[
 {
  "userName": "Jeff Lane",
  "date": "2020-04-16T02:37:35.173Z",
  "score": 4,
  "title": null,
  "text": "Good app. Sometimes might go which seems 200 hands without picking up but otherwise entertaining. Very quick to take your money in seconds. Very slow to give you your winnings, (days for some reason) and you also have to give up your bonuses to withdraw. They really do not want you to withdraw, you are actively discouraged to leave your money with them.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 13
 },
 {
  "userName": "Richie Lowe",
  "date": "2020-04-07T19:37:09.550Z",
  "score": 2,
  "title": null,
  "text": "If you like big action, insane hands and odds smashing wins. This game is for you. But don't play with your hard earned money. Its nothing short of a roulette machine in a bookies. Play for fun, play money. It's an Arcade game that'll take your money. Nothings changed. Thankfully I got out with profit (minimal as it was, I got lucky)",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 23
 },
 {
  "userName": "makadeni123",
  "date": "2020-04-25T13:26:07.812Z",
  "score": 2,
  "title": null,
  "text": "Don't think I've ever seen a poker site that has as many bad beats as this one. Many a time I have KK and opponent has like A2. You KNOW an A will come out in the river to screw you. Most recently my KK was against 3 oppnents. ALL had Aces with 2s and 7s. Still the final A comes out. This of course is possible but ehen it happens 8/10 times you have to ask questions. Most hands are won with straights, flushes and full houses. I'm up overall on Pokerstars so bot being a bad loser. Im not alone",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 3
 },
 {
  "userName": "J N",
  "date": "2020-04-09T20:14:56.417Z",
  "score": 1,
  "title": null,
  "text": "Terrible Support. Waited over 6 weeks before getting a response, for a query regarding my account being frozen, which then they asked for a screenshot of the message!!?! Taking the peas or what. Given they'd already know if they checked the system, which is why some people get quicker responses by hounding them on Twitter. You can't access the live chat either when your not logged in. Pokerstars used to be the best many years ago, now it's a shell of its former self.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 7
 },
 {
  "userName": "Marek Skubal",
  "date": "2020-04-19T09:17:35.523Z",
  "score": 2,
  "title": null,
  "text": "First of all App is solid & entertaining. BUT! 2** After some time of playing i started to having troubles with trusting the transparency of the app. After playing small stake tournaments (am not big player) I realised that 10 out of 15 all ins i always lost due to \"spot on\" river for opponent. Sometimes my oponents had nothing on the hand and even then called me & won. Winning after turn is giving you big probability to win the hand. Somtimes can happen you will loose but 10 out of 15??",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 3
 },
 {
  "userName": "William Sanger",
  "date": "2020-04-11T14:08:18.503Z",
  "score": 1,
  "title": null,
  "text": "Where to start? The countless bugs like invisible hole cards, bet amount button randomly going unclickable, lobby being a farce showing full tables as constantly having a chair free, make this unusable. Why did they not include a queueing system? They have a 'play now' game finder that you are unable to choose the specific stakes of, seats you at a table before immediately saying the table is reserved for another play. This is an app made by non poker players. Love poker stars, hate this app",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 12
 },
 {
  "userName": "samuel davis",
  "date": "2020-04-03T10:49:52.598Z",
  "score": 1,
  "title": null,
  "text": "1 year later I decide to give this game another go and it is still the same the exact same players the same names from last year winning when I start with a clearly better hand basically every flop had a pair of cards in it when does this ever happen in real life and 4 of the same suit coming up out of 5 cards. The same players will follow you around tables which are the robot players that pokerstars put into there app I left 5 tables and moved away from these players as soon as I sat down they",
  "replyDate": "2020-04-03T14:18:11.718Z",
  "replyText": "Thank you for your review.\n\nWe do not use any house players or automatic players on our site.\n\nWe have an extensive arsenal of detection tools to ensure that each player is a human being. You will only play against other players like yourself.\n\nSuch activity is explicitly prohibited as per our Terms of Service.",
  "version": "1.117.0",
  "thumbsUp": 17
 },
 {
  "userName": "Duncan Macrae",
  "date": "2020-04-17T00:25:50.364Z",
  "score": 1,
  "title": null,
  "text": "Do not use this software if you want to play cash games. It is the most RIGGED site out there. You are guaranteed to lose money. The site charges 10% rake on each pot so it's in their interest to give players great hands which they have to commit all their cash to. I am a ranked player on the GPI not an amateur so take my word for it. Save your money and take up another online hobby! Clearly they are not properly checked by the regulators.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 13
 },
 {
  "userName": "Dmitrij Smirnov",
  "date": "2020-04-24T17:07:51.442Z",
  "score": 1,
  "title": null,
  "text": "I request 12h Break and after I pass it my acc still frozen until now, its happens second time and second time I need to beg to unfroze it and wait for a week to get answer? Why to send automatically email saying someone will come back to me in 24h????? Probably it's more important to verify new costumers then to give good service to existing players, who stay with you for years??",
  "replyDate": "2020-04-09T07:18:19.803Z",
  "replyText": "When available, you can contact us via our Live Chat channel. This channel is available 24/7. To chat with us, simply log in, and go to:\n\n\nMenu → Settings & Tools → Support → Contact Support\n\nSelect the Category and the Sub-category, and you will be prompted to contact us via Live Chat or via Email.",
  "version": "1.117.0",
  "thumbsUp": 1
 },
 {
  "userName": "Francis Kennedy",
  "date": "2020-03-20T17:37:20.476Z",
  "score": 1,
  "title": null,
  "text": "I've analysed 500 hands on this app and 500 live hands and this game is so unrealistic and so rigged its embarrassing. Three players with full houses in one hand on multiple occasions. Three players with AA, KK, QQ in one hand multiple times. Bots everywhere. Constant bad beats like T4 clubs cracking pocket aces. Absolute joke and that's when it decides to actually work. DO NOT WASTE YOUR MONEY!!",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 89
 },
 {
  "userName": "Dave",
  "date": "2020-04-06T08:16:41.383Z",
  "score": 3,
  "title": null,
  "text": "Not brilliant, it tries to force too many of the desktop features onto the mobile app. If it loses connection, which it does frequently, it takes way too long to reconnect.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 2
 },
 {
  "userName": "Graeme Hamilton",
  "date": "2020-04-21T02:34:24.907Z",
  "score": 1,
  "title": null,
  "text": "***** WARNING!!! DO NOT USE THIS APP !!!!!******* WHAT IS GOING ON!!!! They took my money and froze my account??? Someone needs to get this sorted! I Went online to play in a pre arranged tournament we had set up weeks in advance. I missed the \"entire\" event and had account froze with no explanation!!!!! Have sent them all relevant docs for security. And nothing. Is this a scam? As in most societies taking someone's money is called \"Theft\" I SERIOUSLY SUGGEST YOU USE OTHER SITE",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 3
 },
 {
  "userName": "Sean Johnson",
  "date": "2020-02-21T19:23:01.237Z",
  "score": 1,
  "title": null,
  "text": "Do not download this app if it glitches out and you touch your screen and a bet is made by accident then they blame it on your Internet saying its an issue on your side I went on roulette first game was fine went to do a second go my screen went blank I tapped my screen a few times to get a response and it came up with the wheel spinning and had taken all my money be warned they robbed me and blamed my Internet yet I have fiber broadband!!",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 42
 },
 {
  "userName": "JP H",
  "date": "2020-04-09T13:14:41.684Z",
  "score": 2,
  "title": null,
  "text": "Both desktop and phone verification process broke so they couldn't verify me. Only option then was to share my licence and utility bill. Who has utility bills in 2020?? Customer service via chat not very helpful. Not impressed. I'd avoid.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "Shane Dobson",
  "date": "2020-03-19T01:33:16.431Z",
  "score": 1,
  "title": null,
  "text": "When you have more than 1 table open, you go to press a button and it can switch tables on you and make you press the button on the other table instead! Terrible design. There should be like at least a 1 second window after a table is switched to before the buttons become active.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 32
 },
 {
  "userName": "Neil Matheson",
  "date": "2020-04-20T20:31:10.241Z",
  "score": 2,
  "title": null,
  "text": "So decided to play starburst on the casino app and got a big win with7s in 3 rows and a starburst but my app closed down and now It won't let me bk in to finish my game even though everytime I try to open it, it asks if I would like to resume my last game so clearly hasn't paid me from it yet as its not after 5 hrs game finally opened up again but skipped pass my first spin and only showed me the second spin results won 9 dollars, I got robbed as I said I saw 3 rows of 7s and starburst such BS",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "Zack Lunacek",
  "date": "2020-02-09T16:14:06.510Z",
  "score": 3,
  "title": null,
  "text": "This app is only good if you need to go to the toilet or something like that when you have to leave your computer. You can't see structure of the tournament in the lobby and browsing tournaments is really difficult in general. It feels so unorganised that it triggers my OCD I never had.",
  "replyDate": "2020-02-10T09:24:38.727Z",
  "replyText": "Thank you for the feedback.\n\nI will pass this on to our developers.\n\nFeel free to let me know if you think of any other improvements for the app.\n\nCheers!",
  "version": "1.117.0",
  "thumbsUp": 5
 },
 {
  "userName": "Gina Tate",
  "date": "2020-02-15T10:21:26.239Z",
  "score": 1,
  "title": null,
  "text": "Casino literally will not work at all. If you are lucky enough to open a game its glitchy and slow, but most of the time wont even open a game. Blames my internet, but that's working fine. Expected better as I've been a desk top player for many years.",
  "replyDate": "2020-02-17T15:49:14.285Z",
  "replyText": "Dear player, \n\nHave you tried contacting support - they can get our tech team to look further into the issues you are encountering. \n\nWe are sorry for the poor experience and look forward to do better for you.\n\nThanks!",
  "version": "1.117.0",
  "thumbsUp": 27
 },
 {
  "userName": "Anderson Aldo",
  "date": "2020-04-09T17:41:26.706Z",
  "score": 1,
  "title": null,
  "text": "Astronomical bad beats, garbage pay outs, chasers always win, 100% rigged, will give you something like a KK and hand the opponent a trips/straight or flush on the river 99% of the time. Makes you afraid to actually play well, the people who all in preflop with unsuited garbage win most the time. Most scuffed poker app I've ever used. Today i lost every single <80% hand i went in on, literally about 20 hands i had a massive chance of winning and lost on the river every time. Lost $40. Corrupt",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 2
 },
 {
  "userName": "James Dunn",
  "date": "2020-04-13T23:27:28.517Z",
  "score": 1,
  "title": null,
  "text": "Can't tell you how the app is I cannot play even though my account has been verified. Pokerstars customer service is so poor have emailed and messaged on numerous occasions and had no response.",
  "replyDate": "2020-04-14T13:18:25.328Z",
  "replyText": "Hi James,\n\nIs there an issue with the app or with your account? Have you checked our Help centre for solutions - https://www.pokerstars.uk/help/?\n\nWe apologise for current delays; Customer support are doing their utmost to respond to all your queries and I am sure they will get back to you shortly.\n\nFeel free to update the review to let me know.",
  "version": "1.117.0",
  "thumbsUp": 1
 },
 {
  "userName": "Phil Oreilly",
  "date": "2020-03-28T15:42:38.357Z",
  "score": 1,
  "title": null,
  "text": "Tried to create an account, all details were correct, kept knocking me back to login page, stating incorrect details. Contacted for help heard nothing back, no email confirmation, nothing, great service.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 6
 },
 {
  "userName": "Spelunky Skills",
  "date": "2019-11-18T10:18:45.176Z",
  "score": 2,
  "title": null,
  "text": "Good app but I have had a few problems trying to sign in on my Samsung phone on the past, and problems with joining the tournament table once paid with no money being returned. The app could be great though with all the different types of poker it has, with loads of different stakes. The sports betting is also a great feature for the app.",
  "replyDate": null,
  "replyText": null,
  "version": "1.116.1",
  "thumbsUp": 15
 },
 {
  "userName": "Geoff",
  "date": "2020-04-04T18:54:37.503Z",
  "score": 1,
  "title": null,
  "text": "What a joke - firstly my old 'US account' (I've always been in the uk) didn't work with this app so I created a new id. Then you have to pay to use play chips?! Not really play chips then is it.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 1
 },
 {
  "userName": "Charlie Garrett",
  "date": "2020-03-14T11:57:09.671Z",
  "score": 4,
  "title": null,
  "text": "Pretty good app. I have some connectivity issues sometimes but could just be me. It is very difficult to multi-table but probably shouldn't be using your phone if you're a hardcore grinder.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 2
 },
 {
  "userName": "Jon Richards",
  "date": "2020-03-21T17:03:12.677Z",
  "score": 1,
  "title": null,
  "text": "This app is shocking I was almost there on this app for over 5 minutes and that's as far as I got, what a absolute joke! I can open up the app but the majority of the time all I get is the almost there screen and nothing else",
  "replyDate": "2020-03-20T12:10:05.200Z",
  "replyText": "Hi Jon,\n\nDid you manage to get the app running? Or what exactly is the issue you are encoutering?\n\nYou can update the review to let me know or check the Help Centre: https://www.pokerstars.uk/help/ \n\nI'd be happy to help.\n\nCheers",
  "version": "1.117.0",
  "thumbsUp": 14
 },
 {
  "userName": "Steve Ferson",
  "date": "2020-04-12T02:02:30.394Z",
  "score": 3,
  "title": null,
  "text": "Used this app years ago but went off it. Recently redownloaded when I heard poker stars showed you to play \"home games\" with your friends but the mobile app doesn't support this. Uninstall again.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "Keith Robinson",
  "date": "2020-02-26T14:47:38.907Z",
  "score": 5,
  "title": null,
  "text": "Fantastic app, great game of poker on the go. The interface is easy a plenty of options. Still enjoy the desktop version better but this is a must for all poker enthusiasts, great & convinient way of keeping your hand in the game.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "Razvan Marin",
  "date": "2020-04-01T19:39:44.247Z",
  "score": 5,
  "title": null,
  "text": "One of the best poker up with a lot of plus than -, this is the new revolutionary poker up and myself from 3 $ I made 90, playing the spin and go games. Don't forget about the Casino plenty of slots available and a lot of potential Razvan Marin",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "Steve Cairns",
  "date": "2020-04-22T10:06:51.207Z",
  "score": 1,
  "title": null,
  "text": "Even though my WiFi works perfectly, on this app constantly loses connection, by time it's returned have inevitably lost money , feel scammed , don't play",
  "replyDate": "2020-04-22T11:20:32.122Z",
  "replyText": "Hello,\n\nI am sorry to hear about your experience with the app. To help with that, I'd suggest you check the Disconnection & Lags category in our Help Centre: https://www.pokerstars.uk/help/sub-categories/disconnection-and-lags/. \n\nCheers",
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "A Google user",
  "date": "2020-04-08T09:14:21.699Z",
  "score": 1,
  "title": null,
  "text": "This site let's you deposit and lose until you want to withdraw and then they want account verification which they will drag out as long as possible. Poor customer service is very frustrating.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 1
 },
 {
  "userName": "Adam Bumble",
  "date": "2019-11-22T22:37:02.130Z",
  "score": 1,
  "title": null,
  "text": "This site is rigged, i wouldn't feel confident with a Royal flush. I've played online poker for 20 years, I know enough to know when its rigged, bad beat after bad beat. Three times in one hour , river came the only card in the pack , everyday the same. I can't even take this site seriously. I have no confidence in any hand, while people play bingo instead of poker and its just poor. Seriously avoid this site.",
  "replyDate": null,
  "replyText": null,
  "version": "1.116.1",
  "thumbsUp": 33
 },
 {
  "userName": "reedy trippleseven",
  "date": "2020-04-12T05:22:43.811Z",
  "score": 1,
  "title": null,
  "text": "Freeze your account when you win. Make it hassle to access your account. Customer support is painfully slow at best.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "Nico Aquino",
  "date": "2020-04-09T15:23:21.278Z",
  "score": 2,
  "title": null,
  "text": "I downloaded this to play home poker games with the guys and really disappointed that it is not yet supported on android or chromebook, the two things I own. So to play I would have to purchase a Microsoft laptop/desktop. Are there any plans in the future to change this? Otherwise I'd be more than happy with the app. Should the game work on android or chromebook I'll change my rating but this currently gets 2 stars.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 1
 },
 {
  "userName": "Arban Haziri",
  "date": "2020-02-07T16:20:08.917Z",
  "score": 1,
  "title": null,
  "text": "Very very bad. When i want to play casino, its never working properly. It goes 100% and logs you out. It has been 1 month with the same bulllshit.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 5
 },
 {
  "userName": "Vincent Grinney",
  "date": "2020-02-27T06:17:33.492Z",
  "score": 1,
  "title": null,
  "text": "Played a few times and built up a cash pot, then my account was restricted due to government policies!!! Not sure what that's about? But it wont even let me withdraw my money!! Avoid this app!!",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 8
 },
 {
  "userName": "andrei ilie",
  "date": "2020-04-05T18:34:52.405Z",
  "score": 1,
  "title": null,
  "text": "I have oppened an account and stright away it says that my account it is frozen to contact them... Sent them an email and no repy. Still frozen acc... Do not download it....",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 2
 },
 {
  "userName": "mark cogzell",
  "date": "2020-04-14T22:49:17.482Z",
  "score": 5,
  "title": null,
  "text": "Great fast app. Always plenty of different poker to play and always lots of good promotions. Best poker app I've used. A++++",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "Dave Alderton",
  "date": "2020-01-02T16:43:35.156Z",
  "score": 3,
  "title": null,
  "text": "Have a lot of issues with the app not knowing my location - the solution seems to be to reinstall but that does become a pain. Gameplay itself is good with lots of different games for all abilities and bankrolls",
  "replyDate": null,
  "replyText": null,
  "version": "1.116.1",
  "thumbsUp": 1
 },
 {
  "userName": "Davide Martalò",
  "date": "2020-02-15T17:01:49.536Z",
  "score": 1,
  "title": null,
  "text": "Rigged game. Favours the aggressive chip leader in order to close the table faster. Will make you lose with whatever good cards you've got. Don't deposit money, will just rob you clean.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 9
 },
 {
  "userName": "Chris Brough",
  "date": "2020-03-27T15:00:45.267Z",
  "score": 1,
  "title": null,
  "text": "App just freezes and stuck on the first page. Cant navigate or do anything. Reinstalled 4 times and tried with wifi and 4G. Not good",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 2
 },
 {
  "userName": "Swinglehurst 1981",
  "date": "2020-03-31T13:48:21.969Z",
  "score": 5,
  "title": null,
  "text": "Seeing everyone putting this app down. I'd like to tell everyone this is the best betting app. I've watched my mate win £5000 in a poker tournament. I've seem mate win big prizes. This is the best slots and poker game about.. you need to know how to play poker. Its poker not bingo",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "Ben Hoyle",
  "date": "2020-04-20T17:49:59.806Z",
  "score": 4,
  "title": null,
  "text": "Overall good app but sometimes is a bit slow to respond when using the screen",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "Jens Lynen",
  "date": "2020-03-21T00:32:07.774Z",
  "score": 2,
  "title": null,
  "text": "The log in procedure is very erratic. Good game formulas but sometimes limited or confusing.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 2
 },
 {
  "userName": "Adam Brady",
  "date": "2020-03-04T04:42:58.962Z",
  "score": 4,
  "title": null,
  "text": "Works well, a few minor bugs but nothing to really take away from the overall experience",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "RichieP",
  "date": "2020-04-24T18:42:35.260Z",
  "score": 1,
  "title": null,
  "text": "Continue button doesnt work at the 4th stage of sign in, cant even finish creating an account",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "P G",
  "date": "2019-12-09T09:32:50.460Z",
  "score": 1,
  "title": null,
  "text": "Horrible experience with PokerStars Casino. No matter how random they say it is, casino games are absolutely rigged. You get 0 payout. I played 10 £ on a game, and I played 1k on a game and I can guarantee you it makes no difference... It won't pay at all.",
  "replyDate": null,
  "replyText": null,
  "version": "1.116.1",
  "thumbsUp": 19
 },
 {
  "userName": "Jeff Rouse",
  "date": "2019-12-07T08:54:07.530Z",
  "score": 1,
  "title": null,
  "text": "DO NOT USE ITS AWFULL. ALLOWS YOU TO SPEND MONEY N JOIN A GAME THEN CRASHES AFTER THEY HAVE YOUR CASH. NOT COMPLETED ONE GAME ON MOBILE APP USING 4G N WIFI. Tested against browser version which does not have this ISSUE. THIS APP IS A CON N SHOULD BE REMOVED FROM APP STORE ASAP",
  "replyDate": null,
  "replyText": null,
  "version": "1.116.1",
  "thumbsUp": 15
 },
 {
  "userName": "John Paul Leaf",
  "date": "2020-04-19T10:13:36.328Z",
  "score": 1,
  "title": null,
  "text": "Absolutely rubbish they frozen account cant get hold of anyone sent several emails Nothing!!!! 888 poker much better",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 },
 {
  "userName": "Daeker Poland",
  "date": "2020-01-10T11:01:34.640Z",
  "score": 1,
  "title": null,
  "text": "Awful service. Do not deposit with this service, promised £40 deposit bonus which you are supposed to get a portion of daily I.e. 3 spin and go tickets on day one. I have waited all week and not received a single bonus, I emailed on the second day and got a response saying that the bonus had been activated (clearly not) and now they are just ignoring my emails to support. I would advise not to bother. In the process of filing a complaint against this company with the FCA. Clearly a scam.",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 36
 },
 {
  "userName": "John Franklin",
  "date": "2020-04-10T14:25:06.168Z",
  "score": 1,
  "title": null,
  "text": "Doesn't let me play, could not verify my details , customer service non existent, don't waste your time",
  "replyDate": null,
  "replyText": null,
  "version": "1.117.0",
  "thumbsUp": 0
 }
]