[
 {
  "userName": "Kogu",
  "date": "2020-04-25T13:51:42.722Z",
  "score": 2,
  "title": null,
  "text": "The user interface could be better, it needs simplifying, and modernizing feels like something that was made for the early internet I should be able to jump quickly into \"my games\" rather than having to navigate a drop down list",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 9
 },
 {
  "userName": "Muhammad Kashif",
  "date": "2020-04-28T13:11:42.652Z",
  "score": 1,
  "title": null,
  "text": "I cant registered myself. At open account step 2 of 2 its not going throw. Every field filled in full manners and tried several times but it shows error that some field left to fill. Damn it",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 1
 },
 {
  "userName": "A Google user",
  "date": "2020-04-29T06:42:02.963Z",
  "score": 5,
  "title": null,
  "text": "Hi i am unable to write a review because i am unable to upgrade an account or opening a New account the era message highlighted is about my name i cannot change these because the names i give is correct and cannot change them. Believe me i was trying to fix this for the last 3 months without any success so i just get frustrated and give up.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 4
 },
 {
  "userName": "EdyGk2K'sOnlyTM 2k",
  "date": "2020-04-27T15:00:15.594Z",
  "score": 1,
  "title": null,
  "text": "Had this app for a couple of years now , I've tried to open up an account so many times it always gives me the same stupid thing that it can't confirm my details and if I want to confirm them I should do it by post.. Why?...Why would I lie about my details if it comes to winning the lottery..Who does that.. This logic is just plain stupid.. My cousin use it for the first time and he opened an account in just a few minutes..If I wanna play the lottery I'm forced to go outside because of this..",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 9
 },
 {
  "userName": "Terry Barrett",
  "date": "2020-04-20T12:38:34.964Z",
  "score": 1,
  "title": null,
  "text": "Gave it one star as I can't give it zero. Just upgraded and now on trying to open the app all I get is a blue screen saying \"25 Years Of Amazing\" with the word \"loading\" underneath. Gave up after 30 minutes. Restarted phone tried again, gave up again after another 30 minutes. Is the message about 25 years, an indication that it takes that long to load? I can't answer the optional questions if it won't load.",
  "replyDate": "2020-04-22T14:21:01.990Z",
  "replyText": "Hi Terry, we're sorry that you're experiencing this issue. Thanks for the feedback, which we will forward on to our development team. We want you and all our players to have the best possible experience using the app. If this issue continues, please contact our Customer Services team at: help@national-lottery.co.uk",
  "version": "7.2.2",
  "thumbsUp": 30
 },
 {
  "userName": "Connor Hood",
  "date": "2020-04-25T08:56:25.634Z",
  "score": 1,
  "title": null,
  "text": "It will not let me add funds. Always saying this is a temporary issue try later. It has been a week now",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 0
 },
 {
  "userName": "Ad Harg",
  "date": "2020-04-01T10:04:44.723Z",
  "score": 1,
  "title": null,
  "text": "Useless, don't bother downloading! Just use the website, as it only redirects you there anyway. The instant win \"games\" on the app are literally spend your money to have a message saying you didn't win. Dissatisfied to say the least. Even the website has problems but at leaat you can play the games to win/lose money",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 82
 },
 {
  "userName": "Max Hurlbut",
  "date": "2020-04-14T00:09:32.594Z",
  "score": 2,
  "title": null,
  "text": "If you're buying lottery tickets it's fine although I've never won anything more than £5 through a digital ticket. Playing instant win is a complete waste of money. Odds are wrong. 0 in 7 win on mega cashword.. in fact most games are more like 1 in 8 wins App is a bit glitchy sometimes. Uninstalled... Buying from the shop still feels more secure",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 34
 },
 {
  "userName": "Elena **",
  "date": "2020-04-06T16:04:52.835Z",
  "score": 4,
  "title": null,
  "text": "The application works fine on Android, i can buy tickets, i can store the numbers i am playing, i can see the results from previous weeks and compare them to the numbers i played. It offers a fingerprint sign in. Not sure what else people expect from this application. I am happy with the functionality it offers.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 54
 },
 {
  "userName": "David Inman",
  "date": "2020-04-26T21:38:57.944Z",
  "score": 1,
  "title": null,
  "text": "Installed but nlue screen with 25 years of lottery. Wont load up. There is an onvious problem with this as it was installed on a clean phone after re-installing factory settings",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 3
 },
 {
  "userName": "Sam Thomas",
  "date": "2020-04-11T10:12:33.338Z",
  "score": 1,
  "title": null,
  "text": "I always get suspicious that the reason they don't show the winning numbers when you've scanned your ticket under the \"my numbers\" dropdown alongside yours is because they think the app is broken again like in 2018 where it declared winning tickets as \"no prize won\" and got fined for it so it's untrustworthy for me.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 11
 },
 {
  "userName": "Pauline Devlin",
  "date": "2020-04-25T21:28:38.608Z",
  "score": 5,
  "title": null,
  "text": "I'm so happy with this app. I don't have to worrie about forgetting to put the lotto n thunderball on !! You can even scan your tickets yourself 👍🏻",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 7
 },
 {
  "userName": "Tiffany Onions",
  "date": "2020-04-22T10:28:17.140Z",
  "score": 1,
  "title": null,
  "text": "Instant play games are not what they were it feels like your playing a fixed game now against you and the price of the games have also changed there used to be games for 25p and 50p now the minimum is £1 I used to put at least £10 a week on this app I wont be doing that any more don't even feel like I had a fair shot",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 4
 },
 {
  "userName": "Asa Johnson",
  "date": "2020-04-08T10:31:00.735Z",
  "score": 3,
  "title": null,
  "text": "Was working fine until a recent update. Every time I play an instant game, the app freezes and you can't leave the game after completion. You then get an error message stating that the game could not be processed. Purchasing lottery tickets in easy and quick.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 32
 },
 {
  "userName": "debbie peck",
  "date": "2020-04-27T19:55:09.301Z",
  "score": 5,
  "title": null,
  "text": "It works fine on my phone and scans tickets for you it's awesome.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 0
 },
 {
  "userName": "craig reid",
  "date": "2020-04-05T09:01:52.839Z",
  "score": 2,
  "title": null,
  "text": "Current multiplay tickets are never displayed at the top, have to scroll through list to try and find it. Online shows all current running tickets that are still to play. Less games now on instant win now after update.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 3
 },
 {
  "userName": "Rossi Roo",
  "date": "2020-04-10T18:07:45.943Z",
  "score": 1,
  "title": null,
  "text": "Downloaded the app as the website wouldn't let me log in or create an account. Well the app was no better! Still won't let me sign in or create a new account. Utterly useless and extremely disappointing.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 1
 },
 {
  "userName": "Peter C",
  "date": "2020-03-23T23:44:43.395Z",
  "score": 4,
  "title": null,
  "text": "All I get is \"Our app is currently unavailable\". The \"Try Again\" button produces the same response... UPDATE: They don't tell you this but it only works if you're NOT connected to WiFi. They need proof of who you are and where you are. I can give it 4 stars now I've realised this.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 106
 },
 {
  "userName": "A Google user",
  "date": "2020-04-11T20:27:57.931Z",
  "score": 1,
  "title": null,
  "text": "fingerprint enabled on my mate 20 pro but goes straight into the account without fingerprint scanning!!! contacted Hannah in customer support. as much use as a chocolate condom. One year on and I've changed my phone to a one plus 7 Pro and still the same issue. Invest some of OUR money into a decent app.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 2
 },
 {
  "userName": "A Google user",
  "date": "2020-04-09T20:18:18.676Z",
  "score": 1,
  "title": null,
  "text": "Man what happened to all the good Games? All the decent £5 and £10 games are gone and you're left with cash word as the only good one. Wont be back for a long time. Shame because there used to be a lot of fun ones.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 10
 },
 {
  "userName": "Sean Callaghan",
  "date": "2020-04-07T21:14:17.960Z",
  "score": 1,
  "title": null,
  "text": "Absolute joke every time I try to register it keeps freezing, think I will just check the results using YouTube a lot easier also will prob save some money from playing there games, I would of giving no stars if possible.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 3
 },
 {
  "userName": "Lloyd. W",
  "date": "2020-04-09T07:09:19.274Z",
  "score": 5,
  "title": null,
  "text": "Excellent app and spot on if your a winner!. Will save you having to trust the sales advisor if you get them to scan your ticket! It's quick and very easy to use. But i still get the tickets scanned at the shop to be sure.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "John Macalister Wood",
  "date": "2020-04-05T10:34:38.322Z",
  "score": 1,
  "title": null,
  "text": "The app is functional, I can see or experience no difference from the previous version. Google forced me to update, wanting me to remove some apps that I wanted, however, I got round it by removing some Google apps. Done.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 6
 },
 {
  "userName": "Monkey Brain",
  "date": "2020-04-07T10:32:20.705Z",
  "score": 1,
  "title": null,
  "text": "Absolute pos app. Have had to change my password 3 times this morning, only to have the session expire after 2 minutes. My profile persistently shows up as 'profile not found'. Waste of time.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 4
 },
 {
  "userName": "Nigel Smith",
  "date": "2020-04-04T06:30:21.976Z",
  "score": 4,
  "title": null,
  "text": "Nice app, good layout and easy to use. The only issue I've had is when you click add funds, it initially does nothing, when I click it again it works",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 4
 },
 {
  "userName": "Global",
  "date": "2020-04-25T18:15:56.218Z",
  "score": 1,
  "title": null,
  "text": "Cannot log in. And when trying to register it says email in use. I don't understand",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 0
 },
 {
  "userName": "Serena Easton",
  "date": "2020-04-19T07:03:04.421Z",
  "score": 3,
  "title": null,
  "text": "This is a really good for putting my tickets on I would give it 5 stars but u cant delete tickets that have expired witch is really annoying as I have to look at all my tickets to find the ones that are still in play",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Ryan Morris",
  "date": "2020-04-22T20:13:25.752Z",
  "score": 5,
  "title": null,
  "text": "No issues lovely set up, during this pandemic makes this very helpful instead of going to the shop exposed to the virus! Lifes hard especially now this app brings fun and a chance to change lives for a few lucky people ☺",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "stephen bachrach",
  "date": "2020-04-21T21:34:42.796Z",
  "score": 2,
  "title": null,
  "text": "Every time I try and log in to tha app. It says invalid username or password. Yet using the same details in a browser it works. Shocking coding and testing.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "splatter you_2",
  "date": "2020-04-21T02:30:58.143Z",
  "score": 3,
  "title": null,
  "text": "Does pretty what you expect, buy tickets but not sure if mine is bugged or its terribly designed to stop working after a certain time , after normal working hours.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Olivia Traynor",
  "date": "2020-04-16T01:10:09.637Z",
  "score": 5,
  "title": null,
  "text": "This app is great. Easy to use and play all lotterys on here. Notifications available so will let you know if you win. Also puts your winnings into your online account for you and you can transfer them into your bank account.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 1
 },
 {
  "userName": "Steven O'Brien",
  "date": "2020-04-18T07:28:47.508Z",
  "score": 2,
  "title": null,
  "text": "So erratic..... When it works it is very good, when it decides it doesn't want to work it is very frustrating.....",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Alister Lowe",
  "date": "2020-04-03T17:29:37.500Z",
  "score": 1,
  "title": null,
  "text": "Absolutely dreadful to try to create an account on an android phone. Belongs in the stone age's!! If you want an app that is being maintained as good as the government is running the country.. this is the app for you!",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 2
 },
 {
  "userName": "Keith Law",
  "date": "2020-03-27T14:54:08.910Z",
  "score": 2,
  "title": null,
  "text": "So frustrating if you want to use the app to buy a ticket on the day of the draw because it always says unavailable. Works every other day but never on a draw day. Even clicking the website link doesn't work.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 42
 },
 {
  "userName": "Imran Zaid",
  "date": "2020-04-09T13:24:27.794Z",
  "score": 5,
  "title": null,
  "text": "Very grateful this app was created it saves allot of hastle messing about trying to check numbers and great for checking previous numbers and results are clearly displayed how much people won jackpot and other wins",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "SuffolkLad",
  "date": "2020-03-27T06:54:42.236Z",
  "score": 2,
  "title": null,
  "text": "Not impressed! Smaller selection of 'scratch cards' than there used to be, odds of winning are inaccurate, only really useful for playing a few lines without having to go to a shop.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 14
 },
 {
  "userName": "Samuel Hallett",
  "date": "2020-03-28T21:10:55.900Z",
  "score": 2,
  "title": null,
  "text": "Awkward to use, buy a lottery ticket, don't expect to see it again unless you hunt high and low, in which case you may as well just go look for buried treasure yourself, scratchcards are a scam no doubt, don't waste your money, stay away, far away.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 19
 },
 {
  "userName": "Stuart Henshaw",
  "date": "2020-04-13T13:00:52.940Z",
  "score": 1,
  "title": null,
  "text": "App was fine. Now it won't scan a ticket. App permission is on for the camera but tells me it isn't.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Maureen Bray",
  "date": "2020-03-25T18:53:27.333Z",
  "score": 1,
  "title": null,
  "text": "Hardly ever opens. Haven't been able to access it for a couple of weeks now, just comes up ' This app is temporarily unavailable'. Very frustrating. I've reported it before but it's worse now",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 14
 },
 {
  "userName": "Jonathan Mcdonagh",
  "date": "2020-04-01T01:13:57.622Z",
  "score": 2,
  "title": null,
  "text": "Always unable to sign in. Every time I get an email telling me I've won something I can never login without a long battle.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Nagaraj Acharya",
  "date": "2020-04-08T13:09:39.367Z",
  "score": 1,
  "title": null,
  "text": "After recent update I have never been able to log in because always I get an error \"Our app is currently unavailable\"",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 1
 },
 {
  "userName": "Andrew Nicholson",
  "date": "2020-04-22T21:55:35.910Z",
  "score": 1,
  "title": null,
  "text": "Poor it won't allow me to set up an account keep getting to the last stage and it doesn't go any further takes me to sign in page but no account created absolute waste of time",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "damian wickham",
  "date": "2020-04-04T22:49:32.260Z",
  "score": 1,
  "title": null,
  "text": "Mini games are fixed, I've spent about £400. By the law of averages I should of won somthing. Never again",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Scott Hemy",
  "date": "2020-03-26T12:24:26.940Z",
  "score": 4,
  "title": null,
  "text": "Good app, when scanning tickets wish it would show the numbers for that draw as I would like to double check without having to come out then back in to app.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 4
 },
 {
  "userName": "Robert Sharp",
  "date": "2020-04-04T17:37:42.424Z",
  "score": 5,
  "title": null,
  "text": "I have not had problem... Just use the app coz saves time n tht walking 2 shop when I can scan ticket on this super helpful just hope it does me a winner ah!!",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Tony K",
  "date": "2020-04-10T13:34:26.473Z",
  "score": 1,
  "title": null,
  "text": "Utter rubbish. Can't log in or app is offline or it tells you you're offline. Hopeless.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 1
 },
 {
  "userName": "Sailesh Mehta",
  "date": "2020-04-23T17:56:36.832Z",
  "score": 2,
  "title": null,
  "text": "Not able to play instant win game as the message I get is that the Browser is not supported on my new Galaxy note 10 lite.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Alexander Matthieu",
  "date": "2020-04-08T06:56:06.520Z",
  "score": 4,
  "title": null,
  "text": "Amazing new setup. Love the app. Great and easy way to spend money.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Richard Johnston",
  "date": "2020-04-08T09:30:04.770Z",
  "score": 1,
  "title": null,
  "text": "Can't connect to app, just keep getting an unavailable notice. Can't connect to website either.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Gary Vennard",
  "date": "2020-04-29T18:23:32.774Z",
  "score": 4,
  "title": null,
  "text": "Would be a good idea if you could just pay as you play instead of having to deposit a minimum of £5",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 }
]