[{"title":"Sky Vegas Slots, Roulette, Blackjack, Instant Win","description":"Sky Vegas is the ultimate destination for new, exclusive, and exciting online slots\r\n\r\nDownload the Sky Vegas App to enjoy exclusive games, head-turning bonuses and offers, and the thrill of the unexpected, wherever you choose to play. Every spin at Sky Vegas is another chance for a bonus game to kick in, a line to win or a jackpot to hit – the best bit is it could happen at any moment.\r\n\r\n⭐New Customers⭐\r\n\r\nOpt in today to receive 50 seriously free spins! No Deposit – No Wagering! Plus Deposit and Spend £10 to get a £40 bonus. New Customers Only. Opt In Required. \r\n7 Day Free Spin Expiry. All Free Spins Will Auto Play On First Eligible Game Loaded. 40x Wagering Requirement Applies to the £40 Bonus To Which Table and Card Games Contribute 20%. 30 Day Bonus Expiry Applies. Eligibility Restrictions Apply. Further T&Cs Apply. >> goo.gl/jGTz4u\r\n\r\nIf you already have an account with Sky Vegas, Sky Bet, Sky Casino, Sky Poker or Sky Bingo you can login with your existing account details and discover all that Sky Vegas has to offer!\r\n\r\nPlay your way… \r\nOur app gives you complete control over your gameplay as you can…\r\n\r\nManage your account within the app:\r\nRegister and log in\r\nRecover login details\r\nAdd payment details \r\nDeposit and withdraw funds \r\nView your account history\r\nAccess help & support\r\n\r\nResponsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support in the United Kingdom please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/ and in Ireland please contact Gamble Aware at 1800 753 753 or visit http://www.gambleaware.ie/\r\n\r\nThe Sky Vegas app is brought to you by Bonne Terre Limited, an Alderney registered company wholly owned by The Stars Group Inc. and licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Vegas is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group. The Sky trademarks used in the app are owned by the Sky UK Limited and its affiliated companies and are used under license. To place a bet with Sky Vegas you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Vegas. Customers located outside of the UK or Ireland will be prohibited from using this app.","summary":"All the thrills of Vegas with Real Money Slots, Roulette and Blackjack Games","installs":"100,000+","score":4.544554,"ratings":6094,"reviews":2460,"histogram":{"1":362,"2":80,"3":181,"4":724,"5":4746},"price":0,"developer":"Sky Betting and Gaming Apps","genre":"Casino","contentRating":"PEGI 18","contentRatingDescription":"Simulated Gambling, Real Gambling/Paid Contests","released":"Jul 28, 2017","updated":1552058811000,"version":"2.2.0","recentChanges":"In this release we&#39;ve added some new, exciting games for you to enjoy! And we’ve also made some changes behind the scenes to improve the stability and performance of our app. If you like using Sky Vegas, please support us by leaving a review in the Play Store.","appId":"com.skybet.app.skyvegas"},{"title":"William Hill - Sports Betting & Odds","description":"Get the definitive betting experience on your mobile or tablet with the William Hill Sports Betting app. \r\n\r\nWith instant prices on thousands of markets, stay close to the heart of the action through live streaming, advanced in-play scoreboards and up to date dashboard. Bet, watch, cash in and more – wherever and whenever you want.\r\n\r\nGREAT FEATURES AND BETTING BONUSES\r\nWilliam Hill boast a range of offers and bonuses to enhance your betting experience across lots of sports not just on our popular football betting and horse racing betting markets.\r\n•\t#YourOdds: Got a hunch on the game? Tweet @WilliamHill with your bet and our traders will endeavour to price it up.\r\n•\tBet Boost: Whether you include Premier League, the big fight or a Grand Slam, boost your accas of three or more selections - it's our biggest ever Bet Boost!\r\n•\tFlash Odds: Get the best enhancement ahead of the big game. From 6pm, Flash Odds goes live, so whether it’s the man of the moment to score or hit the target, these aren’t to be missed.\r\n•\tBet and watch live sports: There’s no better feeling than seeing your bet win – we stream heaps of football, horse racing, tennis and more on our app.\r\n•\tCash In: You can win even if your bet doesn’t with Cash In. It’s your opportunity to accept an early pay out offer while the action is on-going.\r\n•\tPartial Cash Out: For those seeking the best of both worlds – get something back on your bet early, while waiting for the rest to play out.\r\n•\tIn-play: Bet on countless in-play markets now with advanced, in-depth scoreboards so you know exactly what’s happening. Whether there’s been a yellow card or corner kick, it’ll be tracked keeping you across all of the action.\r\n\r\nHERE TO HELP\r\nWilliam Hill takes Responsible Gambling seriously because betting shouldn’t get in the way of your enjoyment of sport.\r\n•\tOur Account management: Features, include deposit limits, timings and self-exclusion, to help you stay in control.\r\n•\tCustomer Services: You can get hold of us in a number of ways - phone, email, live chat, social media – whatever the communication method, we’re at your service.\r\n\r\n\r\nKEY TERMS\r\n•\tBet £10 get £30 in free bets\r\nNew Customers using Promo Code P30 Only, min £10/€10 stake, min odds 1/2, free bets paid as 2 x £15/€15 (30 days expiry), free bet/payment method/player/country restrictions apply.\r\nLink to full terms: https://wh.bet/3azbROd\r\n\r\n•\tBet £10, Get £40 in free bets\r\nNew Customers using Promo Code W40. Min £10/€10 stake, win only, min odds 1/2, free bets paid as 4 x £10/€10, 30 day expiry, free bet/payment method, player/country restrictions apply.\r\nLink to full terms:  https://wh.bet/2TrjDnz\r\n\r\n\r\n•\tBet £5 & get £10 in free bets\r\nNew Customers using Promo Code S5. Min £5/€5 stake, win only, min odds 1/2, free bets paid as 2 x £5/€5, 30 day expiry, free bet/payment method, player/country restrictions apply.\r\nLink to full terms: https://wh.bet/2vIjWBi\r\n\r\n•\tBet Boost: One Bet Boost on straight line accumulators per customer, per day. 3+ selections. Max stake £20 win or £10 EW. On EW bets, only “win” part Boosted. Mobile and new desktop only. Player restrictions & terms apply.\r\n\r\nYourOdds: Betting rules and terms apply.\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 (UK) or 1800 753 753 (IRE). Alternatively, visit https://www.begambleaware.org (UK) or http://www.gambleaware.ie/ (IRE).\r\nWilliam Hill is operated by WHG (International) Limited a company registered in Gibraltar. William Hill is licensed by the Gambling Commission (Number: 000-039225 R-319373-009) for customers in Great Britain, and licensed by the Gibraltar Government and regulated by the Gibraltar Gambling Commissioner (RGL no. 034 & 042) for all other customers. The app requires you be over 18 to participate in any gambling activity. Full details can be found on www.williamhill.com","summary":"Bet with the latest odds on sports including football and horse racing","installs":"500,000+","score":4.485134,"ratings":13822,"reviews":4506,"histogram":{"1":781,"2":150,"3":481,"4":2575,"5":9832},"price":0,"developer":"William Hill","genre":"Sports","video":"https://www.youtube.com/embed/53wl6ebV2wk?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://i.ytimg.com/vi/53wl6ebV2wk/hqdefault.jpg","contentRating":"PEGI 18","contentRatingDescription":"Simulated Gambling, Real Gambling/Paid Contests","released":"Aug 1, 2017","updated":1582554712000,"version":"2.13.0_GP","recentChanges":"Have you played our Yes No coupon yet?<br>Get 6 simple questions correct for 33/1.<br>Try it now on the top sporting events.<br>In Addition to some bug fixes to improve your experience","appId":"com.williamhill.sports.android"}]