[
 {
  "title": "Blackjack - Free & Offline",
  "description": "With Blackjack you now have the famous gambling game always with you - for free and offline. Play Blackjack like a pro without having to bet real money. Adapt the rules to your favorite casino, train your skills and become a blackjack pro yourself!\r\n\r\n• Play Blackjack without the use of real money\r\n• Fully usable offline\r\n• Blackjack rules fully customizable, play like in your favorite casino\r\n• Integrated card counters (Hi-Lo, Red Seven, Knock Out, Omega II) so you can verify your counted values\r\n• Free and offline\r\n• Optimized for Smartphone and Tablet\r\n\r\nAre you missing certain rules or card counting methods? Email us at blackjack@fassor.com and we'll take a look!\r\n\r\nNOTE: This Blackjack includes advertisements to allow offering this game for free. The app itself can be used offline / without an internet connection!",
  "summary": "The famous gambling game Blackjack completely free and offline!",
  "installs": "100,000+",
  "score": 4.3955884,
  "ratings": 6832,
  "reviews": 3102,
  "price": 0,
  "IAPRange": "£1.79 per item",
  "developer": "Fassor",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 4, 2018",
  "updated": 1588152776000,
  "version": "1.6.2",
  "recentChanges": "Various bug fixes and improvements",
  "appId": "com.fassor.android.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21: Blackjackist",
  "description": "Play the best blackjack 21 free game with millions of players from all over the world!\r\nBlackjack is an exciting game that any player is sure to enjoy. Place your bet, get more points than the dealer and win chips. Feel the risk as you dive into the casino atmosphere and hit the big time!\r\nPlay now to improve your skills, gain experience, make new friends and become the best blackjack player ever!\r\n\r\nGame features:\r\n• FREE CHIPS – Play the game every day to get free chips!\r\n• GET REWARDS – Up the stakes, win games against the dealer, take risks to get to 21 and unlock achievements.\r\n• QUESTS – Complete daily quests to get free chips!\r\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level up. See how many blackjack tournaments you've won and achievements you've completed. Get unique properties and display them on your profile. View other players' profiles to see how you compare!\r\n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other blackjack players.\r\n• FAIR HAND DEALING GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest blackjack experience!\r\n• LEARN TO PLAY – Are you new to blackjack but always wanted to try it? \r\nOur simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about blackjack, from the rules of the game to winning combinations.\r\n• 3D GRAPHICS – An absolutely free blackjack game with stunningly realistic 3D graphics.\r\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\r\n• SINGLE ACCOUNT – Start playing free blackjack on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.\r\n\r\n♥️♦️♠️♣️ Want more than blackjack? ♣️♠️♦️♥️\r\nTry our other games for an unforgettable 3D experience: \r\n• TEXAS HOLD'EM POKER – The most popular casino game among professional gamblers! Test your skills in amazing poker tournaments!\r\n• SLOTS – Explore our themed slots with lots of unique features!\r\n• ROULETTE – Featuring stunning 3D graphics and three varieties of table: French, American, and European.\r\n• OMAHA POKER – A more dynamic version of poker with 4 cards in a hand. Have more fun with amazing combinations!\r\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\r\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\r\n\r\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!  https://facebook.com/Pokerist\r\nFollow us on Twitter and get free chips!\r\nhttps://twitter.com/KamaCasino\r\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "summary": "Blackjack 21 is an exciting game that any player is sure to enjoy!",
  "installs": "5,000,000+",
  "score": 4.2526064,
  "ratings": 75032,
  "reviews": 25521,
  "price": 0,
  "IAPRange": "£0.50 - £99.99 per item",
  "developer": "KamaGames",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Oct 26, 2015",
  "updated": 1588578695000,
  "version": "32.6.0",
  "recentChanges": "Stay home. Be safe!<br>We&#39;ve planned a lot of new features for you to enjoy!<br><br>New VIP System<br>VIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!<br><br>Weekly Rankings<br>Compete against other players and see how you rank each week!<br><br>Now MTT starts every 40 minutes!<br><br>Quicker Betting<br>Try raising a bet and you&#39;ll find a new option to bet 1/2 or the full pot! Raise faster!<br><br>Improved navigation in the lobby—now you can view playing tables in a chart.",
  "appId": "com.kamagames.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Blackjack is the best way to play Blackjack for fun! Bet big to win big, or play the long game and prove you can beat the dealer! With free chips, you can play this casino style game with no risks, and with random cards, our games are guaranteed fair and fun!\r\n\r\nNever played Blackjack before? Blackjack is the best way to learn the game. With no real money at risk, you can play this classic casino game just for fun! You'll be winning in no time.\r\n\r\nBlackjack is easy to play! Place a bet, and you'll receive 2 cards. Picture cards are worth 10 points and Aces are worth either 1 or 10. \"Hit\" for another card, and get your score as close to 21 as you can without going bust.\r\n\r\nIf you like Poker, Roulette or Slots we know you will love this Casino Classic!\r\n\r\nBy playing Blackjack, you agree to our Terms of Use and Community Guidelines available at https://www.tripledotstudios.com/tos",
  "summary": "Blackjack 21 - Black Jack Casino Card Game (Pontoon)",
  "installs": "500,000+",
  "score": 4.721239,
  "ratings": 15932,
  "reviews": 6591,
  "price": 0,
  "developer": "Tripledot Studios Limited",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 18, 2019",
  "updated": 1587742995000,
  "version": "1.5.5",
  "recentChanges": "This update to Blackjack brings a number of improvements:<br><br>* You can bet even higher with some of our new high-value chips!<br>* More levels are coming soon!<br>* A new auto-deal feature to increase game speed.<br>* We&#39;ve also made various behind-the-scenes fixes and improvements.<br><br>We hope you&#39;ll enjoy this update! Good luck!",
  "appId": "com.tripledot.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "BLACKJACK!",
  "description": "BLACKJACK 21: THE BEST Blackjack GAMES ONLINE or OFFLINE! Play Las Vegas Casino Blackjack 21 with the Black Jack 21 FREE APP!\r\n\r\nThe Best FREE blackjack card game app! Play LIVE tournaments online or offline! \r\n\r\nAuthentic free Blackjack Games on Android - Blackjack 21 FREE can’t be beat! Play the best Blackjack Twentyone card game TODAY!\r\n\r\nThis free blackjack games app is intended for adult audiences and does not offer real money gambling or any opportunities to win real money or prizes. Success within this free blackjack 21 game does not imply future success at real money gambling.\r\n\r\nHaving an issue with BLACKJACK? For immediate support, contact us at BJHa@12gigs.com. Thanks!",
  "summary": "Play free BLACKJACK! Online or Offline. Blackjack 21 Casino Games in BLACK JACK!",
  "installs": "10,000,000+",
  "score": 4.54395,
  "ratings": 541486,
  "reviews": 202978,
  "price": 0,
  "IAPRange": "£1.18 - £150.00 per item",
  "developer": "Super Lucky Casino",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "updated": 1467919041000,
  "version": "1.126",
  "recentChanges": "BLACKJACK 21 KEEPS GETTING BETTER!<br>With a New Look to the More Games Bonus and lots of improvements YOU asked for!",
  "appId": "com.genina.android.blackjack.view",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack 21 - Online Blackjack multiplayer casino",
  "description": "Blackjack 21 is multiplayer card game full of chips!\r\nPlay free Blackjack 21 ♠️♥️ - the world’s most played free multiplayer Blackjack card game around the world, with real casino card's players, playing live blackjack at stunning black jack tables and awesome card and chips graphics from our diverse blackjack casino cities: Las Vegas, London, Macau and more. Place your chips on the tables, beat the dealer’s hand and win chips and share with friends. Millions of real users to play against in this multiplayer blackjack game now made even more exciting with the new Side Bets exclusive feature! \r\n\r\nIt’s one of the world’s most famous card games. Take a seat and play in the world’s most glamorous casinos, from Monte Carlo to Vegas, on an incredible and rewarding Blackjack journey. Do you want to win more with Side Bets feature? Challenge the dealer by placing a Side Bet and wait for those pairs to gain more chips. Then crank up the excitement further and be the best ‘Tournament Master’ champion! Can your Blackjack strategy defeat all opponents? The cards are already waiting for you, so come and see if you can draw the one you need when it really counts! Find out now in this free Blackjack game!\r\n\r\nWin BIG and rise to the top of the leaderboard in one of the best card games around!\r\n\r\nEvery player gets free daily bonuses, sales offers and discounts with the opportunity to join our exclusive 💰 ‘VIP Privilege Club’ 💰, complete with seven unique levels from Bronze to Black that ensure you special boosts, and huge Chip and Diamond deals. The higher up you go, the more privileged you become!\r\nWhat’s new in Blackjack 21:\r\n✓ SIDE BETS  – Get Perfect Pairs for side bets and win bigger ♠️♣️ \r\n✓ FRESH FACELIFT – Revamped tables and stunning graphics, now with three seats for more room to play. It’s still your favorite game, just better!\r\n✓ NEW TOURNAMENTS 🏆– Three round winner takes all. A totally unique and fantastic new Blackjack 21 tournaments in hot casino cities!\r\n✓ LEADERBOARDS – Weekly leaderboard winners collect kudos and prizes\r\n✓ CASINO JOURNEY – Play in any of the seven casinos, from Athens to Monte Carlo, with high-roller stakes and bigger winnings the further you go!\r\nWhat to expect in the game:\r\n✓ FREE CHIPS EVERY DAY\r\n✓ HOURLY & DAILY BONUSES\r\n✓ VIP PRESTIGE CLUB – 7 all-new LOYALTY levels, Bronze to Black\r\n✓ BOOSTERS as rewards for your purchases\r\n✓ CASINO JOURNEY – Play in the casino of your choice, from Athens to Monte Carlo\r\n✓ AUTHENTICITY – Real casino feeling, same rules, same fun\r\n✓ CHAT – Live chat with gamers all over the world\r\n✓ AVATARS – Cool heroes – which one will you be today?\r\n✓ SIGN IN – With Facebook or as a guest (no registration needed as a guest)\r\n✓ SINGLE ACCOUNT – Use the same account for smartphones and tablets\r\n✓ PROFILE PAGE – One-touch access to your complete profile and status\r\nNOW PLAY OUR OTHER GAMES TOO:\r\n➕ POKER LIVE - Multiplayer Texas Hold’em\r\n➕ ROULETTE - French & American classic\r\n➕ BACCARAT - Authentic Asian favorite\r\n\r\nPlease like us on Facebook!\r\nhttp://facebook.com/liveblackjack21\r\n\r\nFollow us on Twitter!\r\nhttps://twitter.com/liveblackjack21\r\n\r\nLive Blackjack 21 is a free online game of chance and skill for entertainment purposes only. It is not possible to win real money, real items/services/gifts or goods in kind by playing our skill games. The virtual currencies used in this game are called Chips and Diamonds, and they can be purchased in the ‘Store’ with real money. Chips and Diamonds cannot be exchanged for cash or be paid out in any form and can only be used to play our game. Live Blackjack 21 is intended solely for an adult audience - gamers aged eighteen years or over.\r\n\r\nTerms of Service: http://www.abzorbagames.com/terms-of-service",
  "summary": "Play Blackjack now! Grab a spot and join the best black jack casino cards game!",
  "installs": "5,000,000+",
  "score": 4.4587703,
  "ratings": 110561,
  "reviews": 39049,
  "price": 0,
  "IAPRange": "£0.82 - £179.99 per item",
  "developer": "Funstage",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 11, 2011",
  "updated": 1576138507000,
  "version": "7.9.5",
  "appId": "eu.mvns.games",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack! ♠️ Free Black Jack Casino Card Game",
  "description": "Chips are always free on our blackjack tables!\r\n\r\n✔ Feel the excitement of casino blackjack!\r\n✔ Practice & Train your skills!\r\n✔ Learn card counting!\r\n✔ Master the perfect strategy!\r\n\r\nIt is coded to be the exact simulation of the actual card game 21 so that you can train yourself to become a master!\r\n\r\n Blackjack! by Fil Games Features \r\n\r\n✔  COMPLETELY FREE - You never have to pay money with free daily chips, free level up bonus chips and more free chips coming your way!\r\n✔  LEARN BLACKJACK - Our simplistic approach helps our players learn Vegas & European blackjack from scratch and train to master the strategy!\r\n✔  LEARN CARD COUNTING - Learn and become the master of card counting by training with our free card counting trainer!\r\n✔  VARIETY OF RULES - Vast variety of black jack rules to play with from Vegas, Atlantic City and European casinos!\r\n✔  BEAUTIFUL THEMES - 21+ beautiful casino table, chip and card themes inspired from Vegas casinos!\r\n✔  REALISTIC GAMEPLAY - Popular Vegas black jack hand gesture adaptations!\r\n✔  ONLINE SCOREBOARDS - Compete with online players worldwide on our online scoreboards.\r\n\r\nTo assure you of the fairness of our games, source code for the dealing process of our black jack 21 app is available online.\r\n\r\nIf you enjoy our free black jack 21 app, try Fil Games Vegas casino card game 'Baccarat!' on Google Play.\r\n\r\nDISCLAIMER:\r\n\r\nBlackjack! by Fil Games is just a blackjack gambling simulation app. It neither involves real money gambling, nor provides any means to win real money or prize. We do not encourage real money gambling. Your success in blackjack does not assure any real success with real money gambling on an actual blackjack table. \r\n\r\nIf you have any issues or questions regarding our black jack 21 app, you can contact us online at support@filgames.com",
  "summary": "Chips are FREE in our blackjack card game! Have the real black jack experience!",
  "installs": "1,000,000+",
  "score": 4.471605,
  "ratings": 44775,
  "reviews": 14912,
  "price": 0,
  "IAPRange": "£0.79 - £4.99 per item",
  "developer": "Fil Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 29, 2014",
  "updated": 1585589287000,
  "version": "Varies with device",
  "recentChanges": "◉ Visual updates.<br>◉ Critical &amp; minor bug fixes.",
  "appId": "com.sozeray.yirmibir",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Legends: 21 Online Multiplayer Casino",
  "description": "Join the world’s most popular Blackjack Game and play live with real players!\r\n\r\nForget all you know about Blackjack and other multiplayer strategy games. Blackjack Legends is the most competitive and addicting strategy games anywhere! The adrenaline rush of beating live players from around the world while mastering your kills is simply unbeatable. Think you’re the King of Vegas? Join our arena of online Blackjack players and start your win streak today!\r\n\r\nThe basic strategy card chart gives you an edge against the casino dealer, but what about your online opponents? You better practice your 21 card counting strategy! If you want to be a pro and dominate the real tables in Las Vegas, this might be the trainer that turns you from an apprentice to a pro. It's a fun Blackjack Royale!\r\n\r\nSpecial Features\r\nPlay for Free – Hit it rich! Free chips every 4 hours plus all features are totally free.\r\nOnline Multiplayer Tournament – Compete with countless elite Blackjack players around the world. Is your strategy the best?\r\nUnlock All 12 Locations – Level up to unlock high stakes tables from Las Vegas casinos to Rio. Play anywhere! Even while eating pizza at home!\r\nContinuous Play – Start playing classic Blackjack on your phone, then continue playing on your tablet online against friends and enemies alike.\r\nBlackjack Trainer – How good is your poker face? Is your strategy on point? Test your basic strategy. See if you have what it takes to conquer the Las Vegas strip plus prove you don't need an apprenticeship.\r\nFacebook Connect Bonus – Pad your bankroll with $15,000 additional chips when you connect your account to Facebook! You're going to hit it rich at the tables!\r\n\r\nHow to Play\r\nBlackjack Legends is a multiplayer classic Blackjack 21 game, where 3 competitors have 6 rounds to win the most chips. It’s that simple! Adapt your strategy to not just beat the dealer, but outplay the players online next to you in the casino as well. Card counting definitely helps you earn some real money! Just like in Poker, the game is all about strategy plus not being afraid of losing real money. This is the perfect trainer or apprenticeship for the real thing. You'll be a shark and be earning cash fast! \r\n\r\nStrategy\r\nWant to be the king of Blackjack? Multiplayer is the best trainer for your basic strategy. You'll be a pro 21 strategized in now time. It's just takes a little practice in the simulator!",
  "summary": "Win BIG in the #1 Blackjack 21 game! Think you&#39;re a pro? Test your poker face!",
  "installs": "500,000+",
  "score": 4.396109,
  "ratings": 12899,
  "reviews": 4384,
  "price": 0,
  "IAPRange": "£0.79 - £169.99 per item",
  "developer": "WildCard Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 24, 2018",
  "updated": 1527015455000,
  "version": "1.4.6",
  "recentChanges": "We&#39;ve made some fixes behind the scenes based on your feedback. Good luck on the tables, high rollers!",
  "appId": "com.wildcardstudios.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21: House of Blackjack",
  "description": "What you've always wished for is right here at your fingertips! \r\nCome enjoy blackjack as it was meant to be played, with Blackjack 21: House of Blackjack.\r\nBecome Vegas’ biggest fish with the best free blackjack, Blackjack 21 : House of Blackjack.\r\n\r\nAll the best of Blackjack 21: House of Blackjack\r\n\r\n◐ Place Side Bets to claim the Jackpot - Win at Jackpot Busters, Jackpot of Gold and claim up to 1000X more in wins!\r\n◐ Keep up with the blackjack trend in blackjack with Golden Bets - Free Double Downs, Splits\r\n◐ Enjoy fast and fun blackjack with tournaments - Compete against others and see who is the best at blackjack!\r\n◐ More is merrier in blackjack with EVERYBODY WIN - Gain bonus rewards when every player seated wins.\r\n◐ Real casino blackjack, real casino rules - Play free blackjack with the same set of official rules of Vegas.\r\n◐ The best blackjack trainer - See more wins when you play and train while learning the best strategies of blackjack like Card Counting!\r\n◐ Real casino -  Immerse yourself at the table with realistic hand motions and automatic chats.\r\n◐ Experience a colorful interface screen- Professional dealers and the bright lights of the big city await you.\r\n◐ See who’s the cream of the crop with leader boards. \r\n◐ Get rich everyday with various free chip rewards!\r\n\r\nVisit our Facebook Fanpage for more information, BONUS CHIPS, and MUCH MORE!\r\nhttps://www.facebook.com/HouseofBlackjack\r\n\r\nThe best free black jack, Black jack 21: House of Black jack, looks forward to any questions or comments from you.\r\nblackjack@help.neowiz.com",
  "summary": "Play casino blackjack FREE with the best blackjack trainer!",
  "installs": "500,000+",
  "score": 4.2974358,
  "ratings": 5913,
  "reviews": 2223,
  "price": 0,
  "IAPRange": "£0.69 - £169.99 per item",
  "developer": "NEOWIZ",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 6, 2018",
  "updated": 1586340382000,
  "version": "1.5.30",
  "recentChanges": "[Update] SLOTS added!<br>- Popular slots, which you can see in actual VEGAS casinos, are joining House of Blackjack!<br>- Try the HOTTEST 5 slots with your phone, RIGHT NOW!",
  "appId": "com.house.of.blackjack21.free.online.casino",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Blackjack by Brainium captures what makes blackjack such an exhilarating game, while making the experience easy, beautiful, and intuitive for your Android phone or tablet. Best of all, there are NO in-app purchases for getting chips in our casino game! \r\n\r\nTap the chips to adjust your bet, and watch the gorgeous, crisp, and beautifully animated cards fly on the table. \r\n\r\nIf you're unsure of your strategy, ask the dealer for a hint at any time. \r\n\r\nHelpful bubbles assist you to quickly add up your cards, or decide whether you should take a hit on a soft value. \r\n\r\nTake advantage of advanced blackjack 21 strategies, like splitting multiple times and doubling down, to win big!\r\n\r\nPractice your card counting skills by tracking the deck transition animation.\r\n\r\nWe love our players so we made sure that you don't spend any money in our blackjack twentyone game to get more chips. Blackjack 21 free by Brainium is completely free to play and all the chips and money used in the game are fictitious. \r\n\r\nGive Blackjack by Brainium a try and we promise you will have a fantastic experience. With the new skills you pick up you’ll feel more confident for your next trip to Vegas!\r\n\r\nA note regarding the odds of winning Blackjack free:\r\n\r\nLike all casino games, the odds of winning are slightly in favor of the casino. In our game, we use a cryptographically strong randomizer to shuffle the decks to make the game as authentic as possible. The game of blackjack is not meant to be ‘won’ but is instead a game of both strategy and chance, resulting in both wins and losses. The unfavorable hands are meant to make the following winning streaks that much sweeter :)\r\n\r\nBlackjack 21 Rules: \r\n\r\nBlackjack, also known as 21, is one of the most popular casino games in the world. Blackjack is a card game where players compete against the dealer. The object of the game is to reach 21 or to reach a score higher than the dealer without exceeding 21. \r\n\r\nIn Blackjack free by Brainium, the dealer must draw to 16 and stand on soft 17. Blackjack pays 3 to 2, and insurance pays 2 to 1. \r\n\r\nBlackjack 21 Highlights & Features: \r\n\r\n- Gorgeous, beautifully animated cards \r\n- Touch and interact with all of your chips \r\n- Split hands or double down to win big \r\n- Buy insurance to dodge a dealer blackjack \r\n- Surrender to get out of a tough situation \r\n- Detailed statistics to track your performance \r\n- Multiple casino table backdrops to choose from \r\n- Unlimited dealer hints \r\n- Unlimited free chips! Just spin the wheel :)\r\n- New deck animation helps you practice your card counting skills\r\n- Our Blackjack free games look amazing on tablets and phones of all sizes\r\n\r\nIf you enjoy our black jack App, check out our other card games, Solitaire, Spider Solitaire, and FreeCell, on Google Play or AppBrain.\r\n\r\nWe hope you enjoy Blackjack free by Brainium, and contact our five star support if you have any questions :)",
  "summary": "Play the classic Blackjack casino game free, and feel the thrill of winning big!",
  "installs": "1,000,000+",
  "score": 4.4554057,
  "ratings": 55267,
  "reviews": 13633,
  "price": 0,
  "developer": "Brainium Studios",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "May 13, 2014",
  "updated": 1574104086000,
  "version": "Varies with device",
  "recentChanges": "Thank you so much to our amazing players!<br>- We added increased support for 64 bit devices :)",
  "appId": "com.brainium.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack - World Tournament",
  "description": "■The 1st app in the world to offer REAL Blackjack Tournaments!■\r\nPractice your strategies, and get ready before you head to a real casino!\r\n\r\n\r\n▶ Compete in Tournament Mode\r\n\r\n* Real Blackjack Tournaments with Official Casino Rules!\r\n* Multi-level Tournaments: Rio, Las Vegas, Sydney, Macau, Tokyo\r\n* Compete with 2 other players in 8 hands\r\n* Hand 4 is an Elimination Hand\r\n* One chance to exchange a card at the most crucial moment\r\n* See how you stack up to other players around the world\r\n\r\n▶ Get Lucky in Spin & Go Mode\r\n\r\n* The top chip-holder gets the prize!\r\n* Open to all levels\r\n* 4 rounds with no elimination hands\r\n* Compete with 3 other players\r\n\r\n▶ Hone your Skills in Free Bet Mode\r\n\r\n* Play with friends and people around the world\r\n* Multi-Bets & Pair Bets: Bet in up to 3 places simultaneously\r\n* Double Pay Gauge: A full gauge doubles your pay\r\nfor the next hand\r\n* Play with friends at your own private blackjack table\r\n* Rank up and play more advanced tables:\r\nBeginners/Amateurs/Advanced/Bigshots/Highrollers/Billionaires\r\n\r\n▶ Play against friend 1 vs 1 Mode\r\n\r\n  * Add friends in game and challenge them! \r\n  * Play VS mode to show the real blackjack winner!\r\n  * Four rounds with no elimination hands\r\n  * Challenge your friend one on one!\r\n\r\n▶ Earn Free Bonuses & Complete Missions\r\n\r\n   * Connect with Facebook: Get $500,000 in chips\r\n   * Welcome Bonus: $500,000 in chips\r\n   * Time Bonus: $40,000 in chips every 3 Hours\r\n   * Daily Bonuses: Chips up to $3,500,000\r\n   * Weekly Bonus: Tournament Ticket or chips up to $1,500,000 \r\n   * Daily / Special Missions: Free Chips upon completion\r\n   * Various Seasonal Events & Special Missions!\r\n\r\nFor suggestions and help, please contact us at: support@neon-games.zendesk.com\r\nLike Us on Facebook for Updates and Free Prizes: https://www.facebook.com/WBTfan \r\n\r\n* Disclaimer: The games are intended for an adult audience. Our games are meant for amusement and entertainment purpose only. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.”\r\n----\r\n개발자 연락처 :\r\n+82-31-698-3448",
  "summary": "REAL Blackjack Tournaments!",
  "installs": "500,000+",
  "score": 4.368421,
  "ratings": 13913,
  "reviews": 4374,
  "price": 0,
  "IAPRange": "£0.89 - £189.99 per item",
  "developer": "NEON Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 1, 2016",
  "updated": 1574661059000,
  "version": "1.2.115",
  "recentChanges": "Minor bug fixes.",
  "appId": "air.com.neon.games.WBT",
  "searchTerms": "blackjack"
 },
 {
  "title": "myVEGAS Blackjack 21 - Free Vegas Casino Card Game",
  "description": "Play the #1 Blackjack 21 game on Google Play for free!\r\n\r\nIt’s the ONLY LAS VEGAS CASINO – style free black jack 21 app where players can enjoy Las Vegas experiences.\r\n\r\n* TONS OF DIFFERENT WAYS TO HIT THAT 21! *\r\n\r\n*** FREE CHIPS – Collect free chips multiple times per day!\r\n*** Free Bonuses - Join the thousands who enjoy free bonuses just by playing!\r\n*** Unique bonus games – Double or Nothing!\r\n*** Collect unique collectible cards (CCG) by unlocking new casinos!\r\n*** Las Vegas Inspired Blackjack tables - MGM Grand, Excalibur, Mirage, New York New York, Aria, Circus Circus, Luxor and more!\r\n*** Multiple Casino - style Online Card Game Variants - Freebet Blackjack, Single-deck Black jack, Las Vegas - style Progressive Multi-deck free Blackjack.\r\n\r\nDon’t forget to play myVEGAS Slots, my KONAMI Slots, and POP! Slots to enjoy the Las Vegas experience.\r\n\r\nLike Us on Facebook: facebook.com/myVEGASBlackjack\r\nFollow Us on Twitter: @myVEGAS\r\n\r\nDisclaimers:\r\n- myVEGAS Blackjack is intended for individuals 18 years and older.\r\n- myVEGAS Blackjack does not offer real money gambling.\r\n- PLAYSTUDIOS, the developer of myVEGAS Blackjack, is not affiliated in any direct or indirect way with any real-money gambling operations on other domains.\r\n- Virtual chips used in myVEGAS Blackjack have no real-world value and cannot be redeemed for anything of value.\r\n- Playing free-to-play slots games does not imply future success at real money gambling.\r\n- In-app purchases available.\r\n- PLAYSTUDIOS, the developer of myVEGAS Blackjack, is a member of the International Social Games Association (“ISGA”) and has adopted its “Best Practice Principles.”  See more about the ISGA at www.i-sga.org.  For information, guidance, tips, and advice on social gaming, visit “Smart Social Gamers” at www.smartsocialgamers.org.",
  "summary": "#1 BLACKJACK 21 game and Enjoy Las Vegas Experiences",
  "installs": "1,000,000+",
  "score": 4.6584053,
  "ratings": 115444,
  "reviews": 24309,
  "price": 0,
  "IAPRange": "£0.89 - £184.99 per item",
  "developer": "PLAYSTUDIOS INC",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Sep 24, 2014",
  "updated": 1575669546000,
  "version": "1.24.2",
  "recentChanges": "- Loyalty Points will now be rewarded along side chips for watching Rewarded Video Ads starting December 2nd, 2019!<br>- Norwegian Cruise Line has been added as a reward partner!  Look out for these new rewards in the coming weeks!<br>- Be on the look out for new notifications with free chips, special offers and more!<br>- Improved performance, and added support for Android 9.",
  "appId": "com.playstudios.myvegas.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Free",
  "description": "Play the popular Casino game on your mobile device without the need of an internet connection!\r\n \r\nSharpen your skills in Black Jack and enjoy countless hours of fun with unlimited chips! \r\n\r\nBlackJack Free is a single-player, offline game that will make you feel like playing in Las Vegas. There’s no need to rush – play at your own pace! \r\n\r\n♠\tGoogle Play Leaderboard  – compete with players around the world!\r\n♠\tGoogle Play Achievements – test your skills and get the badges! \r\n♠\tTwo seats to play two hands at a time\r\n♠\tAuthentic Blackjack rules\r\n♠\tBeautiful graphics \r\n\r\nBlackjack is a free, online, game of chance and skill for entertainment purposes only. It is not possible to win real money, real items/services/gifts or goods in kind by playing our skill games. The virtual currencies used in this game are called Chips and can be purchased in the ‘Store’ by using real money. Chips cannot be exchanged for cash or be paid out in any form and can only be used to play our game. Blackjack is intended solely for an adult audience which is eighteen years or over.\r\n\r\nTerms of Service: http://www.abzorbagames.com/terms-of-service",
  "summary": "Offline Blackjack 21 with unlimited FREE chips!",
  "installs": "100,000+",
  "score": 4.3771043,
  "ratings": 2991,
  "reviews": 1094,
  "price": 0,
  "IAPRange": "£1.79 - £9.49 per item",
  "developer": "Funstage",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 2, 2016",
  "updated": 1545333160000,
  "version": "1.4.4",
  "recentChanges": "fixes",
  "appId": "com.abzorbagames.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21 Casino Vegas - free card game 2020",
  "description": "🃏 Feel lucky today? Test your Black jack skills now! 🃏\r\n\r\nGet the Blackjack 21 - Casino Vegas and test your strategy on smartphone without ever spending a single penny with nice sound effects and graphics. Try our 21 casino card game with different tactics and get ready for Las Vegas in our simulator of Blackjack free.\r\n\r\n====================✔️ COME AND PLAY RIGHT NOW ✔️====================\r\n\r\nBlackjack 21 - Casino Vegas is a great option for players looking for premium Las Vegas Black jack in a year 2020. Amazing sound effects and graphics are making this game extraordinary. Try your very best strategy and test your card skills before your real adventure in a Las Vegas casino playing blackjack♠️.\r\nBecome a professional black jack player without risking your money, get our chips and prepare yourself with this remarkable Vegas Black jack trainer.\r\n\r\n🃏 FEATURES 🃏\r\n- Real 21 blackjack free casino card game to test your card strategies, poker face and honing your abilities for a gambling adventure\r\n- A wide range of casino chips at your disposal to simulate the real casino feeling\r\n- Scratch Lucky and Royal Tickets to win up to 2 mil. chips \r\n- Spin Lucky and Royal wheel for extra prizes\r\n- Break Piggy Bank to get back your lost chips\r\n\r\n====================✔️INTERESTED ALREADY?✔️====================\r\n\r\nPush your luck, prepare your strategy and become a millionaire!  Come win every day and spin the lucky wheel scratch tickets for a free prize! There is no better better way to prepare yourself than playing a casino card game before going to Vegas than our blackjack free game. In addition, you can always try our roulette game Roulette Pro VIP  to get the most authentic all round Las Vegas casino experience. Play real blackjack 21 and master the cards!\r\n\r\nPlay this amazing offline blackjack 21 game in 2020! Your very own city of sin in your pocket. Join the table, win! True 21 blackjack free experience.",
  "summary": "Enter Las Vegas &amp; play free blackjack♠️ 21 now! Enjoy best gambling casino games",
  "installs": "100,000+",
  "score": 4.6088233,
  "ratings": 3438,
  "reviews": 1166,
  "price": 0,
  "IAPRange": "£0.99 - £134.99 per item",
  "developer": "INLOGIC CASINO - roulette blackjack",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 5, 2019",
  "updated": 1584345864000,
  "version": "1.0.5",
  "recentChanges": "Bug fixes and improved stability",
  "appId": "sk.inlogic.blackjack21.casinovegas",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack for Tango",
  "description": "Blackjack is an exciting game that any player is sure to enjoy. Place a bet, get more points than the dealer and win chips. Feel the risk as you dive into a casino atmosphere and catch fortune by the tail. Play online with people from the world over!\r\n\r\nGame features:\r\n\r\n* GET REWARDS – Raise bets, win deals, go all in and unlock achievements.\r\n\r\n* TALK TO OTHER PLAYERS – Use our convenient chat and messaging system to discuss the games you've won and share your experiences with friends and rivals.\r\n\r\n* FREE CHIPS – Visit the game every day and get free chips.\r\n\r\n* LEARN TO PLAY – Are you a new player and have you always wanted to test your mettle in Blackjack? We can help you take the first step.\r\n\r\n* NO REGISTRATION – Use guest mode to play 21 without registering.\r\n\r\n* SINGLE USER ACCOUNT – Your account is linked to Pokerist Texas Poker and Roulettist, allowing you to use contacts, achievements and chips in all three applications.\r\n\r\n* CONVENIENT INTERFACE – The game's simple and entertaining interface gives you the ability to split, stand or double with a single tap.",
  "summary": "Pick a table, place a bet and play Blackjack with people from around the world!",
  "installs": "50,000+",
  "score": 4.09,
  "ratings": 862,
  "reviews": 294,
  "price": 0,
  "IAPRange": "£0.99 - £99.99 per item",
  "developer": "Tango",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 13, 2016",
  "updated": 1481824798000,
  "version": "5.14.33",
  "recentChanges": "From the makers of Pokerist, Tango is proud to present Blackjack!",
  "appId": "me.tango.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21",
  "description": "Play the best free Blackjack 21 game on the play store. No chip buying, just jump right in and play Blackjack completely free! \r\n\r\nAlso called 21, Blackjack is one of the most popular casino games in the world. With a beautiful and intuitive design, you will love this modern take on the classic casino card game.\r\n\r\n- Popular Las Vegas rules just like at the casino.\r\n- Intuitive hint system.\r\n- Our fair table dealer never cheats - unlike other games, in ours you can actually win.\r\n- Beautiful table customization with HD graphics.\r\n- Double Down, Splits, Insurance and Surrender for an authentic Blackjack experience.\r\n- Deck shuffle animation lets you know when the deck is being reshuffled.\r\n- Tons of chip denominations from singles all the way to millions.\r\n- Large cards and table display for easy playing.\r\n- Easy, simple to learn controls makes this the sleekest card game available.\r\n- Stat tracking shows your performance over time.\r\n- Informative help screen for those who don't already know the rules of 21.\r\n- The object of the game is to reach 21 or to reach a score higher than the dealer without exceeding 21.\r\n- Practice your Blackjack skills to become a true Vegas vip!\r\n\r\nWe'll be adding some awesome new features soon, so stay tuned.",
  "summary": "Try Your Luck With Blackjack 21 - Play Free!",
  "installs": "1,000,000+",
  "score": 4.217468,
  "ratings": 136984,
  "reviews": 46033,
  "price": 0,
  "IAPRange": "£1.69 - £16.99 per item",
  "developer": "Banana & Co.",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Oct 5, 2015",
  "updated": 1560903635000,
  "version": "Varies with device",
  "recentChanges": "Blackjack 21 winnings just got better. Update now :)<br><br>- Reduced ads!<br>- Fixed an issue where pressing the back button would sometimes crash the app<br>- Minor updates to the splash screen animation, app icon design, and other UI improvements<br>- Added privacy policy and terms of service links under the Help menu<br>- Added various ways to get more chips to keep the winnings flowing<br><br><br>Thank you for playing Blackjack! Reach out to us at contact@maplemedia.io for any support or feedback.",
  "appId": "com.banananadco.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Casino 2020: Blackjack 21 & Slots Free",
  "description": "Looking for new Casino Games? BlackJack card game is here to offer breathtaking card\r\ngaming fun. From global players and amazing new tournaments to daily free chips and\r\nweekly rewards, this blackjack online is all about offering upbeat card gaming fun.\r\nMaster your blackjack skills by practicing on online slots and participate in global\r\ntournaments when you are ready. \r\nWondering how to play BlackJack 21? All you need to do is beat the dealer by having a\r\ncard total that doesn’t exceed 21!\r\nPlay the game now!\r\n\r\nWin Free Chips daily\r\nWho doesn’t love a card game offering exciting new rewards? The new casino slot\r\ngame offers huge free chip stacks for all the players. You can not only get to enjoy free\r\ndiamonds but also greeting chips once you spin to win the mega wheel. Win chips and\r\ndiamonds with a free spin that unlocks after every 2 hours!\r\n\r\nExciting BlackJack Card Game\r\nWant to play Classic slot game online anonymously? Switch to the Guest game mode\r\nand play Diamond league tournaments and win exciting new rings collection. Complete\r\ndaily missions and reserve your spot in top 100 weekly players.  \r\n\r\nBlackJack Online Cities\r\nWant to play Casino slot game in different cities? The game features multiple contents\r\nincluding the majestic cities of Atlantic City, Macau city, Singapore and the Carnival Last\r\nlegend casino in Hawaii. You can also choose to double down in Bellagio in Las Vegas.\r\nBecome the best blackjack player in the world as you appeal to the exciting graphics of\r\ndifferent continents in this game. \r\n\r\nCreate profiles \r\nCreate profiles and show off your achievements to other players! You can also view\r\nother people’s profiles to stay inspired. Become the king of BlackJack and impress\r\neveryone around you!\r\n\r\nFeatures of Blackjack Casino 2020 – Blackjack 21 & Slots Free\r\n• Simple and easy casino slot games UI/UX\r\n• Appealing Vegas Casino game layout with striking design elements \r\n• Smooth and responsive spin to win controls for streamlined gaming fun\r\n• Win free huge chip stacks to enjoy free diamonds\r\n• Spin to win free diamonds and greeting chips\r\n• Option to play blackjack anonymously by switching to guest mode\r\n• Create and customize blackjack card game profiles and level up as you win\r\n• View other players profiles and stay inspired \r\n• Complete exciting daily challenges and stay on top of your game\r\n• Weekly top 100 winners selection for exciting gaming experience \r\n\r\nAre you ready to become the global blackjack online king? If yes, this game is all you\r\nneed. Download and play Blackjack Casino 2020 – Blackjack 21 & Slots Free today!\r\n\r\nThis casino game is intended for an adult audience (21+) for amusement purposes only\r\nand does not offer \"real money\" gambling, or an opportunity to win real money or prizes\r\nbased on game play. Playing or success in this game does not imply future success at\r\n\"real money\" gambling.\r\n\r\nCreated with love by CYBERNAUTICA 2018 - 2020",
  "summary": "Experience the best vegas casino game with blackjack casino 2020 - Slots free",
  "installs": "50,000+",
  "score": 4.46,
  "ratings": 697,
  "reviews": 210,
  "price": 0,
  "IAPRange": "£0.99 - £99.99 per item",
  "developer": "CYBERNAUTICA",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 12, 2018",
  "updated": 1584032738000,
  "version": "2.6",
  "recentChanges": "Huge update! BlackJack casino 2020! More improvements are coming to you!",
  "appId": "bds.mobile.casino.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21 - casino card game",
  "description": "This is a free authentic casino Blackjack gambling game, also known as twenty-one or 21, that you can play against the dealer.\r\nEnjoy classic casino card game with Popular Las Vegas rules just like at the real casino. You need to download this app if you like to play slot machines or slots and blackjack or just want to learn how to play Black Jack 21 in a casino and practice your gambling skills to be prepared for your Vegas trip.\r\n\r\nTop Features of the game\r\n- unlimited free chips\r\n- fair game 100% truly random card shuffler with deck shuffle animation \r\n- authentic Blackjack experience\r\n- Double Down, Splits, Insurance and Surrender\r\n- by default the game is played with single deck\r\n- simple game easy to play with smart controls\r\n- hints based on Blackjack strategy charts\r\n- game statistics and free chips after bankrupt\r\n- lit graphics large cards and easy to play\r\n- learn how to beat the casino and how to play blackjack at the casino\r\n- Easy to play 100% fun addictive and challenging game\r\n\r\nBasic rules and how to play \r\nIn Black jack, you are trying to build a hand with a higher value than a hause without going over 21. Aces may count either 11 or 1. Face cards are worth 10, and all othe cards are worth the number they show .\r\nAny hand containing an Ace and a face card is called a black jack. BlackJack beats every other hand, and play 3 to 2 for the players.\r\n\r\nNOTE: This is NOT gamble games for real money.\r\n- The game is intended for an adult audience and this card game do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n\r\nPlease let us know what you think of this card game and rate us.\r\n\r\nCreated by CYBERNAUTICA 2017 - 2018",
  "summary": "Play Blackjack 21 best casino card game ever!",
  "installs": "100,000+",
  "score": 4.4855967,
  "ratings": 4908,
  "reviews": 1796,
  "price": 0,
  "IAPRange": "£2.49 - £2.99 per item",
  "developer": "CYBERNAUTICA",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 22, 2017",
  "updated": 1563367738000,
  "version": "2.4",
  "recentChanges": "Thank you for playing best BlackJack game!<br>2019<br>v2.4<br>updated  64-bit version of the app<br>v2.3<br>- bug fix: some premium users could have seen ads in previous version<br>v2.1<br>- Android 9 Pie support and bugfixies<br>2018<br>v2.0<br>- settings (music, sounds, notifications)<br>- free casino chips for more games<br>- premium membership - no  ads, more coins on bankrupt!<br>v1.7<br>-minor bugfixes<br>v1.6<br>- updated version for android 8 mobile<br>v1.5<br>- game is more smooth and lit<br>v1.4<br>- get triple bonus on level up",
  "appId": "blackjack.casino.card.game",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21",
  "description": "Blackjack Casino Card Game - The BEST Vegas casino blackjack free game! Play Blackjack as if you were at the real vegas casinos!\r\n\r\nIn Blackjack 21 by HHSDaily, You can set the rule about whether the dealer must hit or stand on soft 17, and the number of decks, from 4 to 8. Split, Double Down, Insurance and  Surrender for an authentic Blackjack experience!\r\n\r\nIn our Blackjack game, there are the most popular 6 real casinos, from Las Vegas Downtown to The Mirgae. Play Blackjack against the dealer and see who can WIN by getting 21 without going bust! \r\n\r\nBlackjack 21 Features:\r\n- Easy to play, full of fun.\r\n- Large cards, great graphics.\r\n- Awesome sound effects, gorgeous animations.\r\n- Tap chips, cards and table to play blackjack as if you were at the casino.\r\n- Flexible Rules: Dealer hit or stand on soft 17.\r\n- Split hands or double down to win big!\r\n- Buy insurance to dodge a dealer blackjack.\r\n- Surrender to get out of a tough situation.\r\n- Multiple real casino tables to choose from.\r\n- Detailed statistics to track your performance.\r\n\r\nDownload Blackjack 21 Classic - Casino Card Game for FREE and start playing today!",
  "summary": "Play the Classic Blackjack 21 for free, feel the thrill of real vegas casino!",
  "installs": "10,000+",
  "score": 4.896755,
  "ratings": 3448,
  "reviews": 130,
  "price": 0,
  "IAPRange": "£1.79 - £90.99 per item",
  "developer": "Card Games, HHS Daily",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 26, 2018",
  "updated": 1556602085000,
  "version": "1.2.6",
  "recentChanges": "Game performance improvements. <br>We hope you enjoy our Blackjack! Keep it updated so you&#39;ve always got the latest and greatest.",
  "appId": "com.card.games.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Welcome to the #1 Blackjack! Play as in real casinos and beat the dealer to win tons of dollars!\r\n\r\nBlackjack, also known as twenty-one, is the most widely played casino banking game in the world.\r\n\r\nRULES AND OPTIONS\r\n\r\nBlackjack is a card game between a player competing against the dealer. It is played with two or more decks of 52 cards.\r\n\r\nThe object of the game is to beat the dealer in one of the following ways:\r\n\r\n- Get a BlackJack on the player's first two cards (21 points), without a dealer blackjack.\r\n- Reach a final score higher than the dealer without exceeding 21\r\n- Let the dealer draw additional cards until his or her hand exceeds 21.\r\n\r\nCASINOS\r\n\r\nTravel all around the world and play in the most popular casinos: \r\n- Casino of Las Vegas\r\n- Casino of Paris\r\n- Casino of Macau\r\n- Casino of London\r\n- Casino of Monte Carlo\r\n- Casino of The Bahamas\r\n\r\nFEATURES\r\n\r\n- Blackjack pays 3:2 \r\n- Dealer must stand on a 17 and draw to 16\r\n- Insurance pays 2:1\r\n- Hit, Stand, Double Down, Split or Surrender\r\n\r\nIMPORTANT NOTICE\r\n\r\nThis game contains an algorithm that strictly respects Blackjack rules. Cards are shuffled and dealt in the exact casino way to ensure a 100% fair gameplay.\r\n\r\nInapp purchases cost real money - be responsible when playing games including money. This Blackjack game is a gambling simulation game, it neither involves real money gambling, nor provides any means to win real money or prize.\r\n\r\nCONTACT\r\n\r\nPlease feel free to contact us at support@greenpandagames.com if you encounter any problem regarding this app.\r\n\r\nFor the latest news and updates on Green Panda Games:\r\n\r\nLIKE us on Facebook\r\nhttps://www.facebook.com/Green-Panda-Games-1696022237280275/\r\n\r\nFollow us on Twitter\r\n@greenpandagames\r\n\r\nVisit us at:\r\nhttp://www.greenpandagames.com",
  "summary": "The best Blackjack game with awesome and colorful design available for FREE",
  "installs": "100,000+",
  "score": 4.302064,
  "ratings": 5354,
  "reviews": 1668,
  "price": 0,
  "IAPRange": "£0.99 - £154.99 per item",
  "developer": "Green Panda Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 1, 2017",
  "updated": 1538380814000,
  "version": "1.3.1",
  "recentChanges": "GDPR update",
  "appId": "com.greenpanda.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Strategy Practice",
  "description": "Learn perfect Blackjack strategy quickly and easily! Maximize your casino edge by playing every kind of hand or just the ones you want to improve on. Get immediate feedback on each and every move. Automatically track your accuracy, hot streaks, and detailed stats.\r\n\r\n+ No Ads\r\n+ Learn perfect strategy\r\n+ Fast and simple\r\n+ Detailed stats of all your hands\r\n+ Immediate feedback on every move\r\n+ Practice everything or just what you need to\r\n+ Quick access to standard blackjack strategy card\r\n+ Customize your hand types\r\n+ Easy to share with friends",
  "summary": "Learn perfect Blackjack strategy quickly and easily!",
  "installs": "100,000+",
  "score": 4.5641026,
  "ratings": 1967,
  "reviews": 812,
  "price": 0,
  "IAPRange": "£0.79 - £8.99 per item",
  "developer": "WFT LLC",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Oct 6, 2013",
  "updated": 1579064254000,
  "version": "3.0.20",
  "recentChanges": "Dark Mode is here!",
  "appId": "com.wftllc.blackjackstrategy",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack -21 Casino Card Game",
  "description": "Play your favorite game - Blackjack in real casino environment. Realistic and intuitive graphics further adds to the experience.\r\n\r\nBefore leaving for Las Vegas, this is the right app for you to learn the basics and get your black jack strategy right.\r\n\r\nGet the thrill of winning money against the dealer in almost real life scenarios with this App.\r\nDefine your strategies, practice using this app and get to perfection.\r\n\r\n-----------------------------------------\r\n\r\nFeatures of the Black Jack App :\r\n\r\n*Three tables to chose from depending on your risk taking abilities - the minimum and maximum bet varies along with the number of decks. The third table is for the high-rollers with no upper cap on maximum bet.\r\n\r\n*Nice casino style sound and music added.\r\n\r\n*Shuffling after half of the hands played. Card counting can be done.\r\n\r\n*Split option available if the initial two cards are same.\r\n\r\n*Double down option available if you wish to double your bet after seeing the first two cards.\r\n\r\n*Hourly Free Bonus Chips - The more you play, the more you get.\r\n\r\n*Learn section which has everything you need to know about blackjack. This can be used by a beginner as well as advanced players.\r\n\r\n*Leaderboard to boast your earnings!\r\n\r\n\r\nComing Soon : Card Counting Trainer \r\n\r\nFor Support and Feedback : support@phonato.com",
  "summary": "#1 Blackjack App! Have the most realistic blackjack experience!",
  "installs": "100,000+",
  "score": 4.521898,
  "ratings": 2757,
  "reviews": 803,
  "price": 0,
  "IAPRange": "£0.99 - £94.99 per item",
  "developer": "Vegas Casino Slots by Phonato Studios Gaming",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 25, 2016",
  "updated": 1521030498000,
  "version": "1.3",
  "recentChanges": "- Minor Optimisations.<br>- Privacy Policy/Terms of service added. Secure Data transmission.<br>- Bug Fixes, Performance enhancement &amp; Improvements.<br>Enjoy the game and don&#39;t forget to share your feedback with us.",
  "appId": "com.phonato.card.game.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Blackjack, also known as twenty-one, is the most widely played casino banking game in the world.Blackjack is a comparing card game between a player and dealer, meaning players compete against the dealer but not against other players. It is played with one or more decks of 52 cards. \r\n\r\nPress your bets for a good time and go all in with Blackjack 21 + today!\r\n\r\nFeatures:\r\n● Unlock higher table limits\r\n● The more coins you win the higher you can bet!\r\n● Play by genuine casino Blackjack rules\r\n● Keep track lots of different gameplay statistics\r\n● Handy Hint feature to help novice players\r\n● Daily and Hourly Bonuses\r\n● Engaging scoring features\r\n\r\nFree Download Now! Thanks for playing!",
  "summary": "Black Jack(Twenty-One, 21 Points) is a Classic Casino Card Games",
  "installs": "500,000+",
  "score": 4.5957446,
  "ratings": 5715,
  "reviews": 1502,
  "price": 0,
  "IAPRange": "£2.89 - £95.99 per item",
  "developer": "Spider Solitaire Card Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 7, 2016",
  "updated": 1545216129000,
  "version": "2.5",
  "recentChanges": "UI Optimized",
  "appId": "com.happysky.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Card Game",
  "description": "Win BIG at your next casino trip by playing this Blackjack app, with the best casino-style experience. Learn to master the most popular card game found in casinos all over the world, from the best Blackjack developer on Google Play. \r\n\r\nREAL BLACKJACK STRATEGY\r\nThere’s more to this Blackjack app than just Hit or Stand. Just like a real casino, you have the option to split, double down, and even take insurance!\r\n\r\nMULTIPLE TABLE OPTIONS\r\nThink you’re ready to play with the High Rollers? Try your hand in the high stakes tables! Start with Beginner’s Luck and work your way up to The Penthouse! \r\n\r\nMORE BLACKJACK FEATURES\r\n• Option to play 1 to 8 decks\r\n• Come back every few hours for BONUS chips\r\n• Toggle strategic Advice on or off to get real-time feedback as you play\r\n• Toggle “Insurance” and “Surrender” on or off\r\n\r\nDownload Blackjack today and master your game!\r\n\r\nDISCLAIMER\r\n• The games are intended for an adult audience.\r\n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n• Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\nFor answers to frequently asked questions, head over to\r\nhttp://www.mobilityware.com/support.php\r\n\r\nLIKE US on Facebook\r\nhttp://www.facebook.com/mw.blackjack/\r\n\r\nFOLLOW US on Twitter\r\n@mobilityware\r\n\r\nCreated and supported by MobilityWare",
  "summary": "Experience Vegas-style blackjack from the makers of Solitaire, MobilityWare!",
  "installs": "10,000+",
  "score": 4,
  "ratings": 160,
  "reviews": 76,
  "price": 0,
  "IAPRange": "£0.89 - £91.99 per item",
  "developer": "MobilityWare",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 4, 2019",
  "updated": 1566586191000,
  "version": "2019.8.0.2194",
  "recentChanges": "Hey Blackjack Fans! 🃏 We’ve made some new updates to the gameplay to make sure you have the best Blackjack ♠ experience around! Enjoy the new gameplay enhancements! If you’re loving this game ♥, please take a moment to leave us a ⭐⭐⭐⭐⭐review. Have fun and Good Luck! 😉",
  "appId": "com.mobilityware.BlackJackFree",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21 - FREE Black Jack",
  "description": "Blackjack 21 is the MOST popular, fun and authentic Las Vegas Blackjack game on the store! Play 21 blackjack as if you were at the REAL Vegas Casino! \r\n\r\nPlay 21 blackjack against the dealer and see who can WIN by getting 21 without going bust! Splits, Double down, Insurance and Surrender for an authentic black jack experience. Deck shuffle animation let you know when the deck is being reshuffled!\r\n\r\nKing of Vegas Bellagio? Try your luck around the world in Macau, Monte Carlo, Sydney, Monaco or Las Vegas. Even learn Basic Strategy and Card Counting to become a high roller, sharpen your skills before your next big trip to Vegas, Bellagio, Monaco, or Macau!\r\n\r\n3D Authentic Black Jack tables, 3D chips, choose your favorite! Beautiful graphics with wonderful animations! Updated with awesome music and sweet dealer voice.\r\n\r\nAt the same time of playing black jack, you can open the chest and get beautiful, exquisite collectible. More than 200 collectibles to collect! Each collectible is well designed by us, each collectible has a mysterious story about it. \r\n\r\nWant to know all story? Want to take a good look at these mysterious items? Hurry to download black jack, lighten all the collectibles, and unlock bonuses!\r\n\r\nBlackjack 21 FEATURES:\r\n- Easy to play, full of fun!\r\n- 3D Authentic Casino Tables, choose your favorite!\r\n- Large Cards, Beautiful graphics.\r\n- Blackjack casino rules pays 3:2\r\n- Insurance pays 2:1 if the dealer has blackjack\r\n- Come back every 3 hours for BONUS chips, and get more chips in DAILY BONUS! \r\n- Easily earn chips by leveling up or selling collectible.\r\n\r\nThis game is intended for an adult audience (21+) and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.",
  "summary": "Blackjack Free! Play 21 blackjack against the dealer and WIN BIG by getting 21!",
  "installs": "50,000+",
  "score": 4.27,
  "ratings": 607,
  "reviews": 188,
  "price": 0,
  "IAPRange": "£1.79 - £90.99 per item",
  "developer": "AE Magwin: Free Casino Slot Machines Bingo Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 28, 2016",
  "updated": 1556531719000,
  "version": "1.3.0",
  "recentChanges": "Hi Blackjack Fans! This is our largest update yet! <br>- Complete a set of collections for more rewards!<br><br>Thank you for your feedback, and your continued support will help us bring you new content often.",
  "appId": "com.arcadegame.games.blackjack21.free.chips",
  "searchTerms": "blackjack"
 },
 {
  "title": "Multi Hand Blackjack",
  "description": "Multi-hand Blackjack, supports up to 3 hands (or up to 3 players in multiplayer mode): triple the action, triple the excitement, triple the fun!\r\n\r\nThis game uses real cards from 1 to 8 decks (can be configured in settings). It's a great way to practice your strategy, or enjoy some couch time with friends using the local multiplayer mode.\r\n\r\n♣ Choose between Serious and Fun Mode. Practice your skills or just have fun!\r\n♣ No annoying banner ads and pop-up ads! Only optional ads that rewards chips.\r\n♣ Single player or local co-op. Plenty of fun without the need for Internet connection.\r\n\r\nThis is the full version. It's completely free!",
  "summary": "Multihand Blackjack: triple the action, triple the excitement, triple the fun!",
  "installs": "100,000+",
  "score": 4.4346504,
  "ratings": 3617,
  "reviews": 1485,
  "price": 0,
  "developer": "Naive Code",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 4, 2011",
  "updated": 1565472455000,
  "version": "5.0.3",
  "recentChanges": "This update: added support for Android Q.<br><br>Last Update:<br>- Added a Magic Hat screen for Magic and other cool items that may aid you in Fun Mode.<br>- Added a statistics screen that counts cards, to show this game simulates real decks and shuffles randomly.<br>- Added support to &quot;re-split&quot;, allowing infinite splitting on pairs.<br>- Performance and graphical changes: larger texts, animation speed adjustments, bug fixes.",
  "appId": "hr.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack All-In-One Trainer",
  "description": "The only application you need to master both Basic Strategy and Card Counting.\r\n\r\nBlackjack All-In-One Trainer has 3 modes; Play, Train and Simulate. Reduce the advantage the casinos have over you by learning and practicing Basic Strategy. Beat the house and shift the odds in your favor by learning and practicing Card Counting. Understand the statistics and see the results of millions of hands of Blackjack played using the most advanced Blackjack simulator on the app store.\r\n\r\nFeatures:\r\n●  Play mode with very detailed statistics.\r\n●  Basic Strategy Training Guides - From absolute beginner to advanced Basic Strategy statistics.\r\n●  Basic Strategy Charts - You set the rules and view the optimized strategy chart.\r\n●  Basic Strategy Drills - Two drills for practicing the correct Basic Strategy for the table rules you've selected.\r\n●  Card Counting Training Guides - From beginner to advanced guides covering the Hi-Lo counting system.\r\n●  Card Counting Index Charts - These show deviations from Basic Strategy based on the card count.\r\n●  Card Counting Drills - Three drills for practicing all aspects of Card Counting.\r\n●  Simulator - See the results of millions of hands of Blackjack played in seconds.\r\n\r\n--= Basic Strategy =--\r\nGuides - How to Play, Rule Variations, Basic Strategy, Side Bets and Statistics.\r\nStandard Drill - Select table rules and the type of hand you would like to practice. Choose the best action on the hand that is presented. If you are correct the hand is removed from the list. If you are wrong the hand will appear again at random. The strategy chart is available to view if you are stuck.\r\nGame Play Drill - Just like a regular game of Blackjack except there are no bets. As long as you choose the correct action you will play out your entire hand. Your best win streak is tracked.\r\n\r\n--= Card Counting =--\r\nGuides - How to Count, Learn Indexes, Finding a Table, Camouflage, Statistics\r\nKeeping Count Drill - Select the speed and how many hands should be dealt. After the hand is dealt out you are asked what the running count and the true count is. Designed to practice counting speed and accuracy as well as true count conversions.\r\nDeck Countdown Drill - Count a deck or multiple decks of cards. You can either automatically or manually flip through the cards while keeping the count. A classic card counting practice technique that improves speed and accuracy.\r\nGame Play Drill - The most powerful drill in the application. Play Blackjack with completely customized rules. Set up your betting strategy and when to receive alerts. Easy access to charts and your errors. This is a custom training experience tailored to how you like to practice. Designed to practice every aspect of counting cards.\r\n\r\n--= Simulator =--\r\n- Run millions of hands. (Speeds of up to 10 million hands per minute)\r\n- Adjust how many decks should be used and how far into the decks the Simulator should go before shuffling again.\r\n- Adjust the table rules.\r\n- Control how the Simulator should place bets.\r\n- Completely customizable Basic Strategy charts. (e.g. You can see what happens if you were to split on every pair hand or what would happen if you were to stand on every hand.)\r\n- Card counting options that allow you to control how the Simulator should count cards.\r\n- Dozens of statistics provided after the simulation runs.\r\nThe Simulator will allow you to see the House Edge the casino would have under various conditions. You can also see how much you could win per hour counting cards under various conditions.",
  "summary": "The most advanced Blackjack Trainer for Basic Strategy and Card Counting.",
  "installs": "50,000+",
  "score": 3.9633029,
  "ratings": 1105,
  "reviews": 447,
  "price": 0,
  "IAPRange": "£0.99 - £5.49 per item",
  "developer": "Blackjack Advantage Player",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 4, 2017",
  "updated": 1537668478000,
  "version": "1.32",
  "recentChanges": "Privacy Policy added",
  "appId": "blackjack.allin1.com",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack - Side Bets - Free Offline Casino Games",
  "description": "Play the best offline BLACKJACK with SIDE BETS for FREE. Black jack 21 lets you enjoy the real deal a casino card game can offer. Blackjack 21 is simple, beautiful and fun. It is the only Blackjack game with side bets. Perfect pairs is the most popular of the side bets in Blackjack. Try it now! \r\n\r\nLas Vegas casinos are not the only place where you can play Blackjack. You can earn MILLIONS of daily chips FREE. Spin the wheel of fortune, or lucky wheel as some of you might know it, and again get rewarded with free chips. Do not miss it!\r\n\r\n*********NEW!!!  Perfect Pairs as a side bet.***************\r\n\r\nFeatures:\r\n• Free to play\r\n• Detailed card design with a fast paced game flow.\r\n• Dealer stands on soft 17.\r\n• 3:2 is paid for blackjack.\r\n• Split is enabled.\r\n• Double and Insurance\r\n• Side Bets - Perfect Pairs\r\n\r\n\r\nThis free blackjack games app is intended for adult audiences and does not offer real money gambling or any opportunities to win real money or prizes. Success within this free blackjack 21 game does not imply future success at real money gambling.\r\n\r\nHave fun with Blackjack 21! Never give up on blackjack!",
  "summary": "Play the best offline Blackjack with SIDE BETS now. Download for FREE.",
  "installs": "100,000+",
  "score": 3.15,
  "ratings": 532,
  "reviews": 219,
  "price": 0,
  "IAPRange": "£0.79 - £18.49 per item",
  "developer": "SNG Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 18, 2017",
  "updated": 1584017022000,
  "version": "3.13",
  "recentChanges": "Bug fixes",
  "appId": "com.sng.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21-Free online poker game-jackpot casino",
  "description": "Blackjack 21 is the MOST popular, fun and authentic Las Vegas Blackjack game on the store! Play 21 blackjack as if you were at the REAL Vegas Casino! \r\n\r\nPlay 21 blackjack against the dealer and see who can WIN by getting 21 without going bust! Splits, Double down, Insurance and Surrender for an authentic black jack experience. Deck shuffle animation let you know when the deck is being reshuffled!\r\n\r\nKing of Vegas Bellagio? Try your luck around the world in Macau, Monte Carlo, Sydney, Monaco or Las Vegas. Even learn Basic Strategy and Card Counting to become a high roller!\r\n\r\n3D Authentic Black Jack tables, 3D chips, choose your favorite! Beautiful graphics with wonderful animations! Updated with awesome music and sweet dealer voice.\r\n\r\nAt the same time of playing black jack, you can open the chest and get beautiful, exquisite collectible. More than 200 collectibles to collect! Each collectible is well designed by us, each collectible has a mysterious story about it. \r\n\r\nWant to know all story? Want to take a good look at these mysterious items? Hurry to download black jack, lighten all the collectibles, and unlock bonuses!\r\n\r\nBlackjack 21 FEATURES:\r\n- Easy to play, full of fun!\r\n- 3D Authentic Casino Tables, choose your favorite!\r\n- Large Cards, Beautiful graphics.\r\n- Blackjack casino rules pays 3:2\r\n- Insurance pays 2:1 if the dealer has blackjack\r\n- Come back every 3 hours for BONUS chips, and get more chips in DAILY BONUS! \r\n- Easily earn chips by leveling up or selling collectible.\r\n\r\nThis game is intended for an adult audience (21+) and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.",
  "summary": "Fun blackjack21 game ! Fun game than &quot; Baccarat, Roulette and slots card games&quot;.",
  "installs": "10,000+",
  "score": 3.9,
  "ratings": 170,
  "reviews": 70,
  "price": 0,
  "IAPRange": "£0.79 - £92.99 per item",
  "developer": "really cattle card casino games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 5, 2019",
  "updated": 1586525420000,
  "version": "2.6.4",
  "recentChanges": "1. Senior room interface changes<br>2. Game interface optimization<br>3. Code optimization",
  "appId": "com.blackjack.rb",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Welcome to the world’s MOST beloved card game: BlackJack!\r\n\r\nThe same experience as play in real table, 6 unique rooms with different bet ranges for you to choose. Whether you are a seasoned veteran or inexperienced newcomer, you will love the fast tables and fun games in this BlackJack game!\r\n\r\nFully respects and modeled on real casino rules and performance, cards are shuffled and dealt in exact casino way to ensure a 100% fair gameplay. You will have the most fun and entertaining Blackjack experience with Side Bet and Jackpot game in each room.\r\n\r\nGame Features:\r\n\r\n- Play multi-level Blackjack Tournaments, win your own Rings and climb the leaderboard!\r\n- Play with Live Friends, send gifts and likes to other players and make new friends in this game!\r\n- Play as in real table, all scenes designed as the interior of Las Vegas!\r\n- Unique Side Bet and Jackpot game for each room!\r\n- Travel all around the world and play in the most popular 6 citys, bet big to unlock new tables and win more!\r\n- BlackJack pays 3:2!\r\n- Insurance pays 2:1!\r\n- Flexible rules, you decide the dealer hit or stand on soft 17!\r\n- Come back every 4 hours for Lucky Slots BONUS chips!\r\n- Easily earn chips by watch a few seconds of video!\r\n- Toggle Basic Strategy on or off to get real-time advice as you play!\r\n- Toggle “Insurance” and “Surrender” on or off anytime!\r\n- Track lifetime player statistics, including wins, pushes, surrenders, hand info and more, always get improved and play skillfully, let’s hit the top!\r\n- And much more!\r\n\r\nAll the fun and exciting features are in BlackJack!\r\nDownload and get bonus chips now, you are the next big winner!\r\n\r\nBlackJack is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Welcome to the world’s MOST beloved card game: BlackJack!",
  "installs": "100,000+",
  "score": 4.411917,
  "ratings": 7731,
  "reviews": 2183,
  "price": 0,
  "IAPRange": "£0.89 - £91.99 per item",
  "developer": "Word Search Puzzle Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 24, 2018",
  "updated": 1584936054000,
  "version": "3.8.3",
  "recentChanges": "- Improve User Experience<br>- Minor Bug Fixed",
  "appId": "com.blackjack.cardgame",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "The best and the most interesting Blackjack game on Android!\r\nThis Blackjack game make you win the dealer easily is completely free.\r\nBlackjack is one of the most popular board games in the world. Simple rules and addictive gameplay are perfect for killing leisure time extremely, come and play Blackjack Free to see who can win many more dealers.\r\nEnjoy the fun of Blackjack Free!\r\n\r\nFeatures:\r\n- Simple and fun, easy to handle.\r\n- Like a real casino, bet on the gambling-table, flop.\r\n- Click on the table to split pokers.\r\n- Free chips every hour and every day.\r\n- Win chips when you get 21 points.\r\n- Use 3: 2 traditional Blackjack rules.\r\n- Pay the insurance to prevent dealer from geting 21 points.\r\n- 4 kinds of backgrounds.\r\n- Multiple bets and table themes.\r\n- Nice soundtrack.\r\n- Support for tablet perfectly.\r\n\r\nCome on and download the best Blackjack game!",
  "summary": "The best and the most interesting Blackjack game on Android!",
  "installs": "100,000+",
  "score": 4.379085,
  "ratings": 1542,
  "reviews": 356,
  "price": 0,
  "developer": "MplayOnline: Free card games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 28, 2017",
  "updated": 1490701989000,
  "version": "1.0.131",
  "appId": "blackjack.games.blackjack21.casino.blackjack.free",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Play the best free Blackjack game available. Are you feeling lucky? Just jump right in and play Blackjack completely free! \r\n\r\nBored with casino games like Poker, Slots and Craps? Blackjack, also called 21 (Twenty-One), is one of the most popular casino games in the world. With a beautiful and intuitive design, you will love this modern take on the classic casino card game.\r\n\r\n- Popular Las Vegas rules just like at the casino.\r\n- Intuitive hint system.\r\n- Our fair table dealer never cheats - unlike other games, in ours you can actually win.\r\n- Beautiful table customization with HD graphics.\r\n- Helpful strategy card shows basic strategy for the various rules settings.\r\n- Double Down, Splits, Insurance and Surrender for an authentic Blackjack experience.\r\n- Deck shuffle animation lets you know when the deck is being reshuffled.\r\n- Tons of chip denominations from singles all the way to millions.\r\n- Large cards and table display for easy playing.\r\n- Easy, simple to learn controls make this the sleekest card game available.\r\n- Stat tracking shows your performance over time.\r\n- Informative help screen for those who don't already know the rules of 21.\r\n- The object of the game is to reach 21 or to reach a score higher than the dealer without exceeding 21.\r\n- Practice your Blackjack skills to become a true Vegas VIP.\r\n\r\n* For entertainment purposes only, no real money gambling.",
  "summary": "Blackjack Twenty-One (21) | FREE to Play | Just Like Vegas!",
  "installs": "10,000+",
  "score": 4.26,
  "ratings": 584,
  "reviews": 201,
  "price": 0,
  "IAPRange": "£1.69 - £16.99 per item",
  "developer": "Banana & Co.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 29, 2018",
  "updated": 1522360680000,
  "version": "1.0",
  "recentChanges": "Initial release.",
  "appId": "com.bananaandco.card.games.casino.blackjack.free.chips.twentyone",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blazing Bets Blackjack - Free Blackjack Games",
  "description": "Play real casino blackjack with Blazing Bets Blackjack! Whether you like 3 hand blackjack, single deck blackjack or the riveting blazing bets blackjack, we have all the vegas blackjack you crave. We took the fun of the casino and designed it for your phone so you can practice your blackjack game anywhere, anytime. Hit 21 today!\r\n- Beautiful casino-style graphics\r\n- Easy & fun to play\r\n- Real Vegas fun!\r\n\r\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\nPractice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "This game is a blackjack lover&#39;s dream! Hit 21 and win big!",
  "installs": "5,000+",
  "score": 4.3333335,
  "ratings": 42,
  "reviews": 21,
  "price": 0,
  "IAPRange": "£0.89 - £274.99 per item",
  "developer": "Ruby Seven Studios Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 16",
  "contentRatingDescription": "Use of Alcohol/Tobacco, Simulated Gambling",
  "released": "Jan 24, 2020",
  "updated": 1584075577000,
  "version": "1.1.0",
  "recentChanges": "Blazing Bets Blackjack App Keeps Getting Better!<br>We have updated the app to improve your game experience.<br>All new with this update:<br>-Improved game performance.<br>-Seamless side bet feature.<br>-Game art changes.<br>Download or update now to join the fun!",
  "appId": "com.rubyseven.blazingbetsblackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Master",
  "description": "New Blackjack with very great graphics, three different themes.\r\nQuick and clear gameplay. \r\n\r\nThe object of Blackjack is very simple: to achieve a total that is greater than that of the dealer, and which does not exceed 21. \r\nYou must consider your cards and your dealer's card and remember, if you go over 21, you lose. \r\nYou win if: \r\n- Your total is higher than the Dealer's total. \r\n- The Dealer goes over 21 or \"busts\". \r\n\r\nIf your total is the same as the Dealer's total it is a \"stand-off\" and you neither win nor lose. \r\nIf you go over 21, or the Dealer's total is greater, you lose. \r\n\r\nThe values of the cards: \r\n\r\n- Picture cards (Jack, Queen, King) each count as 10 points. \r\n- An Ace counts as 1 point or 11 points, whichever is better for owns of the hand. \r\n- All other cards have their numerical value. \r\n\r\nBlackjack is a combination of an Ace and any 10-points card.\r\n\r\nNew great Blackjack. Best Blackjack 21 in 2014!",
  "summary": "The best Blackjack ever!<br>Beat the house!",
  "installs": "100,000+",
  "score": 4.390411,
  "ratings": 1487,
  "reviews": 226,
  "price": 0,
  "developer": "KoBruy",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 23, 2014",
  "updated": 1564270412000,
  "version": "1.0.8",
  "recentChanges": "Minor bugfix",
  "appId": "com.lineres.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Strategy Practice, Blackjack Trainer",
  "description": "If you're serious about winning more when you play blackjack, use this app to quickly and easily build the optimum strategy.\r\n\r\nFeatures:\r\n\r\n- Instant feedback and contextual tips.\r\n\r\n- Track accuracy overall, by recent plays, and by hand type.\r\n\r\n- Optimum strategy for 8 decks.\r\n\r\n- Simplified strategy for easy learning, but just as effective.\r\n\r\n- Learn on the go. The easiest way to practice.\r\n\r\n- Unlimited practice.\r\n\r\n- Customizable strategy for personal preferences.\r\n\r\n- Filter hand types to practice. Improve weak areas.",
  "summary": "Learn and master Blackjack basics.",
  "installs": "5,000+",
  "score": 4.31,
  "ratings": 321,
  "reviews": 127,
  "price": 0,
  "IAPRange": "£2.79 - £4.99 per item",
  "developer": "Uncaught Exception Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 11, 2019",
  "updated": 1564889561000,
  "version": "1.0.9",
  "recentChanges": "Fix the bug where explanation is correct.",
  "appId": "uncaught.app.blackjacktrainer",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Download the casino experience with our free blackjack app on your Android phone or tablet. You're always a VIP at our blackjack table. As Internet connection is not required, our cards are ready to deal faster than you can say, \"hit me!\" \r\n\r\nOur blackjack game offers the sights, sounds, and thrills of the casino all for FREE. With our lush graphics and sleek game design, you'll feel like the blackjack table is your throne. Best of all? You can enjoy the gambling adventure of a high roller without betting a dime. Receive FREE CHIPS every two hours and exciting bonuses daily!\r\n\r\nIf you have what it takes, join our high stakes Tournament mode. If you win, (lucky) - collect the prize money equal to 3 times the entry fee!\r\n\r\nFEATURES:\r\n- Play blackjack online or offline - Internet is not required!\r\n- High-quality graphics - spacious table, large cards, and chips.\r\n- Clean, uncluttered game design.\r\n- Play by legit, casino blackjack rules.\r\n- Fun options - double down or split a pair.\r\n- Single player, multi-player, or AI mode.\r\n- Free casino chips every two hours!\r\n- Chance to win free chips in daily \"spin the wheel\" login bonus!\r\n- Compatible with Android phones and tablets \r\n\r\nHOW TO PLAY: \r\n- Place a minimum bet\r\n- Players are dealt two cards each. \r\n- Cards in blackjack hold their face value - face cards equal 10 and an Ace is considered 1 or 11 (whichever is more advantageous to your hand).\r\n- Decide to take an additional card (hit) or stand.\r\n- Take as many cards as you need - but STOP before you go over 21. \r\n\r\nYour GOAL is to beat the Dealer's hand without going over twenty-one - that's a bust!\r\n\r\nWHAT'S A BLACKJACK?:\r\nDid you know there's a difference between twenty-one and a natural black jack? \r\n\r\nNATURAL BLACKJACK: For a natural, the player must form 21 with their first 2 cards. You're crossing your fingers for an Ace + 10.\r\n\r\nTWENTY-ONE: A 21 consists of more than two cards that equal twenty-one. For example, 10+5+6 is not black jack - but it's a 21!\r\n\r\nTo learn more about blackjack strategy or receive news about the latest features, check our website.\r\n\r\nThis game is intended for an adult audience. This game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "What happens in Vegas, stays in Vegas... except this Blackjack App!",
  "installs": "100,000+",
  "score": 4.009709,
  "ratings": 1044,
  "reviews": 170,
  "price": 0,
  "IAPRange": "£0.78 - £40.99 per item",
  "developer": "Clockwatchers Inc",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 28, 2015",
  "updated": 1548957533000,
  "version": "3.3",
  "recentChanges": "Final fix to crashing bug.",
  "appId": "com.clockwatchers.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Royale",
  "description": "Gamble your way to the top of the charts with the best Blackjack has to offer! Includes three unique game modes as well as a host of content and tables to unlock. Earn Poker chips with every win and build up your stash. It is an unparalleled game play experience! Also connect to Facebook to store your statistics and progress in the cloud. Personalize your game, earn experience with every victory, and share your progress between all your devices.\r\n\r\nFeatures include:\r\n\r\n• Three unique game modes: Classic Blackjack, Double Exposure and Switch Blackjack!\r\n• Optional Side Bets! Earn big from a random set of possible side bets.\r\n• Multiple table options with increasing bets to unlock!\r\n• Facebook integration - personalize your game and save your progress.\r\n• Four unique themes to play with!\r\n\r\n• This game is intended for an adult audience.\r\n• This games does not offer \"real money gambling\" or any opportunity to win real money or prizes.\r\n• Practice or success in Blackjack Royale does not imply future success at \"real money gambling.\"",
  "summary": "Play the BEST Blackjack on Google Play!",
  "installs": "10,000+",
  "score": 4.14,
  "ratings": 102,
  "reviews": 36,
  "price": 0,
  "IAPRange": "£2.69 - £88.99 per item",
  "developer": "North Sky Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 11, 2017",
  "updated": 1565042977000,
  "version": "1.7.0",
  "recentChanges": "Thanks for your wonderful feedback. This update includes a host of bug fixes an improvements!<br><br>Keep the great reviews coming. We&#39;ve got some really cool features in store coming soon!<br>____________________________________________<br>Follow us online for news and sneak previews:<br>Facebook.com/NorthSkyGames",
  "appId": "com.northskygames.BlackJack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Sky Vegas Slots, Roulette, Blackjack, Instant Win",
  "description": "Sky Vegas is the ultimate destination for new, exclusive, and exciting online slots\r\n\r\nDownload the Sky Vegas App to enjoy exclusive games, head-turning bonuses and offers, and the thrill of the unexpected, wherever you choose to play. Every spin at Sky Vegas is another chance for a bonus game to kick in, a line to win or a jackpot to hit – the best bit is it could happen at any moment.\r\n\r\n⭐New Customers⭐\r\n\r\nOpt in today to receive 50 seriously free spins! No Deposit – No Wagering! Plus Deposit and Spend £10 to get a £40 bonus. New Customers Only. Opt In Required. \r\n7 Day Free Spin Expiry. All Free Spins Will Auto Play On First Eligible Game Loaded. 40x Wagering Requirement Applies to the £40 Bonus To Which Table and Card Games Contribute 20%. 30 Day Bonus Expiry Applies. Eligibility Restrictions Apply. Further T&Cs Apply. >> goo.gl/jGTz4u\r\n\r\nIf you already have an account with Sky Vegas, Sky Bet, Sky Casino, Sky Poker or Sky Bingo you can login with your existing account details and discover all that Sky Vegas has to offer!\r\n\r\nPlay your way… \r\nOur app gives you complete control over your gameplay as you can…\r\n\r\nManage your account within the app:\r\nRegister and log in\r\nRecover login details\r\nAdd payment details \r\nDeposit and withdraw funds \r\nView your account history\r\nAccess help & support\r\n\r\nResponsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support in the United Kingdom please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/ and in Ireland please contact Gamble Aware at 1800 753 753 or visit http://www.gambleaware.ie/\r\n\r\nThe Sky Vegas app is brought to you by Bonne Terre Limited, an Alderney registered company wholly owned by The Stars Group Inc. and licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Vegas is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group. The Sky trademarks used in the app are owned by the Sky UK Limited and its affiliated companies and are used under license. To place a bet with Sky Vegas you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Vegas. Customers located outside of the UK or Ireland will be prohibited from using this app.",
  "summary": "All the thrills of Vegas with Real Money Slots, Roulette and Blackjack Games",
  "installs": "100,000+",
  "score": 4.518195,
  "ratings": 6913,
  "reviews": 2800,
  "price": 0,
  "developer": "Sky Betting and Gaming Apps",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1552058811000,
  "version": "2.2.0",
  "recentChanges": "In this release we&#39;ve added some new, exciting games for you to enjoy! And we’ve also made some changes behind the scenes to improve the stability and performance of our app. If you like using Sky Vegas, please support us by leaving a review in the Play Store.",
  "appId": "com.skybet.app.skyvegas",
  "searchTerms": "blackjack"
 },
 {
  "title": "Simply 21 - Blackjack",
  "description": "Simple card game. Place the poker cards on 4 stacks - each stack must have a value of 21 (similar to Black Jack).\r\n\r\nJack, Queen, King: 10 points. \r\nAce: 1 or 11 points.\r\n\r\nThis game is powered by libgdx.",
  "summary": "Simple card game. Place the poker cards on 4 stacks -  reach 21 to complete",
  "installs": "100,000+",
  "score": 4.45,
  "ratings": 931,
  "reviews": 233,
  "price": 0,
  "IAPRange": "£0.89 per item",
  "developer": "ExtraAndroary",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 25, 2012",
  "updated": 1584716785000,
  "version": "Varies with device",
  "recentChanges": "- Improved Graphics Quality<br>- Minor bugfixes and improvements",
  "appId": "com.twenty.one",
  "searchTerms": "blackjack"
 },
 {
  "title": "Gold Rush Blackjack",
  "description": "Great graphics, three different tables, quick and clear gameplay. \r\n\r\nThe object of Blackjack is very simple: to achieve a total that is greater than that of the dealer, and which does not exceed 21. \r\nYou must consider your cards and your dealer's card and remember, if you go over 21, you lose. \r\nYou win if: \r\n- Your total is higher than the Dealer's total. \r\n- The Dealer goes over 21 or \"busts\". \r\n\r\nIf your total is the same as the Dealer's total it is a \"stand-off\" and you neither win nor lose. \r\nIf you go over 21, or the Dealer's total is greater, you lose. \r\n\r\nThe values of the cards: \r\n\r\n- Picture cards (Jack, Queen, King) each count as 10 points. \r\n- An Ace counts as 1 point or 11 points, whichever is better for owns of the hand. \r\n- All other cards have their numerical value. \r\n\r\nBlackjack is a combination of an Ace and any 10-points card.\r\n\r\nNew great Blackjack. Best Blackjack in 2013!",
  "summary": "Maybe the best Blackjack!<br>Try to beat the house!",
  "installs": "100,000+",
  "score": 4.4545455,
  "ratings": 3004,
  "reviews": 654,
  "price": 0,
  "developer": "KoBruy",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 27, 2013",
  "updated": 1564270279000,
  "version": "2.8",
  "recentChanges": "Some improvements",
  "appId": "com.gadgetcrafts.grblackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21 Free - Casino Black Jack Trainer Game",
  "description": "BLACKJACK 21: THE BEST Blackjack GAMES ONLINE or OFFLINE!   Play Las Vegas Casino Blackjack 21 with the Black Jack 21 FREE APP!\r\n\r\nPlay the best free Blackjack 21 game on the play store.  Authentic free Blackjack Games on Android - Blackjack 21 FREE can’t be beat!   Play the best Blackjack Twenty one card game TODAY!\r\n\r\nAlso called 21, Blackjack is one of the most popular casino games in the world.  With a beautiful and intuitive design,  you will love this modern take on the classic casino card game. \r\n\r\nBlackjack is an exciting game that any player is sure to enjoy.  Place your bet, get more points than the dealer and win chips.  Feel the risk as you dive into the casino atmosphere and hit the big time!\r\n\r\nPlay now to improve your skills,  gain experience,  make new friends and become the best blackjack player ever!\r\n\r\n✔ Feel the excitement of casino blackjack!\r\n✔ Practice & Train your skills!\r\n✔ Learn card counting!\r\n✔ Master the perfect strategy!\r\n\r\nIt is coded to be the exact simulation of the actual card game 21 so that you can train yourself to become a master!\r\n\r\nGame features:\r\n\r\n✔ Popular Las Vegas rules just like at the casino.\r\n✔ Our fair table dealer never cheats - unlike other games, in ours you can actually win.\r\n✔ Double Down, Splits, Insurance and Surrender for an authentic Blackjack experience.\r\n✔ Deck shuffle animation lets you know when the deck is being reshuffled.\r\n✔ Large cards and table display for easy playing.\r\n✔ Easy, simple to learn controls makes this the sleekest card game available.\r\n✔ Stat tracking shows your performance over time.\r\n✔ Informative help screen for those who don't already know the rules of 21.\r\n✔ The object of the game is to reach 21 or to reach a score higher than the dealer without exceeding 21.\r\n✔ Practice your Blackjack skills to become a true Vegas VIP!\r\n\r\nWe'll be adding some awesome new features soon, so stay tuned.\r\n\r\nThis free blackjack games app is intended for adult audiences and does not offer real money gambling or any opportunities to win real money or prizes. Success within this \r\n\r\nfree blackjack 21 game does not imply future success at real money gambling.",
  "summary": "Play free BLACKJACK! Online or Offline.Black Jack 21 Casino Card Games Offline",
  "installs": "10,000+",
  "score": 4.61,
  "ratings": 198,
  "reviews": 63,
  "price": 0,
  "IAPRange": "£1.89 - £93.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 10, 2019",
  "updated": 1560497749000,
  "version": "1.3",
  "recentChanges": "- Minor Bug Fixed.<br>- Improve User Experience.<br>We&#39;ve improved performance and reliability across the board so now it&#39;s even easier to play Blackjack, collect your bonuses and win big!",
  "appId": "com.sagafun.blackjack21",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack 21",
  "description": "The Best Addictive Casino Game for you! Let you feel the excitement of winning big, and train your blackjack skills. It's easy, beautiful and intuitive for your phhone or tablet.\r\n\r\nFeatures:\r\n* Vast Variety of Blackjack Rules to Play With! (Vegas, Atlantic City and Europe Casino)\r\n* Realistic casino games scene\r\n* Free Daily Chips, Level Up Bonus Chips and More Free Chips!\r\n* Gorgeous, beautifully animated cards\r\n* Touch and interact with all of your chips\r\n* Split hands or double down to win big\r\n* wealth Leaderboard\r\n* Gaming Technology Statistics",
  "summary": "Free experience casino blackjack realistically and  feel the thrill of winning",
  "installs": "100,000+",
  "score": 4.3070173,
  "ratings": 1155,
  "reviews": 375,
  "price": 0,
  "IAPRange": "£0.85 - £4.18 per item",
  "developer": "Adventure AppStudio",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 13, 2016",
  "updated": 1484899540000,
  "version": "1.1.8",
  "recentChanges": "* Fixed bugs",
  "appId": "com.game.card.blackjack.landscape",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21 Jogatina: Casino Card Game For Free",
  "description": "Also known as Black Jack and 21 (twenty one), Blackjack is one of the most classic and traditional casino and gamble games in the world. In Blackjack 21 Jogatina, you play for FREE against the dealer with real Vegas odds!  Keep an eye out for the dealer: you have to score closer to 21 than he does, but be careful not to go over 21! Make your bet and choose wisely if you want to hit, double or stand!\r\n\r\nTravel around the world, visit glamorous casinos and win tons of chips! Check out our main features.\r\n\r\nBlackjack 21 Jogatina's Features:\r\n- Different Casinos to Visit: Travel the world and play different tables like Montevideo, Caribbean, Singapore, Monaco, and Macao.\r\n- Real Vegas odds: Our algorithm was built to be 100% fair and make you feel the Vegas experience!\r\n- Daily Bonus: Get free chips everyday! \r\n- Daily Missions: Every day, receive 3 challenging missions that will give you chips when you complete them!\r\n- Tutorial: Want to learn Blackjack? Don't worry! Mary, our Blackjack trainer, will teach you in a fast and simple way.\r\n- Statistics: Check your evolution in Blackjack!\r\n\r\nIt doesn't matter if you call it BlackJack, Black Jack or 21 (twenty one), if you like this game or other card games with bets like poker or even gambling games like slot machines, bingo and roulette, you will love Blackjack 21 Jogatina! Download it now for free and win tons of chips by scoring as many Blackjacks as you can! \r\n\r\n* Blackjack 21 Jogatina is a game for adults, offline and free. This app does not use real money for gambling games or to generate a financial gain. Practice and wins in our game do not mean future success in other games involving real bets.",
  "summary": "Experience the real Blackjack 21 casino card game! Download it now!",
  "installs": "100,000+",
  "score": 4.3108616,
  "ratings": 2685,
  "reviews": 1044,
  "price": 0,
  "IAPRange": "£0.79 - £91.99 per item",
  "developer": "Jogatina.com",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 1, 2017",
  "updated": 1534772971000,
  "version": "1.5.1",
  "recentChanges": "In this version of the game Royal Blackjack Casino - 21 Card Game:<br><br> - Bug Fixes in the daily missions. Complete and earn your chips!<br><br>Don&#39;t forget to rate us! You can help improve our game. Send any questions and suggestions to blackjack.android@gazeus.com.",
  "appId": "com.jogatina.blackjackroyal",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21 Pro",
  "description": "Black jack, also known as Twenty-one, is the most widely played casino banking game in the world.\r\nPlay Blackjack as if you were at the casino! \r\n\r\nFree experience casino realistically blackjack, play against the dealer and feel the thrill of winning.\r\nLet you feel the excitement of winning big, and train your black jack skills. It's easy, beautiful and intuitive for your phone or tablet.\r\n\r\nFeatures:\r\n* Vast Variety of Black jack Rules to Play With! (Vegas, Atlantic City and Europe Casino)\r\n* Realistic casino games scene\r\n* Free Daily Chips, Level Up Bonus Chips and More Free Chips!\r\n* Gorgeous, beautifully animated cards\r\n* Touch and interact with all of your chips\r\n* Split hands or double down to win big\r\n* Wealth Leaderboard\r\n* Detailed statistics to track your performance \r\n* Insurance: pays 2:1 if the dealer has Blackjack\r\n* Surrender to get out of a tough situation \r\n* Five Dragon to win more chips\r\n\r\nPlay Blackjack fairness against the dealer and see who can WIN by getting 21 without going bust!\r\nBlackjack is just a gambling simulation app. It neither involves real money gambling, nor provides any means to win real money or prize. We do not encourage real money gambling.",
  "summary": "The Best Addictive Casino Game! Realistically Blackjack 21！",
  "installs": "10,000+",
  "score": 4.14,
  "ratings": 297,
  "reviews": 80,
  "price": 0,
  "IAPRange": "£0.99 - £5.49 per item",
  "developer": "Adventure AppStudio",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 12, 2016",
  "updated": 1472005015000,
  "version": "1.2.4",
  "recentChanges": "* Bugs fixed",
  "appId": "com.game.casino.card.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Maniac",
  "description": "Blackjack, also known as twenty-one, is the most widely played casino banking game in the world. It's the most fun simple and easy to learn. \r\n\r\nBlackjack Maniac is the best Social Casino game on Google Play. This is the most fun, smart and authentic card game on the market. Beautiful graphics with wonderful animations and transitions. Play with your friends, compete with million of players around the world and train yourself in Blackjack. Represent your county and your city to win against others. You are wanted in this maniac war of Blackjack. \r\n\r\nMain Features:\r\n1. Great Game Play - Always BEST in mobile\r\n2. Daily and Endless Quests - Challenge yourself for extra fun\r\n3. Unlimited Money - Win as much as you can\r\n4. Leaderboards - Time to show off\r\n5. Friends - You are not alone\r\n\r\nThis game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at real money gambling. Use of this  application is governed by the Cubeace Terms of Service. Collection and use of personal data are subject to Cubeace's Privacy Policy. Both policies are available in the Application License Agreement below as well as at www.cubeace.com. Social Networking Service terms may also apply.",
  "summary": "Blackjack Maniac is the best Social Casino game on Google Play.",
  "installs": "100,000+",
  "score": 4.5686064,
  "ratings": 18803,
  "reviews": 2973,
  "price": 0,
  "IAPRange": "£1.55 - £96.60 per item",
  "developer": "Cubeace",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 7, 2015",
  "updated": 1569397559000,
  "version": "19.09.25",
  "recentChanges": "v8 Updates:<br>Optimize user experience<br><br>v7 Updates:<br>1.Fixed Bug<br><br>v6 Updates:<br>1. Added Guild<br>2. Added Prayer<br>3. Added Achievement<br>4. Added Mission and challenge mission<br>5. Optimized leaderboard<br>6. Optimized Events<br>7. Optimize user experience",
  "appId": "com.lavapot.bjm",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack 21 Offline",
  "description": "BlackJack 21 Offline, free casino game style: The best game for Free! Play Las Vegas casino twenty one with the Black Jack 21 Free ( Blackjack card counting ) app!\r\nBlackjack 21 Offline Free Casino ( Blackjack card counting ) is a popular casino banking game in the world, also known as twenty-one. If you get 21 points on the player's first two cards (\"Blackjack\" or \"Natural\"), without a dealer blackjack or reach a final score higher than the dealer without exceeding 21 or let the dealer draw additional cards until his or her hand exceeds 21, you will be the winner.\r\nWith BlackJack 21 Free Casino Free & Offline (Blackjack card counting) you can play and pratice your authentic the casino game for Free.\r\nLet's play the BlackJack tournaments Monaco, Las Vegas, Singapore and HongKong casino. Download and play the best of twenty one BlackJack 21 Free & Offline ( Blackjack card counting ) game Today!\r\n Features \r\n- Beautiful graphics and pretty sound, with background sounds and dealer voice!\r\n- BlackJack 21 Offline play with tournaments Monaco, Las Vegas, Singapore and HongKong casino game. Blackjack 21 Offline Free Casino Free & Offline Games ( Blackjack card counting ) on Android - \r\n- This is Blackjack card counting game style. \r\nBlackjack 21 Offline FREE can’t be beat! Download to play the best Blackjack Twentyone free casino game style card game TODAY!",
  "summary": "Play BlackJack 21 Offline and pratice your authentic the casino game for free.",
  "installs": "100,000+",
  "score": 3.57,
  "ratings": 867,
  "reviews": 294,
  "price": 0,
  "IAPRange": "£0.79 - £45.99 per item",
  "developer": "DotFinger Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 21, 2016",
  "updated": 1520743580000,
  "version": "2.0.1",
  "recentChanges": "Fixed daily reward bugs.",
  "appId": "com.dotfinger.blackjack21king",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack & Baccarat - Casino Card Game",
  "description": "Whether you're an amateur or a gambling expert, looking for an app to learn the rules of Blackjack and Baccarat, or to perfect your techniques and strategies, Blackjack & Baccarat is made for you! \r\n\r\nThe perfect Blackjack trainer, ideal for learning the rules of Baccarat and becoming a better card player, testing a new Blackjack strategy or simply to pass the time, Blackjack & Baccarat accompanies you everywhere on your tablet or smartphone. \r\n\r\nEnjoy simple rules, thrilling gameplay and the opportunity to reach the high skill ceiling of professional Blackjack & Baccarat players,, employing different approaches and strategies. The objective of the game is to beat the dealer. The player can accomplish this goal by getting a count as close to 21 as possible. The only requirement is to not go over 21.\r\n\r\nShare the passion and enthusiasm of millions of players from all over the world and play the best Free Blackjack 21 game. Your experience as a Blackjack and Baccarat player is not that important. Jump in and feel the thrill of a real casino atmosphere, where your luck and skills will be tested to the limit in Blackjack & Baccarat!\r\n\r\nImmerse yourself in the atmosphere of the two most popular casino table games in the world thanks to Blackjack & Baccarat’s HD games and high quality soundtrack! Dive in the best free Blackjack  card game and enjoy the most realistic casino experience.\r\n\r\nLearn to play the casino card game Blackjack and Baccarat on mobile for FREE! Receive a daily token bonus for you to try your luck every day! Blackjack & Baccarat offers you the opportunity to play casino Baccarat according to the classic Vegas rules and 4 variants of Blackjack, Classic Blackjack, Blackjack free Bet, Blackjack Lucky Lucky and Blackjack Switch!\r\n\r\nFeeling lucky? Improve your gambling techniques, learn to become a casino table games pro, use the games as a Blackjack trainer and build a strategy to beat the dealer in this free Blackjack card game! Place your bets and good luck! \r\n\r\nGAME FEATURES: \r\n\r\n✓ FREE Chips!\r\n✓ You are eligible to receive our Daily Bonus award on a daily basis. Simply log in to claim it!\r\n✓ Test your luck with our Wheel of Fortune! You can spin the wheel every hour to receive free chips\r\n✓ Watch a sponsored video and receive even more free chips instantly!\r\n✓ Classic versions of the two most popular casino table games in the world: Classic Blackjack and Classic Baccarat. \r\n✓ Three Blackjack variants with unique rules: \r\n\r\nBLACKJACK FREE BET allows you to split hands and double your bets without having to place an additional bet! The FREE BET game mode does not use jokers or any wild cards. The standard Blackjack rules apply. What’s different is the fact that you should double down on 9, 10 or 11 against any up-card by the dealer. \r\n\r\nBLACKJACK LUCKY LUCKY gives the player the opportunity to bet on a side bet that rewards specific card combinations for bigger winnings on each hand! The LUCKY LUCKY bet is based on your two cards and the dealer’s up card. The player has the opportunity to make this optional bet, which does not affect the regular blackjack play.\r\n\r\nBLACKJACK SWITCH is a unique Blackjack version where you play two hands at the same time and can switch the highest cards of each hands with one another in order to get the best hands possible! In other words, if you are dealt a hand that contains a 9 and a 7, and another hand with a 6 and a 10, you are allowed to switch the 7 and the 10, creating two new hands: 9, 10 and 7, 6.\r\n\r\n✓ High definition graphics and soundtracks providing an authentic casino feeling.\r\n✓ Our random numbers generator guarantees the fairest Blackjack & Baccarat single player experience. \r\n✓ Thanks to the fluid animations and user-friendly interface, hit, double, split or stay easily with a simple click! \r\n✓ No registration needed, just download the app and play instantly! Enjoy your stay and feel like a professional Vegas Blackjack and Baccarat player in no time!\r\n\r\nCheck our other games!",
  "summary": "Pro Blackjack trainer and casino Baccarat card game! Free on our casino table!",
  "installs": "10,000+",
  "score": 4.4183674,
  "ratings": 98,
  "reviews": 45,
  "price": 0,
  "IAPRange": "£0.89 - £12.49 per item",
  "developer": "Zariba Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 9, 2018",
  "updated": 1574256919000,
  "version": "1.1.21",
  "recentChanges": "Bug fixes and performance improvements",
  "appId": "com.zariba.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack! - Official REAL Casino FREE",
  "description": "Play the best Blackjack now!\r\nAt last we can play the Blackjack in REAL casino machine on mobile. and it is completely free!\r\n\r\nDid you just want play the Blackjack?\r\nThen play 'Blackjack! - Official REAL Casino'\r\nPlay game offline, lightly any time.\r\nNo need to worry about purchasing.\r\nEnjoy the blackjack right now! \r\n\r\nBlackjack! - Official REAL Casino Features\r\n\r\n- A Simple start, Completely free, and No-Wifi\r\n- Side-Bets supports: Perfect 7 and Dealer blackjack - the same rules with Casinos\r\n- Various voices\r\n- Leaderboards\r\n- Accounting meters\r\n- Game data backup",
  "summary": "Blackjack 21 in REAL Casino machine for mobile FREE",
  "installs": "1,000+",
  "score": 4.3809524,
  "ratings": 63,
  "reviews": 35,
  "price": 0,
  "developer": "NORIWORKS",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Oct 16, 2019",
  "updated": 1588346406000,
  "version": "1.0.29",
  "appId": "com.noriworks.mb",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack free offline card games no wifi trainer",
  "description": "Blackjack also known as Blackjack 21 is the world's most popular card games. The game is free and works without wifi or internet connection. \r\n\r\nThe goal of the game is to beat the dealer in one of the following ways:\r\n\r\n🔴 Get 21 points on the player's first two cards (called a \"blackjack\" or \"natural\"), without a dealer blackjack; \r\n\r\n🔴 Reach a final score higher than the dealer without exceeding 21; or\r\n\r\n🔴 Let the dealer draw additional cards until their hand exceeds 21 (\"busted\").\r\n\r\nBets and Chips\r\n\r\nIn the first place, toward the beginning of each round, you should make a BET. It tends to be somewhere in the range of $1 to All In. By clicking your chips of proper value, you put down your wager on the table (you can tap the wager on the table to take the chips back). When cards are dealt, wagers can't be changed until the following round.\r\nThe \"All-In\" button will wager all your money at once.\r\n\r\nDEAL\r\n\r\nWhen a wager is made, click DEAL. The dealer will give you two cards, which form your HAND, and two cards to themselves. One of the seller's cards will be covered up at first. To win, you have to guarantee the consolidated sum of your cards is greater than that of the dealer.\r\n\r\nHit and Stand\r\n\r\nYou can add more cards, one by one, by choosing to HIT, but be wary: you must never exceed 21. Whoever gets more than 21 loses automatically. Once you’re ready to play the hand, click STAND. Dealer will then reveal their hidden card, and must always Hit if they have 16 or lower. When they have 17 or more, they will stop hitting.\r\n\r\nCard Value\r\n\r\nThe value of an ace can be either 1 or 11 to give you the best possible combination. All the faces are worth 10 each, and other cards are worth their face value. \r\n\r\nWinning\r\n\r\nThe one who gets 21, wins! A tie is termed as a PUSH and will refund the wager to the player. If you get over 21 then you get a BUST which is an instant loss. \r\n\r\nYou can also win if the dealer gets over 21, or if you get a higher value than the dealer. Getting 21 on your first two cards is called a \"Blackjack\" or a \"natural\" and beats any combination of the dealer. A normal win will give you 2x of your wager and a blackjack will give you 2.5x of your wager.\r\n\r\nDouble and Split\r\n\r\nYou can also \"DOUBLE\" your wager once cards are dealt. The dealer cannot \"DOUBLE\". Once you tap \"DOUBLE\" you can take exactly one more card, and then immediately Stand.\r\nYou can also \"SPLIT\" if you get two cards of the same value.\r\n\r\n\"SPLITTING\" gets you two hands, each with a wager equal to your initial wager. Then you can play normally with both the hands. You can \"SPLIT\" again if possible, up to 3 times a deal.\r\n\r\nInsurance\r\n\r\nInsurance is a side bet that the dealer has blackjack and is treated independently of the main wager. It pays 2:1 (meaning that the player receives two dollars for every dollar bet) and is available when the dealer's exposed card is an ace.\r\n\r\nChanging the rules\r\n\r\nYou can change the following game rules:\r\n🔴 Dealer \"HITTING\" or not \"HITTING\" on a soft 17 (when they have a value of 17 with an Ace+6)?\r\n🔴 Number of decks.\r\n🔴 Allowing Insurance?\r\n🔴 Automatic wager equal to you last one?\r\n\r\nHint\r\n\r\nTap on \"HINT\"  to get a hint from the dealer. \r\n\r\nCashOut and Score\r\n\r\nTapping CashOut will end your game.\r\n\r\nThis app can also be used as a Blackjack trainer app which could help you in your real money games. Hope you enjoy playing Blackjack ! 😀",
  "summary": "Play Blackjack - the most popular card game. It&#39;s free and works without wifi",
  "installs": "10,000+",
  "score": 4.3,
  "ratings": 116,
  "reviews": 52,
  "price": 0,
  "developer": "The Card Games Company",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 10, 2019",
  "updated": 1577186745000,
  "version": "1.8",
  "recentChanges": "Fixed bugs",
  "appId": "com.thecardgamescompany.blackjack.blackjack21.blackjackfree.cardgames",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21 ♠️♥️ Play Fun Black Jack OFFLINE FREE",
  "description": "♠️♥️Authentic Blackjack Game! Try Blackjack and Win!♠️♥️\r\n\r\nBlackjack 21 is an ONLINE OR OFFLINE Vegas casino gambling game. Train with Real Pro Blackjack Gambling odds in this Fun App. Play the Blackjack Side Bet 21+3 where you try for a 3 card poker hand and win!\r\n\r\nBlackjack 21 Game Features:\r\n- Play Blackjack Forever with Free Chips!\r\n- Learn with Authentic Casino Blackjack Pro Rules\r\n- Try to Split and Double Down!\r\n- Customize your Blackjack 21 table and Chips with Real Vegas Themes!\r\n- Practice Real Strategy with our Trainer!\r\n- Play Hands to get XP and Level Up Chips!\r\n- Collect the Daily Bonus Chips!\r\n- Play offline free!\r\n- Track stats in our Player Profile Including Blackjack Total Chips Bet!\r\n\r\nBlackjack 21 is a simple gambling simulation where you try to get 21 without going over.  The goal is to gamble your chips while playing perfect strategy.\r\n\r\nIf you like our Black Jack app try our other casino games on Google Play!\r\n\r\nWe always try to find ways to make our blackjack app better. Email us at\r\nsupport@luckyjackpotcasino.com",
  "summary": "#1 Blackjack 21 Card Game. Play Online or Offline. Fun 21+3 Side Bet Black Jack!",
  "installs": "500+",
  "score": 4.6,
  "ratings": 20,
  "reviews": 11,
  "price": 0,
  "IAPRange": "£1.79 - £91.99 per item",
  "developer": "Lucky Jackpot Casino",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Apr 1, 2020",
  "updated": 1585770687000,
  "version": "1.0.5",
  "recentChanges": "Hit the jackpot with performance improvements!",
  "appId": "com.luckyjackpotcasino.blackjack21",
  "searchTerms": "blackjack"
 },
 {
  "title": "World Class Casino Slots, Blackjack & Poker Room",
  "description": "Super premium free casino slots, multiplayer blackjack, baccarat, video poker, keno, and poker rooms by the makers of Spanish 21, World Series of Poker Deluxe, World Class Poker with T.J. Cloutier, and PC & Mac casino slots from IGT, WMS, and Bally! Featuring exclusive casino games Spanish 21®, Down Under Blackjack®, and Match the Dealer®.\r\n\r\n• FREE welcome gift, and lots more ways to get free coins\r\n• Immediate free access to every game—no waiting for slots to unlock and no registration required\r\n• Over 70 casino-style video and mechanical slots just like you find in the land-based casinos\r\n• Multiplayer casino tables, including single and multi-deck Blackjack, Baccarat, and exclusives like Spanish 21®, Down Under Blackjack®, and Match the Dealer®\r\n• Texas Hold’em, Omaha, 7 Card Stud, and 5 Card Draw Poker multiplayer tables and tournaments\r\n• Exclusive Texas Hold’em Video Poker, multi-hand Jacks or Better Video Poker, and more\r\n\r\nMasque games are played in land-based casinos worldwide and we pioneered casino-style free games on-the-go. World Class Casino is our most realistic casino experience yet!\r\n\r\nWorld Class Casino is intended for an adult audience and does not offer real money gambling, nor the opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at real money gambling.",
  "summary": "Authentic licensed games played in land-based casinos worldwide!",
  "installs": "50,000+",
  "score": 4.0895524,
  "ratings": 1353,
  "reviews": 351,
  "price": 0,
  "IAPRange": "£4.29 - £289.99 per item",
  "developer": "Masque Publishing",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 31, 2014",
  "updated": 1588382252000,
  "version": "7.7.8",
  "recentChanges": "Stressed out that your favorite casino is temporarily closed? Join our Golden Rose Poker Tournament with total chip prices of more than 100,000,000. Daily qualifiers begin May 3, 2020 and the Main Event is May 9, 2020!",
  "appId": "air.com.masque.WorldClassCasino",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21",
  "description": "BLACKJACK (Blackjack 21) download and play a new, free game. You can play without the Internet - offline.\r\nOne of the most popular card games in casinos around the world.\r\nThe great popularity of the game is determined by simple rules, the speed of the game and the simplest strategy in counting cards.\r\nThe rules of the game BLACKJACK (Blackjack 21).\r\nFirst, the player receives two cards “open”, the sum of the points of which allows you to decide whether he needs additional cards or not. The goal of the game is to score 21 points or an amount close to this. If a player scores a total of points in excess of 21, then his bet loses. If the amount of points on the dealer’s cards is more than 21, then all bets remaining in the game win.\r\nPlayers who score more than the dealer points win, their bets are paid 1: 1.\r\nPlayers who score less than the dealer lose.\r\nIf the player’s total is equal to the dealer’s total, then a “draw” or Stay is declared: the player’s bet does not win or lose.\r\nThe dealer collects the cards last, while he is obliged to take the card if he has 16 points or less, and stop if the sum of points is 17 or more. Aces count as 1 or 11, “pictures” (jacks, ladies and kings) - all 10 points each, the rest of the cards correspond to their face value.\r\n\r\nBLACKJACK (BLACKJACK)\r\nThis is a combination on the first two cards from the deal, giving a total of 21 points (ace and ten or ace and “picture”). In this case, the player’s bets are paid 3: 2, if the dealer does not have the same combination. Blackjack wins any other combination of cards, including combinations with an amount equal to 21 points.\r\n\r\nSURRENDER\r\nAfter the first two cards are dealt, the player may refuse to continue the game, losing half of the corresponding bets. This can be done before the third card, on which they want to make SURRENDER. A player cannot make SURRENDER if the dealer's first card is an ace.\r\n\r\nSPLIT\r\nIf the first two cards of a player are of the same denomination, that is, they have the same value for points, then they can be divided. At the same time, the player makes an additional bet on this box, equal to the original one, and draws cards for each card separately. All pairs of identical cards can be divided no more than three times. The exception is aces. Splitting aces is allowed twice, and when splitting a player receives only one card for each of the aces. The combination of Ace and Ten (picture), obtained after the separation, is considered as 21 and is not a Blackjack combination.\r\nDOUBLE DOWN\r\nAfter the player has received the first two cards, regardless of the number of points, he can double his bet, while receiving only one card. Doubling after splitting cards is allowed. If the player has 9, 10 and 11 points, then the dealer will always offer to double the player’s bid.\r\n\r\nINSURANCE (INSURANCE)\r\nIf the dealer’s first card is an ace, the player can make an additional bet, but not more than half of the amount of the initial bets and not less than half of the minimum table, placing it on the field marked Insurance. This bet wins if the dealer drops Blackjack and is paid 2: 1, in all other cases it loses.\r\n\r\nThe difference between the Russian version of the game \"Point\" and \"BlackJack 21\".\r\nA point, also called twenty-one point, or just twenty-one - the Russian version of the card game, known in many countries.\r\nThis game is similar to the blackjack version of the game, which can be played with a standard Russian deck (36 cards) instead of a full standard deck (54 cards), since at that time a deck of 36 cards was common, and decks of 52 and 54 cards were rare.\r\nUnlike blackjack, the values ​​of the cards J (jack), Q (queen) and K (king) are not 10, but 1, 2 and 3, respectively, which partially compensates for the absence of cards from two to five. But, since the number of cards with a value of 10 is significantly less than in blackjack, the game balance is very different. Ace 11. King 3. Queen 2. Jack 1.",
  "summary": "Blackjack 21 - free, simple, dynamic and addictive game!",
  "installs": "5,000+",
  "score": 3.8095238,
  "ratings": 42,
  "reviews": 22,
  "price": 0,
  "developer": "Kostin Nikolai",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 25, 2019",
  "updated": 1575479533000,
  "version": "2.0.7",
  "recentChanges": "Fixed errors.",
  "appId": "ru.kostin.gamesTwentyOne",
  "searchTerms": "blackjack"
 },
 {
  "title": "BigWin Casino - Blackjack,Slot,Baccarat,Roulette",
  "description": "Play The 3D Baccarat, 3D Roulette,  Slot, Blackjack 21 free game with millions of players from all over the world! Bigwin is an exciting game that any player is sure to enjoy. Place a bet, get more points than the dealer and win chips. Feel the risk as you dive into a casino atmosphere and catch fortune by the tail. Play now to improve your skills, gain experience, make new friends and become the best casino player ever!\r\n\r\nGame features:\r\n• FREE CHIPS – Play the game every day to get free chips!\r\n• PLAY WITH FRIENDS – Get free bonuses when you invite your friends to the game through email or Facebook.\r\n• GET REWARDS – Up the stakes, win games against the dealer, take risks to get to 21 and unlock achievements.\r\n• QUESTS - Complete daily quests to get free chips!\r\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and lvl-up! See how many game Tournaments you've won and Achievements you've completed. Get unique Properties and display them on your profile! View other players profiles to see how you compare! \r\n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our easy to use in-game instant messenger and chat with other Blackjack players!\r\n• FAIR HAND DEALING GUARANTEED – Our Certified Random Number Generator (RNG) brings you the best and fairest casino experience.\r\n• LEARN TO PLAY – Are you new to Casino but always wanted to try it? Our simple to follow tutorial mode will help you take the first steps. Learn everything you need to know about casino, winning combinations and the rules of the game quickly.\r\n• SMOOTH INTERFACE – A simple and attractive interface which gives you the ability to bet, stand or hit with just one tap.\r\n• 3D GRAPHICS – An absolutely free Blackjack, Baccarat,Roulette,Slot games with stunningly realistic 3D graphics.\r\n• NO REGISTRATION – Get straight into the action. Use guest mode to play our free casino app without registration.\r\n• SINGLE ACCOUNT – Start playing free game on your smartphone then continue playing on tablet without losing your progress. Use your single account to play any of our other casino games in one app!\r\n\r\n\r\n*************BigWin Casino Helps*************** \r\nEmail：service@happiplay.com\r\n\r\nThis game is only available to people of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "summary": "JOIN NOW FOR FREE! MORE CASINO GAMES",
  "installs": "100,000+",
  "score": 4.3257575,
  "ratings": 1350,
  "reviews": 578,
  "price": 0,
  "IAPRange": "£0.99 - £97.99 per item",
  "developer": "SCAI LIMITED",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 24, 2016",
  "updated": 1588868244000,
  "version": "2.6.3",
  "recentChanges": "Bugs Fix",
  "appId": "com.happiplay.bestbj",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Live!",
  "description": "Backjack OFFLINE and  ONLINE completely FREE!\r\n\r\nPlay Live with your friends. The best Blackjack game on Android Platform.\r\n\r\nAll features while you are Offline or Online:\r\n\r\n★ CHAT -  while playing blackjack\r\n★ GIFTS - Send gifts to others blackjack players\r\n★ SOCIAL - Completely social!\r\n★ OFFLINE - You can play while you are offline \r\n★ LEADERBOARD - Compete with other players gobally!\r\n★ FACEBOOK - Login with Facebook or play as guest.\r\n★ WHEEL OF FORTUNE – Predict the next lucky number and win a lot! This money can be used in blackjack!\r\n★ REWARD SYSTEM –  A richly-featured rewards system that allows you to win big-Play for FREE Gift & FREE Texas Chips!\r\n★ Gorgeous, beautifully animated cards \r\n★ Intuitive graphics, touch and interact with all of your chips \r\n\r\nEnjoy and don't forget to give 5 stars if you like the game.",
  "summary": "Now play Blackjack Live completely Free! Best gambling game ever!",
  "installs": "100,000+",
  "score": 3.768,
  "ratings": 1257,
  "reviews": 388,
  "price": 0,
  "IAPRange": "£0.59 - £129.99 per item",
  "developer": "ZMist Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 21, 2016",
  "updated": 1533069064000,
  "version": "3.0.2",
  "recentChanges": "- Refreshing new user interface.<br>- Performance improvements.<br>- Policy update.",
  "appId": "com.byte3d.blackjackoffline",
  "searchTerms": "blackjack"
 },
 {
  "title": "Card Counting (Counter) - KK Blackjack 21",
  "description": "You are Built To Beat The Black!\r\n\r\nLearn card counter and blackjack strategy with our blackjack training. Double down & know how much to bet your casino chips at our blackjack table!\r\n\r\nKK Blackjack game is one of the most exciting cards game this year. You can learn, test, and sharpen your skill at this classic casino cards game and enjoy every minute of it. You will see that you can beat the House at black jack 21 if you learn blackjack strategy & practice enough. Don’t wait. Try this fun blackjack game to learn card counting & best strategy to be a great cardplayer!\r\n \r\nSo many cardplayers are looking for fun, addictive blackjack casino cards game to play and they also want to learn card counter, blackjack strategy. But there are few blackjack training available.  Some like poker, other people like playing capsa.  Black jack 21 is a classic card game. KK Blackjack is an online card game that uses Hi-Lo jack black card counting system. It’s a great way to practice counting cards game and do it faster and faster. You should learn when it’s time to double down and when it’s best to surrender. \r\n\r\nThis jack black game will help you when you play at real blackjack table in blackjack casino and when you want to play online card game and place online bet. You can be a better cardplayer by learning basic strategy, card counting, running count, true count and bet calculation. We provide step-by-step training that you could learn and master the skills easily. When you need to master other games such as capsa, this skill will help you master capsa faster. When you play an online card game and you place online bet, it doesn’t mean that winning isn’t rewarding. Winning a lot of casino chips and beating the House is very satisfying. \r\n\r\n♠ Earn Bronze, Silver or Gold Medals for winning! \r\n♣ On our 21 blackjack card game, we will motivate you to keep playing & winning this game through medals! \r\n\r\n=== FEATURES OF KK BLACKJACK GAME: ===\r\n\r\n- Fun, challenging, and addictive\r\n- Opportunity to learn about basic blackjack strategy in playing cards game.\r\n- Realistic gameplay that mirrors the cards game in real casino.\r\n- HiLo counting system.\r\n- Earn medals for winning a level. \r\n- Improve your skill as you play. \r\n\r\n=== KK Blackjack is a tool to helps you mastering: ===\r\n\r\n♣ Basic blackjack strategy.  Basic strategy is a result of probability and computer simulation. It gives you the best move (Hit, Stand, Double, Split or Surrender) to increase your chances of winning on blackjack tables.\r\n\r\n♣ Card counting on blackjack casino. Base on Hi-Lo counting system, you keep tracking of the running count and true count. \r\n\r\n♣ Bet calculation. Know when to surrender and how to calculate how much casino chips to bet.  \r\n\r\nLike other strategy cards game, the more you play, the more you have experience, skill, and confidence. You will be able to also win at real game when you feel ready or you can keep sharpening your skill on online card game and enjoy beating the House or other players with your skill. \r\n\r\nSo, are you ready to learn blackjack strategy and card counter through our blackjack training? Download and play now! \r\n\r\nPlease refer to the following link to understand the philosophy behind.\r\nhttps://macaugamblinghk.blogspot.com/2019/07/how-to-win-at-blackjack-card-counting.html\r\n\r\n\r\n----\r\n\r\nDo you like playing 21 blackjack card game? Please share our casino app to your friends & family so they can have fun too. Also, we need your help for our blackjack game to succeed. Please leave us your thoughts through a rating and review. It only takes a minute and it means the world for us!",
  "summary": "Play 21 blackjack card! Learn card counter &amp; basic blackjack strategy!",
  "installs": "1,000+",
  "score": 3.7692308,
  "ratings": 13,
  "reviews": 7,
  "price": 0,
  "IAPRange": "£0.99 - £97.99 per item",
  "developer": "Red Koda Software Limited",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 17, 2019",
  "updated": 1568875373000,
  "version": "1.9",
  "recentChanges": "- Easier to enter next level",
  "appId": "com.redkoda.kkblackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "BLACKJACK\r\n\r\nMain characteristics:\r\n- Play Sevens against several CPU (1 to 4) or only against the dealer\r\n- Different game modes: American or European, with bets or points\r\n- It includes help and play explanation\r\n- Settings: Cards size, cards back color, sound, animations, speed, scoreboard, table and scores color...\r\n- Scores: Rounds, matches, best and worst,...\r\n- Achievements: They allow to achieve experiencie points\r\n- Save and load game\r\n- Landscape and vertical orientation\r\n- Move to SD\r\n\r\nPlay:\r\n- The players who obtain a higher score than the dealer without going over win the round. The cards are worth their facial value except the face cards that are worth 10 points and the aces that are worth 1 or 11 points.\r\n- In the game two face-up cards are initially dealt for each player. The players decide whether to take more cards or to stand. If a player goes over 21 he loses. The dealer plays last and wins all the players who have scored lower or have busted.\r\n\r\nScoring Blackjack:\r\n- Playing by bets players receive from the dealer the value of their bet if they win or give their bet to the dealer if they lose. If a player gets Blackjack, initially having an Ace and a card of value 10, he wins once and a half his/her bet.\r\n- Playing for points the players who win the dealer get a point and if they do not lose it. If a player gets Blackjack he gets a point and a half.\r\n\r\nThe rules settings allow changing some of this rules:\r\n- Maximum number of rounds\r\n- Minimum and maximum bet\r\n- Number of decks\r\n- Insurance\r\n- Surrender\r\n- Double down\r\n- Split",
  "summary": "Classic Blackjack game. Multiple options and variants",
  "installs": "100+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "Melele",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 24, 2020",
  "updated": 1584386495000,
  "version": "1.001",
  "recentChanges": "Improvements and corrections",
  "appId": "com.melele.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack Trainer",
  "description": "Learn how to play BlackJack, when to Hit, Stand, Split, Double or Surrender. BlackJack Trainer Lite will teach you to how to play any hand, such that you maximize your chance of winning by playing the basic strategy.\r\n\r\nFeatures:\r\n* Hit, Stand, Split, Double or Surrender to the cards dealt\r\n* Get feedback on your decision\r\n* See the strategy table for the selected black jack house rules\r\n* Share your achievements on Facebook\r\n* See your overall correct decision rate\r\n\r\nThis is NOT a blackjack game, but an application that teaches you the right play of blackjack. Use this app to learn playing Black Jack for your next trip to Las Vegas.\r\n\r\n**************************************************\r\nReviews:\r\n★★★★★\r\nExcellent training device - Simple way to refresh blackjack strategy that was second nature to me forty years ago.\r\n\r\n★★★★★\r\nGood Teacher - The dealer will be impressed with your quick play\r\n\r\n★★★★★\r\nI like it. Very good practice before visiting casino.\r\n\r\n★★★★★\r\nAmazing\tThis app is a must have!\r\n\r\n★★★★★\r\nBest Blackjack Trainer out there. I have tried them all. this one is by far the best.\r\n\r\n★★★★★\r\nVery helpful and straightforward. Self-explanatory. Especially like the question mark link to the strategy table.\r\n\r\n★★★★★\r\nVery good for learning basic strategy\r\n\r\n**************************************************\r\n\r\nAny futher questions/feedback/suggestions? Don't hesitate to contact us at blackjacktrainer@hornetapps.com\r\n\r\nAbout black jack:\r\nBlackjack, also known as twenty-one, is the most widely played casino banking game in the world. Blackjack is a comparing card game between a player and dealer, meaning that players compete against the dealer but not against any other players. It is played with one or more decks of 52 cards. The objective of the game is to beat the dealer.",
  "summary": "Learn how to play BlackJack, when to Hit, Stand, Split, Double or Surrender.",
  "installs": "50,000+",
  "score": 3.98,
  "ratings": 442,
  "reviews": 130,
  "price": 0,
  "IAPRange": "£0.89 - £4.99 per item",
  "developer": "HornetApps",
  "genre": "Card",
  "contentRating": "PEGI 3",
  "released": "Mar 26, 2012",
  "updated": 1580338508000,
  "version": "5.1.0",
  "recentChanges": "Improved compatibility with latest phones.<br>Upgrade to Pro without installing another app",
  "appId": "com.hornetapps.blackjacktrainer.lite",
  "searchTerms": "blackjack"
 },
 {
  "title": "Snarling Black Jack",
  "description": "A simple, fun Black Jack game. Beat the dealer to 21 with good cards and good choices.\r\n\r\n• Simple\r\n• Casual\r\n• Beat the Dealer!",
  "summary": "A simple, fun and slightly exciting Black Jack game.",
  "installs": "1,000+",
  "score": 3.625,
  "ratings": 8,
  "reviews": 1,
  "price": 0,
  "developer": "Snarling Sheep",
  "genre": "Card",
  "contentRating": "PEGI 3",
  "released": "Aug 21, 2019",
  "updated": 1575133083000,
  "version": "2.0.2",
  "recentChanges": "Version: 2.0.2<br>--Fixed a couple Split/Double issues.<br>Version: 2.0.1<br>--Added points won/lost display animation.<br>Version: 2.0.0<br>--All new design adding Double, Split and 6-Card Charlie.",
  "appId": "com.snarlingsheep.snarlingblackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Dragon Ace Casino - Blackjack",
  "description": "Dragon Ace Casino - Blackjack invites you to the most exciting multiplayer casino experience. Play for FREE with friends from around the world and refine your skills as you take on the dealer at the blackjack table!\r\n\r\nTired of fake blackjack games with unfair outcomes and no side bets? Dragon Ace Casino offers the most authentic casino blackjack experience on the app store. With the same rules and gameplay as you will find in Vegas and Macau, Dragon Ace Casino has the most realistic casino experience and gives you the chance to be the best. \r\n\r\nBlackjack is enjoyed by millions worldwide and now comes to your device for you to play anywhere!\r\nStart today and get a 100,000 CHIP WELCOME BONUS!\r\n\r\nOur Top Features \r\n● Two exciting GAME STYLES for more fun!\r\n● 4, 6, or 8 DECKS to play with!\r\n● SPLIT your hand up to three times!\r\n● INSURANCE bets against the dealer!\r\n● DOUBLE DOWN and increase your rewards!\r\n● Live SCOREBOARD to track your success!\r\n● Dynamic CARD COUNTING tracker!\r\n● Includes BASIC STRATEGY for blackjack!\r\n● SIDE BETS for a thrilling casino experience!\r\n● Genuine RNG – Fair games guaranteed!\r\n● FREE CHIPS twice a day!\r\nMany events, rewards, and other ways to get more free chips!\r\n\r\n\r\nGameSpring has been operating social casino apps since 2010 and has used its extensive casino game experience to create the ultimate blackjack game. Dragon Ace Casino delivers the most realistic multiplayer blackjack experience. You were looking for the best blackjack app and you found it!\r\n\r\n- Dragon Ace Casino is intended for an adult audience\r\n- Dragon Ace Casino does not offer an opportunity to win real money or prizes\r\n- Success at this game does not imply future success at “real money gambling”",
  "summary": "Vegas Cards: 100K FREE CHIPS",
  "installs": "1,000+",
  "score": 4.095238,
  "ratings": 21,
  "reviews": 9,
  "price": 0,
  "IAPRange": "£0.99 - £99.99 per item",
  "developer": "GameSpring",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 9, 2020",
  "updated": 1587948573000,
  "version": "3.4.1",
  "recentChanges": "Minor update:<br>*Minor bug fixes<br><br>Download today and start playing!<br>Make sure to support us with a 5-star review if you like the game.",
  "appId": "com.gamespring.dbj",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack Arena - 21 card game",
  "description": "About BlackJack Game\r\n\r\nBlackJack or TwentyOne ( 21 ) is the most popular casino style board game of luck and strategy played with cards. BlackJack Arena app is a free social casino version of the classic 21 game. Νo need to get to Macau or Monte Carlo for tournaments, play from anywhere with your friends or family and beat the dealer!\r\n\r\nBlackJack Basics / How to Play\r\n\r\nBlack Jack is an easy to learn game, however, it requires strategy and strong memory skills. The object of the game is to \"beat the dealer\", which can be done in a number of ways:\r\n• Get 21 points on your first two cards (called a black jack), without a dealer blackjack;\r\n• Reach a final score higher than the dealer without exceeding 21; or\r\n• Let the dealer draw additional cards until his hand exceeds 21.\r\nBlackJack Arena offers 6 Game Modes. Start your unlocking journey, enjoy unlimited games!\r\n1. Las Vegas (for lucky beginners at level 1)\r\n2. London Empire (for the best of the newbies at level 5)\r\n3. Black Jack Kings (for pro blackjackists at level 17)\r\n4. High Strike (for platinum players at level 32)\r\n5. Nevada Rollers (for vip players and mega wins at level 47)\r\n6. Jack Royale WBT (for elite players and xtreme wins at level 67)\r\nBlackjack Arena is multiplayer, you can play online with 2 or 3 other players in the same table depending on the mode. Practice and training is the key! Win one match after the other, have fun with buddies, level up, enjoy cool mini games, earn amazing prizes and become the master of this popular social casino card game.\r\n\r\nPlay against the dealer and watch out not to get busted!\r\nCan you become the VIP BlackJack King? Deal me in!\r\n\r\nBlackJack Arena Features\r\n\r\n• Play with real players not robots\r\n• Fair hand dealing and predictable dealer: dealer must draw on 16 and stand on 17\r\n• Daily BONUS of BJ chips.\r\n• Amazing MINI GAMES with prizes: Bonus Wheel spin mania and Scratch Cards; win chips, points or diamonds!\r\n• New HD graphics: Each new Game Mode has unique and quality graphics, yet a simple and lite table board.\r\n• Different Bet & Earnings: In each new Game Mode, you have the chance to win more Points and Chips for each victory.\r\n• In-game CHAT with your oppenents ( Online feature ).\r\n• \"Play in the same table with a friend\" option.\r\n• Fireworks effects to celebrate a match win!\r\n• Daily, weekly and monthly Leaderboards for TOP players\r\n• \"Share the fun\" feature by sending GIFTS to your friends even when they are offline.\r\n\r\nPlayers' Desicions\r\n\r\nAfter receiving an initial two cards, there's up to five standard options: \"hit\", \"stand\", \"double down\", \"split\" or “surrender”.\r\n\r\nHit: Take another card from the dealer.\r\nStand: Take no more cards.\r\nDouble down: Increase the initial bet by up to 100% in exchange for committing to stand after receiving exactly one more card. \r\nSplit: If the first two cards have the same value, you can split them into two hands and play out the two separate hands in turn.\r\nSurrender: The game offers the option to \"surrender\". When you surrender, the house takes half your bet and returns to you the other half.\r\nInsurance: If the dealer's upcard is an ace, you are offered the option of taking \"insurance\" before the dealer checks the hole card. Insurance is a side bet that the dealer has blackjack and is treated independently of the main wager. It pays 2:1 (meaning that you receive two Chips for every Chip bet).\r\nGet your Aces, Jacks, Queens, and Kings ready to rock the deck! \r\nRush for the gold rewards!\r\n\r\nImportant Notices\r\n\r\n- BlackJack Arena is free to download and play and it is addressed to an adult audience. \r\n- The game offers optional in app purchases, however, all modes can be unlocked without spending any money. Neither real-money gambling nor an opportunity to win real money is offered within the game.\r\n- Card Counting is not banned within the game.\r\n- BlackJack Arena logos and names are trademarks of LazyLand Company.",
  "summary": "Get your Jacks, Queens, Kings and Aces ready to rock the deck!",
  "installs": "50,000+",
  "score": 4.2773724,
  "ratings": 1389,
  "reviews": 229,
  "price": 0,
  "IAPRange": "£1.56 - £69.89 per item",
  "developer": "LazyLand SA",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 7, 2014",
  "updated": 1569572290000,
  "version": "1.12.12",
  "recentChanges": "Minor updates",
  "appId": "air.com.lazyland.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "32Red Casino: Play Slots, Roulette & Blackjack",
  "description": "The award winning casino, 32Red, presents the best mobile real money casino app straight to your Android device and other smartphones... Play a huge range of casino games all under one app, including the latest blockbuster slots and old favourites like classic Roulette and Blackjack - you can also take a seat at the live tables too!\r\n\r\n\r\nJOIN TODAY TO CLAIM £10 ABSOLUTELY FREE – NO DEPOSIT REQUIRED\r\n\r\n\r\nExperience the thrill of a casino right in the palm of your hand, with over 150 top quality games available, fantastic daily bonuses and the chance to win life changing jackpots! The multi-award winning 32Red Casino has it all. \r\n\r\nJoin today and not only will you get £10 absolutely free – but you can also take advantage of our exclusive first deposit bonus! What are you waiting for? Win real cash today!\r\n\r\n32Red Games & Features:\r\n\r\n•\tPlay feature titles at 32Red such as Who Wants to Be a Millionaire! We've all fancied our chances on the hit TV-show, now you can test your wits in this awesome slot.\r\n\r\n•\tGet the very best real Roulette experience straight from your device, our Live Roulette tables provide the full package - expert, friendly dealers and an exciting real-time environment.\r\n\r\n•\tEnjoy our selection of Live Blackjack tables which take the game to a new level of excitement, realism and fun.\r\n\r\n•\tPlay classics such as European Roulette & Blackjack, the mainstay of all top casinos.\r\n\r\n•\tHuge Progressive Jackpot slots such as Mega Moolah and Major Millions, with life changing sums up for grabs.\r\n\r\n•\tRound the clock help from an award winning player support team.\r\n\r\n•\tThe very best VIP experience... Become casino royalty!\r\n\r\n\r\n32Red Bonuses:\r\n\r\n•\tGet industry leading promotions - from welcome bonuses, daily offers, leaderboards and tournaments… It’s all covered for both new and existing players!\r\n\r\n\r\n32Red Feature Online Slots:\r\n\r\nHighlander™ • Avalon • Avalon II • Thunderstruck • Thunderstruck II • Immortal Romance • Mega Moolah • Lucky Leprechaun • Jurassic World • Lost Vegas • Castle Builder II • Tomb Raider™ • Deco Diamonds • Cool Buck • Hitman™ • Major Millions • Who Wants to Be a Millionaire™ • The Great Albini • Bonanza • Showdown Saloon\r\n\r\nNew Slots at 32Red:\r\n\r\nStarburst • Rainbow Riches • Lara Croft™ • Gonzo's Quest • Narcos Video Slot™ • Planet of the Apes™ •  Guns N' Roses Video Slot™ • Monopoly On The Money™ • Spartacus • 88 Fortunes • Jack Hammer  • Reel Rush \r\n\r\nInstall the 32Red app today for the very best casino experience!  \r\n\r\n\r\n\r\nThis is a real money gambling app and you must be over 18 to install and play on the 32Red app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact BeGambleAware at 0808 8020 133 or visit https://www.begambleaware.org/. \r\n\r\n\r\nWelcome Bonus terms and conditions:\r\n\r\n**** £10 Free - No Deposit Bonus ****\r\nNew accounts only. Max. withdrawal £100. 50x wagering, game contributions vary, max. stake applies. 7 day expiry. Full terms apply.",
  "summary": "Play Slots, Roulette &amp; Blackjack on the 32Red Casino App with £10 FREE!",
  "installs": "100,000+",
  "score": 2.85,
  "ratings": 313,
  "reviews": 207,
  "price": 0,
  "developer": "32Red PLC",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Jul 28, 2017",
  "updated": 1549633799000,
  "version": "2.2.0",
  "recentChanges": "This latest release of the 32Red Android App includes performance enhancements, great new games and more.",
  "appId": "com.ttr.dev",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack 21 Free",
  "description": "Do you think it's your lucky day? Then test yourself with BlackJack!\r\n\r\nWhatWapp Entertainment is really pleased to announce the release of the coolest BlackJack on Google Play Store! Best news? It's completely FREE to play!\r\n\r\nChallenge your friends by reaching the top of the Global Leaderboard and by unlocking all the different achievements! You can choose among 5 different casino: Las Vegas, Reno, Monte Carlo, Atlantic City and Macao. Each one has it's own rules and will give you a new experience!\r\n\r\nWith a very colorful and full of light effects graphic BlackJack will give you the most fun experience and it's completely free. \r\n\r\nHere you can find some of it's characteristics:\r\n* 25 levels to unlock \r\n* 5 different casino to play BlackJack in: Las Vegas, Reno, Monte Carlo, Atlantic City and Macao\r\n* Full integration with the most popular social networks (Facebook, Twitter, Google+)\r\n* Global Leaderboard\r\n* 20+ different achievements\r\n* Premium stats\r\n* Cloud savings: never lose your progress, with cloud savings you can backup and restart from where you left, even if you use a different device\r\n* More than 10 ways to get free money every day\r\n\r\nThe game is free to play and all the money you can win playing BlackJack are virtual and not real.\r\n\r\n\r\nFor any questions, error or clarification, please contact us by sending an e-mail at info@whatwapp.com, or by writing on Twitter at @ WhatWapp. This information is accessible directly from the application in the \"Credits\" section.\r\nLike us on Facebook by going to www.facebook.com / WhatWapp and follow @ WhatWapp on Twitter!\r\nHave fun!",
  "summary": "The coolest BlackJack on Google Play! It&#39;s free to play",
  "installs": "100,000+",
  "score": 4.2394824,
  "ratings": 3179,
  "reviews": 809,
  "price": 0,
  "developer": "Whatwapp Entertainment",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 26, 2013",
  "updated": 1582826627000,
  "version": "2.0.1",
  "recentChanges": "New look in the update!<br>We’ve improved the game experience and added new shiny graphic.<br>Try to beat the dealer!",
  "appId": "com.WhatWapp.BlackJack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Classic 21 BlackJack",
  "description": "Play Blackjack as if you were at the casino! \r\n\r\nPlay blackjack against the dealer and see who can get 21 without going bust! \r\n\r\n√ Large high quality cards and chips \r\n√ Leaderboard to boast your score \r\n√ The table max limit is 20,000 \r\n√ Blackjack pays 3 to 2 \r\n√ Insurance pays 2 to 1 \r\n√ Dealer must hit on soft 17 and stand on hard 17. \r\n√ Split option available if the first two cards are the same, inclusive of Aces \r\n√ Double down option available if you wish to double your bet after seeing the first two cards \r\n√ Double on any first two cards and allow double after split \r\n√ Surrender option available if you do not like your first two cards \r\n√ Insurance option available if the dealer's first card is Ace \r\n√ Shuffling after half of the 6-deck cards played",
  "summary": "Play Blackjack as if you were at the casino!",
  "installs": "50,000+",
  "score": 3.89,
  "ratings": 287,
  "reviews": 44,
  "price": 0,
  "developer": "奇遊創意網路科技有限公司",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 18, 2012",
  "updated": 1573571032000,
  "version": "4.5",
  "recentChanges": "Performance tuning.<br>Bug fixes.",
  "appId": "com.qiyofun.android.game.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack 21",
  "description": "#1 Realistic BlackJack game on the Android Play Store!\r\n\r\nFree Chips every Day and every Hour!\r\n\r\nPlay Free Now! Blackjack by Solitaire Games Free is the best way to experience the rush of a real BlackJack Casino on your Android!\r\n\r\nFeatures of BlackJack:\r\n- Play unlimited Hands \r\n- Free chips every hour\r\n- Even more Free chips every day\r\n- Realistic Gameplay\r\n- Win Big!\r\n- Sharp real looking cards\r\n- Awesome Casino Experience",
  "summary": "Win $1,000,000 Chips! Play Free Now! Best New Black Jack Casino Game!",
  "installs": "10,000+",
  "score": 4.19,
  "ratings": 105,
  "reviews": 42,
  "price": 0,
  "IAPRange": "£1.99 - £99.99 per item",
  "developer": "Solitaire Games Free",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 11, 2018",
  "updated": 1534003159000,
  "version": "1.0",
  "recentChanges": "#1 BlackJack game now available!",
  "appId": "card.games.free.blackjack.twenty.one.black.jack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Switch Pro",
  "description": "Blackjack Switch Pro does not contain ads and you will not have to buy chips.\r\n\r\nPlay unlimited for free or Unlock Practice mode and learn the optimal strategy for Blackjack Switch.",
  "summary": "The most popular Blackjack variation in casinos today. Play and Learn!",
  "installs": "1,000+",
  "score": 4.2,
  "ratings": 60,
  "reviews": 25,
  "price": 0,
  "IAPRange": "£1.89 per item",
  "developer": "Blackjack Advantage Player",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 5, 2018",
  "updated": 1558283284000,
  "version": "1.12",
  "recentChanges": "Blackjack Switch v1.12",
  "appId": "com.coopdev.blackjackswitch",
  "searchTerms": "blackjack"
 },
 {
  "title": "Casino Blackjack (5 Games)-21",
  "description": "Casino Blackjack (21) brings authentic BlackJack action with you anywhere you go.  Most blackjack apps give you one plain version!  Casino Blackjack (21) gives you 5 different versions!  No in-app purchases for chips either!  Never spend money on chips again!  Saying this is the best blackjack game on the play store is no alternative fact!  It's true!\r\n\r\nThe different versions are:\r\nRegula\r\nCount\r\nFace-up\r\nPlus\r\nPair",
  "summary": "Casino Blackjack (21) gives you 5 different versions of blackjack and free chips",
  "installs": "5,000+",
  "score": 3.8333333,
  "ratings": 12,
  "reviews": 4,
  "price": 0,
  "developer": "MediaLab Entertainment",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 18, 2017",
  "updated": 1484752962000,
  "version": "1.0",
  "appId": "com.tljtek.blackjack.casino",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Trainer",
  "description": "If you are new to the game of blackjack, want to beat the house and win money at the casino, just download Blackjack Trainer now!\r\n\r\nBlackjack Trainer helps you easily learn blackjack basic strategy and card counting. The game can help make it easy to learn the basics of when to hit, when to stand, when to double double down and when to split pairs in any situation. \r\n\r\nBy studying basic strategy you can learn the best decision to make in any hand of blackjack. Basic blackjack strategy charts are tables that list possible hand values on one axis and possible dealer upcard values on the other axis. Based on the value of your hand and the value of the dealer's upcard you can easily determine which move you should make.\r\n\r\nThe Hi-Lo strategy is one of the most popular card counting strategies, as well as one of the easiest to learn. This is a great strategy for beginning to intermediate blackjack card counters and if you can do the simplest of math then you can use it to improve your blackjack success.The Hi-Lo strategy of counting cards is a fantastic system for new card counters and is a great way to ease yourself into the world of card counting and improve your chances of winning at blackjack.\r\n\r\nFeatures:\r\n- Authentic casino blackjack gambling experience!\r\n- Learn blackjack basic strategy\r\n- Lean the most popular card counting strategy: Hi-Lo Strategy\r\n- Help you practice your card counting skills\r\n- Improve your chances of winning at blackjack.\r\n- Keep track lots of different gameplay statistics\r\n- Multiple casino table backdrops to choose from",
  "summary": "Learn blackjack basic strategy and card counting,increase your chance of winning",
  "installs": "5,000+",
  "score": 4.2727275,
  "ratings": 99,
  "reviews": 44,
  "price": 0,
  "IAPRange": "£1.79 - £92.99 per item",
  "developer": "AE Magwin: Free Casino Slot Machines Bingo Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 15, 2016",
  "updated": 1559294781000,
  "version": "1.1.0",
  "recentChanges": "Hi Blackjack Fans! This is our largest update yet! <br>- Complete a set of collections for more rewards!<br><br>Thank you for your feedback, and your continued support will help us bring you new content often.",
  "appId": "com.arcadegame.games.blackjack.trainer",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack: Experience real casino for game 21",
  "description": "Play the all new Blackjack and be the Master of your table.\r\n\r\nOUR FEATURES\r\n🌟Daily Bonus for everyday engagement\r\n🌟Multiple casino tables to choose from\r\n🌟Updated with realistic background sounds and dealer voice\r\n🌟Well defined player angle for realistic feel\r\n🌟Best Tutorial for a comfortable play\r\n🌟Fair card shuffling for honest gameplay\r\n🌟Rich graphics and animations\r\n🌟Spin wheel to Win more\r\n\r\n\r\nBlackjack has always been listed on Top among all Casino games due to its engaging game strategy.\r\n\r\nWe have made the game by keeping all the essential elements in mind which are needed to provide a real-time Casino feel to its players.Each and every minute detailing has been made in this game to enhance maximum User Experience. A well explained Tutorial has been provided in the game so let's understand the game briefly in this section.\r\n\r\nTHE GAME\r\nThe Blackjack game makes you understand the concept clearly even if you are completely new to the game. If you are new to the game, you can opt for the ‘Newbie’ option on which you will be guided perfectly to gradually become an expert in the game. You will get clear instructions to make each and every single movement in the tutorial session. The different rules and strategies of the game will be explained to you in the simplest way. In the ‘Newbie’ platform you can bet for lower amounts and can practice more to understand the complete logic of the game.\r\n\r\nOnce you are all set to make big moves in the game, you have ‘Casual’ and ‘Elite’ options to bet on higher amounts. The ambience of each mode changes accordingly which gives you the feel of your upgradation. The table colour and texture, along with the perfect player angle view gives the Master of The Table feeling within yourself.\r\n\r\nNow you have another option to make the game much more interesting, that is the 'PvP offline' mode. The Player v/s Player mode helps you to include two more players in the game, which means, three players and the dealer will move the game forward. This mode is perfect when you are hanging around with your friends. \r\n\r\nThe visual and sound effects in the game will keep your maximum engaged and the 'daily bonus' and 'spin wheel' will provide you with chips to play the game everyday. Additionally, there is an in-app purchase option provided within the game to keep you moving even if you lose all the chips. The store has different purchase options and it also shows you the most preferred option among the packages.\r\n\r\nSo it's time to step inside the Casino to feel the real spirit of the Blackjack game. \r\nGood Luck!!!😃\r\n\r\nWe would love to hear from you, show your support in the form Ratings and Reviews😍\r\n\r\nWe are active on social media platforms:💌\r\n\r\nInstagram: https://www.instagram.com/infocomstudios/\r\nFacebook: https://www.facebook.com/Trending-Games-191957664945583/\r\nTwitter: https://twitter.com/infocom?lang=en\r\nYouTube: https://www.youtube.com/channel/UCvGTAczRPDxj_WK-0Ab3KhQ\r\nPinterest: https://www.pinterest.co.uk/infocomstudios/\r\nLinkedIn: https://www.linkedin.com/company/infocom-software-pvt-ltd-/",
  "summary": "Get the real time casino feel at your place for a game of Blackjack 21",
  "installs": "100,000+",
  "score": 4.6021867,
  "ratings": 11939,
  "reviews": 3701,
  "price": 0,
  "IAPRange": "£0.60 - £93.99 per item",
  "developer": "Infocom Studios",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Oct 23, 2015",
  "updated": 1543384758000,
  "version": "1.0.27",
  "appId": "air.com.infocom.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Professional",
  "description": "Blackjack is a card game where you face off against the dealer. You're both trying to get to 21 points without going over. Whoever gets closest, wins. It's that simple.\r\n\r\n\r\nFeatures:\r\n• Different themed rooms available to play in.\r\n• Online leader boards so you can see exactly where you stand, per month and per week.\r\n• Customizable cards and chips!\r\n• Daily prizes where you can win big!",
  "summary": "Enjoy the classic game of Blackjack for FREE with Blackjack Professional!",
  "installs": "1,000+",
  "score": 4.4666667,
  "ratings": 15,
  "reviews": 6,
  "price": 0,
  "IAPRange": "£0.99 - £17.99 per item",
  "developer": "Random Salad Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "May 14, 2018",
  "updated": 1564578774000,
  "version": "1.5.1",
  "recentChanges": "Enjoy improvements to game play and bug fixes.",
  "appId": "com.randomsaladgames.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Spanish Blackjack 21",
  "description": "Spanish 21 is a variation of blackjack, that in some cases is the best bet in the casino. In locations where the dealer stands on a soft 17, or redoubling is allowed, Spanish 21 may be a better bet than blackjack, depending on the specific blackjack rules. If you are looking for a change of pace from traditional blackjack but insist on a game with a low house edge, then you may find new excitement in Spanish 21.\r\n\r\nKey feature: \r\n\r\n* Gorgeous HD graphics and slick, fast gameplay\r\n* Realistic sounds, and smooth animations\r\n* Fast and clean interface.\r\n* Offline playable: you dont need an internet connection to play this game, it run perfectly fine when offline\r\n* Constant playing: you don't need to wait for other player to play this game\r\n* Completely free: you don't need any money to play this game, the chips in the game are also free to get.\r\n\r\nHere are the full rules of the game.\r\n\r\nSpanish 21 uses six or eight Spanish decks, each deck consisting of 48 cards — the regular 52 cards less the four tens. Any card counter can tell you that removing any 10-point card from the cards moves the odds in favor of the dealer. To make up for this, Spanish 21 gives the player a host of bonuses and favorable rules. There are lots of Spanish 21 games all over the country, so rules will vary somewhat from place to place, but the usual rules in the player's favor are:\r\n\r\n+ Late surrender allowed.\r\n+ Double after split allowed.\r\n+ Re-splitting aces allowed.\r\n+ A player 21 always wins.\r\n+ Player blackjack beats dealer blackjack.\r\n+ Player may double on any number of cards.\r\n+ Player may usually hit and double down after splitting aces.\r\n+ Player may surrender after doubling, known as \"double down rescue.\" The player forfeits an amount equal to his original bet.\r\n+ A five-card 21 pays 3 to 2, a six-card 21 pays 2 to 1, a seven or more card 21 pays 3 to 1. Bonus not honored after doubling.\r\n+ A 6-7-8 or 7-7-7 of mixed suits pays 3 to 2, of the same suit pays 2 to 1, and of spades pays 3 to 1. These bonuses do not pay after doubling.\r\n+ Suited 7-7-7 when the dealer has a seven face up pays $1000 for bets of $5-$24 and $5000 \"Super Bonus\" for bets of $25 or over. In addition, all other players receive a $50 \"envy bonus.\" This bonus does not pay after doubling or splitting.\r\n\r\n\r\nDownload Spanish 21 now for free!\r\n\r\nBlue Wind casino\r\nBring the casino to your home",
  "summary": "Spanish 21 is a variation of blackjack and also the best bet in the casino.",
  "installs": "10,000+",
  "score": 4.37,
  "ratings": 369,
  "reviews": 138,
  "price": 0,
  "IAPRange": "£0.89 - £2.69 per item",
  "developer": "Blue Wind Studio",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 3, 2018",
  "updated": 1587636297000,
  "version": "1.4.1.1",
  "recentChanges": "+ Fix 21+3 side bet sometimes not paying on Straight/Straight Flush<br><br>Enjoy the game!<br>Bring the casino to your home!",
  "appId": "com.bluewind.spanish21",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21",
  "description": "Blackjack is a popular American casino game, now found throughout the world. It is a banking game in which the aim of the player is to achieve a hand whose points total nearer to 21 than the banker's hand, but without exceeding 21.\r\n\r\nGame\r\nAfter the player has selected the bet, dealer distributes first two cards. Player decides whether to HIT or STAND. If the player decides to take one more card and the total points are more than 21 then the player gets busted. The same condition holds for the dealer too. If both player and dealer decide to stand and their points are less than 21, the one whose point is closer to 21 wins. \r\n\r\nIn the case of a draw, placed bet is given back. In the case of player's first two card total point is exactly 21 then player wins by BlackJack unless dealer's point is less than 21. In cases when both player and dealer make Blackjack than placed bet is given back. If the player wins the game he gets twice coins as its initial bet.\r\n  \r\nHit\r\n  \r\nIf you hit, you take another card or cards in hopes of getting closer to 21. If the player's total exceeds 21 after hitting, the player is said to \"bust\" and loses the bet.\r\n   \r\nStand\r\n   \r\nIf you stand, you elect to draw no more cards in hopes that the current total will beat the dealer.\r\n\r\nThe Dealer's Turn\r\n   \r\nIf the dealer has a natural 21 (blackjack) with his two cards, he won't take any more cards. The dealer must hit if the value of the hand is lower than 17, otherwise the dealer will stand. Whether or not the dealer must hit on a soft 17 differs from casino to casino. There might even be blackjack tables with different rules within the same casino.\r\n   \r\nScoring\r\n  \r\nKings, queens, and jacks are each worth 10, and aces may be used as either 1 or 11. The object for the player is to draw cards totaling closer to 21, without going over, than the deale's cards.",
  "summary": "Blackjack is a popular card game",
  "installs": "1,000+",
  "score": 4.214286,
  "ratings": 28,
  "reviews": 15,
  "price": 0,
  "developer": "Globile",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 7, 2017",
  "updated": 1502785349000,
  "version": "1.0.1",
  "recentChanges": "* Minor bugfixes",
  "appId": "globile.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack",
  "description": "Blackjack 21 is the most widely played casino banking game in the world. It is a comparing card game between a player and dealer and played with one French decks of 52 cards.\r\n\r\nThe game features:\r\n - Enables live counting of left cards in a decks\r\n - Counts players and  dealers wins\r\n - Enables bids\r\n\r\nPlayer decisions in the game:\r\nAfter receiving an initial two cards, the player has options: \"hit,\" \"stand,\" or \"split\". \r\n - Hit: Take another card from the dealer.\r\n - Stand: wait; also known as \"stand pat\", \"stick\", or \"stay\".\r\n - Split: (only available as first decision of a hand), if the first two cards have the same value, the player can split them into two hands.",
  "summary": "Play BlackJack 21 game casino card game - completely free!",
  "installs": "100,000+",
  "score": 3.76,
  "ratings": 1057,
  "reviews": 421,
  "price": 0,
  "developer": "Wintrino",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 8, 2012",
  "updated": 1442405817000,
  "version": "10.0.17",
  "appId": "com.blackjack.wintrino",
  "searchTerms": "blackjack"
 },
 {
  "title": "Battlejack: Blackjack RPG",
  "description": "Collect hundreds of legendary heroes and engage in high risk, high reward card battle games in Battlejack, the only fantasy RPG game with a unique blackjack-inspired card battle system! \r\n\r\nHelp the heroes free the mythical tree Yggdrasil and restore the elemental balance to Midgard. Join a guild and battle Titans in epic RPG card games. As you battle Titans, deal battle cards that equal exactly 21 to deal the most damage, just like in blackjack!\r\n\r\nStart your fantastical journey today in Battlejack, the only RPG game that uses a blackjack card battle system!\r\n\r\nBattlejack Features:\r\n\r\nEXPLORE FANTASTICAL WORLDS\r\n• Enjoy a fantasy story that leads you on an epic journey!\r\n• The fantasy world of Midgard is full of adventures!\r\n• Enjoy the all new Dark Maze, where you will encounter powerful enemies and face challenges like never before.\r\n• Play this card RPG while killing time waiting for your bus or sitting on the toilet. Ain’t modern gaming awesome?\r\n\r\nCARD BATTLES – VICTORY OR NOTHING\r\n• RPG fun full of exploring, collecting and customizing with a blackjack twist!\r\n• In a card battle, score 21 to unlock a massive boost to all heroes.\r\n• Like a real Blackjack game, you will face consequences if you’re too greedy. Play it safe and don’t get punished or try to defy the odds and risk it all.\r\n\r\nCOLLECT LEGENDARY HEROES\r\n• Card collecting games – Collect trading cards for hundreds of unique heroes from the enemies you slay!\r\n• Legendary heroes can be mixed and matched to create the perfect team from an troll-YAAAARRR!-pirate alliance to a cute unicorn- kitten squad: the possibilities are endless!\r\n\r\nEVOLVE & EQUIP HUNDREDS OF HEROES\r\n• Want heroes stronger than a fire mecha? What about a mega-powerful-lava-spitting-shredder-of-doom-and-death?!\r\n• Legendary heroes can be fused, upgraded and customized to make them even stronger and cooler!\r\n• Battle using the right party combinations to make your newbish weaklings become mighty gods in every card battle!\r\n\r\nSLAY EPIC TITANS IN A GUILD\r\n• Battle Titans with your guildmates, and help each other climb to the top of the leaderboard!\r\n• As the goblin proverb says: If you want to wipe fast, fight alone; if you want to wipe far, fight together. Or something like that.\r\n\r\nEnjoy an epic, fantasy story full of heroes, Titans and challenge yourself in turn based games inspired by blackjack! \r\nDownload today to play turn-based card games and battle alongside the heroes of Midgard!\r\n\r\nLike us on Facebook at https://www.facebook.com/battlejackofficial/ to get the latest Battlejack news! This app allows you to purchase virtual items. Privacy policy: http://legal.grandcrugames.com/privacy.html",
  "summary": "Fight your way to victory &amp; defeat your enemies in a fantasy RPG game!",
  "installs": "500,000+",
  "score": 4.3431125,
  "ratings": 23611,
  "reviews": 8312,
  "price": 0,
  "IAPRange": "£0.89 - £93.99 per item",
  "developer": "Grand Cru Games",
  "genre": "Role Playing",
  "contentRating": "PEGI 7",
  "contentRatingDescription": "Mild Violence",
  "released": "Aug 23, 2017",
  "updated": 1588786324000,
  "version": "2.6.3",
  "recentChanges": "Minor bug fixes and balance changes",
  "appId": "com.grandcru.battlejack",
  "searchTerms": "blackjack"
 },
 {
  "title": "bet365 Casino: Play Blackjack, Roulette & Slots",
  "description": "bet365 Casino app is the place to play Blackjack, Roulette and Slots. We have a large selection of games, jackpots and slots.\r\n\r\nWhether you’re an aspiring spinner or a vegas veteran, the bet365 Casino app is the perfect casino app for you. \r\n\r\nJoin bet365 Casino today and play straight away. \r\n\r\nPlay all the latest games on your device with the bet365 Casino app, with a huge selection of Casino table games such as Roulette, Blackjack and Baccarat. \r\n\r\nPersonalise your play and access to your favourite real money games, whether you prefer Casino classics such as Blackjack and Roulette or the thrill and excitement of Slots - there’s something for everyone.\r\n\r\nPlay Live Casino, where you can play Blackjack, Roulette, Baccarat and Dragon Tiger with real life dealers. \r\n\r\nUse your existing bet365 account to log in, or sign up now.\r\n\r\nSpin to win across a wide range of slots - keep an eye out for familiar faces such as Superman and Batman. Play a range of video slots, search for the pot of gold with Plenty of Fortune or keep it classic with Crazy 7 and Lotto madness.\r\n\r\nGo for big cash jackpot slots in Age of the Gods and Jackpot Giant.\r\n\r\nGet lucky with fantastic slot games with bonus games, free spins and massive progressive jackpots.\r\n\r\nExperience live Roulette, Blackjack and other table games, when you play Live Casino with real life dealers. Sitting across from our live dealers who are ready to chat and waiting to spin the Roulette wheel or deal you in to Blackjack, Poker, Baccarat and lots more Live Casino games.\r\n\r\n•\tCompete in a range of exciting bet365 exclusive monthly promotions\r\n•\tLive Casino games\r\n•\tTable games\r\n•\tJackpot Slots\r\n•\tInstant Wins\r\n•\tNew games every week\r\n\r\nDownload the bet365 Casino app and start playing today! \r\n\r\nOur customer support team is on hand 24/7 to help with any queries.\r\n\r\nYou must be 18 or over to have a bet365 account.\r\n\r\nThis is a real money gambling app. Please gamble responsibly.\r\n\r\nFor the full terms and conditions please follow the link to the Developer Website below.\r\nPlease read the bet365 Privacy Policy (see link below) before installing this application. By installing and opening the application you are accepting this policy.\r\n\r\nFor gambling help and support in the UK, users can contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org.\r\nFor gambling help and support in IE, users can contact Gamble Aware at 1800 753 753 or visit http://www.problemgambling.ie.",
  "summary": "Casino games, Live Dealer &amp; Slots",
  "installs": "50,000+",
  "score": 2.774648,
  "ratings": 71,
  "reviews": 38,
  "price": 0,
  "developer": "Hillside Technology Limited",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1575466126000,
  "version": "19.60.6",
  "recentChanges": "We&#39;ve updated some game elements and improved the user experience.",
  "appId": "com.bet365.bet365CasinoApp.play",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack",
  "description": "Blackjack, also known as Twenty-one or Vingt-et-un (French: \"twenty-one\"), is the most widely played casino banking game in the world. Blackjack is a comparing card game between a player and dealer and played with one or more French decks of 52 cards.\r\nThe player is dealt an initial two card hand with the option of drawing cards to bring the total value to 21 or less without exceeding it, so that the dealer will lose by having a lesser hand than the player or by exceeding 21. Since the 1960s, blackjack has been a high profile target of advantage players, particularly card counters, who track the profile of cards yet to be dealt, and adapt their wager and playing strategy accordingly. While in our implementation we do not teach counting, we do offer basic strategy hints to train you on how to improve your odds.\r\nMany rule variations of BlackJack exist. Our implementation offers most common casino rules:\r\n- Play with 4 decks\r\n- Decks are reshuffled when there is less than 20 cards left.\r\n- Dealer stands on soft 17\r\n- Player can split twice\r\n- Neither surrender nor insurance are offered\r\nWhen hints are enabled, player would need to confirm his choice if it's not the most optimum action.\r\nWhen you running short on credits, feel free to use our build in slot machine - truly the loosest slots in town!\r\nDon't forget to check our Game section for other fun games...",
  "summary": "Enjoy our version of BlackJack with optional hints on how to improve your odds.",
  "installs": "100,000+",
  "score": 4.03,
  "ratings": 516,
  "reviews": 82,
  "price": 0,
  "developer": "GASP",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 11, 2011",
  "updated": 1565456302000,
  "version": "1.35",
  "recentChanges": "Fixed occasional problem when app moved to the background",
  "appId": "com.sg.js.BlackJack",
  "searchTerms": "blackjack"
 },
 {
  "title": "BlackJack",
  "description": "One of the most popular card games worldwide, Blackjack 21 is now out on the Google Play Store. Non Stop Blackjack 21 fun is here!\r\nBlackjack is also know as 21 or twenty-one is a widely played casino banking game. \r\n\r\nBlackjack 21 is a comparing card game between a player and a dealer, meaning players will compete against a dealer but not against other players and is played with one or more decks of 52 cards. \r\n\r\nA Blackjack 21 game can be won in the following ways:\r\n\r\n✔ Getting 21 points on the player's first 2 cards which is called a 'blackjack', 'natural' assuming the dealer has not got a blackjack\r\n✔ Get a score higher than the dealer without exceeding 21\r\n✔ Allowing the dealer to draw additional cards until his hand exceeds 21\r\n\r\nWhen the game of blackjack 21 starts the player or players are dealt with a two card hand and add together the value of their cards. The Face cards which are kings, queens and jacks are counted as 10 points. The dealer and the player count an ace as 1 point or 11 points, and all other cards are counted according to the numeric value shown on the card. The players after receiving their first two cards, have an option of getting a hit or taking an additional card. The player or the dealer wins by having a score of 21 or by having the higher score that is less than 21. Having a score higher than 21 is going bust or called busting which will result in a loss.  The player playing blackjack 21 can win by having any score equal to or less than 21 if the dealer 'busts'\r\n\r\nThe player can also take the following decisions: Hit, Stand, Double Down and Split\r\n\r\nEach Blackjack game has a basic strategy, which is playing a hand of any total value against any dealer's up card which loses the least money to the house in the long run.\r\n\r\nSo what are you waiting for? Sharpen your Blackjack 21 skills before visiting the casinos and win those big bets!! \r\n\r\nBlackjack 21 is absolutely FREE! Download it today! \r\n\r\n❖❖❖❖ Features ❖❖❖❖\r\n\r\n✔✔ 1000 Free Chips everyday\r\n✔✔ Phone and Tablet Support\r\n✔✔ Split and Double to win big bets\r\n✔✔ Intuitive Gameplay and Interface\r\n\r\nDownload Blackjack 21 for your phone and tablets today for hours of fun\r\n\r\nFor any kind of Blackjack 21 support, visit: \r\nhttp://droidveda.com\r\n\r\nPlease don't forget to Rate and Review Blackjack 21, we aim to make Blackjack 21one of the best card games out there on the google play store",
  "summary": "Blackjack 21 is a popular card game at casinos. Download Blackjack 21 for FREE!",
  "installs": "100,000+",
  "score": 4.1030536,
  "ratings": 2642,
  "reviews": 340,
  "price": 0,
  "IAPRange": "£0.61 per item",
  "developer": "DroidVeda LLP",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 16, 2013",
  "updated": 1448458296000,
  "version": "2.0",
  "recentChanges": "===== v2.0 Update =====<br><br>Minor Bug Fixes",
  "appId": "com.sleepwalkers.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Strategy Trainer",
  "description": "This Blackjack basic Strategy Trainer helps you quickly and easily learn perfect basic blackjack strategy to maximize your casino edge and increase your odds at winning blackjack at the casino.\r\n\r\nThis blackjack basic strategy trainer teaches in a way similar to flashcards, in matching accuracy to each play based on dealer up card. Basic blackjack strategy Real Deck mode can assist in blackjack card counting strategies. The blackjack basic strategy trainer is only based on the blackjack basic strategy specific odds of each pertaining blackjack hand alone, regardless of which cards may or may not be next. This is originally designed as a lightweight app, light on graphics, animations, and interface.\r\n\r\nKey Features:\r\n★ Simpler, and easier Blackjack Basic Strategy Trainer.\r\n★ Fast and simple flashcard style teaching.\r\n★ Manually select-able cards for both dealer and player. (Choose the cards you want)\r\n★ Auto deal mode, deals cards randomly for both player and dealer.\r\n★ Realistic real deck shuffle mode - Simulates a real deck/shoe to help card counting.\r\n★ Temporarily logs plays for going back over after lightning round practicing.\r\n★ Instant feedback shows the hand, play, and suggested play based off the charts.\r\n★ Quickly check out strategy charts for a wide variety of table rules, including the most popular real world casino rules.\r\n★ Customize-able app through in app upgrades.\r\n★ Highly responsive/attentive support for any issues with the app.\r\n\r\n\r\nBlackjack Basic Strategy Trainer and Charts support the most common real casino blackjack rule variations including:\r\n★ 1-8 deck(s)\r\n★ Hit/stand soft 17\r\n★ Double Any 2 cards, Double 9/10 only, Double 10/11 only\r\n★ Double after splitting / No double after splitting\r\n★ Late Surrender / No surrender\r\n★ Dealer peek / No Peek\r\n\r\nBlackjack Basic Strategy Trainer Real Deck mode:\r\n★ Adds decks and shuffles into \"shoe\" and draws cards from top of shoe like in a real table setting.\r\n★ Can help learn card counting strategies.\r\n★ Simulates a real game of blackjack (without betting).\r\n\r\n\r\n\r\nPlanned Features:\r\n★ Additional settings (themes, audio, etc.)\r\n\r\n★★★ This application supports English localizations, from Left-Right format. Also, this application has only been optimized on a Samsung Galaxy S8, running Android 9.\r\nIf you try this app and it does not work on your device, please contact support and see if they can help you get it running!★★★\r\n\r\n\r\n★ This is the first app to be developed by Aeon Apps, and was originally intended as a quick, lightweight, on-the-go tool to help learn basic strategy of blackjack at the casino.\r\n\r\n\r\n\r\n\r\n***** DISCLAIMER *****\r\nBlackjack Basic Strategy and/or this application in no way guarantees any persons to be successful at real casino blackjack no matter how well they have done within the application. This is just a tool to assist with learning basic blackjack strategy. The developer(s), creator(s), and/or owner(s) of this application are not responsible for anything that may result from any information presented within the application.",
  "summary": "Easily and quickly learn blackjack basic strategy",
  "installs": "10,000+",
  "score": 4.15,
  "ratings": 112,
  "reviews": 47,
  "price": 0,
  "IAPRange": "£0.89 - £9.99 per item",
  "developer": "Aeon  Apps",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 7, 2016",
  "updated": 1572504433000,
  "version": "3.6.8-A",
  "recentChanges": "3.6.8-A:<br>★ Removed surrender button from &quot;No Surrender&quot; rules.<br>★ Dealing/Splitting in real deck more consistent in working.<br>★ Add card counter to real deck.<br>★ Dealer now burns the first card in Real Deck.<br>★ Unlocked version no longer available.<br>★ Real Deck add-ons added as upgrades.<br>★ BG/Txt upgrades no longer individual.<br>★ BG/TXT trials should be enabled in rotation.<br>★ UI Tweaks.<br>★ Ad frequency tweaked.<br><br><br>★ Contact support if you have any issues! Email/Discord/Twitter 😁",
  "appId": "com.aeonpsych.blackjackbasicstrategy",
  "searchTerms": "blackjack"
 },
 {
  "title": "Sky Casino Live Casino, Blackjack, Roulette, Slots",
  "description": "The Sky Casino App gives you the opportunity to enjoy an extensive range of Live Casino Table games, plus hundreds of Slots, blackjack and Roulette tables for you to experience either on the move or from the comfort of your own home.\r\n \r\nOur App is your gateway to thrills, possibilities and probabilities with every spin or stake. With a wide assortment of Live tables, just take a seat where our expert live dealers are posed to spin, or deal your way into your preferred table whenever you chose. Whether you enjoy Roulette, Blackjack, Baccarat, Casino Hold em or Hi Lo, we have the games for you!\r\n \r\nWe  are inviting you to come and play with Sky Casino where you enter a world of entertainment with vast array of promotions and campaigns you can access directly through the App providing a truly immersive online casino experience.\r\n \r\nOur easy to navigate and intuitive site, allows you manage your account with our Touch ID, make secure deposits and withdrawals, and choose a range of payment methods. \r\n \r\nDownload our App today to enjoy all of our Casino games, there’s something for everybody at Sky Casino. If you live for the unexpected then why not visit Sky Vegas to enjoy a world of exclusive and big name slots, or for a true sports betting fan immerse yourself in the world of Sky Bet, Britain’s most popular online bookmaker.\r\n \r\nPlease note all app images / previews shown here are for illustrative purposes only*. \r\n\r\nResponsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support in the United Kingdom please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/ and in Ireland please contact Gamble Aware at 1800 753 753 or visit http://www.gambleaware.ie/\r\n\r\nThe Sky Casino app is brought to you by Bonne Terre Limited, an Alderney registered company wholly owned by The Stars Group Inc. and licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Casino is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group. The Sky trademarks used in the app are owned by the Sky UK Limited and its affiliated companies and are used under license. To place a bet with Sky Casino you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Casino. Customers located outside of the UK or Ireland will be prohibited from using this app.",
  "summary": "Enjoy Our Unique Roulette Experience",
  "installs": "50,000+",
  "score": 4.36,
  "ratings": 658,
  "reviews": 262,
  "price": 0,
  "developer": "Sky Betting and Gaming Apps",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1570537487000,
  "version": "2.2.0",
  "recentChanges": "This release brings a whole new look to the app settings area where you can manage your log in preferences. And we’ve also made some changes behind the scenes to improve the stability and performance of our app. If you like using Sky Casino, please support us by leaving a review in the Play Store.",
  "appId": "com.skybet.app.skycasino",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 2 in 1",
  "description": "Awesome graphics, quick and clear gameplay, simple rules, different themes, leaderboard and achievements.\r\nReally best Blackjack ever.\r\n\r\nGoGo21 rules:\r\nGoGo 21 is a card game based partly on the BlackJack rules and way of counting, and the object of the game is to place cards in such a way as to make 21 as many times as possible in each round. You can place each card in any column as long as the sum does not exceed 21. The current sum of the column is presented above each column. If you can’t place a card in a column you have to throw it away. Try to keep the number of cards you throw away to a minimum to increase your score.\r\n\r\nClassic Blackjack rules:\r\n\r\nThe object of Blackjack is very simple: to achieve a total that is greater than that of the dealer, and which does not exceed 21. \r\nYou must consider your cards and your dealer's card and remember, if you go over 21, you lose. \r\nYou win if: \r\n- Your total is higher than the Dealer's total. \r\n- The Dealer goes over 21 or \"busts\". \r\n\r\nIf your total is the same as the Dealer's total it is a \"stand-off\" and you neither win nor lose. \r\nIf you go over 21, or the Dealer's total is greater, you lose. \r\n\r\nThe values of the cards: \r\n\r\n- Picture cards (Jack, Queen, King) each count as 10 points. \r\n- An Ace counts as 1 point or 11 points, whichever is better for owns of the hand. \r\n- All other cards have their numerical value. \r\n\r\nBlackjack is a combination of an Ace and any 10-points card.",
  "summary": "New way to play Blackjack!<br>Solitaire-like GoGo 21 and classic Blackjack!",
  "installs": "1,000+",
  "score": 4.0185184,
  "ratings": 54,
  "reviews": 14,
  "price": 0,
  "developer": "KoBruy",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 10, 2014",
  "updated": 1564270137000,
  "version": "1.0.4",
  "recentChanges": "Bugfix",
  "appId": "com.gadgetcrafts.gogoblackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Blackjack 21 Card Game\r\n\r\n* Different deck graphics to choose.\r\n\r\n* Adjustable number of decks.\r\n\r\nGame Rules:\r\n\r\nThe aim of the game is to reach the nearest number included 21 without exceeding it. The game is played against the dealer who will play with some predefined rules.\r\n\r\n* When game started, each player is dealt two cards and the dealer's one card is dealt face-up, you can determine your strategy according to this card.\r\n\r\n* After the cards are dealt if two cards in your hand have the same numerical value, you could split them by putting the same amount of bet while starting the game and have two separate hands.\r\n\r\n* If you want to double your bet by pulling a single card, you can use the double option.\r\n\r\n* When you have reached a number that you think you can win you could say stay so dealer will continue to play its turn.\r\n\r\n* Dealer will pull card until he reaches 17 or above number.",
  "summary": "Blackjack game is now on Android! Download right away for free!",
  "installs": "50,000+",
  "score": 3.8,
  "ratings": 957,
  "reviews": 66,
  "price": 0,
  "developer": "Gany Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 27, 2013",
  "updated": 1401222007000,
  "version": "3.0",
  "recentChanges": "Version 3.0<br><br>* Daily chip<br>* Bug fix.",
  "appId": "com.sadegames.yirmibir",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Magma Mobile introduces Black Jack, and it’s totally free !\r\n \r\nIn this famous casino game, your goal is to beat the croupier by having a bigger score, without exceeding 21. Use discernment in choosing insurance, split, or double to try to have a \"Black Jack\". Will you be able to win the jackpot without going bankrupt ?\r\n \r\nBlack Jack features :\r\n \r\n- Customize the casino table with special cards and layouts\r\n- Get bonus gains by accumulating chips\r\n- Play the roulette to get free chips\r\n- Test your luck with the daily challenge\r\n- Get detailed statistics to track your performance\r\n- Enjoy unlimited free tokens!\r\n \r\nThe croupier is waiting for you ... Download Black Jack for free!",
  "summary": "Will you join us at our table?",
  "installs": "100,000+",
  "score": 3.94,
  "ratings": 609,
  "reviews": 238,
  "price": 0,
  "developer": "Magma Mobile",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jul 7, 2017",
  "updated": 1578494846000,
  "version": "1.0.3",
  "recentChanges": "Android 9 Compatibility",
  "appId": "com.magmamobile.game.Blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Blackjack, also known to some as twenty-one(21), is one of the most popular casino games around - and also super simple to learn! \r\n\r\nIt is one of the most attractive casino games for the player. Today, Blackjack is the one card game that can be found in every American gambling casino. The rules are simple, the play is thrilling, and there is opportunity for high strategy. In fact, for the expert player who mathematically plays a perfect game and is able to count cards, the odds are sometimes in that player's favor to win.\r\n\r\nThe objective of Blackjack is to beat the dealer. This can be accomplished by getting \r\n\r\nBlackjack (first two cards equal 21) without dealer Blackjack, having your final card count be higher than the dealers without exceeding 21, or by not exceeding 21 and dealer busting by exceeding their card count of 21.\r\n\r\nOn the first deal, each player is dealt two cards, face-down. The dealer deals one card face-down (the hole card) and the other card face-up. Each player is basically playing a separate game based on the cards dealt and in relation to what the player thinks the dealer has. That player looks at the cards and determines if he can take another card without going over 21. It's important to get a good look at the dealer's face-up card because that could determine what strategy you decide to use in playing your own hand.\r\n\r\nThe cards from 2 through 10 have their face value, J, Q, and K are worth 10 points each, and the Ace is worth either 1 or 11 points (player's choice).\r\n\r\nThere are different game options of Blackjack like 'Split', 'Double' and also use 'Insurance' to win big bets in Blackjack.\r\n\r\nBlackjack brings Vegas to your phone with the same rules and settings of a casino gambling table right on your phone. Take a gamble and throw down your virtual chips if you're feeling lucky. But don't get too greedy. When you play free blackjack you got to know when to take a hit and when to stand steady. The right move can win you more chips and keep you in the game. \r\n\r\nOur game offers you all the excitement of the classic game of Blackjack by following the most popular rules and conventions for your ultimate free Blackjack experience.\r\n\r\nAnd while you may think this free blackjack game is simple, think again. It's not just about getting 21. It's how you get 21. \r\n\r\nChallenge yourself against the dealer to become a Blackjack superstar.\r\n\r\nHave a great time using your skills and a little good luck to enjoy the best Blackjack game around!\r\n\r\nDownload it today for free!\r\n\r\n★★★★ Blackjack Features ★★★★\r\n\r\n❖ 500 Free Chips everyday\r\n❖ Excellent graphics, optimized to run on all devices\r\n❖ Split and Double to win big bets\r\n❖ Intuitive Gameplay and Interface\r\n❖ Free coins, spin and win\r\n\r\nPlease rate and give your feedback for Blackjack for further improving the game.\r\n\r\nIt makes us happy to serve you even better.\r\n\r\nHave a nice time playing Blackjack!",
  "summary": "Blackjack also called 21 is one of the most popular casino card games.",
  "installs": "1,000+",
  "score": 3.8,
  "ratings": 10,
  "reviews": 1,
  "price": 0,
  "developer": "Ironjaw Studios Private Limited",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 16, 2017",
  "updated": 1492440620000,
  "version": "2",
  "appId": "casino.blackjack.cards",
  "searchTerms": "blackjack"
 },
 {
  "title": "Casino Roulette: Roulettist",
  "description": "Play the best free roulette game with millions of players from all over the world! \r\nA realistic roulette table with 3D graphics, featuring all varieties of roulette: three-sector European, \"double zero\" American and French with additional betting on sectors. \r\nPlace bets, take risks, improve your skills, and gain experience! Experiment and win to become the best online roulette player!\r\n\r\nGame features:\r\n• FREE CHIPS – Play the game every day to get free chips!\r\n• 3 VERSIONS OF ROULETTE – Try European, French and American roulette and choose the best for you.\r\n• ROULETTE TOURNAMENTS – Compete against lots of worthy opponents and try your luck!\r\n• GET REWARDS – Up the stakes, win games, take risks and unlock achievements.\r\n• QUESTS - Complete daily quests to get free chips!\r\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level-up. See how many roulette games you've won and achievements you've completed. Get unique properties and display them on your profile! View other players' profiles to see how you compare!  \r\n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other roulette players!\r\n• FAIR HAND DEALING GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest roulette experience.\r\n• LEARN TO PLAY – Are you new to roulette but always wanted to try it?\r\nOur simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about roulette, from the rules of the game to betting combinations.\r\n• 3D GRAPHICS – An absolutely free roulette game with stunningly realistic 3D graphics.\r\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\r\n• SINGLE ACCOUNT – Start playing free roulette on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.\r\n\r\n🔔🔔🔔 Want more than roulette? 🔔🔔🔔\r\nTry our other games for an unforgettable 3D experience: \r\n• TEXAS HOLD'EM POKER – The most popular casino game among professional gamblers! Test your skills in our amazing weekly poker tournaments!\r\n• SLOTS – Explore our themed slots with lots of unique features!\r\n• BLACKJACK – A simple game of \"21\". An exciting 3D game that any blackjack fan is sure to enjoy.\r\n• OMAHA POKER – A more dynamic version of poker, with 4 cards in your hand. Have more fun with amazing combinations!\r\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\r\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\r\n\r\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!  https://facebook.com/Pokerist\r\nFollow us on Twitter and get free chips!\r\nhttps://twitter.com/KamaCasino\r\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "summary": "An all-new, free roulette game with stunning, realistic 3D graphics",
  "installs": "1,000,000+",
  "score": 4.4156237,
  "ratings": 23341,
  "reviews": 7449,
  "price": 0,
  "IAPRange": "£0.50 - £99.99 per item",
  "developer": "KamaGames",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 24, 2013",
  "updated": 1588670596000,
  "version": "32.6.0",
  "recentChanges": "Stay home. Be safe!<br>We&#39;ve planned a lot of new features for you to enjoy!<br><br>New VIP System<br>VIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!<br><br>Weekly Rankings<br>Compete against other players and see how you rank each week!<br><br>Now MTT starts every 40 minutes!<br><br>Quicker Betting<br>Try raising a bet and you&#39;ll find a new option to bet 1/2 or the full pot! Raise faster!<br><br>Improved navigation in the lobby—now you can view playing tables in a chart.",
  "appId": "com.kamagames.roulettist",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21",
  "description": "Blackjack 21 free game is best casino card games. \r\n\r\n Blackjack 21 card game popular as \"Twenty one\" (21) / table no 21 or bj2. Its as famous game as classic solitaire cardgame. .\r\n\r\nWell, Bet big to win big, i am serious you will love the game play so keep play the long game smartly and prove you can beat the dealer and win the game!  Gmae Blackjack is top rated free card game which is popular in Europe and US casino.\r\n\r\n\r\nBlackjack gratuit is easy to play!  \tblackjack free - learn blackjack strategy \r\n\r\nBlackjack 21 2020 edition provides best simulation BlackJack casino 21 gmae with offline feature on your android phone. Blakjack is a one of the best casino banking isgame in the world. Bet like myvegas blackjack or blackjack with side bets and earn virtual chips with blackjack strategy. Blakjack mobile game is one of the most popular casino games in US, UK and other countries, called as playing jack or blackjack poker. Play free blackjack app for mobile & Play las Vegas Blackjack 21! Learn rules to blackjack and win at blackjack games free\r\n\r\n21 blackjack cards games billy Features -\r\n* Best game play of blackjack21\r\n* blackjack + classic card game features\r\n* Simple and effective controls\r\n* black jack free game with in-app purchases to buy virtual chips (5K,100K and 500k)\r\n* Beautiful UI \r\n* Dealers bkack jack tricks - best strategy card game \r\n* How to learn blackjack for understanding black jack rules\r\n* Learn How to play blackjack strategy or blackjack basic strategy\r\n*** !1 blackjack offline game\r\n* Blackjack Rules with help assistance\r\n* table no 21 game top card game\r\n* offline blackjack, call it right card game\r\n* simulation blackjack controls\r\n* blackjack with side bets newbie\r\n* card games popular\r\n\r\n★★DOWNLOAD this offline Blackjack21 game, be a blackjackist free casino blackjack playcard game on your device for FREE NOW! ★★\r\n\r\nvegas blackjack how to play 21 cardgame\r\n How to blackjack winner, learn and play more Blakjack is a one of the best 21 casino banking isgame in the world. If you get 21 points on the player's first two cards, without a dealer blackjack or reach a final score higher than the dealer without exceeding 21 or let the dealer draw additional cards until his or her hand exceeds 21, You will win the deal. You will get blackjack21. Its 21 blackjack hd in 2D interface of less than 7 MB. If you like Poker, Roulette or Slots like game then you will love this Casino Classic blackjack+ free\r\nchips game.\r\n\r\nHave fun, play black jack with friends with free Blackjack mobile game that is popular free card game which is truely casino game highly popular in US and other countries, part of top most free casino (roulette gratis) game. Practice free black jack 21 gambling game on your mobile and feel like you are sitting in las vegas 21 to play blackjack 21 free casino game. Feel free to share feedback of our 21 blackjack cards game. This casion game version supports blackjack play offline ; players can play with simulation blackjack anytime. Different chips from virtual 5k to 5. Be a smart blackjack players and learn new blackjack strategy or blackjack basic strategy. Blackjack mobile isgame for strategy maker.\r\n\r\nDifferent countries of are known as blackjack gratuit , flapjack 21 онлайн , блекджек , ぶらっくじゃっく,  21点 , 21点单机 , 21点黑杰克 , 21點狂人 and 21點黑傑克\r\n\r\nPlay blackjack free OFFLINE games !1 black jack  in any time and anywhere,hope you will love this Classical BlackJack card game. BlackJack21 game helps to learn blackjack rules and helping player to play & learn blackjack rules, this is one of smallest size of blackjack apps amongst all free blackjack game .\r\n\r\nPlease share feedback of top slot 21 blackjack free on mggames.inn@gmail.com improve black jqck game. Dont forget to share Blakjack isgame \"bj21\" to friends and family. Its friendly for blackjack ipad and tablets\r\n\r\nKeep playing happy casino 3d blackjack 21 - best blackjack offline",
  "summary": "Blackjack 21 popular card games popular  blackjack + casino 21 new offline gmae",
  "installs": "5,000+",
  "score": 4.177778,
  "ratings": 45,
  "reviews": 18,
  "price": 0,
  "IAPRange": "£0.99 - £18.99 per item",
  "developer": "MGGAMES",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 13, 2016",
  "updated": 1580794161000,
  "version": "1.3",
  "recentChanges": "WIN BIG in #1 Blackjack 21 card game!<br>*** Have a real blackjack experience with Improved Interface",
  "appId": "com.mggames.blackjack21",
  "searchTerms": "blackjack"
 },
 {
  "title": "AA Poker - Holdem, Omaha, Blackjack, OFC",
  "description": "THE BEST FREE POKER APP!\r\nALL BEST HOLD’EM POKER GAMES ARE HERE AT AA POKER!\r\n\r\nMULTI-TABLE TOURNAMENT, TEXAS HOLDEM POKER, OMAHA HOLDEM, Progressive OFC, OFC Poker, Blackjack, Short Deck\r\nPairs, Straight, Flush, Full House!\r\n\r\nFeel the excitement playing multi-table poker game with every mobile devices. \r\nWIN BIG POT WITH BEST HANDS YOU GET!\r\n\r\n* AA Poker Features *\r\n\r\nDAILY BONUS CHIPS\r\n- Collect Check-In Bonus every day\r\n- Free Rewards every 4 Hours through lucky spin\r\n- Invite your friends to play and make your day with more REWARDS.\r\n- Exhausted all your Chips? Don't be disappointed, free refill bonuses 3 times a day!\r\n\r\nTexas Hold’em Poker Multi Table Tournaments\r\n- Improve your poker skills while playing AA Poker Tourney every day!\r\n- AA Poker offers you variants of hold’em tournaments: Freeroll, Speed tourney, Hyper-Turbo, SitnGo, Satellite to win Tournament ticket.\r\n\r\nDaily Big Tournaments\r\n- Join daily Big Tourney with undeniable guaranteed prize every day at 9 PM (GMT+9). Be on top of poker tournament world!\r\n\r\nExclusive AA Poker Event\r\n- Special events await every month with so much benefit!\r\n\r\nVarious Holdem Games\r\n- Short Deck, No Limit Holdem, Omaha and Ante\r\n- It's just best thing that can happen to you whenever you are going to all-in, just insure your cards to avoid losing all chips\r\n\r\nOpen Face Chinese Poker\r\n- The latest trend in Poker Game is OFC poker! Set the cards in \"row\" and create three hands in a 3-5-5 order from lowest to the highest.\r\n\r\nProgressive Open Face Chinese Poker\r\n- It's progressive! You are getting more cards in Fantasyland depending on your row Hand. Get maximum 17 Cards in Fantasyland and have bigger chance to win.\r\n\r\nSportsbook\r\n- Win more chips! How about to bet?\r\n\r\nBlackjack\r\n-  Deal till '21'! Hit, Stand, Split what's your choice?!\r\n\r\nFacebook & Google Log-In\r\n- Fast and Easy to access with social network account, Facebook or Log-In with your Gmail account.\r\n\r\nDeal your cards and face up to opponents!\r\nCheck! To see the action. Raise! Hand with proud. All-In! To win.\r\n\r\nYou can subscribe our fanpage to see more events here at www.facebook.com/playaapoker\r\n\r\n\r\n※ The games are intended for an adult audience.\r\n※ The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n※ Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "Best Poker Game for Aces!<br>Experience AA Poker now~",
  "installs": "10,000+",
  "score": 3.53,
  "ratings": 502,
  "reviews": 194,
  "price": 0,
  "IAPRange": "£0.89 - £184.99 per item",
  "developer": "Memoriki Limited",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 8, 2014",
  "updated": 1587719414000,
  "version": "2.0.36",
  "recentChanges": "[Updates]<br>●  New Game Mode, All-In or Fold  Added!",
  "appId": "com.memoriki.fulpotpoker",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21 HD",
  "description": "Blackjack 21 HD offers a great opportunity to train and master your casino blackjack strategy!\r\n\r\nAbsolutely free -> You don't have to spent money to get more chips with the level up bonus chips!\r\nMaster your skills: Learn, train and become the master of vegas casino Blackjack!\r\nStunning variety of themes -> Beautiful casino card and table themes inspired by vegas casinos.\r\nChoose your own rules -> Modify Blackjack 21 HD to suit your desired strategy.\r\nAmazing gameplay -> Classic Blackjack 21 gameplay, simple controls, georgeous animations and HD graphics.\r\n\r\nIn Blackjack21 HD the goal is to reach the closest value to 21 as possible without exceeding it. \r\nMake sure to not go over the value of 21 as this will automatically make you loose your chip bet.\r\nAt the end of each round if the dealer's hand total value is closer to 21 as yours the dealer wins.\r\nIf your hands total value is the same as the dealers the round results in a push and you get your chips back.\r\n\r\nThe cards value are as follows: \r\nCards ranging from 1-10 count as much as their value says. A 10 of Spade counts as 10, 5 of Heart counts as 5 etc.\r\nThe face cards Jack, Queen, King count as 10 points each. \r\nAn Ace can count both as 1 and 11. \r\n\r\nIt is possible to split a hand of cards when both cards have the same value (for example 9 of Hearts and 9 of Spades).\r\nAfter a split both hands can win independent of each other.\r\n\r\nJust as in a real vegas casino you can choose to \"double down\". In this case the chip bet is doubled and you are no longer able to draw any more cards.\r\n\r\nIn Blackjack 21 HD winning and loosing goes hand in hand, it is a matter of skill and chance, sometimes you win, sometime you don't. \r\nThe cards are randomly shuffled and you can also decide how many decks of cards you want to play with.\r\n\r\nIn Blackjack 21 HD the rules are as in a classic vegas casino Blackjack game:\r\n- Dealer must draw to 16 and stand on all 17s\r\n- Blackjack pays 3:2\r\n- Insurance pays 2:1\r\n\r\nPlease note: Blackjack 21 HD does not offer real money gambling or an opportunity to win real money or prizes.",
  "summary": "Blackjack 21 HD - Classic game with an unique taste!",
  "installs": "50,000+",
  "score": 4.33,
  "ratings": 238,
  "reviews": 75,
  "price": 0,
  "IAPRange": "£2.09 per item",
  "developer": "SITDZenith",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 20, 2016",
  "updated": 1495550078000,
  "version": "1.0",
  "recentChanges": "Added new Backgrounds + minor fixes",
  "appId": "com.pandagasgdx.blackjack.android",
  "searchTerms": "blackjack"
 },
 {
  "title": "Master Blackjack 21 - Free Blackjack Vegas Casino",
  "description": "Enjoy the popular Blackjack Vegas 21 casino games on your mobile anytime anywhere today, only with Master Blackjack 21 - Free Blackjack Vegas Casino. Experience the ultimate blackjack online just like Vegas with the most glamorous graphic designs and entertaining sound effects.\r\nPlace your betting chips on the table and start beating the dealer’s hand to win big today with the most awesome features below:\r\n- Real authentic blackjack online experience to test your blackjack strategy and skills to train for the real deal in Vegas!\r\n- Absolutely FREE to download and enjoy the lucky blackjack casino games online and offline\r\n- No internet nor wifi required to win big in this Blackjack free simulator\r\n- No risk of losing your money and start preparing for real Las Vegas blackjack 21 casino games now\r\n- Daily free bonus chips to place bigger bets and win more\r\n \r\n- Beautiful HD blackjack table graphic designs and unique card design keeping you fun and entertained\r\n- Try different blackjack vegas 21 card strategy and train your skills being blackjack expert before your real adventure in real casino floors\r\n- Premium blackjack with the most authentic and rewarding blackjack 21 casino games journey to enjoy\r\nWhat are you waiting for? A real hot blackjack online casino games is waiting for you to join and win big at Master Blackjack 21 - Free Blackjack Vegas Casino. An absolutely best black jack 21 experience you could have at your fingertips. Easy to play and test out your blackjack vegas winning strategy today.",
  "summary": "Feel lucky today with the best Blackjack 21 casino games FREE online and offline",
  "installs": "100+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "IAPRange": "£0.89 - £47.49 per item",
  "developer": "Vegas Fever Casino: Slots Roulette Bingo Blackjack",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 16, 2020",
  "updated": 1580885261000,
  "version": "1.4",
  "recentChanges": "Feel lucky today with the best Blackjack 21 casino games FREE online and offline",
  "appId": "com.vegas.fever.casino.master.blackjack21.free.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Verite Free",
  "description": "BV-F is the free version of Blackjack Verite Games supporting basic strategy without the advanced options. This is a practice app for Blackjack designed to operate on tablets and smartphones. BV-G is modeled after Casino Verite Blackjack, mentioned in 25 books. BV-F features include:\r\n\r\nRealistic graphics – Screen space is not wasted on cartoonish graphics, like glowing tables. Useful graphics, cards, shoes and discard trays, are realistic, regulation casino-style, images. For example, there are 228 photo-realistic images of discard trays and shoes merged into a felt table.\r\n\r\nCasino Database – A database of U.S. and Canadian casinos is included. Subscribers to CBJN may download monthly updates. \r\n\r\nThe Table – One, two, four and six seat tables are allowed in landscape mode. One or two seats in portrait. (Phones only support portrait for the table.) You can play one to six seats at once. You can split to four hands in each seat.\r\n\r\nGestures – All decisions can be made with gestures or by tapping.\r\n\r\nStandard Options – You can set number of decks, shuffling rules and burn cards. You can play any or all seats and/or let computer players play in selected seats.\r\n\r\nStatistics – Statistics are kept, errors logs are kept, and error counts are kept by hand. \r\n\r\nWe also have an online 540 page free book on Blackjack and the most active Blackjack forum on the web.\r\n\r\nFor the full features of BV-G, see Blackjack Verite Games.",
  "summary": "A practice app for Blackjack modeled after Casino Verite mentioned in 25 books.",
  "installs": "1,000+",
  "score": 4.117647,
  "ratings": 34,
  "reviews": 17,
  "price": 0,
  "developer": "QFIT (Norman Wattenberger)",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 28, 2013",
  "updated": 1558110225000,
  "version": "Varies with device",
  "recentChanges": "New device support",
  "appId": "com.nsbasic.bjfree",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21 - ENDLESS & FREE",
  "description": "Blackjack, also known as twenty-one or Blackjack 21, is a great casino card game!\r\nA fun free and simple card game, where you can play an endless game of black jack.\r\nNo ads in this offline game.\r\n\r\nBet your chips and see if you can get 21 to beat the dealer!\r\nSplit when you have the same card values or Double Down when you're about to hit a winning hand.\r\nThere is no insurance for the fun in this game, just start with a fresh new chip stack.\r\n\r\nCompete against friends with leaderboards to see who is the best card player!\r\nClaim Great Blackjack 21 achievements in Google Play Games.\r\n\r\nNote:\r\n-This easy to use app is offered for free by the offline Poker Game: GOVERNOR OF POKER !\r\n-If you have any questions, please send a mail to: Support@youdagames.com",
  "summary": "Free Blackjack game, Offline 21 Blackjack Casino game. Twenty-one card game",
  "installs": "10,000+",
  "score": 4,
  "ratings": 131,
  "reviews": 66,
  "price": 0,
  "developer": "Youda Games Holding B.V.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 19, 2016",
  "updated": 1538487453000,
  "version": "1.0.7",
  "recentChanges": "Fixed some bugs<br>Added support for more resolutions",
  "appId": "com.youdagames.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Trainer",
  "description": "Learn how to play blackjack by memorizing the optimal blackjack strategy. \r\n\r\nFeatures:\r\n- Blackjack Training\r\n- Timed Challenge\r\n- Card Counting\r\n- Point system to purchase upgrades\r\n- Online Leaderboards",
  "summary": "Learn how to play blackjack!",
  "installs": "5,000+",
  "score": 3,
  "ratings": 9,
  "reviews": 3,
  "price": 0,
  "IAPRange": "£0.69 - £1.39 per item",
  "developer": "DDevelopments",
  "genre": "Educational",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 23, 2017",
  "updated": 1542074186000,
  "version": "1.6",
  "recentChanges": "Added privacy policy<br>Removed music<br>Removed Twitter integration<br>Cleaned up code",
  "appId": "com.DDeveloper.BlackJackTrainer",
  "searchTerms": "blackjack"
 },
 {
  "title": "Simple Blackjack",
  "description": "It's a simple 1 on 1 blackjack game with the dealer.\r\n\r\nNo wager function\r\n5 card rule(when the player reaches 5 cards without busting, the player will automatically win)\r\nTurn on/off background music function\r\n\r\nIt is suitable for killing time.\r\n\r\n*Sound & Music:Maoudamashii",
  "summary": "It&#39;s a simple blackjack game.",
  "installs": "1,000+",
  "score": 4.571429,
  "ratings": 7,
  "reviews": 5,
  "price": 0,
  "developer": "DeveloperMas",
  "genre": "Card",
  "contentRating": "PEGI 3",
  "released": "Mar 21, 2018",
  "updated": 1529568655000,
  "version": "1.2",
  "recentChanges": "Screen orientation lock",
  "appId": "com.smasa.simpleblackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack 21 Free",
  "description": "Blackjack 21 is an exciting game that any player is sure to enjoy. Place a bet, get more points than the dealer and win chips. Feel the risk as you dive into a casino atmosphere and catch fortune by the tail. \r\n\r\nBlackjack is also know as 21 or twenty-one is a widely played casino banking game. \r\n\r\nBlackjack is one of the easiest games to play in a casino and offers you one of the strongest odds of winning. Without a doubt, it is the most popular table game in the United States. \r\n\r\nThe objective of the game is to beat the dealer. In order to beat the dealer, you need to get cards that get you close to 21, but not over. While not going over 21, you have to outscore the dealer or have him go bust. \r\n\r\nWhen the game of blackjack 21 starts the player is dealt with a two cards and add together the value of their cards. The Face cards which are kings, queens and jacks are counted as 10 points. The dealer and the player count an ace as 1 point or 11 points, and all other cards are counted according to the numeric value shown on the card. The players after receiving their first two cards, have an option of getting a hit by taking an additional card, Stand, Double or Split. The player or the dealer wins by having a score of 21 or by having the higher score that is less than 21. \r\n\r\nHaving a score higher than 21 is going bust or called busting which will result in a loss. The player playing blackjack 21 can win by having any score equal to or less than 21 if the dealer 'busts'\r\n\r\nBlackjack is most certainly a game of decisions, and what you decide has an effect on your outcome. \r\n\r\nWith our Blackjack 21, you can sit in the comfort of your home, without the risk of losing all your money.\r\n\r\nSo what are you waiting for? Sharpen your Blackjack 21 skills before visiting the casinos and win those big bets!! \r\n\r\nTry Blackjack 21 HD today– just make sure you don’t exceed 21 points!\r\n\r\nBlackjack 21 is absolutely FREE! Download it today! \r\n\r\n❖❖❖❖ Blackjack 21 Free Features ❖❖❖❖\r\n\r\n✔✔ 500 Free Chips everyday\r\n✔✔ Phone and Tablet Support\r\n✔✔ Split and Double to win big bets\r\n✔✔ Intuitive Gameplay and Interface\r\n\r\nPlease take your time to rate your experience with this addictive game Blackjack 21 and write a short Review.\r\n\r\nWe will be grateful to hear your opinions and improve - whenever needed - in future versions.\r\n\r\nHave a nice time using Blackjack 21!",
  "summary": "Blackjack 21 Free is a popular card game played at casinos worldwide.",
  "installs": "10,000+",
  "score": 4.1694913,
  "ratings": 59,
  "reviews": 22,
  "price": 0,
  "developer": "DroidVeda LLP",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 22, 2015",
  "updated": 1492175677000,
  "version": "1.5",
  "recentChanges": "minor bug fixes",
  "appId": "com.casino.blackjack.pro.droidveda",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Strategy Trainer",
  "description": "Blackjack Strategy Trainer is an app lets you play the game while learning the best strategy. All table rules can be customized and the strategy is adjusted accordingly. The strategy card for your specific table settings is included in the menu.\r\n\r\nThe app offers two game modes:\r\n\r\n- Normal game mode\r\nThis mode lets you play a regular game of blackjack. A strategy card is given in the menu and the game tells you when you make a mistake. This way you can play a full game of blackjack while still learning the basic strategy.\r\n\r\n- Quick trainer mode\r\nIn this mode you will only see a hand of two cards and the first card of the dealer. You select what the correct strategy should be for each set of cards. This mode is best if you want to quickly memorize the basic strategy without having to play a full game of blackjack.\r\n\r\nPrivacy Policy:\r\nWe keep this app free by showing ads provided by Google AdMob. This app does not collect any Personal Data. However, through the use of Google AdMob personalized ads may be shown. Google Ads Settings lets users view and edit their interests and demographics. Some users may choose to opt out of personalized ads. Go to to following link to edit your interests: https://adssettings.google.com",
  "summary": "Play blackjack while learning the correct decision for every hand!",
  "installs": "10,000+",
  "score": 4.131579,
  "ratings": 76,
  "reviews": 47,
  "price": 0,
  "developer": "BST Team",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 10, 2018",
  "updated": 1563818917000,
  "version": "3.0.5",
  "recentChanges": "- 64 bit compatibility update<br>- Privacy policy and consent updated",
  "appId": "com.companyname.Blackjack_trainer",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "This Blackjack game developed as part of an assignment at Lorain County Community College (LCCC).\r\n\r\nThe Blackjack online game uses six decks of cards and gives the online player five hundred chips.  The online player uses the slider to identify the amount of the placed bet and to reduce the available chips accordingly. When the online player presses the Play button, the online player and the dealer receive two cards.  The online player cards are both face up.  The dealer receives one card face up and one card face down. This Blackjack game gives the online player options to Hit (take another card) or Stand (keep the cards that have been dealt) as happens at a Casino.  \r\n\r\nThe dealer flips the card turned faced down when the online player presses the Stand button or when the first two dealer cards equal exactly 21 points. The dealer player follows simple rules. A dealer takes a hit (receives a card) on 16 points or lower. A dealer stands on 17 points or greater.  The dealer takes no hit when the game declares a bust for the online player.\r\n\r\nThe game declares a Win (higher score), Bust (loss of game), or Push (equal score) for the online player based on the highest score equal to or less than 21 between the player and dealer. Game automatically declares a winner when the dealer and/or the player have 21 points with the first two cards that are dealt.  Game automatically declares a Win or Push when a player reaches 21 points.  Game automatically declares a Bust (loss of game) when a player goes over 21.\r\n\r\nGame declares a Win, Bust, or Push when the online player presses the Stand button. Game declares a Win when the online player has a higher score than the dealer or when the Dealer goes over 21 points. Game declares a Bust when the online player has a lower score than the dealer. Game declares a Push when the player and the dealer have the same score.  \r\n\r\nIn the case of a Push the player receives chips equal to the placed bet. In the case of a Win the online player receives the chips equal to the bet plus an equal amount of chips based on the bet. If the player receives a Win based on Blackjack (exactly 21 points), the player receives the chips equal to the bet plus two times the amount of chips based on the bet. In the case of a Bust the player loses the chips equal to the bet.",
  "summary": "Practice Blackjack skills for free in this online and ad free game.",
  "installs": "10+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "Brenda Stevens",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 22, 2020",
  "updated": 1583836411000,
  "version": "4.1",
  "recentChanges": "This release includes layouts for additional Android phone devices.",
  "appId": "com.bs.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Casino Blackjack",
  "description": "No! The object of blackjack is to beat the dealer. \r\n\r\nTo beat the dealer the player must first not bust (go over 21) and second either outscore the dealer or have the dealer bust.\r\n\r\nKey feature: \r\n\r\n* Gorgeous HD graphics and slick, fast gameplay\r\n* Realistic sounds, and smooth animations\r\n* Fast and clean interface.\r\n* Offline playable: you dont need an internet connection to play this game, it run perfectly fine when offline\r\n* Constant playing: you don't need to wait for other player to play this game\r\n* Completely free: you don't need any money to play this game, the chips in the game are also free to get.\r\n\r\nHere are the full rules of the game.\r\n\r\n+ Casino Blackjack may be played with one to eight decks of 52-card decks.\r\n\r\n+ Aces may be counted as 1 or 11 points, 2 to 9 according to pip value, and tens and face cards count as ten points.\r\n\r\n+ The value of a hand is the sum of the point values of the individual cards. Except, a \"blackjack\" is the highest hand, consisting of an ace and any 10-point card, and it outranks all other 21-point hands.\r\n\r\n+ After the players have bet, the dealer will give two cards to player and two cards to himself. One of the dealer cards is dealt face up. The facedown card is called the \"hole card.\"\r\n\r\n+ If the dealer has an ace showing, he will offer a side bet called \"insurance.\" This side wager pays 2 to 1 if the dealer's hole card is any 10-point card. Insurance wagers are optional and may not exceed half the original wager.\r\n\r\n+ If the dealer has a ten or an ace showing (after offering insurance with an ace showing), then he will peek at his facedown card to see if he has a blackjack. If he does, then he will turn it over immediately.\r\n\r\n+ If the dealer does have a blackjack, then all wagers (except insurance) will lose, unless the player also has a blackjack, which will result in a push. The dealer will resolve insurance wagers at this time.\r\n\r\n+ Play begins with the player to the dealer's left. The following are the choices available to the player: \r\nStand: Player stands pat with his cards.\r\n\r\n\t+ Hit: Player draws another card (and more if he wishes). If this card causes the player's total points to exceed 21 (known as \"breaking\" or \"busting\") then he loses.\r\n\r\n\t+ Double: Player doubles his bet and gets one, and only one, more card.\r\n\r\n\t+ Split: If the player has a pair, or any two 10-point cards, then he may double his bet and separate his cards into two individual hands. The dealer will automatically give each card a second card. Then, the player may hit, stand, or double normally. However, when splitting aces, each ace gets only one card. Sometimes doubling after splitting is not allowed. If the player gets a ten and ace after splitting, then it counts as 21 points, not a blackjack. \r\n\r\n\t+ Surrender: The player forfeits half his wager, keeping the other half, and does not play out his hand. This option is only available on the initial two cards\r\n\r\n+ After each player has had his turn, the dealer will turn over his hole card. If the dealer has 16 or less, then he will draw another card. A special situation is when the dealer has an ace and any number of cards totaling six points (known as a \"soft 17\"). At some tables, the dealer will also hit a soft 17.\r\n\r\n+ If the dealer goes over 21 points, then any player who didn't already bust will win.\r\n\r\n+ If the dealer does not bust, then the higher point total between the player and dealer will win.\r\n\r\n+ Winning wagers pay even money, except a winning player blackjack pays 3 to 2.\r\n\r\nDownload Casino Blackjack now for free!\r\n\r\nBlue Wind casino\r\nBring the casino to your home",
  "summary": "Is the object of blackjack to get as close to 21 as possible without going over?",
  "installs": "5,000+",
  "score": 4.1149426,
  "ratings": 87,
  "reviews": 30,
  "price": 0,
  "IAPRange": "£0.89 - £2.69 per item",
  "developer": "Blue Wind Studio",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 28, 2018",
  "updated": 1588859746000,
  "version": "1.3.0",
  "recentChanges": "+ Improved betting function<br>+ Added 21+3 and Match Dealer side bet<br><br>Enjoy the game!<br>Bring the casino to your home!",
  "appId": "com.bluewind.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Casino style Blackjack game.   Play against the computer opponent and improve your blackjack skills.  \r\n\r\nFeatures of this game include\r\n* Split to 2 levels\r\n* Select from $10, $20, $50 and $100 table\r\n\r\nI wrote this as a learning aid, and I hope that you enjoy practicing your Blackjack skills, so that hopefully if you do hit the Casinos, you can be a little more successful.\r\n\r\nThe rules mirror the rules for Blackjack in Australia at some of our popular casinos.  The rules implemented are:\r\n\r\n* 8 decks, dealt from shoe\r\n* Double on 9, 10, 11\r\n* Split to 2 hands\r\n* Only one card dealt on Ace Splits\r\n* Double after split\r\n* Blackjack pays 3:2\r\n* First card from shoe burnt\r\n* Dealer Ace as first card counts as 11\r\n* Dealer will Hit lower than Soft 17",
  "summary": "Classic Blackjack as played in Casino",
  "installs": "5,000+",
  "score": 3.9629629,
  "ratings": 54,
  "reviews": 5,
  "price": 0,
  "developer": "PS Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 22, 2013",
  "updated": 1424439817000,
  "version": "3.4",
  "recentChanges": "3.4<br>* Added Google Leaderboards and Achievements<br>* Added Instructions<br>3.1<br>* hit on soft 17, fine tuning graphics<br>* fix dealer rules<br>* fixed help screen<br>3.0 - updated to 720*960 resolution<br>2.0 - Reduced Permissions<br>1.2 - Implemented many of the Casino rules, as well as split<br>1.3 - Full implementation of Australian rules stated <br>     - Ability to select from different tables<br>     - Fixed payout for Blackjack<br>1.5 - Fixed calculation for Double <br>      - Stop cards from extending over the screen",
  "appId": "com.pvella.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "BLaCKJaCK",
  "description": "Here you have the first version of the amazing game BlackJack a casino poker card game in which every player try to get as close as possible to the number 21 to win the game. On each round, the role of the bank changes, the bank also plays the game.\r\nBlack Jack is one of the famous poker card games known! you’ll find an improved interface and a new global TOP score board system.\r\n\r\nYou can either choose the online mode, or the practice mode to improve your game!\r\n\r\nDo you wanna play BlackJack?\r\n\r\nChat with your fellow players, and challenge players all over the world!\r\n\r\nChoose your name, select an avatar and you’re ready to play! Choose practice mode, or multiplayer!\r\n\r\nPolish your game playing solo mode. You’ll be able to adjust the speed of the game to the most challenging, or change the color of the board.\r\n\r\nGet your position on the Worldwide TOP players with online mode. Challenge either your friends or family, or random people, all of them competing to become the best.\r\n\r\nJoin the first online round of the classic game, BlackJack!\r\n\r\nEnter or leave multiplayer games as you want, chatting with everyone on the table, and improving your scores. \r\n\r\nCheck our updated global score board, challenge players all over the world to get to the top!\r\n\r\nBlack Jack is a classic poker card game with this rules:\r\n★ The main objective of BlackJack game is to get as close as possible to the number: 21. \r\n★ On each round, the role of the bank changes, the bank also plays the game.\r\n★ The bank deals one card to each player, and one goes to the center of the table, this card is not shown. \r\n★ The first player is the one sitting on the right side of the bank, he can either ask for another card or stick to what he has.\r\n★ You can either ask for a card, or stick to what you have. If your number is too high or too low, you lose.\r\n★ If there’s a tie, the bank always has preference, or the player closer to him counter clockwise.\r\nThis is the value of the cards on BlackJack:\r\n★ The value of the cards corresponds to their number, except figures that are 10 points.\r\nPunctuation on BlackJack:\r\n★ At the end of the round, the winner gets 20 points if he has BlackJack, or five points if he doesnt.\r\n★ The rest of the players, get -5 points if their number is higher than 21, or -1 if they stand with what they had.\r\n\r\nJoin the biggest game of the legendary game, BlackJack!\r\n\r\nTechnical features:\r\n★ Fluent and accessible game\r\n★ No need of registration\r\n★ Customizable name\r\n★ Many avatar possibilities to choose\r\n★ Change the color of the board as you play\r\n★ Practice Mode available without connection, and adjustable speed\r\n★ Worldwide Online Mode\r\n★ Global TOP 50 players\r\n\r\nBlackJack is one of the famous casino poker card game of all times, Black Jack is a classic poker card game.\r\n\r\nIf you like card games, board games, poker-like games, the betting, the challenge, chatting to people all over the world and get to out TOP 50. \r\n\r\nYou can also enjoy our other card games: MuS, EsCoBa, BRiSCa, SoLiTaRio, PReSiDeNTe, CiNQuiLLo, CiNQuiLLo CaBRóN or SieTe & MeDia, BRiSCa, PoCHa, Bingo, TRuCo, Domino, Backgammon, or Crazy Eights.\r\n\r\nHope you have fun with our completely free card games!\r\n\r\nPlease, rate our app or recommend it to your friends! Also, +1. Thanks!\r\n\r\nMore Classic Games coming soon. \r\n\r\nFOLLOW  TxL ESTUDIOS ON TWITTER! \r\nhttps://twitter.com/TxLestudios\r\n\r\nLIKE  TxL ESTUDIOS ON FACEBOOK! \r\nhttps://www.facebook.com/TxlEstudios\r\n\r\nTxL Estudios - Creating online free card games since 2010\r\nhttp://www.txlestudios.es",
  "summary": "First version of the amazing game BlackJack a casino poker card game online",
  "installs": "1,000+",
  "score": 3.6,
  "ratings": 10,
  "reviews": 3,
  "price": 0,
  "developer": "TxL",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 28, 2016",
  "updated": 1582187469000,
  "version": "1.2",
  "recentChanges": "SDK update<br>Minor changes<br>bug fixing",
  "appId": "com.txl.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack Offline",
  "description": "Blackjack is the most popular casino table game. Equally well known as Twenty-One.\r\n\r\nBlackjack card game objective is that each participant attempts to beat the dealer by getting a count as close to 21 as possible, without going over 21.\r\n\r\nWhen the game of blackjack 21 starts the player is dealt with two cards and add together the value of their cards. The Face cards which are kings, queens and jacks are counted as 10 points. The dealer and the player count an ace as 1 point or 11 points, and all other cards are counted according to the numeric value shown on the card. The players after receiving their first two cards, have an option of getting a hit by taking an additional card, Stand, Double or Split. The player or the dealer wins by having a score of 21 or by having the higher score that is less than 21. \r\n\r\nThe rules of blackjack are simple enough to understand: Beat the dealer’s hand total without exceeding 21. That’s it in a nutshell. \r\n\r\nThe challenge in blackjack lies in knowing when to hit and when to stand, when to double and when to take insurance. A basic Blackjack strategy is enough to get you off to a good start. Remember, in blackjack you’re only playing against the dealer. Games are quick, and smart decisions can pay off handsomely.\r\n\r\nBlackjack is not just a game of chance. While a lot depends on the luck of the draw, there are many strategies to better your odds of winning.\r\n\r\nBlackjack or 21 is the popular casino card game.\r\n\r\nThe rules are simple, the play is thrilling, and there is opportunity for high strategy. In fact, for the expert player who mathematically plays a perfect game and is able to count cards, the odds are sometimes in that player's favor to win.\r\n\r\nThis easy to use, simple Blackjack game will certainly become your new favorite.\r\n\r\nHave a great time using your skills and a little good luck to enjoy the best Blackjack casino card game around!\r\n\r\nDownload it today for free!\r\n\r\n★★★★ Blackjack Features ★★★★\r\n\r\n❖ Offline Gameplay\r\n❖ 1000 Free Bonus Chips everyday\r\n❖ Earn bonus chips in every level up\r\n❖ Wallet for Bonus chips \r\n❖ Statistics to know Player Stats\r\n❖ Split and Double to win big bets\r\n❖ Intuitive Gameplay and Interface\r\n❖ Excellent graphics, optimised to run on all devices\r\n\r\nPlease don't forget to Rate and Review Blackjack, we aim to make it one of the best card games out there.\r\n\r\nAny suggestions? We always love to hear from you for making this game better.\r\n\r\nEnjoy playing Blackjack!!",
  "summary": "Blackjack Offline is a great way to play Blackjack 21 anytime, anywhere",
  "installs": "1,000+",
  "score": 3.6153846,
  "ratings": 13,
  "reviews": 12,
  "price": 0,
  "developer": "Floating Ninja Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Oct 17, 2019",
  "updated": 1574407663000,
  "version": "1.1.0",
  "recentChanges": "Minor Bug fixes",
  "appId": "blackjack.free.card.game",
  "searchTerms": "blackjack"
 },
 {
  "title": "Spanish BlackJack",
  "description": "Play Blackjack as if you were at the casino! \r\n\r\nPlay blackjack against the dealer and see who can get 21 without going bust! \r\n\r\n√ Large high quality cards and chips \r\n√ Leaderboard to boast your score \r\n√ The table maximum limit is 20,000  \r\n√ The player's blackjack always wins \r\n√ A total of 21 always wins for the player unless the dealer has a blackjack \r\n√ Blackjack pays 3 to 2  \r\n√ Insurance pays 2 to 1  \r\n√ A 21 composed of 6-7-8 or 7-7-7 of mixed suits pays 3:2, of the same suit pays 2:1, and of spades pays 3:1 \r\n√ A five-card 21 pays 3:2, a six-card 21 pays 2:1, and a 21 with seven or more cards pays 3:1 \r\n√ Dealer must hit on soft 17 and stand on hard 17 or higher score \r\n√ Split option available if the first two cards are the same, inclusive of Aces  \r\n√ Double down option available on any total and on any number of cards  \r\n√ Double after split is allowed, but only once per individual hand \r\n√ Surrender option available at any time before the dealer checks for the hold card \r\n√ Insurance option available if the dealer's first card is Ace \r\n√ Play with 48-card Spanish decks, which are standard 52-card decks with the 4 ten-spot cards removed \r\n√ Shuffling after half of the 6-deck cards played",
  "summary": "Play Spanish Blackjack 21 as if you were at the casino!",
  "installs": "10,000+",
  "score": 3.09,
  "ratings": 105,
  "reviews": 32,
  "price": 0,
  "developer": "奇遊創意網路科技有限公司",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 25, 2013",
  "updated": 1573573400000,
  "version": "4.6",
  "recentChanges": "Performance tuning.<br>Bug fixes.",
  "appId": "com.qiyofun.android.game.spanish21",
  "searchTerms": "blackjack"
 },
 {
  "title": "Blackjack",
  "description": "Fan of card games such as Solitaire, Spider Solitaire Belote and casino games like Poker?\r\n\r\nThen you are going to love this amazing version of the famous casino game Blackjack, also known as Blackjack 21, 21 or twenty-one!\r\n\r\nThe main goal of Blackjack 21 is:\r\n\r\nEach participant attempts to beat the dealer by getting a count as close to 21 as possible, without going over 21.\r\nIt is up to each individual player if an ace is worth 1 or 11. Face cards are 10 and any other card is its pip value.\r\n\r\nPlay Blackjack 21 in a casino atmosphere of Las Vegas and beat the dealer at his own game!\r\n\r\nIn this amazing version of Blackjack, you will be able to:\r\n\r\n- Take on challenges to win free tokens (coins)\r\n- Take insurance in case the dealer make a Blackjack\r\n- Make different bets thanks to 1 up to 200 dollars value tokens\r\n- To split your pairs in order to double your gains (or triple them)\r\n- The possibility to stay, draw or double\r\n- and much more!\r\n\r\nYou can also access numerous stats in real-time to measure your progress and see your bets and victories. Careful not to bust!\r\n\r\nFunctionalities:\r\n- Blackjack pays 3 to 2\r\n- Insurance pays 2 to 1\r\n- Dealer draw at 16, stays at 17\r\n\r\nIf you get over 21: it's a bust! (you lose your bet)\r\nIf you get 21 with an Ace and an honor: it's a blackjack! (you double your bet)\r\nIf you get the same as the dealer, it's a push! (you get back your chips)\r\n\r\nYou love casino games, but you don't want to bet any real money? Then download right now Blackjack 21 - casino game! Enjoy!",
  "summary": "The ultimate casino game!",
  "installs": "1,000+",
  "score": 4.2,
  "ratings": 10,
  "reviews": 4,
  "price": 0,
  "IAPRange": "£1.09 - £22.49 per item",
  "developer": "VALIPROD",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jul 25, 2017",
  "updated": 1543075946000,
  "version": "2.0.0",
  "recentChanges": "- privacy policy<br>- added the possibility the subscribe",
  "appId": "com.valiprod.blackjack",
  "searchTerms": "blackjack"
 },
 {
  "title": "Puzzle 21 - Blackjack Solitaire Hybrid",
  "description": "Welcome to Puzzle Twenty-one; a whole new puzzle challenge! In this original puzzle game you must get the most points from a deck of cards by making columns that add up to 21.\r\n\r\nThis is NOT a gambling game. It is a solo puzzle game inspired by crossing Solitaire and Patience with the scoring system of Blackjack.\r\n\r\n♠️ HOW TO PLAY ♠️\r\nTake one card at a time from the deck, and assign it to a column. Attempt to make the sum of the cards add to twentyone, but don’t go over.\r\n\r\nBetween getting a new card, you may choose to hit ‘Stay’ to take the points, or you can take a chance and draw the next card.\r\n\r\nAces are worth 1 or 11 points. Getting a Twenty-one is worth double points, getting a Blackjack (a Twenty-one with only 2 cards) is triple points!\r\n\r\nThe goal: Get the most points with a deck of 52 cards.\r\n\r\n♠️ FEATURES ♠️\r\n● Excitement: Just the right mix of skill along with the thrill of getting lucky, but without a gambling component. \r\n● Depth: Unlock new rules that allow you to earn more points and get even higher scores.\r\n● Compete: See how you measure up on the leaderboard. Beat your friends’ scores and become the best card sharp.\r\n● Customise: Unlock new Decks, Card Backs, and Tables.\r\n● Haptic feedback adds a sense of immersion (this can be turned-off in the settings).\r\n\r\nPlay something new but familiar, and try Puzzle Twenty-one today!",
  "summary": "Solitaire meets Blackjack in this fun puzzle card game. Get the best score!",
  "installs": "100+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "IAPRange": "£2.09 per item",
  "developer": "Jeffrey Laird",
  "genre": "Card",
  "contentRating": "PEGI 3",
  "released": "Mar 20, 2020",
  "updated": 1588241332000,
  "version": "0.810",
  "recentChanges": "This update improves art and UI<br>- Small UI adjustments.<br>- A sparkly new icon and better screenshots.<br>- ...embarrassing typo fixed.",
  "appId": "com.jeffreylaird.puzzletaire",
  "searchTerms": "blackjack"
 }
]