[
 {
  "title": "Zynga Poker – Free Texas Holdem Online Card Games",
  "description": "﻿Join one of the world's most popular free poker games with more tables, more tournaments, more jackpots, and more players to challenge than ever before! Whether you prefer casual Texas Holdem Poker or competitive tournaments, Zynga Poker is your home for authentic gameplay.\r\n\r\n==ZYNGA POKER FEATURES==\r\n\r\nAUTHENTIC WORLD POKER TOUR EXPERIENCE – Play Holdem poker games like a pro at the WPT Final Table in the new WPT Tournament mode!\r\n\r\nHIGHER STAKES, BIGGER PAYOUTS – Higher buy-ins mean you can win even more virtual chips for every tournament you play.\r\n\r\nFASTER TOURNAMENTS – Compete at the traditional 9-person table or the new 5-person table for faster play.\r\n\r\nVIP PROGRAM – Earn in-game benefits and features by reaching higher Tiers in our VIP Program! Enjoy exclusive chip package offerings and special poker game modes.\r\n\r\nFREE CHIPS – Get a welcome bonus of 60,000 FREE chips just for downloading your new favorite, free Holdem poker game! Plus, win a daily bonus of up to $45,000,000 in in-game money!\r\n\r\nTEXAS HOLDEM YOUR WAY – Stay casual with a classic, free Texas Holdem game or turn up the heat and go for the high-stakes jackpot. It’s up to you how high the stakes go! Texas Holdem Poker games for all experience and skill levels! \r\n\r\nFAIR PLAY – Zynga Poker is officially certified to play like a real table experience. Take your online poker games anywhere and know that you’re getting the true Vegas-style game.\r\n\r\nVARIETY – Play poker free and however you want! Join a Sit n Go game or a casual online poker game, and win generous in-game payouts! 5 player or 9 player, fast or slow, join the table and stakes you want. Zynga Poker caters to all playing types and skill levels.\r\n\r\nLEAGUES – Join millions of players across the World competing in our online Poker Season competition. Win the most chips to come out on top and become the Texas Holdem Poker champion!\r\n\r\nSOCIAL POKER EXPERIENCE – Challenge your friends to poker games, or meet new friends online. Zynga Poker has the strongest community of any poker game.\r\n\r\nPLAY ANYWHERE – Take your favorite poker game anywhere for free. Play seamlessly across all web and mobile versions -- just log in with your Facebook profile!\r\n\r\nZynga Poker is the destination for video poker players, social casino fans and table top poker players alike. If you’re a fan of the Vegas casino experience, you’ll feel right at home in our friendly poker community!\r\n\r\nDownload Zynga Poker and start playing today for free! The classic casino card game, now for mobile and online play!\r\n\r\nTALK TO US – Let us know what you'd like to see next by hitting us up on Facebook or Twitter:\r\nFacebook: https://www.facebook.com/TexasHoldEm/\r\nTwitter: https://twitter.com/zyngapoker\r\n\r\nAdditional Information:\r\n· This free poker game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.\r\n· The game is free to play; however, in-app purchases are available for additional content and in-game currency.\r\n· Use of this application is governed by Zynga’s Terms of Service, found at www.zynga.com/legal/terms-of-service.\r\n· For information about how Zynga uses personal data, please read our privacy policy at www.zynga.com/privacy/policy.",
  "summary": "Be the stars. Play the most exciting series of Hold&#39;em Poker game in the world!",
  "installs": "50,000,000+",
  "score": 4.402971,
  "ratings": 2448886,
  "reviews": 699158,
  "price": 0,
  "IAPRange": "£0.69 - £276.00 per item",
  "developer": "Zynga",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 21, 2010",
  "updated": 1587675673000,
  "version": "21.92",
  "recentChanges": "More Rewards, More Challenges, More FREE CHIPS!  Play in all new challenges to earn tons and tons of free chips!",
  "appId": "com.zynga.livepoker",
  "searchTerms": "poker"
 },
 {
  "title": "World Series of Poker – WSOP Free Texas Holdem",
  "description": "Play the world’s  Most Authentic Poker App! \r\nJoin millions of players in the  official World Series of Poker game! \r\n\t\r\nThe most prestigious poker brand raises the stakes with THE authentic poker experience. Compete to win the ultimate prize in poker; your very own WSOP Bracelet! Do you have what it takes to become a champion?\r\n\r\n  Key Features of World Series of Poker:  \r\n●  Free poker chips every 3 hours:  Claim your free chips to enjoy Texas Hold’em Poker to the fullest!\r\n●  WSOP Bracelets:  Fill up your Collectors’ Chip collections & win the most prestigious prize in Texas Hold’em and Omaha Poker; the WSOP Bracelet.\r\n●  Circuit Tournaments:  Compete in Texas Hold’em poker tournaments, with fast gameplay and magnificent prizes! You can win it all! \r\n●  Exclusive events:  Return daily to World Series of Poker to experience new poker game modes, free chip events and more, for FREE!\r\n●  WSOP CLUBS:  Test your Texas Holdem Poker skills to earn your place in exclusive clubs and get elite benefits. Will you become a part of poker royalty?  \r\n●  Poker Recall:  Challenge your memory and Texas Holdem Poker skills in our mini-game to win huge jackpots!\r\n●  Poker statistics:  Improve your game with the most extensive stats’ tracking in any Texas Holdem Poker game!\r\n●  Texas Hold’em or Omaha:  Your choice! Crush the tables and become the poker king of Texas Holdem & Omaha Poker!\r\n●  Missions:  Stay on top of your poker game with daily and weekly missions!\r\n●  Play live with friends:  Invite your friends to play Texas Holdem and make it a poker night anytime, anywhere. \r\n●  Continuous play:  Start playing Texas Holdem or Omaha Poker on your phone or tablet and continue on PlayWSOP.com or Facebook with the same bankroll. \r\n●  Guest mode:  Rock the tables and play Texas Hold’em or Omaha anonymously. Don’t be afraid to bluff!\r\n●  Facebook connect bonus:  Boost your bankroll with 250,000 additional chips when you connect your account to Facebook. Start your journey to become a World Series of Poker star!\r\n●  Slots mini-game:  Spin and win chips in between poker hands with our casino slot machine. \r\n\r\nWE’D LOVE YOUR FEEDBACK!\r\nConnect with us on Facebook (http://bit.ly/WSOP_Fanpage) and on Twitter (http://bit.ly/TwitterWSOP).\r\n\r\nCall information is required to provide you with the ultimate customer support!\r\nThis product is intended for use by those 21 or older for amusement purposes only. \r\nPractice or success at social casino gaming does not imply future success at real money gambling.\r\nThis product does not offer real money gambling or an opportunity to win real money or prizes.",
  "summary": "★ The Best Texas Hold’em Poker App ★",
  "installs": "10,000,000+",
  "score": 4.4296174,
  "ratings": 1273086,
  "reviews": 339166,
  "price": 0,
  "IAPRange": "£0.50 - £299.99 per item",
  "developer": "Playtika",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 5, 2013",
  "updated": 1589266131000,
  "version": "7.7.0",
  "recentChanges": "● Bug Fixes and Improvements - We’ve folded more bugs to improve your WSOP experience.",
  "appId": "com.playtika.wsop.gp",
  "searchTerms": "poker"
 },
 {
  "title": "PokerStars: Play Online Poker Games & Texas Holdem",
  "description": "Play poker with millions of players – only with the PokerStars Mobile poker app! Jump into exciting online poker games starting now, including Texas Hold'em poker, Omaha and more!\r\n\r\nHOW TO ENJOY OUR POKER GAMES\r\nJoining our online poker games is easy. Download the free poker app, create your account and make a deposit to start playing poker games. There are hundreds of online poker games to choose from, in traditional and unique formats. Take your seat at the tables and start playing real money poker or free poker with real people. \r\n\r\nNew to poker? Read more about how to play poker on our site or visit our Poker School for free poker lessons, advice, and the chance to win free poker tickets for must-play tournaments.\r\n\r\nNeed help with your account? Whatever the issue, our Support team are on-hand to bring you the best experience possible. Visit the Help Centre to get started.\r\n\r\nENJOY REAL MONEY POKER GAMES ALL DAY LONG\r\n- Ready to challenge for real money prizes? Kick-start your real money adventure with £20 extra play! This exclusive welcome offer is open to new players and claiming £20 is simple.\r\n\r\nHere's how to claim:\r\nVisit the Cashier\r\nMake a first deposit of £10 or more\r\nUse bonus code 'TWENTY' when you deposit\r\n\r\n- Play online poker games with the world’s largest community of real poker players. Join the biggest and best online poker games – including Texas Hold'em poker tournaments - and enjoy promotions you won’t find anywhere else!\r\n\r\n- From Texas Hold'em poker to Omaha poker, PokerStars offers the widest selection of games anywhere online. For more on all our games, visit our site.\r\n\r\n- Experience unique poker formats\r\n• Unforgettable Tournaments: Play the largest number of multiplayer poker tournaments anywhere online and battle for huge guaranteed prize pools\r\n• Sit & Go's On-Demand: Looking for a quick poker tournament? In Sit & Go's, the action starts as soon as enough players have registered \r\n• One-of-a-kind Zoom – Try the fast-paced poker game format where opponents change every hand!\r\nFind out more here.\r\n\r\nSPORTS BETTING AND CASINO GAMES\r\n- PokerStars Mobile offers poker, casino games and sports betting all in the same app. \r\n\r\n- Bet on over 30 different sports and enjoy great odds on leagues from around the world.\r\n\r\n- Choose from hundreds of casino games, including:\r\n• Exclusive Slots with unique Jackpots\r\n• Variety of Blackjack games!\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at www.begambleaware.org or 0808 8020 133.\r\n\r\n*******************************************\r\n\r\n£20 Free Play Promotion Terms and Conditions \r\n• Offer only available to players who have never made a real money deposit of £10 or more \r\n• The £20 Free Play will be credited daily from deposit date: Day 1 = 5 x $1 tickets, Day 2 = 5 x tickets, Day 3 = 5 x $1 tickets, Day 4 = $5 cash bonus, Day 5 =5 x $1 tickets, Day 6 = $5 cash bonus \r\n• We reserve the right to withhold rewards if there is reason to suspect that a deposit is fraudulent, or that it has not been made with the intention of using it to play real money games \r\n• All tickets issued as part of the £20 Free Play promotion expire 21 days from issue \r\n• Any unused tickets issued as part of this promotion will be forfeited \r\n• Tickets cannot be redeemed for cash or any other value, or be transferred \r\n• During the bonus period, you are not permitted to cashout the bonus amount. For the avoidance of doubt, you may withdraw any deposit funds you have made (or winnings from same) at any time.",
  "summary": "PokerStars is home of poker, with a real money tournament starting every second!",
  "installs": "500,000+",
  "score": 4.288243,
  "ratings": 7935,
  "reviews": 2109,
  "price": 0,
  "developer": "Stars Mobile Limited",
  "genre": "Card",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Aug 4, 2017",
  "updated": 1588580964000,
  "version": "1.122.0",
  "recentChanges": "We never stop improving our app to provide the best mobile poker experience to our millions of players across the world. If you like our work please take a moment to rate our app and let us know!",
  "appId": "com.pokerstars.uk",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Heat™ - Free Texas Holdem Poker Games",
  "description": "Poker Heat – The new FREE ONLINE POKER game brought to you by the creators of World Series of Poker (WSOP) poker app - Playtika\r\n\r\nCompete in intense poker games as you place your bets online in the best POKER APP WITH EPIC LEAGUES. Put your Texas poker strategy to the test & place your best bet like a true VIP Texas poker player! Move up the ranks of TEN poker leagues to reach the top and claim jackpots of MILLIONS of chips!! Play solo from your phone and enjoy the best Vegas Casino Poker online while you compete in live poker games vs other VIP players from Las Vegas and all over the world.\r\n\r\nFeel the HEAT with Free Texas Hold’em poker – your free chips await in the poker room – there’s a reason why poker is the best card game around!\r\n\r\nPrepare - New Poker Rings are Coming\r\nYou might be a good poker player, you might be great at Texas Holdem, but can your poker skills grant you our RING? We’ve just turned the HEAT ON and enhanced our poker casino experience with an all new poker rings collection. Play free Texas Hold’em poker and complete missions to win crowns. After you’ve earned enough crowns, and only then, you will be worthy of the ring.  Claim your free poker chips, wear your best ring at the poker table and flaunt your achievements in front of everyone at the poker table. Claim your free poker chips NOW!\r\n\r\nLeague-based competition\r\nLooking for something more exciting than simple Las Vegas poker games, where you can truly test your poker strategy? Poker Heat’s unique league-based competition mechanism with party-like classic poker games gives you an intensely competitive gameplay. Our large variety of online poker rooms delivers an experience like no other, better than any other standard online poker app. Start by playing in the Newbie Court to get into the ‘Promotion Zone’ and progress into the next league. Compete in 10 leagues, bet your free chips online and finish in the top tier to win HUGE PRIZES!! Free Poker games are here for you to play – Place your gamble, join the poker party and play free online poker!\r\n\r\nCompete against friends and players from around the world\r\nParticipate in a world poker tour straight from your phone! Show your poker hand, ante up, go ALL IN or fold - bluff your friends and outsmart poker players from all around the world! Play poker online with friends by simply hitting the Invite button at the poker tables and play free poker Texas Holdem together. Participate in exciting poker tournaments and win BIG!\r\n\r\nWin Daily Bonuses and Free Perks\r\nGet your daily free poker chips bonus multiplied by your league ranking! The higher the league – the bigger the multiplier - jackpot! A Prize pool filled with free poker chips awaits the league’s top TX poker players in the Promotion Zone. Reach the World Class league to become a poker legend of poker stars in Poker Heat - the best online Texas Holdem app! Play online poker tournaments anytime, everywhere!\r\n\r\nExciting Content\r\nGet into the online VIP casino of Poker Heat as a true poker king and discover nine different stadiums with their own poker style and mood! Start at the Newbie Court, advance through Victory Cage and move on to the Ring of Honor - for the true poker pro! Enjoy player statistics, hand strength info, amazing animations and so much more! Find special deals at the Chips Store to buy chips instantly for a cheap price!\r\n\r\nConnect with us on Facebook (https://www.facebook.com/Pokerheat/)\r\n\r\nInstall the latest Texas Holdem poker game, brought to you by the creators of the WSOP official online game (World Series of Poker).\r\n\r\nThis game is intended for an adult audience (21+) for amusement purposes only and does not offer ‘real money’ gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at ‘real money’ gambling.\r\n\r\nPoker Heat – can you feel it?",
  "summary": "The NEW Poker Experience by Playtika - creators of WSOP Poker<br>You&#39;ve Earned It!",
  "installs": "5,000,000+",
  "score": 4.5265446,
  "ratings": 364442,
  "reviews": 120240,
  "price": 0,
  "IAPRange": "£0.58 - £139.99 per item",
  "developer": "Playtika",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 14, 2012",
  "updated": 1583740160000,
  "version": "4.41.5",
  "recentChanges": "- New feature: In Game Slot Machine will coming soon!<br>- Performance and stability improvements",
  "appId": "com.bigblueparrot.pokerfriends",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Offline - Free Texas Holdem Poker Games",
  "description": "Welcome to our casino poker app! Here, you'll find real poker emotions, a lot of fun and the best poker games for free.\r\n\r\nThe game features:\r\nAmazing bonuses\r\nGet a welcome bonus of 50,000 chips and claim other gifts. Play poker classics (poker holdem texas) every day to collect all prizes.\r\n\r\nTrue random deck\r\nWe use shuffle algorithm tested on millions of hands. Poker cards are dealt randomly. Your success in holdem texas poker depends on your skill and luck.\r\n\r\nFree poker games\r\nIf you don't have enough chips you can get free chip packs anytime and continue playing best card games.\r\n\r\nRight opponents\r\nOpponents' skill level grows with the stakes. Doesn't matter if you are a newbie or expirienced player, you'll find suitable table according to your skills.\r\n\r\nLucky wheel game\r\nTry your luck and get a chance to win a huge jackpot!\r\n\r\nPoker learning\r\nIt's not a problem if you don't know how to play poker. You'll master easy poker rules and get access to the new poker hands guide. Our game is perfect poker for beginners because it doesn't have time limitation. Don't be hurry, you can think as much time as you need.\r\n\r\nOffline poker\r\nYou don't need internet to play the most popular card games in the world. Play wherever and whenever you want.\r\n\r\nTournaments around the world\r\nWalk the way from cheap texas holden tournaments to vip poker rooms.\r\n\r\nImmersive design\r\nSmooth animations, rich graphics and realistic sounds let you feel poker live pro emotions.\r\n\r\nGuest mode\r\nThere is no registration process in our app. Download poker app and rock poker texas tables without delay.\r\n\r\nSkip hand\r\nYou can instantly start next hand after fold. Just press \"skip\" button. Don't waste your time waiting opponents.\r\n\r\nTalk to us\r\nPlease give us your feedback anytime. You can write us right from the app or reach us using our email.\r\n\r\nAdditional information:\r\nThis product is intended for an adult audience (18+).\r\nOur social poker casino does not offer an opportunity to win real prizes.\r\nSuccess at social casino game does not imply success in real game or live poker competitions.",
  "summary": "Learn poker rules and play offline games: texas poker, SNG poker",
  "installs": "1,000,000+",
  "score": 4.4547367,
  "ratings": 14363,
  "reviews": 4399,
  "price": 0,
  "IAPRange": "£0.79 - £34.99 per item",
  "developer": "Red Rocket Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 23, 2018",
  "updated": 1589207969000,
  "version": "9.3",
  "recentChanges": "- Bug fixes<br>- Minor improvements",
  "appId": "com.redrocket.poker",
  "searchTerms": "poker"
 },
 {
  "title": "Texas Hold'em & Omaha Poker: Pokerist",
  "description": "Play Texas hold’em poker free with millions of players from all over the world!\r\nImmerse yourself in the world of Texas hold'em excitement, challenges and victories to prove that you're a true winner.\r\nBluff and raise, improve your skills, gain experience, make new friends and become the best poker player ever!\r\n\r\nGame features:\r\n• FREE CHIPS – Play the game every day to get free chips!\r\n• TOURNAMENTS – Master your poker skills! Participate in WEEKLY Sit'n'Go and Shootout tournaments, where you can WIN unique trophies or millions of chips and top our Leaderboard!\r\n• GET REWARDS – Up the stakes, win hands, go all-in and unlock achievements.\r\n• PARTY MODES – Mix up your Texas hold'em poker game with unique game modes and get amazing combinations!\r\n• BOOST POKER MODE – The biggest \"winner takes all\" weekly tournament, where you spin the reel for a chance to win 5 billion chips! Boost your balance with this incredibly exciting game!\r\n• PLAY AGAINST THE CASINO – Try your luck at unique poker modes. Challenge the dealer in Split bet poker and Set poker!\r\n• MULTI-TABLE TOURNAMENTS (MTT) – The most popular offline tournaments are now available online! Play at several tables with lots of worthy competitors and reach the final table!\r\n• QUESTS - Complete daily quests to get free chips!\r\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level up. See how many poker tournaments you've won and achievements you've completed. Get unique properties and display them on your profile. View other players' profiles to see how you compare!\r\n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other Texas hold'em players.\r\n• FAIR HAND DEALING GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest Texas hold'em experience!\r\n• LEARN TO PLAY – Are you new to Texas hold’em poker, blackjack or roulette but always wanted to try it?\r\nOur simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about poker, from the rules of the game to winning combinations.\r\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\r\n• SINGLE ACCOUNT – Start playing free Texas hold'em poker on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.\r\n\r\n♥️♦️♠️♣️ Want more than poker? ♣️♠️♦️♥️\r\nTry our other games for an unforgettable 3D experience:\r\n• SLOTS – Explore our themed slots with lots of unique features!\r\n• BLACKJACK – A simple game of \"21\". An exciting 3D game that any blackjack fan is sure to enjoy.\r\n• ROULETTE – Featuring stunning 3D graphics and three table varieties: French, American, and European.\r\n• OMAHA POKER – A more dynamic version of poker, with 4 cards in your hand. Have more fun with amazing combinations!\r\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\r\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\r\n\r\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!  https://facebook.com/Pokerist\r\nFollow us on Twitter and get free chips!\r\nhttps://twitter.com/KamaCasino\r\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "summary": "#1 Texas poker in the USA! Play with millions of players from around the world!",
  "installs": "10,000,000+",
  "score": 4.191685,
  "ratings": 223572,
  "reviews": 63967,
  "price": 0,
  "IAPRange": "£0.50 - £99.99 per item",
  "developer": "KamaGames",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 11, 2011",
  "updated": 1588670817000,
  "version": "32.6.0",
  "recentChanges": "Stay home. Be safe!<br>We&#39;ve planned a lot of new features for you to enjoy!<br><br>New VIP System<br>VIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!<br><br>Weekly Rankings<br>Compete against other players and see how you rank each week!<br><br>Now MTT starts every 40 minutes!<br><br>Quicker Betting<br>Try raising a bet and you&#39;ll find a new option to bet 1/2 or the full pot! Raise faster!<br><br>Improved navigation in the lobby—now you can view playing tables in a chart.",
  "appId": "com.kamagames.pokerist",
  "searchTerms": "poker"
 },
 {
  "title": "Texas Holdem Offline Poker",
  "description": "Offline Poker at its best!\r\n\r\n* Offline Play - play anytime, anywhere, no waiting for slow online opponents\r\n* 142 Unique Offline Opponents (some seemingly drunk and aggressive, some tight)\r\n* Fast Fold - no waiting for the next hand\r\n* Optional Increasing Blinds (doubling every 5, 10 or 15 minutes)\r\n* Heads Up or Six Player Multiplayer\r\n* Leagues - play offline, collect thousands of league chips if you go online\r\n* Realistic sounds, and smooth animations\r\n\r\n\r\n\r\n=== A NOTE ABOUT THE AI (ARTIFICIAL INTELLIGENCE) ===\r\n\r\nThe cards are drawn 100% randomly and nothing is done to give the AI any unfair advantage whatsoever.\r\n\r\nThe AI learned by playing hundreds of millions of hands against itself (starting completely randomly and gradually improving). To test it I had it play online on real money holdem tables and it could hold its own.  It plays better than I do myself.\r\n\r\nFor those users that are whining about the app being rigged against them, you should probably recognize that you don't really know how to play poker very well and that you don't have a real understanding of statistical variation.  \r\n\r\nIf you are unable to beat the AI and feel it rigged against you, please let me know if you play anywhere online for real money.  I myself (the developer) am a less than average poker player (I lack the required patience), but I am sure I can beat you.",
  "summary": "Offline Poker - Texas Holdem, play offline anytime or anywhere!",
  "installs": "500,000+",
  "score": 4.033155,
  "ratings": 28253,
  "reviews": 9906,
  "price": 0,
  "IAPRange": "£0.63 - £90.99 per item",
  "developer": "The Othernet, LLC",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 15, 2014",
  "updated": 1589074878000,
  "version": "8.06",
  "recentChanges": "+ Further development of the poker AI<br>+ Fixes some occasional crashing that occurred on the Cashier screen",
  "appId": "cota.android.TexasHoldem",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Face - Texas Holdem‏ Poker With Your Friends",
  "description": "●● Playing Poker with Avatar is sooo last year. ●●\r\n \r\nPokerface, #1 Group Video Chat Poker Game  that enables friends to play and connect via group video chat around a poker table, It’s simple and synchronous up to 5 people at the same time, and now you and your friends can meet for your poker night - wherever you are ;)\r\n \r\nWill you be able to bluff your friends? Download Poker Face Now: Play Poker with Friends | Multiplayer and let’s see what you’ve got!!!\r\nGet up to $1,000,000 welcome bonus.\r\n \r\n◉ LIVE FRIENDS:\r\nPlay Texas Hold'em Poker with your friends anytime anywhere!\r\nJump and invite your friends to tables in one click. We empower people to have more frequent conversations and fun with the people they care about most.\r\n \r\n◉ WORLDWIDE:\r\nBuy-in and play friendly poker with your friends and their friends too and meet new poker players across the globe.\r\n\r\nSocial Poker:\r\nWherever you are, wherever they are, play poker with buddies in a tap of a screen! Watch their reactions, communicate as if they’re sitting right beside you. That’s what Poker Face is all about - The only REAL Social Poker App!\r\n \r\nMAIN FEATURES:\r\n \r\nGroup Video Chat Poker Game:\r\nLive group video chat with up to 5 people at a time!\r\n \r\nLucky Bonus:\r\nGet exciting prizes from the wheel every 4 hours!\r\n \r\nFair Play:\r\nFair hand dealing. The cards in the game are shuffled randomly to provide you the best Texas hold'em experience!\r\n \r\nLook in your opponent’s eyes!\r\nSheer luck will not do anymore. You’ll have to work your entire body to win this game! Feel the adrenaline rush throughout the fight, and they will be watching every movement you make. Can you keep them in the game and win the pot?\r\n \r\n♠🍀♠ Put on your poker face strategy, feel the heat, and bet like a real VIP poker player! Download Poker Face NOW!!! ♠🍀♠   \r\n \r\nConnect with us on social:\r\nFacebook:  https://facebook.com/joinpokerface\r\nTwitter:  @pokerface_game\r\nInstagram:  @pokerface_game\r\n \r\n*Practice or success at a social poker casino gaming does not imply future success at 'real money' gambling.\r\n*This game is intended for an adult audience for amusement purposes only and does not offer 'real money' gambling, or an opportunity to win real money or prizes based gameplay.",
  "summary": "Play Free Social Texas Hold’em‏ Poker with Friends on Live Video Chat, Join NOW!",
  "installs": "1,000,000+",
  "score": 4.3893576,
  "ratings": 16028,
  "reviews": 9153,
  "price": 0,
  "IAPRange": "£1.79 - £91.99 per item",
  "developer": "Comunix Ltd",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Apr 9, 2019",
  "updated": 1588492994000,
  "version": "1.1.10",
  "recentChanges": "Thank you very much for your support and for using Pokerface to socialize with your friends during this difficult time.<br>We are all in this together, and we wish everyone can stay safe and healthy.<br>We’re working super hard to make the games much better every day, so you can still have fun with your friends when physically apart!<br>◉ This update is the best update we ever built we improved connection performance and a small annoying bug ;) Now, Your game will be smoother than ever!",
  "appId": "com.comunix.pokerface",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Games: World Poker Club",
  "description": "The multi-million player social poker game awaits! Do you have poker friends who play deluxe poker games online free? Play free poker card games - Omaha and Texas Holdem - and compete in the Weekly Club tournament! Call them out!\r\n\r\nFind yourself in the world of bets, stakes and huge winnings in poker world series! \r\nFinally, enjoy the stylish interface and friendly atmosphere designed for deluxe poker card games free!\r\n\r\nTo hype up the experience and thrill in poker card games free, we’ve prepared all sorts of surprises and free bonuses for our players:\r\n• complete themed collections by playing poker free online in different casino rooms and exchange them for game currency - feel the atmosphere of a real texas holdem poker deluxe;\r\n• play poker online with friends live, send gifts to them and receive kind gestures in return;\r\n• use the live chat to talk to other players while playing poker free online; \r\n• aim high in the top charts of our club wpt poker.\r\n\r\nProve to millions of other players in poker free online that you’re the king of your poker card games in World Poker tournament games. Let’s play poker king Texas Holdem free and free Omaha poker games! Once you’ve joined the club of poker kids pro, you’d never want to leave!\r\n\r\nFEATURES:\r\n• Free chips and other deluxe bonuses\r\n• Card classics: Texas Holdem poker deluxe and free Omaha poker games (try poker king texas holdem free)\r\n• Weekly tournaments (world series of poker)\r\n• Sit-n-Go tournaments\r\n• World Poker tournament games (poker world series tournament)\r\n• Play as a guest or via your accounts at Facebook or Google+\r\n• Player ratings - become a poker king!\r\n• Stylish and intuitive interface\r\n• World Series of poker\r\n• Gifts, awards and collections\r\n\r\nDownload the poker king pro game to play poker online with friends live and become a true member of club wpt poker!\r\n\r\nThis product is intended for an adult audience.\r\nThis product does not offer real money gambling or an opportunity to win real money or prizes.\r\nPractice or success at social casino gaming does not imply future success at real money gambling.",
  "summary": "The ultimate poker game with Holdem tournaments, free chips and bonuses!",
  "installs": "10,000,000+",
  "score": 4.5745153,
  "ratings": 444315,
  "reviews": 96950,
  "price": 0,
  "IAPRange": "£0.99 - £299.99 per item",
  "developer": "Crazy Panda Mobile",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 27, 2014",
  "updated": 1588237467000,
  "version": "1.143",
  "recentChanges": "We&#39;ve taken into account your comments and requests in this update. So, welcome a few minor yet promising revisions that will make your gaming even more comfortable! And don&#39;t forget the new events, tournaments with unique rewards and gifts, too.<br>See you at our tables!",
  "appId": "air.ru.crazypanda.wpcm",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Legends - Free Texas Holdem Poker Tournament",
  "description": "Poker Legends: Texas Holdem Poker ☆☆☆☆☆\r\n\r\nBest Free Texas Holdem Poker Game with In-Depth Pro Features\r\n\r\n✅ WEEKLY LEAGUES TOURNAMENT\r\nCompete in League Based Poker Tournaments & use your Texas Holdem Poker strategy to reach the top.\r\n\r\n✅ HAND REPLAYS\r\nConfused about a particular hand win or loss at the table? Now get an instant replay of any game and investigate what happened.\r\n\r\n✅ SIDE-POTS: LIVE\r\nCheck the exact distribution of all the pots at stake and check what everyone in the table stands to gain at any point in the game. No more scratching your head figuring out the win amounts. Feels like Celeb Poker.\r\n\r\n✅ GREAT USABILITY & EXPERIENCE\r\nPoker Legends is designed with simplicity to the core... intuitive design meant for PRO, Big Fish, and New Poker Players alike. 100% free Texas Holdem.\r\n\r\n✅ FAIR PLAY GUARANTEED\r\nBe assured that the hands dealt are purely random and are bound by our 100% Fair Play Guarantee. Best among all Texas Holdem Poke Games.\r\n\r\n✅ SOCIAL IN-GAME PROFILES\r\nPick your custom Avatar or pick one from a vast galley of characters, feature your Best Hand and Best Win games, communicate with other players through profiles walls and Table Chat.\r\n\r\n✅ EXTENSIVE STATISTICS\r\nGet detailed stats to track your progress and status in the game! Gain experience points to level-up! Visit the profile of other players and friends to see where the competition stands!\r\n\r\n✅ CONNECT ONCE PLAY ANYWHERE\r\nTake your poker account anywhere you go. Connect once and play from any of your devices on the go.\r\n\r\n✅ NO HIDDEN RAKE\r\nGet free from hidden, uncertain rake system. Completely free online poker no real money involved.\r\n\r\n✅ DAILY BONUSES AND FREE CHIPS\r\nGet daily free poker chips through the Bingo type Spinwheel and the Slot Machine.\r\n\r\n✅ 100% FREE\r\nPoker Legends is 100% free to play 5-person table game. Awesome world series of poker tour experience. Multiplayer Texas Holdem just for fun\r\n\r\nLive the excitement of Vegas Casino, experience Texas Hold’em Bluff, Raise or go All-In to win Hugee on the table, improve your poker skills, gain experience, make new friends from all over the world! House of real Fun! Free to play Texas Holdem Poker.\r\n\r\nAre you looking for the best 24/7 free poker games? Poker Legends brings the authentic poker experience to your mobile and web alike. Video Poker, Slots, Blackjack coming soon!\r\n\r\nFree Online Poker no download of additional files. Best free Texas Hold'em ONLINE\r\n\r\nLooking for free live Texas Holdem? It doesn’t matter if you are already a poker star or a rookie, learn as you play with our replay feature to learn the strategies of your opponents and to become the ultimate vegas poker king\r\n\r\n24/7 free Poker Holdem expert? Put your Texas poker strategy to the test, watch your pot size of winnings grow and compete to be the ultimate governor of poker in this just for fun online poker game\r\n\r\nNo hidden Rake! Fair Play Guaranteed!\r\n\r\n100% FREE to play! Get FREE Daily Bonus Chips and get rewarded for your achievements - FREE Texas Hold'em Poker!\r\n\r\nHelp and Support:\r\nEmail: dev@dtcpoker.mobi\r\nHelpDesk: http://helpdesk.dtcpoker.mobi\r\nOfficial Facebook Page: http://www.facebook.com/DTCPoker\r\nDeveloper: DYNAMICNEXT (http://www.dynamicnext.com)\r\n\r\nPlease Note:\r\nThe collection and use of personal data are subject to DynamicNext's Privacy Policy available in the Application License Agreement below. Social Networking Service terms may also apply. This game is intended for an adult audience and is meant for entertainment purposes only. It does not offer any real money gambling or an opportunity to win real money or prizes at any time. Practice or success at social gaming does not imply future success at real money gambling",
  "summary": "Best Free Texas Holdem Poker Games With In-Depth Pro Features (Online) 🏆",
  "installs": "100,000+",
  "score": 4.4568157,
  "ratings": 9713,
  "reviews": 4255,
  "price": 0,
  "IAPRange": "£0.89 - £95.99 per item",
  "developer": "DYNAMICNEXT",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 26, 2017",
  "updated": 1585932521000,
  "version": "0.2.78",
  "recentChanges": "Version: 0.2.78<br>♠ Introducing Tournament Hall Of Fame<br>♠ Introducing FairPlay Stats<br><br>Version: 0.2.36<br>♠ Introducing Heat-Mode for Tournaments <br><br>Version: 0.2.20<br>♠ Show cards option at end of hand even if you folded.<br>♠ Online status for Buddies<br>♠ 5x spin option in Slot Machine and Spin Wheel",
  "appId": "com.dn.games.dtcpoker",
  "searchTerms": "poker"
 },
 {
  "title": "Mega Hit Poker: Texas Holdem massive tournament",
  "description": "Go against up to 1,000 players at the same time to play big and win even bigger!\r\n\r\nMega Hit Poker is designed to offer the BEST EXPERIENCE POSSIBLE in a hand held device! Become a Champion in our Top Player Mode and prove that you are better than the rest! Are you up for the challenge? Play now and find out!\r\n\r\nRNG Certified\r\nThe card shuffling algorithm used in Mega Hit Poker has been tested and certified by iTech Labs! You can check the certification by going to the in-game settings menu! Mega Hit Poker supports fair game play!\r\n\r\nFeatures\r\n● FREE CHIPS EVERY 4 HOURS - Get up to LOADS of free chips! Don’t forget about the Mega Spin that comes after every 5 servings! Spin and win big!\r\n● MASSIVE ONLINE TOURNAMENTS - Compete with UP TO 1,000 PLAYERS in real time! Win and prove that you are better than the rest!\r\n● VARIOUS GAME MODES – Cash Games, Sit & Go, Shoot-out, and Tournaments. Play what you want! Don’t forget about the special game modes we have as well!\r\n● All-in - Play big, win big! The real player is never afraid to go all-in.\r\n● PLAYER RECORDS - Check your play history to improve yourself or check others to find out their play patterns to beat them!\r\n● SOCIAL FEATURES – Connect your Facebook Account to the game to get a handsome reward! Being able to safely secure your account is a plus!\r\n● SLOT MACHINE – Bored at the table? Don’t worry! Hit the SLOTS while you’re waiting!\r\n● TOP PLAYER – Are you a Champion? Can you reign supreme over others? Prove to the rest that you are better and mark your name in the Hall of Fame!\r\n● VARIOUS EVENT SALES PROMOTION – Interested in buying some chips? We’ve got you covered! Enjoy the various sales promotions we have going at ALL TIMES!\r\n\r\nWe are happy to hear your voice! Come find us at Facebook Page(http://bit.ly/MHP_Fanpage) or send us a ticket via the in-game CS feature!\r\n\r\nIt’s your time to shine! Hit the tables and show them what you’ve got!\r\n\r\nPractice or success at social gaming does not imply future success at “real money gambling.\"",
  "summary": "Feel the Las Vegas Casino in your hand. Have your best poker experience here!",
  "installs": "1,000,000+",
  "score": 4.3892903,
  "ratings": 74986,
  "reviews": 32582,
  "price": 0,
  "IAPRange": "£0.79 - £274.99 per item",
  "developer": "Wonder People Co.,Ltd.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 3, 2017",
  "updated": 1585526670000,
  "version": "3.10.1",
  "recentChanges": "Jump in for the best poker experience ever!<br>Mega Hit Poker is RNG ready! Certified by iTech Labs!<br><br>*Whats new?<br>- Added New Content: Challenges<br>- Drastically Improved VIP Benefits<br>- New Player Level Bonuses",
  "appId": "com.wonderpeople.megahitpoker.global",
  "searchTerms": "poker"
 },
 {
  "title": "DH Texas Poker - Texas Hold'em",
  "description": "Over 30M downloads, 80K initial FREE CHIPS, 100% FREE Texas Hold'em Poker!  $80,000 initial FREE chips, DAILY gift, friends gift and online rewards - They're totally FREE! \r\n\r\nExciting features that you can only experience in DH Texas Poker:\r\n# VIP Table - Experience Las Vegas VIP!\r\n# Private Table - Play with your friends!\r\n# Game mode - Play Now, Lucky table, Private Room, Select Casino, Sit&Go\r\n# Daily login lottery\r\n# Daily special offer\r\n# Online reward\r\n# Super chip package\r\n# Facebook connect is supported.\r\n\r\nLike us on https://www.facebook.com/droidhenpoker\r\nIf you have any suggestion/comment/problem, please mailto: support@droidhen.com. \r\n\r\n============================================================================\r\nDON'T TRUST ANYONE/ANY WEBSITES WHICH REQUIRE YOU INPUT YOUR USERNAME AND PASSWORD. YOU ARE NEVER ASKED FOR PASSWORD TO GET REWARD.\r\n============================================================================\r\n\"DH Texas Poker\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.\r\n\r\n\r\n====================================\r\nDroidhen is marked as top developer by Google.\r\n====================================",
  "summary": "Over 30M downloads Texas Hold&#39;em Poker!",
  "installs": "10,000,000+",
  "score": 4.205547,
  "ratings": 580301,
  "reviews": 145085,
  "price": 0,
  "IAPRange": "£0.89 - £184.99 per item",
  "developer": "DroidHen",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jul 27, 2012",
  "updated": 1586236371000,
  "version": "Varies with device",
  "recentChanges": "Bug fixes and performance improvements.",
  "appId": "com.droidhen.game.poker",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Offline",
  "description": "Poker Offline:  Play poker free with millions of players from all over the world when you are online or Offline! Most authentic Poker app in the world. Lots of interesting variations like Texas Holdem Poker, Sit-N-Go, Poker-Match-3, Blackjack, lucky-wheel. \r\n\r\nAfter winning multiple awards ZMist presents you the app on Android! Compete in intense environments, place bets, go All IN, Bluff, put your Texas Hold'em strategy to win big! Go up the poker-ranking ladder by winning tournaments & Sit-N-Go games.\r\n\r\nList of features:\r\n● FREE CHIPS: Free Chips every 15 minutes and Daily Bonus to boost your chips. A richly-featured rewards system that allows you to win Big.\r\n● Tournaments: Multi-level Sit&Go tournaments to win trophies.\r\n● Offline Or Online Play with computers/bots while offline OR with friends/players from around the world when online.\r\n● Game Modes: NO LIMIT HOLD'EM, SIT&GO, Poker-Match-3, BLACKJACK, LUCKY WHEEL. All modes with or without internet.\r\n● NO LIMIT HOLD'EM: No limit on money you can win in this game\r\n● Poker statistics: Track and improve your game with extensive poker stats.\r\n● BLACKJACK: Play blackjack in the same app.\r\n● Rankings & Leagues🏅: Dominate the world of poker with your skills and become the top player.\r\nWHEEL OF FORTUNE / Roulette: Rotate the wheel to win chips.\r\n● START WITH 45,000 chips:🎁🎁🎁 \r\n● OFFICIAL VEGAS EXPERIENCE: Try your hand at Texas Hold'em, Omaha, Tournaments, and more for FREE.\r\n● VIP membership: Enjoy VIP membership and VIP tables.\r\n● Facebook Connect: Connect with Facebook and play with friends.\r\n\r\nIn short, we think you'll love it as this game is the top offline poker free game. Enjoy poker when you are offline Las Vegas style.\r\n\r\nNow you can select language of your choice. Available languages are:\r\n- German (Deutsch)\r\n- Portuguese (portugués)\r\n- French (francés)\r\n- Spanish (Español)\r\n\r\nZMist lets you play, the best card game in the world, anywhere anytime, on your Android device! Now with statistics available and worldwide player pool, you can compete with friends and challenge new poker players! ZMist is known for providing games related services free of cost. You can also play the live online Multiplayer Hold'em and prove you are the real poker pro!\r\n\r\nThis game is for an adult audience for amusement purposes only. Game does not offer real money gambling or an opportunity to win real money. Please read our terms & privacy policy for more information.\r\n\r\nYou can connect with us on our Facebook page:\r\nhttps://www.facebook.com/Poker-1046185402123163/\r\n\r\nFor any issue, suggestion or comment please mailto: support@zeemist.com",
  "summary": "Poker Offline &amp; Online. Play with friends or thousands of live players for Free!",
  "installs": "5,000,000+",
  "score": 4.1761236,
  "ratings": 58023,
  "reviews": 22406,
  "price": 0,
  "IAPRange": "£0.99 - £49.00 per item",
  "developer": "ZMist Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 24, 2015",
  "updated": 1586337495000,
  "version": "3.8.1",
  "recentChanges": "- App performance enhancement.<br>- Better device support.",
  "appId": "com.byte3d.poker",
  "searchTerms": "poker"
 },
 {
  "title": "Texas HoldEm Poker Deluxe",
  "description": "Top-rated Poker App on Facebook!  \r\nFASTEST growing Poker App on Android!\r\n\r\nTexas Hold'Em Poker Deluxe offers classic gameplay, full Facebook compatibility and an active community. Compete against over 16 million other players on Facebook, iPad, iPhone, and Android. It's exciting Las Vegas style poker on the go! \r\n\r\nJoin now and receive $30,000 in chips for FREE!\r\n\r\nGame Features:\r\n* FREE daily gifts and chip bonuses \r\n* 1-click access to 100's of tables \r\n* 5 to 9 person Poker tables \r\n* Sit-n-Go Tournaments\r\n* Shootout Tournaments\r\n* Beautiful graphics and luxurious casinos\r\n* Simple interface that's easy to navigate\r\n* Personalized profile and buddy lists\r\n* Fast registration via Facebook Connect (optional)\r\n* Live in-game chat and animated emoticons\r\n* Plenty of gifts, snacks, and drinks to share with others\r\n* Unlock special prizes in the Facebook App (English, Turkish, Thai and Spanish only)\r\n\r\nAnd more is coming soon....!\r\n\r\n\r\nTexas Hold'Em Poker Deluxe is a great way to meet new Poker pals and connect with Facebook friends! And we're more global than ever now, offering our game in different languages: English, Français, Deutsch, Español, Português, ภาษาไทย, Türkçe, 日本语, 繁體中文!\r\n\r\nFor more information or to tell us what you think, visit our fanpage: https://www.facebook.com/bzbeepoker",
  "summary": "★★★★★ Get $30,000 chips FREE for your first time playing.",
  "installs": "10,000,000+",
  "score": 4.3925333,
  "ratings": 400719,
  "reviews": 146276,
  "price": 0,
  "IAPRange": "£1.23 - £99.99 per item",
  "developer": "IGG.COM",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 12, 2012",
  "updated": 1584000422000,
  "version": "2.6.0",
  "appId": "com.igg.pokerdeluxe",
  "searchTerms": "poker"
 },
 {
  "title": "Poker World Mega Billions",
  "description": "The fairest and funniest poker app in the game world!\r\nPlentiful and interesting game types and the coolest game interfaces will bring you tremendous fascination and immersive gaming experience! Here, you can enjoy the purest game environment with fair and open random licensing rules and massive amounts of free chips with abundant gifts!\r\n\r\n\r\nMain Features:\r\n● Massive amounts of free chips: You will own unprecedented massive amounts of free chips here, which will fly into your pocket every four hours!\r\n● Invite friends: You can invite your friends for an exciting Texas orgy. You'll meet millions of Texas players from all over the world!\r\n● Glory rings and trophies: Win rings—the crowning glory for sharks after gathering all chips of Texas hold'em Poker! Win a variety of tournaments and grab your own trophies!\r\n● Colorful game modes: Here, novel game modes will be regularly launched, bringing you unprecedented game experience. Come and open the door to a new world!\r\n● Game level setting: You will meet more advanced players and learn more advanced poker skills by improving your level. You will also obtain a higher reward rate and incentives.\r\n● Facebook bonus: Connecting to your Facebook account, you'll get more free chips every day and numerous fans. The next poker superstar is you! \r\n\r\n\r\nLooking forward to your participation, we are very pleased to receive your valuable opinion! Pay attention to us on Facebook (https://www.facebook.com/PokerWorldMegaBillions/?modal=admin_todo_tour), or via joining our discussion group (https://www.facebook.com/groups/2345755415664813/?source_id=301587127457191 ). The players around the world will exchange experience with you, and more unlimited free chips will be waiting for you.\r\n\r\n【This game】is only for entertainment for adults (21+). It does not involve any gambling function. Any success in【 this game 】is not indicative of future success at real money gambling.\r\n\r\n【This game】does not offer real money gambling , nor to provide an opportunity to win real money or physical goods.",
  "summary": "The fairest and most interesting poker app in the game world!",
  "installs": "500,000+",
  "score": 3.9983306,
  "ratings": 6031,
  "reviews": 1945,
  "price": 0,
  "IAPRange": "£0.79 - £92.99 per item",
  "developer": "Wonderful Moment(HK) Limited",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Oct 24, 2019",
  "updated": 1588230795000,
  "version": "1.3.02",
  "recentChanges": "- CLUB 2.0 goes live. Optimizes Club details display. <br>- Loading screen performance improvements. <br>- New Mission System. <br>- Fixed bug of the last version.",
  "appId": "com.zmgzs.android.overseas.texas",
  "searchTerms": "poker"
 },
 {
  "title": "888 Poker – Texas Holdem Real Money Poker Games",
  "description": "Welcome to the 888poker Texas Hold’em app where all your online poker playing dreams can come true! \r\n\r\nThe 888poker mobile app provides the widest variety of poker games including Texas Hold’em, 7 Card Stud, SNAP, and BLAST poker games. \r\n\r\nThis offer is limited to UK only • New players only • £20 free bonus: includes $1 immediate bonus & $31 in tournament tickets • Bonus will be granted gradually throughout the 7 days after it was claimed • Each part of the bonus will expire 24 hours after it was granted • All immediate bonuses may be withdrawn only after a player has accumulated 2.5 Bonus Points for every $1 of the received Bonus amount • This offer may not be combined with any other offer• Withdrawal restrictions & further T&Cs: https://www.888poker.com/terms/20gbp-32USD-poker-reg-bonus_new/\r\n\r\nSNAP games are perfect for those days when you’re short on time or if you just want to play as many hands as possible. As soon as you fold a hand, you’ll be instantly dealt a new one – so there’s absolutely no waiting around. \r\n\r\nBLAST poker is a brand new 4-handed sit & go from 888poker where the prize pool could be as much as 10,000 times your buy-in! After a set period of time where you play straight up, all remaining players are placed all-in until one player is left standing. It’s simple, exciting and well worth playing.\r\n\r\n888poker’s real money poker app cash tables offer round-the-clock action with games available from the lowest 1c/2c stakes up to mid-stakes. So, there’s no excuse! We’ve got a game for every player at any level. Take the time right now to browse around the app to find your perfect table.\r\nAnd there’s more…Our tournaments rank amongst the best making the 888 Poker app the place to play poker online. From Sit & Go’s to MTTS, you’ll find a Texas Hold’em tourney to suit your needs. \r\n\r\nWhether it’s real money poker games that you’re after or that all-important poker bonus, we’ve got the best promotions available to players in the UK. We, at 888poker, also make it simple to get your hands on our top poker bonuses and to keep track of the latest promotions via our website and social media channels.\r\n\r\nCheck out the many reasons you should download and play the best poker app today:\r\n\r\n♥ It’s one of the quickest and easiest ways to start playing Texas Hold’em poker games and tournaments at 888poker.\r\n♦ We’ll match your individual playing style to the game of your choice.\r\n♠ Not ready for cash games yet? Choose from a wide range of ‘practice play’ tables until you’re ready to play for real.\r\n♣ Our low stake buy-ins and tables are perfect for newbies and start from just a few cents.\r\n \r\nOver 10 million registered 888poker users simply can’t be wrong!\r\n\r\n• EGR award winner - Best Poker Operator, 3 years in a row!\r\n• Global Gaming Awards - Best Digital Operator of the Year\r\n• Winner of Socially Responsible Operator of the Year Awards\r\n• Owned by publicly traded company on the London Stock Exchange since 2007\r\n• 15 years of responsible, reliable & transparent operations\r\n• Advanced 24/7 online payment platform to ensure all financial transactions are safe and secure\r\n\r\nBegambleaware: https://www.begambleaware.org/\r\n18+   https://www.888poker.com/responsible-gaming\r\n\r\nPlease notice, 888Poker app will have performance issues once installed on devices with the following Android OS: Ice Cream Sandwich (4.0), Jelly Bean (4.1) and KitKat (4.4) \r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. \r\nFor gambling addiction help and support, please contact Gamble Aware at:\r\nUK: \r\nCall: 0808 8020 133 or visit https://www.begambleaware.org/\r\nIreland: \r\nCall: 089 241 5401 or visit https://www.problemgambling.ie/ \r\n\r\nWhen The Fun Stops Stop!",
  "summary": "Download 888poker app now and start playing Texas Holdem and Blast games",
  "installs": "100,000+",
  "score": 2.0298507,
  "ratings": 2019,
  "reviews": 1112,
  "price": 0,
  "developer": "888 UK",
  "genre": "Card",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 27, 2017",
  "updated": 1582718320000,
  "version": "2.3.379",
  "recentChanges": "Thanks for using 888poker. To make our app better for you, we make regular updates to improve performance and fix issues based on your feedback.",
  "appId": "com.poker888.GP",
  "searchTerms": "poker"
 },
 {
  "title": "Play Free Online Poker Game - Scatter HoldEm Poker",
  "description": "👑 Scatter Holdem Poker is what you get when you mix the Classic Card Game with the Realm of Fantasy 👑 Take your seat, place your bet and experience the Best Free Texas Holdem Poker out there!\r\n\r\nWe took the Classic Online Poker and added a Fantasy Adventure twist to it. Hone your Holdem Gard Game skills by completing Quests, beating Levels and getting Big Rewards for every single one of them! It's a Las Vegas style Free Casino Poker like you've never seen before! Download Now and get your 60 Million Chips Welcome Bonus. See you in the Game, Poker Sharks! \r\n\r\nWhat makes Scatter Holdem Poker worth checking out:\r\n- Play Online Poker Game for Free! It's the Classic Card Game that needs no introduction.\r\n- For the fans of Video Poker - this is how you get Free Chips in Scatter Holdem every hour!\r\n- Hundreds of levels with challenging and creative Poker Missions. It's a brand New Way to play the game!\r\n- Free Mode for those craving Classic 5 Player Texas Poker experience without aforementioned Missions.\r\n- Just started learning How To Play Poker? Highlighting winning poker combinations will help you in the game!\r\n- Customize your Poker Avatar and Card Deck with a variety of gorgeous Fantasy Designs. Using your own picture is an option as well :-)\r\n- Big Wins, Top Hands, Win Rate & more displayed in your personal Scatter Holdem Statistic Screen.\r\n- Folded weak cards early? Free Casino Slots Minigame is here to keep you entertained while you wait for the New Game of Holdem Poker.\r\n- Everything is better with friends ;-) Use elixirs to help each other pass hard missions and ask for help yourself!\r\n- Cute Poker Shark emojis and Spells to express your feeling during the Heat of the Online Poker Game. \r\n- Massive bonuses, Epic Special Events, and a High Roller Club to keep Scatter Holdem Poker constantly fresh and engaging!\r\n- The game is living and breathing - bringing you new updates, features, characters and stunning worlds to explore. You won't get bored with us! ;-)\r\n\r\nAre you new to Texas Holdem Poker?\r\nFrom highlighting winning combinations to the simple and informative tutorial, our game will help you to take the first steps into the wonderful world of poker. You will learn when it is the right time to raise the bet and when you have to fold. But the most important - you will learn to bluff! Feel the uncontrollable thrill of an upcoming win when you have a demolishing Royal Flush in your hand or when you have nothing, but your unequaled bluff skills proving that an opponent is wrong, leading him to his demise!\r\n\r\nThis game will suit both new players willing to learn how to play and poker sharks looking for a change of pace and new challenges. Mysterious Lady Femida, eccentric Genie, cunning Thief, sinister Vampire Hunter, and other fantasy characters are waiting for you in Scatter Poker fantasy realm. Stunning graphics, detailed characters, and bewitching music will keep you satisfied with the captivating atmosphere of the exciting new world. Become the hero for whom Fate itself will cheer for :-)\r\n\r\nDownload now and get 60,000,000 Free Chips as a casino welcome bonus!\r\n\r\nBest of luck to you!\r\n\r\nVisit our website:\r\nhttps://murka.com/\r\n\r\nJoin us on:\r\n\r\nFacebook\r\nhttps://www.facebook.com/scatterpoker/\r\n\r\nTwitter\r\nhttps://twitter.com/ScatterHoldem\r\n\r\nInstagram\r\nhttps://www.instagram.com/scatter_holdem/\r\n\r\nFROM THE MAKERS OF SCATTER HOLDEM POKER:\r\nThis game is intended for an adult audience and does not offer \"real money gambling\". Practice or success at social gaming does not imply future success at \"real money gambling\". Use of this application is governed by Murka's Terms of Service. Collection and use of personal data are subject to Murka's Privacy Policy.\r\nBy downloading this application, you are accepting Terms of Service & Privacy Policy:\r\nhttp://murka.com/#terms-of-service\r\nhttp://murka.com/#privacy-policy",
  "summary": "♥️ Free Texas Holdem Poker ♠️ 40+ Fantasy Poker Worlds ♦️ New Events Monthly ♣️",
  "installs": "500,000+",
  "score": 4.485852,
  "ratings": 52056,
  "reviews": 19334,
  "price": 0,
  "IAPRange": "£0.79 - £79.99 per item",
  "developer": "Murka Games Limited",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Sexual Innuendo, Gambling",
  "released": "Jul 31, 2017",
  "updated": 1585661903000,
  "version": "1.32.0",
  "recentChanges": "Dear players!<br><br>Spring has brought not only warm days but also the new update in your favorite game. To make things even better, we are going to introduce several interesting features and mini-events with generous rewards.<br>And that&#39;s just the beginning! Everyone&#39;s favorite High Roller Club will now be available forever!<br>Moreover, we&#39;ve fixed a few bugs with UI and smoothed out a lot of animations. Stay with us, and you will get the most valuable prizes!<br><br>The Scatter Poker Team",
  "appId": "com.murka.scatterholdem",
  "searchTerms": "poker"
 },
 {
  "title": "Live Hold’em Pro Poker - Free Casino Games",
  "description": "Live Holdem Pro’s Texas online video poker games brings you the most extreme Las Vegas Casinos to your mobile so you can play anytime, anywhere! Challenge the high-rollers ang big spenders in the most intense, LIVE poker tournaments and Texas Holdem poker hands. Think you can beat the experts? Show off your skills and defeat your opponents on the BEST online casino! Install today and enjoy a newer and faster gameplay than ever! With BIGGER bonuses & NEW exciting tables, the thrill of Poker play is at its’ best!\r\nLove free casino games? Go all in, place your poker chips and join millions of fans in the most EXTREME poker tournaments on our online casino!Engage in the best card games online - Play Texas Holdem Poker with Amazing Casino Gameplay & Quick Poker Action!\r\n\r\n👉 Texas Hold'em cash games!\r\n- Cash-Ring games - Capture the Las Vegas casino feel with free Holdem poker games in amazing HD quality\r\n- In or Out - Short poker hands - Entry is 5X big blind\r\n- Fast Fold Poker - Free Texas Holdem poker games at high-speed  \r\n\r\n👉 Poker Tournaments!\r\n- Texas Shootout - 3-stage tournament\r\n- Sit & Go – Grab your poker cards and go!\r\n- Double or Nothing - 4 players with 2 winners! Double your buy-in\r\n\r\n👉 Bonus features! \r\n- Poker Challenges – Complete a series of tasks to enhance your card game and win big!\r\n- Lucky hand – Win MORE poker chips with select cards\r\n- Jackpot Poker Lottery Draw – LHP’s daily lottery so you can fill your in-game stash!\r\n- Poker chip giveaways, casino bonuses every 4 hours and much more!\r\n\r\nPLUS! Multiplayer Live Chat & Virtual Gifts- Online Poker comes alive! Meet poker stars online and chat in-game to learn poker tips and improve poker strategy. \r\nPlay with Friends -Send & receive gifts to gain even MORE poker chips! Upgrade your Poker Play and experience the ultimate social casino by registering to Facebook!\r\n\r\nIf you love online card games, it doesn’t matter whether you’re a poker star or beginner - everyone wins with LHP’s Texas Holdem Poker! Install now and join 50M poker players worldwide playing the best free card games!\r\n\r\n\r\nLive Hold’em Poker Pro is a Poker game for entertainment uses only. The game does not offer an opportunity to win real money. Practice or success at social casino gaming does not imply future success at real money games. Live Hold’em Poker Pro is intended for an adult audience. (E.g Intended for use by those 21 or older.) The games do not offer “real money games” or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at “real money games”.",
  "summary": "Collect DAILY bonuses on the #1 Poker App!!",
  "installs": "10,000,000+",
  "score": 4.1332316,
  "ratings": 1122162,
  "reviews": 655927,
  "price": 0,
  "IAPRange": "£0.58 - £194.99 per item",
  "developer": "Scientific Games Interactive (IL)",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 21, 2010",
  "updated": 1533645851000,
  "version": "Varies with device",
  "recentChanges": "♥ Get ready for some Poker...<br>♣ Check it out!<br>♥ See you at the tables.<br>Live Hold&#39;em Pro Team!",
  "appId": "com.dragonplay.liveholdempro",
  "searchTerms": "poker"
 },
 {
  "title": "Governor of Poker 2 - OFFLINE POKER GAME",
  "description": "Texas Holdem Poker is the world's favorite online poker game. Now Play the best hold'em poker on your Android offline, NO WIFI REQUIRED! Beat every cowboy in Texas, in this great \"Texas Hold em\" Poker app called Governor of Poker 2 !\r\n\r\nMillions of poker players have enjoyed Governor of Poker, without an internet connection.\r\nWith an easy Texas Holdem Poker tutorial for players that don't know how to play Texas poker, but want to learn poker and good opponents for star poker players with real texas poker skills!\r\nThe poker chips you win with player Texas Holdem are required to buy houses, win transportation, play against advanced poker AI cowboys, win Texas and beat the new Governor of Poker.\r\n\r\nTRY GOVERNOR OF POKER 2 FOR FREE, THEN UNLOCK THE FULL POKER RPG ADVENTURE IN THE GAME!\r\n\r\n•Get ready for many hours and hours of Hold'm Poker play:\r\n- Over 80 challenging poker players to beat;\r\n- 27 stunning casino saloons in 19 amazing Texas Holdem cities;\r\n- Get hold of the five big poker assets.\r\n\r\n•Amazing and Fun Texas Poker AI Engine:\r\nThe best poker engine will challenge poker beginners and world poker champions alike.\r\nRefine your card tactics to match the countless holdm poker playing styles of your opponents and watch them go \"Steamy\" and Tilt after showing off your great card bluffs!\r\nThe offline Players will play better in each new city and poker tournament, no cheating allowed!\r\n\r\n•Full Story and Progression:\r\nGovernor of Poker 2 starts where the first game ended.\r\nA new Dallas government decided to put a ban on all Texas Holdem poker games and now considers the game to be illegal in Texas.\r\nTake matters in your own hands and prove them wrong! Poker isn't a game of luck, but requires poker skill.\r\n\r\n•Play Always and Everywhere Poker offline, no internet connection required:\r\nThere is no live internet connection required to play a good game of Texas hold'em poker, you can just play Governor of Poker 2 offline anywhere you want!\r\nDon't wait for real world players in multiplayer poker games, that don't respond or leave the pokergame or go all in every poker hand. Just play this singleplayer pokergame against realistic AI players!\r\n\r\n•Customize poker characters:\r\nProve you are a big shot by customizing your poker style to fit your reputation. Vvisit one of the many great cowboy hat shops across Texas and get yourself the poker deluxe hat of your dreams!\r\nThe game includes HD Poker graphics for a great experience on all Android mobile devices: phones and tablets.\r\n\r\nTravel through Texas by Train, Casino Boat or Coach and play poker whilst on your way to the next poker city in Texas.\r\nEvery city has lots of exciting cash games and big poker tournaments with even bigger Chip prizes, competition and bigger tournaments. You’ll experience more checks, calls, raises, folds and all-ins than you can imagine!\r\nEnjoy sit-n-go tournaments, Wildcard tournaments, highstake poker, Cash games.\r\n\r\n** NO WIFI CONNECTION REQUIRED **\r\n\r\nHave you always been a Texas holde'm pokee fanatic? You'll love Governor of Poker 2! What are you waiting for cowboy? Click install, download and prove you're worthy of the great poker title: GOVERNOR OF POKER !\r\n\r\n**** Governor of Poker 2 Reviews ****\r\n- Gamezebo: \"Makes poker accessible without being too simple. Great sense of personality. Excellent poker tutorial.. It's a Royal Flush.\"\r\n- Jayisgames: \"Governor of Poker 2 is well-made, highly accessible, and surprisingly addictive for all kinds of players.\"\r\n- Zylom: \"Play this challenging poker game now!\"\r\n- Miniclip 5 stars out of 5: \"Howdy! Finally it’s here, Governor of Poker 2! Packed with lots and lots of poker extra’s! More cities to conquer and tournaments to play!\"\r\n\r\n** NOTE:\r\nThis pokergame is FREE to play in Amarillo, but will require IAP to enjoy the full game.\r\nPlease contact support@youdagames.com if you have any issues or suggestions, we would love to help!\r\nFacebook : https://www.facebook.com/governorofpoker2\r\n\r\nDownload Governor of Poker 2 now and enjoy the Texas Holdem Poker Adventure!",
  "summary": "#1 TEXAS HOLDEM POKER OFFLINE. BEST POKER, NO INTERNET TEXAS POKER GAME! HOLD&#39;EM",
  "installs": "5,000,000+",
  "score": 4.2458205,
  "ratings": 282399,
  "reviews": 79748,
  "price": 0,
  "IAPRange": "£1.25 - £12.49 per item",
  "developer": "Youda Games Holding B.V.",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Oct 3, 2013",
  "updated": 1557496209000,
  "version": "3.0.14",
  "recentChanges": "- bugfixes",
  "appId": "air.com.youdagames.google.ww.gop2MobileFree",
  "searchTerms": "poker"
 },
 {
  "title": "VIDEO POKER OFFLINE FREE!",
  "description": "Get POKER OFFLINE FREE! for VIDEO POKER GAMES FREE! Best free video poker game free! Like Deuces Wild poker, Jacks or Better video poker, and other casino poker card games? You’ll LOVE our Free Video Poker Jacks or Better and Deuces Wild card game app - POKER OFFLINE FREE! \r\n\r\nPlay Vegas Casino Video Poker games FREE - Poker offline or online! Play in English, Spanish, or Chinese!\r\n\r\nThis poker game free app is intended for adult audiences and does not offer real money gambling or any opportunities to win real money or prizes. Success within this free poker game does not imply future success at real money gambling.\r\n\r\nHaving an issue with the game?  For immediate support, contact us at VPHa@12gigs.com. Thanks!",
  "summary": "Play Casino Video Poker Offline + Online Games FREE! Deuces Wild/Jacks or Better",
  "installs": "1,000,000+",
  "score": 4.627017,
  "ratings": 65545,
  "reviews": 15393,
  "price": 0,
  "IAPRange": "£0.99 - £150.00 per item",
  "developer": "Super Lucky Casino",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 10, 2012",
  "updated": 1568764897000,
  "version": "1.132",
  "recentChanges": "Video Poker is the coolest free poker app! <br>Now with new game icon and improved gifts for our VIP members!",
  "appId": "com.twelvegigs.heaven.vpoker",
  "searchTerms": "poker"
 },
 {
  "title": "Pokerrrr 2 - Poker with Buddies",
  "description": "Pokerrrr 2 is the ultimate multiplayer poker app to play with your buddies! \r\n\r\nIt’s as simple as creating a free private room, setting the rules( No Limit Hold’em, OFC - Open face Chinese poker, Short Deck, Pot-Limit Omaha, Round of Each, Sit-and-go,  MTT, Tournament Timer and so on) and dealing out the cards. It’s like having a poker night in the palm of your hand, anytime, anywhere!\r\n\r\nWant to meet new poker buddies? Join our Global PRR Challenge or create a Poker club to play with players from around the world!\r\n\r\nPokerrrr 2 is a virtual poker app to play poker with friends. Getting started is simple, just install the app, create a private room, and share the room code! You’ll also be able to keep the game records of your past games.\r\n\r\nPOKERRRR 2 FEATURES:\r\n\r\nHow to Play?\r\n- Host games live or online in private rooms, just for friends!\r\n- Choose Multiple game modes, including NL Hold’em, SNG, MTT, PLO, R.O.E. and tournament clock, for up to 9 players.\r\n\r\nCreate your own Clubs :\r\n- Create free private clubs with your friends from around the world, or join other clubs to meet new players.\r\n- Each club has a members-only chat and place for hosted games/records.\r\n- Share any intense hand with club friends whenever you want.\r\n- Invite friends to a club with the unique club code\r\n\r\nPoker party on the Big Screen :\r\nHosting a poker party? Host the game with your phone and use iPad to join it! Community cards will be shown on iPad(connected to Big Screen) while two hand cards are dealt to each player's phone. Big Screen mode supports all regular games and SNG.\r\n\r\n-------------------------------------\r\nAdditional information:\r\n- This game is intended for an adult audience(21+) and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.\r\n- Use of this application is governed by Pokerrrr 2's Terms of Service, found at http://pokerrrrapp.com/terms/",
  "summary": "Texas hold&#39;em / Omaha / OFC with friends!",
  "installs": "500,000+",
  "score": 4.476881,
  "ratings": 11173,
  "reviews": 4402,
  "price": 0,
  "IAPRange": "£2.69 - £87.99 per item",
  "developer": "PT.farm Inc.",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Apr 4, 2014",
  "updated": 1587995787000,
  "version": "4.3.18",
  "recentChanges": "- Fix minor bugs.",
  "appId": "com.ptfarm.pokerrrr",
  "searchTerms": "poker"
 },
 {
  "title": "Texas Holdem Poker Pro",
  "description": "Do you love poker? Do you want to play with real people whenever and wherever you want? The only thing you need is your mobile phone and internet connection! Now just add a bit of skill and you'll have your first winnings! It doesn't really matter whether you are a newbie without basic knowledge of rules or a weathered poker-shark, you will find a table suitable for you. Come and join the club where poker fans from all over the world gather to play and chat about the best gambling game in the world.  \r\n\r\nGame features: \r\n* Live Chat \r\n* Personal Avatars \r\n* Sit-n-Go tournamet Mode \r\n* Ring Games \r\n* Free daily Gold \r\n* Lottery Draw \r\n* 200+ Virtual goods you can send ppl on tables \r\n* Facebook connect for fast registration (optional) \r\n* Save to SD card \r\n \r\nWe request the following permissions for the following reasons: \r\n- Network communications – \r\n To play online with other players. \r\n- Phone calls: Preventing “phone time-outs” in the middle of the game. \r\n- Storage: To enable saving data on your SD card. \r\n- Vibration: Notification in silent areas.  \r\n \r\nIf you love poker, come and join the club for devoted and occasional poker-players alike. Getting in is easy. Just click on the button and download the app now for free.",
  "summary": "It is the best free online texas hold&#39;em poker club game from all over the world",
  "installs": "5,000,000+",
  "score": 4.141599,
  "ratings": 116451,
  "reviews": 51047,
  "price": 0,
  "IAPRange": "£2.39 - £79.99 per item",
  "developer": "geaxgame",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 28, 2011",
  "updated": 1586676625000,
  "version": "4.7.6",
  "recentChanges": "- fix some bugs <br>- improved user experience",
  "appId": "com.geaxgame.pokerkingpro",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Championship - Holdem",
  "description": "Play the most authentic Texas Hold’em Poker App! Play for Free!\r\nThis is the one just what all Hold’em fans have been looking for!\r\n\r\nAre you a competitive poker player? Then challenge yourself in weekly ranking. Play with outstanding players all over the world to become a world champion and receive huge rewards and honor.\r\n\r\n--\r\n\r\nFair Play Guaranteed\r\nThe strong Random Number Generator (RNG) implements every hand dealing of Poker Championship, thereby ensuring absolute fair game. Our game has been certified by Gaming Laboratories International, the global leading company in gaming and lottery testing.\r\n\r\nKey Features\r\nSpend massively fun time with our top-of-the line game provided with many special features for you to feel real casino atmosphere!\r\n\r\n• HUGE TOURNAMENT : Up to 500 players in a Multi-Table Poker Tournament! Free buy-in events are held every day.\r\n• WORLD POKER TOUR : Two weeks challenge to earn Tour Credits in various cities. Move up your ranking and join the final tournament!\r\n• FREE CHIPS EVERY 4 HOURS : All you need to do to get free chips is just come back every day.\r\n• LUCKY BOX : What will happen when you collect the free chips 4 times? Open the golden box with the red ribbon around!\r\n• JACKPOT : Every poker table has a chance of hitting the Jackpot. Get your chance to be the winner!\r\n• AVATAR : Huge variety of portraits collection representing your achievements! Show off your new lucky decorations.\r\n• EVENTS AND MISSIONS : Many various exciting seasonal events. Stay on top of your game with daily and weekly missions!\r\n• WEEKLY RANKINGS : Compete with outstanding Texas hold’em players throughout the world in real time and be the world champion!\r\n• INTERNATIONAL COMPETITION : While competing with poker players from all over the world, you become the member of the national team of your country.\r\n• CONTINUOUS PLAY : Start playing poker on your phone or tablet and continue on TV or PC with the same bankroll!\r\n\r\n--\r\n\r\nThis product is intended for use by an adult audience for amusement purposes only. Practice or success at social casino gaming does not imply future success at real money gambling. This product does not offer real money gambling or an opportunity to win real money or prizes.",
  "summary": "Most Authentic Texas Hold&#39;em!",
  "installs": "100,000+",
  "score": 4.328283,
  "ratings": 2007,
  "reviews": 912,
  "price": 0,
  "IAPRange": "£1.99 - £98.99 per item",
  "developer": "BBstudio Inc.",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 6, 2018",
  "updated": 1588598175000,
  "version": "3.0.4",
  "recentChanges": "Thank you for playing Poker Championship! To make our game better for you, we bring updates to the Google Play Store with bug fixes and performance improvements. For more details about the update, please find our notice message &quot;Update News&quot; in your inbox.",
  "appId": "io.bbstud.pkc",
  "searchTerms": "poker"
 },
 {
  "title": "TX Poker - Texas Holdem Poker",
  "description": "If you love gambling, TX Poker is the only game you’ll want! Our game will make your poker experience more real than it really are and even better... \r\nReady to handle it? \"Get\" button is here for you \r\nYou think you kind of tough? Prove your strength here with high stakes and Poker Pros from all over the world! \r\nThe best free Texas Holdem games are here - try your hand at Dash Poker, Sit-N-Go tournaments, Golden Tournament, join the table and stakes you want. Enter free tournaments now and show the world’s best poker players who’s boss.\r\n\r\nBy the way, if you just a \"rookie\" don't hesitate you'll also find some people like you somewhere here which help you sharpen your Poker skills.\r\nBuckle up and set off at full speed to the world of gambling!\r\nBattle your way through poker tournaments or wild challenges and win millions chips!\r\nPerhaps, you are guessing where is the catch? And probably answer will amaze you, this app is absolutely \"FREE to play\".\r\n\r\nWhat is HOT here: \r\n• Texas Holdem, a classy way to have fun \r\n• Sit-N-Go tournaments, 9 sharks, fixed buy-in and only Big Wins! \r\n• Jackpot Slot, love to gamble? Spin and win chips in between hands with the slot machine.\r\n• Dash Poker, no need to wait any more, so play as fast as you can \r\n• Prove your strength in Golden Tournament with high stakes and poker sharks! \r\n• Earn Free Chips, easier than ever. Casino playing for fun - anywhere, anytime with free  chips rewards!\r\n• Lots of achievements, increase your chances to win \r\n• Casino Buddies, feeling lonely with tons of chips? Add some friends! \r\n• Stars Journey, а fan of challenges and quests? Get started right away!\r\n• Sales, everyone enjoys buying with benefits, so don't be shy.\r\n• Play non-stop with feature! Extra chips, VIP tables, exclusive look and a lot more await.\r\n\r\nHundreds of thousands of players play TX Poker every day – can you beat them?\r\nSo what are you waiting for? A seat just opened up just for you!\r\n\r\nFROM THE MAKERS OF TX POKER:\r\nThis game is intended for an adult audience and does not offer \"real money gambling\". Practice or success at social gaming does not imply future success at \"real money gambling\". Use of this application is governed by Murka's Terms of Service. Collection and use of personal data are subject to Murka's Privacy Policy.\r\nBy downloading the game app you acknowledge our updated Privacy Policy and Terms of Service: \r\nhttp://murka.com/#terms-of-service\r\nhttp://murka.com/#privacy-policy",
  "summary": "Meet TX Poker – an online FREE to play Texas Holdem Poker game!",
  "installs": "500,000+",
  "score": 4.2759027,
  "ratings": 50854,
  "reviews": 13981,
  "price": 0,
  "IAPRange": "£0.79 - £79.99 per item",
  "developer": "Murka Games Limited",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 6, 2013",
  "updated": 1524833130000,
  "version": "2.35.0",
  "recentChanges": "Bug fixes and improvements",
  "appId": "air.com.murka.poker",
  "searchTerms": "poker"
 },
 {
  "title": "6+ Hold'em Poker",
  "description": "★★★★★  Six-plus hold 'em (also known as short-deck hold 'em) is a community card poker game variant of Texas hold 'em, where the 2 through 5 cards are removed from the deck. Each player is dealt two cards face down and seeks to make the best five card poker hand from any combination of the seven cards (five community cards and their own two hole cards).\r\n\r\n=== AMAZING FEATURES ===\r\n\r\n- 🃏Easiest Texas Hold'em: 6+ porker rules are simple. It has the thrill of cosino slot or blackjack21, while retaining the skills of Hold'em. It's friendly to both begginer and master Texas players\r\n- 💰More Chips: 6 people use short deck games, which greatly accelerates the rhythm of the game and improves the excitement of the game. You can win more chips at the same time.\r\n- 🥊League Season: Take part in the weekly exciting season, earn points and earn your rank honor\r\n- 🎁Free bonus: Rich bonus and rewards, you can get bouns every 4 hours every day, and get rewards for level up or rank up and so on.\r\n- 😄Interesting interactions: You can watch other people's games and send them interesting interactive expressions.\r\n\r\n\r\n\r\n=== THE GAME RULES ===\r\n\r\nThe rules in terms of betting structures, play of the hand, and showdown are the same as in Texas hold 'em. However before play begins all cards 2 through 5 are removed (16 cards), thus the total number of cards in the deck is 36. \r\n\r\nAces are high, but same as in Texas hold 'em, can make both low and high end of straights. For example the lowest straight would be (9x-8x-7x-6x-Ax) and the highest (Ax-Kx-Qx-Jx-10x). This changes the probability of hands and alters hand rankings.\r\n\r\n- The deck if from \"6\" to \"A\". It take out the 2’s, the 3’s the 4’s and the 5’s.\r\n- Ace can be 5 as lowest ranking card.\r\n- Flush ranks higher than full house\r\n- Each round is begin from next seat of Dealer(even if in proflop rounds).\r\n- No Small Blind an Big Blind, but has Ante\r\n\r\n- Hand rankings :Straight Flush > Quads > Flush > Full House > Straight > Three of a Kind > Two Pair > One Pair > High Card\r\n\r\n=== ATTENTION ===\r\n\r\nThis product is intended for an adult audience. This product does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.",
  "summary": "WE ONLY OFFER 6+ TEXAS HOLD&#39;EM",
  "installs": "10,000+",
  "score": 4.5440416,
  "ratings": 1958,
  "reviews": 635,
  "price": 0,
  "IAPRange": "£0.99 - £93.99 per item",
  "developer": "Qixi Cat",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 28, 2019",
  "updated": 1582805735000,
  "version": "0.5.0",
  "recentChanges": "Welcom to play 6+ Hold&#39;em Poker!",
  "appId": "poker.texas.sixplusholdem",
  "searchTerms": "poker"
 },
 {
  "title": "Wild Poker: Texas Holdem Poker Game",
  "description": "Download Wild Poker and start playing the most realistic Texas Hold’em poker game right now! \r\nThe newest name in poker is quickly becoming one of the favorites of players from around the world! What are you waiting for, get Wild Poker today!\r\n\r\nKEY FEATURES:\r\n\r\nAUTHENTIC HOLD’EM POKER – Play cash games & tournaments like a pro against real opponents from around the globe. \r\n\r\nBET BIG, WIN BIG – Choose your table stakes or tournament buy-ins and feel the excitement as you chase down a mega pot. The bigger you play, the more Wild Poker chips you’ll win on your road to greatness\r\n\r\nSIT N’ GO TOURNAMENTS – Test your competitive edge in 6 uniquely themed classic Sit N’ Go tournaments. Outlast your opponents and earn the specially designed tournament trophies. \r\n\r\nREAL SOCIAL POKER – Invite your friends to play with you and earn bonuses for each friend that joins. Add other Wild Poker players to your friends list. You can send and collect gifts from your friends every day and even join them at the table when they’re playing!\r\n\r\nDAILY FREE CHIPS – Get daily free chips by collecting bonuses every 4 hours! Get even more with the Mega Spin Bonus and Daily Streak -- Grow your free bonus by playing every day!\r\n\r\nSPECIAL EVENTS – Get access to exclusive challenges and special poker rooms every day! Try out our Race Tournaments, Leaderboard Events, and other amazing Texas Hold’em poker variants. With so many options to choose from you’ll always find new excitement at Wild Poker.  \r\n\r\nPOWER UP POKER – Add a whole new layer of strategy to your poker play with our special Power Up poker rooms. Unlock amazing power-up champions and use their special skills to gain an edge against the table...just remember, everyone at the table can also use them too!\r\n\r\nWILD POKER LEAGUES – Prove yourself against the toughest competition and climb the Wild Poker league leaderboards for Hold’em glory and tons of rewards. Stay active and play to keep your place in your league. Play well and you can climb to the top of the Legendary League\r\n\r\nWild Poker is the game to play for both novice and experienced poker players, social casino fans and anyone who loves strategy games. Get a real Vegas casino experience with some cool twists too! Wild Poker is one of the fastest growing online poker communities with something for everyone!\r\n\r\nDownload Wild Poker and start playing today for free! The classic casino card game is always at your fingertips on your mobile device!\r\n\r\nBig fans of Texas Hold’em? Make sure to follow Wild Poker on social media! Get more online poker fun on:\r\nFacebook: http://bit.ly/WildPokerFB\r\nInstagram: http://bit.ly/WildPokerIG\r\nTwitter: http://bit.ly/WildPokerTW\r\n \r\nAdditional Information:\r\nWild Poker is a free poker game for entertainment uses only. Our online poker game does not offer an opportunity to win real money. Practice or success at social casino gaming does not imply future success at real money games. Wild Poker is intended for an adult audience (e.g., for use by those 21 or older.)",
  "summary": "Poker Game – Play Online Texas Hold’em Poker Tournaments with Power-Ups",
  "installs": "100,000+",
  "score": 4.2711864,
  "ratings": 2379,
  "reviews": 815,
  "price": 0,
  "IAPRange": "£0.89 - £96.99 per item",
  "developer": "Playtrex",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 28, 2016",
  "updated": 1583767396000,
  "version": "1.4.06",
  "recentChanges": "Achievements!:Reach milestones &amp; collect rewards!.",
  "appId": "com.playtrex.wildpoker",
  "searchTerms": "poker"
 },
 {
  "title": "partypoker - Real Money Poker, Casino & Sports",
  "description": "Play poker wherever and whenever you want with the ALL NEW partypoker app!\r\n\r\nPlay for FREE or choose the thrill of REAL MONEY poker action! Choose from Sit & Go’s, multi-table tournaments, cash games or our very own SPINS, where players can turn a $5 buy-in into $1 MILLION. \r\n\r\nAnd now, partypoker is injecting even more fun into your poker-playing experience with a host of NEW FEATURES like;\r\n•\tA revolutionary portrait gameplay view when you play SPINS or fastforward that encourages one handed poker play –faster, easier and more fun!\r\n•\tMULTI-TABLING! Play up to four tables at once on a single screen.\r\n•\tA new LOBBY– switch between a carousel or tiled view and use filters to narrow results.\r\n•\tA gestural slider bar for raising\r\n•\tOur chat function that allows you to chat with friends and rivals\r\n•\tIn-game currency: Earn Diamonds while you play SPINS and convert them into stuff you can throw at your opponents. Or go RABBIT HUNTING when you play SPINS to see the cards that would have been dealt.\r\n•\tOur HAND REPLAYER feature.  Re-live hands and see your showdown percentages.\r\n\r\nTHE BEST POKER ACTION:\r\n• POKER GAMES – play all Hold’em and Omaha variations\r\n• CASH GAMES – play Short Deck and Texas Hold’em anytime, anywhere with blinds starting at $0.01/$0.02.\r\n• MULTI-TABLE TOURNAMENTS – we have over $6 million in guaranteed prizes for our weekly Power Series. We also have Gladiator, Bounty Hunter, Daily PLO and many more tournament formats to choose from\r\n• LIVE Events - qualify for partypoker MILLIONS or World Poker Tour and WSOP circuit events, where you can play in some of the most glamorous locations across Europe, North America and Latin America.\r\n• SIT & GO'S – choose from hundreds of Texas Hold’em tables with buy-ins from as little as $1.10.\r\n• FREEROLLS – practice for free and win real prizes.\r\npartypoker FEATURES:\r\n• SPINS - three-handed Sit & Go tournaments where the size of the prize pool is randomly multiplied by between 2 and 240,000 before the first card is dealt. This means you could turn a $5 buy-in into $1 MILLION.\r\n• fastforward poker - don’t like the hand that you’ve been dealt? Fold instantly and get dealt new cards at a different table.\r\n• Short Deck – a variation of poker which uses just 36 cards.\r\n• Casino side games - enjoy the thrill and excitement of blackjack or roulette while you’re in a hand!\r\n• Become a partypoker VIP! Get up to 40% CASHBACK on your rake\r\n\r\nFor our latest promotions and exclusive offers check out our website and follow us on social media:\r\nwww.partypoker.com/\r\nwww.partypoker.com/live\r\nwww.partypoker.com/blog\r\nfacebook/partypoker\r\nTwitter @partypoker\r\n\r\nEXPLORE OUR CASINO:\r\nPlay table games like blackjack and roulette or choose from over 1500 of slots and jackpot slot games, including STARBURST, WOLF RUN, BOOK OF DEAD and RAINBOW RICHES.\r\n\r\nBET ON SPORTS:\r\nBet IN-PLAY, EDIT your bet and cash out AUTOMATICALLY with a single click on all of the world's top football leagues.\r\n\r\nSo what are you waiting for? Download partypoker today for the best poker, casino and sports betting experience on mobile.\r\n\r\nResponsible Gambling:\r\n18+ This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org. For users in the Republic of Ireland, please contact telephone 1800 753 753 or visit www.problemgambling.ie.\r\n\r\nLicensing:\r\npartypoker operates under licence and in accordance with applicable laws and regulations. For further licence information, please visit our website at www.partypoker.com.",
  "summary": "Texas Hold’em cash games &amp; tournaments, blackjack, slots and sports betting",
  "installs": "50,000+",
  "score": 3.14,
  "ratings": 362,
  "reviews": 202,
  "price": 0,
  "developer": "ElectraWorks Limited",
  "genre": "Card",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Aug 1, 2017",
  "updated": 1588441280000,
  "version": "6.3.0",
  "recentChanges": "We are always working to improve our partypoker app. This update introduces some minor performance improvements for players.",
  "appId": "com.partypoker.poker",
  "searchTerms": "poker"
 },
 {
  "title": "Texas Holdem Poker",
  "description": "Texas Holdem Poker is the world's favorite online poker game. It attracted 20 thousands of fans worldwide. There are small, medium and large tables, depending on your bankroll. It doesn't really matter whether you are a newbie without basic knowledge of rules or a weathered poker-shark, you will find a table suitable for you.\r\nThe strongest point of GeaxGame's Poker is its social component. You can chat all game long with your table mates. Since a Facebook account is required, you can challenge your friends or meet new ones. The game is entirely multiplatform, so for example, you can be playing from your android device while your friends are playing from home or from an Iphone.\r\n\r\nGame features: \r\n* Live Chat \r\n* Beautiful graphics and luxurious casinos\r\n* Personalized profile and buddy lists\r\n* Simple interface that's easy to navigate\r\n* Free daily bonus  \r\n* Plenty of gifts, snacks, and drinks to share with others\r\n* Facebook connect for fast registration (optional) \r\n\r\nIf you like Poker, you’ll love Texas Holdem Poker . It has everything you need to have a whole of a time betting, raising or bluffing online opponents. Just download the app now for free. \r\nDon't forget to add me as friend, there's much more fun we playing together!",
  "summary": "It is the best free online texas hold&#39;em poker club game from all over the world",
  "installs": "10,000,000+",
  "score": 3.7657566,
  "ratings": 130256,
  "reviews": 36950,
  "price": 0,
  "IAPRange": "£2.39 - £79.99 per item",
  "developer": "GameZone8",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 24, 2012",
  "updated": 1586363291000,
  "version": "4.7.6",
  "recentChanges": "- fix bugs<br>-Improve user experience",
  "appId": "com.geaxgame.gamezone.texas",
  "searchTerms": "poker"
 },
 {
  "title": "Artrix Poker",
  "description": "Texas Hold'em Poker, Casino Cards and Slots that give YOU a real life Casino experience! Join thousands of players in this fun and challenging Casino Poker experience!\r\n\r\n\r\nFREE CHIPS Win up to 1,000,000 chips on the Daily Wheel of Fortune! Hooray, more free chips from Daily Fan Page Bonus, Friend Referral Bonus, Online Time Bonus and other in-game money!\r\n\r\n\r\nTEXAS HOLD'EM POKER Attractive dealers, professional players, adrenaline rushes from bluffing, thrill of winning the Jackpot… just like a real casino! Crush the table and make yourself a master in the world of Texas Hold'em!\r\n\r\n\r\nMULTIPLE GAME MODES Fast/slow tables, private tables, Sit and Go competition, daily/weekly tournament and more! Pick your favorite mode and stack up your chips on the table!\r\n\r\n\r\nLEAGUE:  Beat amateurs and pros alike to climb to the top of the League. Gratify yourself with the triumph of victory as you progress on the leaderboard.\r\n\r\n\r\nPLAY WITH FRIENDS Get more free chips by inviting and playing with friends! Live chat with them while playing and send playful emoticons/gifts to experience more fun of the game. Here, you'll earn something greater than chips!\r\n\r\n\r\nSPECIAL VIP BONUS Enjoy exclusive rewards and access to more features by becoming a member of the VIP club. \r\n\r\n\r\nSLOTS Check it out slot fans! Gorgeous graphics and awesome rewards at the professional 5*3 slot and Mini table slot. Increase your bankroll at the click of the handle!\r\n\r\n\r\nEXCLUSIVE CASINO CARDS GAME Advanced and innovative card-guessing games where you can win chips quickly! Feel the throbbing of your heart as the cards face up one by one.\r\n\r\n\r\nHOLIDAY EVENTS AND BONUSES Specially-designed game events are launched during holidays and festivals! Add more flavor to your holiday with all the bonuses we prepare for you!\r\n\r\n\r\nSUPPORT MULTI-LANGUAGE Not only for English speaking countries! Also for Český, Slovenský, France,Philippines, Polska, Magyarország, Indonesia, España, Latinoamérica, Ελλάδας, Κύπρου, Deutschland, Österreich, Holland, Belga, Romania, Italia, Brasil, Portugal, Türkiye or Balkans, you can play poker games in your Native Language!\r\n\r\n\r\nGUEST MODE No registration is needed to play the game. Use guest mode to start your journey with Artrix Poker right away!\r\n\r\n\r\nCROSS-DEVICE PLAY Once you connect your account to Facebook, you will be able to play on any device without losing any piece of chip in your bankroll.\r\n\r\n\r\n\r\n\r\nThis game is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "The best poker game in the country!",
  "installs": "1,000,000+",
  "score": 4.2357287,
  "ratings": 59900,
  "reviews": 20655,
  "price": 0,
  "IAPRange": "£0.79 - £164.99 per item",
  "developer": "Outerdawn Limited",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 24, 2014",
  "updated": 1585896259000,
  "version": "9.0.203",
  "recentChanges": "New tools.<br>Better User Experience.<br>General improvements.<br>Bugs have been fixed.",
  "appId": "com.playshoo.texaspoker.romania",
  "searchTerms": "poker"
 },
 {
  "title": "Jackpot Poker by PokerStars™ - FREE Poker Games",
  "description": "ARE YOU A REAL POKER PLAYER? \r\nDOWNLOAD TODAY TO BECOME A POKER STAR! \r\n\r\n \r\n★ PLAY POKER ONLINE FOR FREE by PokerStars™ ★\r\nPlay free poker online games of Texas Holdem Poker by the world’s largest online Poker brand! \r\n\r\n♣️ Play Online Poker Spin and Go™ TEXAS HOLDEM Poker Tournaments – fast 3 players poker tournaments where poker players with the best poker hand can win up to 3,000 times their initial gamble buy-in! \r\n\r\nThe Official Spin & Go Poker App for poker casino online\r\n♦️ PLAY FREE POKER ONLINE GAMES WITH STYLE! Live poker games online on the best poker site, the way WSOP mean it! Choose your free poker tournaments, spin the poker bonus wheel and get a Jackpot poker reward multiplier. Pick up the strongest 888 Poker hand or bluff your way to victory on your poker tournaments opponents to win free poker chips. Just like sit and go poker games - spin & go has many buy-in levels - so you can start off small and practice for the full tilt high stakes poker and build your free Texas HOLDEM Poker skills to perfection. The WSOP poker league awaits you!   \r\n \r\n♠️ Never Wait! Fast Paced 3 Players free online Poker Games\r\nPLAY SOCIAL POKER online for free AT A NEW SPEED. Enjoy free casino poker games with a huge range of tables that are always open for more Texas Holdem poker players. Thanks to our fast-paced 3-player free poker games online, your next turn is only a few seconds away, and the best poker hand might be yours! Fast way to polish your online poker game moves on your way to become poker star. With hundreds of tables and thousands of real Poker players, you can experience more gambling excitement, more betting thrills, MORE POKER TOURNAMENTS, more Poker!\r\n\r\n♦️ Win Endless Free Poker Chips\r\nWe give away up to 100 million Free Poker Bonus Casino poker Chips every week! Amazing daily poker chips bonus and lucky poker hand with Jackpot Poker! Receive regular chip bonuses every 4 hours and participate in our free coin giveaways as you play Poker Texas Holdem. Casino Poker chips for everyone!\r\n\r\nPlay freepoker and spin the bonus wheel at the beginning of the tournament for a chance to win up to 3,000 times your original buy-in. Better than any Poker tour, more riveting than any Poker Casino! Invest the bonus casino poker chips in a fearless play, expecting a Royal Flush on the flop? Get that Poker face to action and Bet all in!\r\n\r\n♥️ Additional Features to Enhance your TEXAS HOLDEM Poker playing Experience\r\n★Authentic: The ultimate poker environment, nothing but real Poker players, real poker odds, no machines, no computers, no other casino games\r\n★Real Poker Feel: Feel the game with swipe and flick controls creating an authentic user experience.\r\n★888 Poker Skills Quizzes: Solve Poker questions and riddles & win free poker prizes\r\n★Liquidity With over 400,000 PokerStars™ daily poker players - a huge range of poker tournaments and cash game buy-ins\r\n★Progress: Progress through game levels and edge your way to the top tables as you become a true Texas Poker master,\r\n★Chat: Shoot the breeze with poker table talk, brag about being the best Poker players in the table and throw your opponents off their game\r\n\r\nHundreds of thousands of Poker players play Jackpot Poker every day – can you beat them?\r\n\r\nIf you want to contact support, please email info@playjackpotpoker.com\r\n\r\nThis product is intended for use by those 18 or older for amusement purposes only. Practice or success at social casino gaming does not imply future success at real money gambling.\r\n\r\nPlease, be aware that we do not offer Play Money games in Washington State.",
  "summary": "Play FREE Texas Holdem Online Poker with PokerStars™! Download now to start! ♠️",
  "installs": "1,000,000+",
  "score": 4.3567567,
  "ratings": 98284,
  "reviews": 24599,
  "price": 0,
  "IAPRange": "£0.79 - £109.99 per item",
  "developer": "Stars Mobile Limited",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 10, 2014",
  "updated": 1588149544000,
  "version": "6.0.2",
  "recentChanges": "NEW TABLE ITEMS - Climb the Leagues to battle other Poker Stars for bragging rights!<br>COMING SOON - Daily and Hourly FREE Scratch Cards<br>COMING SOON - Slots Father 2 a game you cannot refuse!",
  "appId": "com.pokerstars.cebo",
  "searchTerms": "poker"
 },
 {
  "title": "bet365 Poker: Play Real Money Texas Hold'em Poker",
  "description": "Welcome package - €5 cash game ticket, €365 bonus, €1 Twister ticket, spin on the Welcome Prize Wheel and welcome missions! T&Cs apply: http://bit.ly/Poker365en\r\n\r\nbet365 Poker is our primary poker app to enjoy playing real money poker. We have an extensive range of card games including Texas hold’em, Omaha, Jackpot Twister, Six Plus Hold’em, Sit & Go, Premium Steps and lots of tournaments that you can sign up to.\r\n\r\nYou can play how you want with limit games or no limit games, up to 9 players at a table and stakes starting from as little as €0.02.\r\n\r\nThis is a real casino poker experience, with millions of real players playing poker from around the world.\r\n\r\nYou can:\r\n\r\n•\tPlay at our exclusive bet365 Premium Tables and join up to six tables at once\r\n•\tPlay Six Plus Hold'em poker\r\n•\tPlay for prize pools of up to €100,000 in our Jackpot Twister sit & gos\r\n•\tPlay in multi-table tournaments\r\n•\tCompete in a range of exciting bet365 exclusive monthly promotions\r\n•\tComplete missions to get prizes\r\n\r\nUse your existing bet365 account to log in, or sign up now.\r\n\r\nbet365 brings you our best online poker experience. Place your bets and compete against poker players from around the world. Join exciting tournaments featuring Texas Hold’em and Omaha Poker games, playing with real money.\r\n\r\nPlay all your favourite poker games, like speed Poker, Sit & Go, Twister Poker or a traditional cash game. Sign up for tournaments for both Hold’em and Omaha. Play casino games like Blackjack, Roulette and slots whilst you wait on your table.\r\n\r\nPlay Texas Hold’em Poker games on your phone with other players from all over the world. \r\nStay casual with the classic Texas Hold‘Em cash game or turn up the heat and go for the high-stakes jackpot. It’s up to you how high the stakes go!\r\n\r\nPlay Poker however you want. Join a Sit n Go game or a casual card game, play with 2 players or 9 players, fast or slow game - join the table and stakes you want.\r\n\r\nThe bet365 Poker app features:\r\n\r\n•\tTexas Hold’em poker\r\n•\tOmaha poker\r\n•\tSit&Go\r\n•\tMulti-table tournaments with huge prizes\r\n•\tPlay Six Plus or Twister poker\r\n•\tTake advantage of some great poker promotions\r\n•\tPlay the world’s most popular casino games, such as Blackjack and Roulette\r\n•\tFantastic slots are available, with huge real money jackpots \r\n\r\nDownload the bet365 Poker app and start playing today! \r\n\r\n\r\nOur customer support team is on hand 24/7 to help with any queries.\r\n\r\nYou must be 18 or over to have a bet365 account.\r\nThis is a real money gambling app. Please gamble responsibly.\r\n\r\nFor the full terms and conditions please follow the link to the Developer Website below.\r\nPlease read the bet365 Privacy Policy (see link below) before installing this application. By installing and opening the application you are accepting this policy.\r\n\r\nFor gambling help and support in the UK, users can contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org .\r\nFor gambling help and support in IE, users can contact Gamble Aware at 1800 753 753 or visit http://www.problemgambling.ie .",
  "summary": "Play Real Money Texas Holdem Poker online with bet365 Poker live real money app",
  "installs": "50,000+",
  "score": 4.04,
  "ratings": 329,
  "reviews": 153,
  "price": 0,
  "developer": "Hillside Technology Limited",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1586368592000,
  "version": "20.1.06002",
  "recentChanges": "We&#39;ve fixed some minor bugs and improved the usability.",
  "appId": "com.bet365.bet365PokerApp.play",
  "searchTerms": "poker"
 },
 {
  "title": "Texas Casino Card Games Poker Online",
  "description": "Play poker with millions of players from all corners of the world! Immerse yourself into a world of excitement, bets and victories to prove that you are a true winner. Bluff and raise your bets, improve your skills, gain experience and become the best player ever Game features:\r\nTOURNAMENTS \r\n– Participate in Sit’n’Go and Shootout tournaments and master your skills.\r\nFREE CHIPS\r\n – Come back to the game every day and get free chips.\r\nCONVENIENT INTERFACE\r\n – A simple and attractive interface which gives you the ability to call, fold or raise the stakes with just one tap.\r\nPLAY WITH FRIENDS \r\n– Invite your friends to the game through email or Facebook and get bonuses as a reward.\r\nGET REWARDS – Up the stakes, win hands, go all–in and unlock achievements.\r\nCHAT WITH OTHER PLAYERS\r\n – Use the convenient chat and message system to discuss hands you  won and get even more fun out of the game.\r\nNO REGISTRATION\r\n – Use guest mode to play poker without registration.\r\nONE ACCOUNT \r\n– Start playing on your smartphone or tablet and continue playing on Facebook without losing your progress.",
  "summary": "Play Texas Hold&#39;em Poker online and enjoy the best card multiplayer tournaments!",
  "installs": "10,000+",
  "score": 4.39,
  "ratings": 241,
  "reviews": 98,
  "price": 0,
  "developer": "atdapps inc",
  "genre": "Casino",
  "contentRating": "Parental guidance",
  "contentRatingDescription": "Parental Guidance Recommended",
  "released": "Mar 28, 2020",
  "updated": 1585400731000,
  "version": "1.1.1",
  "recentChanges": "V1",
  "appId": "com.atdapps.casinocardstow",
  "searchTerms": "poker"
 },
 {
  "title": "Video Poker Classic Free",
  "description": "* The #1 Video Poker Game on Google Play! *\r\n* 39 Authentic Video Poker Games. More Than Any Other! *\r\n* EXCLUSIVE: Skills Trainer for every one of our 39 game types! *\r\n* Progressive Jackpot! Win a Mega Jackpot when you hit a Royal Flush! *\r\n\r\nVideo Poker Classic features your favorite video poker games with real card shuffling, casino paytables, real dealing, and the full Las Vegas experience. \r\n\r\nWith the MOST NUMBER of video poker games, the MOST REALISTIC casino experience, and the BEST FEATURES, Video Poker Classic is a must download! \r\n\r\nFeatures:\r\n* FREE to play with FREE Credits every four hours\r\n* Thirty-nine (39) different, authentic Video Poker casino games\r\n* Just like Vegas Casino Video Poker – REAL shuffling, REAL paytables, REAL dealing\r\n* Top paytable payouts on all 39 games\r\n* Royal Flush mega jackpots – play 5 credits to WIN BIG\r\n* Sequential Royal mega payout in Joker Poker & Double Joker Poker\r\n* Double or Nothing option after each winning hand\r\n* Hold multiple cards at once – just slide your finger across\r\n* Authentic ambient, dealing, and winning sound effects\r\n* Offline support – play anytime, anywhere \r\n* Bet and credit amounts ranging from 1 cent to $1 million\r\n* Invite Facebook friends and get FREE coins\r\n* Need more credits? Get coin pack bonuses BIGGER than any other game\r\n* Skills Trainer for every one of our 39 game types\r\n* Multi-Hand mode for each game type\r\n* Triple-Hand, Five-Hand, & Ten-Hand\r\n* Progressive Jackpot! Win a Mega Jackpot when you hit a Royal Flush\r\n* NEW: Daily Goals & Rewards + Awesome Stats\r\n\r\n39 Video Poker Games, More Than Anyone!\r\n* - Double Double VPC\r\n* - Deuces Wild\r\n* - Jacks Or Better\r\n* - Bonus Deuces Wild\r\n* - Bonus VPC\r\n* - Triple Double VPC\r\n* - Super Double Double Bonus Poker\r\n* - Triple Double Draw Poker\r\n* - Double Bonus Deuces Wild\r\n* - Double Bonus VPC\r\n* - Deuces & Joker Poker\r\n* - Deuces Wild Bonus Poker\r\n* - Joker Poker\r\n* - Super Bonus Deuces Wild\r\n* - Double Double Draw Poker\r\n* - Bonus Poker Deluxe\r\n* - Double Double Bonus Poker Plus\r\n* - Double Jackpot Poker\r\n* - White Hot Aces\r\n* - Triple Deuces Wild\r\n* - Double Double Aces & Faces\r\n* - Aces & Faces\r\n* - Triple Bonus Poker Plus\r\n* - Tens Or Better\r\n* - Super Double Bonus\r\n* - Joker Poker (Aces Or Better)\r\n* - Bonus Draw Poker\r\n* - Loose Deuces\r\n* - Royal Aces Bonus Poker\r\n* - Double Deuces Wild\r\n* - Super Aces Bonus Poker\r\n* - Triple Bonus Poker\r\n* - Ultra Bonus Poker\r\n* - Double Bonus Draw Poker\r\n* - 2 Ways Royal\r\n* - All American\r\n* - Aces & Eights\r\n* - Double Joker Poker\r\n* - Double Aces & Faces\r\n* - Black Jack Bonus Poker\r\n\r\nGET the #1, Top Rated Video Poker Game on Google Play and start winning NOW!\r\n\r\nNote:\r\nThe game is intended for an adult audience.\r\nThe game does not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\nPractice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "The #1 Video Poker Game on Google Play! <br>39 Authentic Video Poker Games.",
  "installs": "100,000+",
  "score": 4.6030536,
  "ratings": 9230,
  "reviews": 2609,
  "price": 0,
  "IAPRange": "£0.89 - £299.99 per item",
  "developer": "Tapinator, Inc. (Ticker: TAPM)",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 7, 2016",
  "updated": 1588540572000,
  "version": "2.7.2",
  "recentChanges": "-Daily Goals &amp; Rewards!<br>-Stamp Card!<br>-Awesome Stats!",
  "appId": "com.tapinator.videopokerclassic",
  "searchTerms": "poker"
 },
 {
  "title": "Live Poker Tables–Texas holdem and Omaha",
  "description": "Texas Hold ‘Em and Omaha High/Low in the same app! \r\n\r\nPoker Live is the fastest-growing, social card game on Google Play with an authentic, multiplayer Vegas feel. Customize your Avatar, choose your favourite Game Mode and play with million of players around the world!\r\nThere are hundreds of tables, VIP privilege suites, tournaments and challenges.  \r\n\r\nWith extra features and mini games aiming to enhance your gaming experience, Live Poker will satisfy even the most demanding players.\r\n\r\nThe game has special items to buy which are purchased using our in-game currency ‘Diamonds’. Diamonds can be earned each day free of charge or you can purchase directly whenever you want from our store.\r\n\r\nLive Poker is a free, online, game of chance and skill for entertainment purposes only. It is not possible to win real money, real items/services/gifts or goods in kind by playing our skill games. The virtual currencies used in this game are called Chips and Diamonds and can be purchased in the ‘Store’ by using real money. Chips and Diamonds cannot be exchanged for cash or be paid out in any form and can only be used to play our game. Live Poker is intended solely for an adult audience which is eighteen years or over.\r\n\r\nTerms of Service: http://www.abzorbagames.com/terms-of-service",
  "summary": "Play Poker Live now! Texas Hold &#39;em and Omaha, all within the same app!",
  "installs": "500,000+",
  "score": 4.5248327,
  "ratings": 21856,
  "reviews": 7117,
  "price": 0,
  "IAPRange": "£0.82 - £179.99 per item",
  "developer": "Funstage",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 28, 2012",
  "updated": 1586939610000,
  "version": "5.2.5",
  "appId": "com.abzorbagames.poker",
  "searchTerms": "poker"
 },
 {
  "title": "Governor of Poker 3 - Texas Holdem With Friends",
  "description": "Do you feel lucky? Play Poker online in this great multiplayer Texas Hold'em Poker game and enjoy Texas Holdem in: Cash games, Spin & Play, Sit & Go tournaments, Royal Poker, Friends game, online Blackjack 21, Big Win and much more in the different Wild West saloon competitions! \r\n\r\nThe Governor of Poker (GoP) series is known as the best free offline poker entertainment game. Texas Hold'em Poker online is the enhanced mobile version of the best multiplayer card game worldwide: Enjoy the real time multiplayer Texas Holdem competition! Join our PvP casino stars club in Vegas western style!\r\n\r\nRaise the stakes, try our card games in this classic Vegas stars casino multiplayer challenge and take your chances to win the jackpot and become rich in this free online GoP cards tournament! \r\nYou have time to learn winning card combinations, pokerhands and casino terms like all-in and showdown or when to fold or bet online - There is also a cheat sheet with all the hand rankings to increase your chances to win a fortune and become a billionaire as a lucky master of the deck of cards! Find out the best bet strategy to win in this PvP gambling competition challenge!\r\n\r\nGOVERNOR OF POKER 3 (GOP 3) FEATURES:\r\n\r\n- BIG FREE CHIP STACK: 30,000 free chips, free gold, jackpot spinning wheel and a hat for every new casino saloon player!\r\n- 7 TEXAS HOLD’EM TYPES: Cash games, Sit N Go tournaments, Heads up Tournament with chests, Push or Fold, Big Win, Royal Poker and Spin & Play gambling jackpot. \r\n- UNIQUE MULTI-TABLE MODE: Play on PvP multiple tables - highly recommended for advanced players who know how to bet and compete in poker multiplayer tables properly!\r\n- ENJOY PVP VEGAS CASINO GAMBLE: Travel through Texas by winning exclusive online tournaments with your best cards and your bet strategy, beat friends at Texas Holdem games and Big Win Poker card tournaments - Countless card games exist, but Texas Holdem is much more addictive than Video Poker, Baccarat or other gambling games and slot machines!\r\n- GUEST MODE – Bet at the competition tables of Texas Hold’em anonymously. Feel free to bluff players to win the jackpot!\r\n- BLACKJACK 21: Different betting amounts like in an offline Vegas casino card game but with more odds of obtaining benefits!\r\n- TROPHIES, PRIZES, REWARD & STATUS: Become a millionaire VIP player, High roller, Poker Shark, VIP+ or Elite status in this free online multiplayer competition.\r\n- PLAY WITH FRIENDS:  Accept this stars casino cards challenge and invite your friends to join you in our gamble saloon!\r\n- FAIR CARDS TEXAS HOLDEM PVP GAME - We shuffle the cards with the best proven methods. So no roulette or bingo poker!\r\n\r\nAre you ready to compete in multiplayer tournaments? Money from our huge jackpots awaits you in our Las Vegas casinos! Start betting now and may the luck be with you in this competition!\r\n\r\nThis PvP online Vegas casino card game is intended for an adult audience (e.g for use by those 21 or older). This Texas Holdem card game does not offer real money gambling or an opportunity to earn real money, rewards or prizes.\r\nPractice or success at this bet game does not imply future success at \"\"real money\"\".\r\n--------------------\r\nSupport: support@governorofpoker.com",
  "summary": "Play Texas Hold&#39;em Poker online and enjoy the best card multiplayer tournaments!",
  "installs": "5,000,000+",
  "score": 4.314262,
  "ratings": 226572,
  "reviews": 62900,
  "price": 0,
  "IAPRange": "£0.99 - £179.99 per item",
  "developer": "Youda Games Holding B.V.",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 29, 2014",
  "updated": 1589194767000,
  "version": "6.5.5",
  "recentChanges": "We have a big Governor of Poker 3 update for you!<br>- Blackjack is now accessible during Poker! Give it a try, it is next to the multi-table icon<br>- Animated emojis are now available in the Team Chat!<br>- You can now use the chat while waiting for players to join the table<br>- Reduced memory consumption and download traffic<br>- Bug fixes",
  "appId": "com.youdagames.gop3multiplayer",
  "searchTerms": "poker"
 },
 {
  "title": "Fresh Deck Poker - Live Hold'em",
  "description": "Poker like you've never seen it before!\r\n\r\nIf you crave the nightlife, risk, and thrill of playing poker in an ultra realistic experience that will make you feel like you’re sitting at a table in Vegas, then you will LOVE Fresh Deck Poker! Come play the best free Texas Hold'em poker game with THOUSANDS of people online every day!\r\n\r\nFresh Deck Poker has all the right sit-n-go tournaments and ring games for you. The numerous rooms to explore, ability to play with friends online, and the interesting non-playable characters you can interact with adds a little spice to the game while you make your poker skills shine.\r\n\r\nPlay on your iPhone and continue your SAME GAME on your iPad or from any mobile device!\r\n\r\nFresh Deck Poker is the FIRST free mobile poker game to offer an immersive experience in matches that take place in locations all over the world. Choose your avatar, show off, and dominate the poker tables!\r\n\r\nFRESH DECK POKER FEATURES INCLUDE:\r\n\r\n\t•\tCHALLENGES: Complete daily and weekly \"gigs\" to collect tons of rewards.\r\n\t•\tAVATARS: Choose from many gorgeous avatars that come alongside custom table themes for each of them.\r\n\t•\tTABLES: Put the turbo speed for a No Limit Texas Hold'em Sit-n-Go's. Up to 9 handed Ring Game tables.\r\n\t•\tLEADERBOARDS: See how you stack up against other players or your friends in the Leaderboards.\r\n\t•\tBONUSES: Suit up for Millionaire Machine, GSN's most exciting jackpot ever!\r\n\t•\tLEVELS: Keep on levelling up to get rewards!\r\n\r\nPlay for FREE today!\r\n\r\n...and don't forget to...\r\nLike Us on Facebook: http://www.facebook.com/FreshDeckPoker",
  "summary": "Live Texas Hold&#39;em Games. Futuristic Gameplay, Free Chip Bonuses and Lots of Fun",
  "installs": "1,000,000+",
  "score": 4.2423472,
  "ratings": 59417,
  "reviews": 14004,
  "price": 0,
  "IAPRange": "£0.69 - £118.46 per item",
  "developer": "GSN Games, Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 11, 2013",
  "updated": 1585724842000,
  "version": "Varies with device",
  "recentChanges": "We keep working to make Fresh Deck Poker better. Thank you for all the feedback!<br>Many of you experiencing SnG problems should see a big improvement with this update.<br>Also, events will be back and extra bonuses for all of you. Thank you for the trust!",
  "appId": "com.idlegames.eldorado",
  "searchTerms": "poker"
 },
 {
  "title": "HD Poker: Texas Holdem",
  "description": "Do you like poker? HD Poker is the place for you!\r\n\r\nExperience the High Def Poker experience! Crush the competition with the newest FREE poker game.\r\n\r\nHD Poker is the latest and greatest multiplayer online poker app in the world. Play with friends and compete against opponents across the globe for chips and prizes - win billions and climb the ranks to become a poker champ.\r\n\r\nPlay Hold'em in a cutting-edge immersive poker app with a huge range of table themes and stakes - play casually or clash with the competition in high stakes games at HD Poker.\r\n\r\nFREE CHIPS - Get a welcome bonus of 125,000 FREE chips and 50 FREE gems just for downloading! Collect a bonus every 4 hours and keep your streak going to win a daily Bonus Chest!\r\n\r\nCUSTOMIZE - Create your own HD Poker experience - choose your character from hundreds of Avatars and vote for your favorite table theme.\r\n\r\nCOLLECT AND TRADE - Win Gems for completing Achievements, then use them on in-game content! Collect, Trade with friends, and open Chests to expand your inventory and further customize your experience.\r\n\r\nLEADERBOARD - Compete with players across the globe in HD Poker's unique ranking system. Win trophies for winning hands and playing skillful poker. Rank up to earn better Rewards!\r\n\r\nPLAY WITH YOUR FRIENDS - Recruit your friends to the HD Poker app and earn an exclusive chest! Invite friends to join your table - play poker, trade, chat, send gifts, and have fun!\r\n\r\nJACKPOTS - Have a chance to win millions or even billions of chips by hitting a Royal Flush or triggering the Bad Beat Jackpot!\r\n\r\nSIDE GAMES - Find tickets in chests or purchase them in the store with Gems, then play Side Games and win bonus prizes! Spin the Super Mega Wheel and win millions!\r\n\r\nMULTI PLATFORM - Play our casino app on any platform – desktop, mobile, and web.\r\n\r\nNEW CONTENT - The HD Poker app offers an immersive casino world with new content being released all the time. Have a cool idea that you want to share with us? Drop us some feedback using the in-game Help system.\r\n\r\nWE’D LOVE YOUR FEEDBACK! - Connect with us on Facebook and Twitter:\r\nFacebook: facebook.com/hdpoker\r\nTwitter: twitter.com/hdpoker\r\nVisit us at: hdpoker.com\r\n\r\n\r\nDISCLAIMER – HD Poker is intended for an adult audience (18+) for amusement purposes only and does not offer 'real money' gambling. HD Poker is free to play; however, in-app purchases are available for additional content and in-game currency. Practice or success at social casino gaming does not imply future success at real money gambling.",
  "summary": "Experience High Def Poker! Crush the competition with the NEW FREE poker game!",
  "installs": "100,000+",
  "score": 4.4489794,
  "ratings": 3944,
  "reviews": 1553,
  "price": 0,
  "IAPRange": "£0.89 - £274.99 per item",
  "developer": "Z4 Poker LLC",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 20, 2018",
  "updated": 1579032332000,
  "version": "1.9624",
  "recentChanges": "Patch Notes: Version: 1.6.5.2<br>- New &quot;Show All&quot; for Chest Opening<br>- Various bug fixes and improvements",
  "appId": "com.z4.hdpokerandroid",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Star: Texas Holdem Poker",
  "description": "Best Texas Poker comes online! Take a virtual trip to Texas and immerse yourself in the hold’em excitement! Texas Poker satisfies all you can imagine in a poker game!\r\nPlay Texas Poker with millions of real friends around the world! Challenge yourself to improve your poker skills and become a real poker winner.\r\nLet’s have incomparable immersive gaming experience here with exclusive game features and multiple game modes.\r\n\r\nExclusive Game Features\r\n\r\nMassive Bonus: Sign-in every day to claim daily free chips and keep yourself playing; Watching video also provides a way to collecting freebies! More bonus in the game than you can think!\r\nSocial System: Invite and play with your Facebook friends. Also share invite code to friends so they can join you! \r\nChat & Gift: Chat with other players and send emojis to each other to make the game more joyful and interactive. \r\nQuick Game: Players will be matched quickly and the game will begin right away! Or you can create private room and invite your friends.\r\nProfile Page: Track your progress and status in the game! All your info and game data are listed here for convenience.\r\nInternet Connection: Works smoothly on 3G, 4G and fast WIFI connection, providing a faster and smoother gameplay for better Texas Poker experience!\r\n\r\nMultiple Game Modes\r\n\r\nTexas Poker：Classic Texas Poker to reveal authentic poker thrill and show your luck and skill! \r\nPrivate Table: Need privacy? We’ve got special private table for you! Play with friends for fun.\r\nPoker League: Come to challenge yourself and poker lovers all around the world. Let’s start with Rookie Court to unlock more and reach the peak!\r\n\r\nEnjoy the never-ending fun anywhere, anytime with Texas Poker! It’s definitely the most authentic poker game you can find in the store!\r\n\r\nPlease note that this game doesn’t offer real money gambling or an opportunity to win real money or prizes. The chips you win or lose have no real cash value.",
  "summary": "Enjoy classic texas hold’em poker online and play with friends around the world.",
  "installs": "5,000+",
  "score": 4.54,
  "ratings": 229,
  "reviews": 212,
  "price": 0,
  "IAPRange": "£1.89 - £92.99 per item",
  "developer": "Teen Patti Rummy Ludo by Banyan",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 12, 2020",
  "updated": 1584069795000,
  "version": "1.0.1",
  "appId": "com.poker.texaspoker.texasholdem",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Texas Holdem Live Pro",
  "description": "Play FREE Texas Holdem and Omaha Poker Games at Poker Live Pro – the latest poker app by GameDesire!\r\n\r\nEnter the world of free, online poker! Join Poker Texas Holdem Live Pro to feel the thrill of real entertainment! Advance with your poker chips and buy into high-stakes poker tables. Compete against the best poker players and prove you’re a true poker star!  Poker Texas Holdem Live Pro invites you to join adrenaline-filled poker tournaments and single-hand battles as you bluff, bet and win with your poker hand.\r\n\r\nAdditional Features to Enhance your Poker Experience\r\n\r\n★Professional: Extensive poker stats, poker table variety, true multiplayer experience.\r\n★Reliable: Similar high-level poker game experience on all platforms and devices.\r\n★Progressive: Very generous poker tournament offerings with a supportive bonus system.\r\n★Incredible Design: Top-of-the-line visual interface, creating a very slick poker game design.\r\n★Game-Aspects: Multi-tabling poker strategy possibilities coming soon!\r\n\r\nPlay Poker Texas Holdem Live Pro –  The BEST FREE POKER experience on all devices!  \r\n\r\nStep into the Poker ring with the masters! Whether you just started to play or you’re already a poker combinations superstar, Poker Texas Holdem Live Pro suits all levels. In this Texas Holdem poker game, you will be able to start your poker journey at the stake level of your choice.  \r\n\r\nUse our Happy Hour Bonus and cash in on your poker-winning hands\r\n\r\nPut on your Poker Face and start playing\r\n\r\nPlay like the pros with a large variety of poker rooms and top-of-the-line poker tournaments. Get ready to play anytime with thousands of online poker players.  With our Welcome Poker Bonus and Free Daily poker chips, you will never wait to play! Poker Texas Holdem Live Pro is full of jackpots, special bonuses and achievements – so you can start-off small and gradually improve your Texas Holdem poker rankings!\r\n\r\nCash-in on Poker Bonuses!\r\n\r\nTrue Multiplayer Texas Holdem Poker card game\r\n\r\nChallenge your friends to a card game or play against any of the thousands of worldwide poker stars. You can invite other poker players to your poker table, chat with them and exchange poker game strategies. With cash tables in a range of amounts and daily poker tournaments, you will feel the exciting rush of going All-In!\r\n\r\nTexas Hold’em Poker games come to life with Poker Live Pro by GameDesire™ - the most professional poker app you’ve ever played!\r\n\r\nThe game is intended for an adult audience.\r\nThe game does not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\nPractice or success at online poker or social casino gaming does not imply future success at cash poker games or real money gambling.",
  "summary": "Million of chips are waiting for on the Jackpot Arena! Get them NOW!",
  "installs": "1,000,000+",
  "score": 4.517617,
  "ratings": 43345,
  "reviews": 13534,
  "price": 0,
  "IAPRange": "£0.89 - £91.99 per item",
  "developer": "GameDesire",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 3, 2012",
  "updated": 1560448067000,
  "version": "7.1.1",
  "recentChanges": "- minor bug fixes",
  "appId": "eu.ganymede.pokerhd",
  "searchTerms": "poker"
 },
 {
  "title": "Video Poker!!",
  "description": "Video Poker for android is the classic video poker slot machines free in Las Vegas.\r\nIt is download completely free, has all video poker games for free in Las Vegas and you can play offline video poker.\r\nA variety of high-quality casino poker games give you the ultimate video poker fun you may have never experienced! \r\nEnjoy hours of fun anytime anywhere!\r\n\r\nUnlike blackjack games or texas holdem poker,  video poker card games are easy to learn, \r\nsimply select a video poker casino game of your choice, choose a bet and start drawing cards from video poker wizard!\r\n\r\nNot enough chips? Go to the chips store to buy more! Or look out for the special triple & double bonus deluxe every 4 hours for even more chances of free rewards. \r\nAnd try your luck with Mini-Games from video poker machines!\r\n\r\nFeatures of Video Poker Deluxe:\r\n- FREE, FREE, FREE! Play all 8 Video Poker games for FREE!\r\n- VIDEO POKER OFFLINE, PLAY ANYTIME, ANYWHERE. No internet connection required!\r\n- FAIR PLAY. Just like Vegas!\r\n- MORE CHOICE. Change speed for slow or fast play.\r\n- HIT THE JACKPOT! Discover endless ways to win a Jackpot!\r\n- MORE FREE CHIPS, MORE OFTEN! Collect free chips every 4 hours.\r\n- MINI GAME: Play \"Double or Nothing\" to triple your chips! Keno and Lotto!\r\n- Enjoy premium graphics, music and sound effects!\r\n- The new video poker games free design gives the video poker classic a fresh look\r\n- Video Poker jackpot, video poker pocket\r\n--Video poker with double up\r\n\r\nList of Video Poker with Various games:\r\n- Joker Wild video poker original game\r\n- Double up video piker with joker\r\n- Jacks or Better video poker\r\n- Free video poker bonus Deuces Wild poker\r\n- Tens or Better video poker\r\n- All American video poker\r\n- Video poker in Las Vegas\r\n- Twofold Bonus video poker\r\n- Twofold Twofold Bonus video Poker\r\n- Deuces Wild video poker\r\n- Nevada Bonus Video Poker\r\n- Aces and Faces Video Poker\r\n- Progressive jackpot\r\n- Red hot Aces\r\n\r\n\r\nVideo Poker Training Mode, provides you video poker tutor and video poker trainer to help you improve your video poker strategy.\r\nMaster your skill in Twofold Twofold bonus video poker trainer, jacks or better video poker trainer.\r\n\r\nMulti hand video poker free app for deuces wild video poker multi hand, 3 hand video poker, five hand video poker, \r\n100 hand video poker, triple play video poker games free and multi line video poker.\r\n\r\n\r\nInstall Video Poker for Android TODAY, play free video poker games and become Video Poker Expert,  game King video poker! \r\nTrain your video poker strategy apps, be super lucky at the real money real video poker Experience the thrill of our original offline Video Poker!\r\n\r\nYes, you can play the offline casino games, BEST Video Poker games offline, without WiFi, without Internet just like bingo and solitaire.\r\n\r\nFree video poker casino games is intended for use by those 21 or older for amusement purposes only, this is not real online video poker with bonus for money.\r\nFree video poker games apps do not offer ''real money gambling'' or an opportunity to win real money or prizes.\r\nPractice or success at social casino gaming like free video poker games free not imply future success at \" real money gambling such as real video poker\".",
  "summary": "Classic Video Poker Fresh new 2016 touch.<br>ALL Las Vegas Video Poker Varieties.",
  "installs": "100,000+",
  "score": 4.214286,
  "ratings": 1273,
  "reviews": 453,
  "price": 0,
  "IAPRange": "£1.79 - £94.99 per item",
  "developer": "AE Magwin: Free Casino Slot Machines Bingo Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 26, 2016",
  "updated": 1569844309000,
  "version": "1.6.5",
  "recentChanges": "Discover the world of classic video poker with the most popular variations: Deuces Wild, Jacks or Better, and Twofold Bonus Video Poker etc. Bet, risk and win huge rewards. Master your casino skills and become a pro player!<br>- Performance optimization and bug fixes<br>- Skills Trainer for everyone for our 8 game types<br>- Improve your abilities before hitting the casino floor!",
  "appId": "com.arcadegame.games.video.poker.slots",
  "searchTerms": "poker"
 },
 {
  "title": "Sky Poker – Texas Holdem & Omaha Poker Games - UK",
  "description": "With Sky Poker’s app you can enjoy all your favourite Cash games, Tournaments and Sit & Go’s on your favourite device. Play in £’s today against thousands of like-minded UK poker players and learn to improve your game with our dedicated poker strategy videos.\r\n\r\nThe Sky Poker app allows you to play whenever and wherever you like. New customers will need to create a new account which is quick and easy. Existing customers can simply log in with their Sky Poker User ID and PIN.\r\n\r\nAs a Sky Poker customer you can enjoy some fantastic features within the app:\r\n- All your favourite Hold’em, Omaha and Omaha Hi-Lo Cash games, Tournaments and Sit & Go’s\r\n- Access to strategy videos that will help you develop your game\r\n- ‘Play Now’ Feature – we will find you a Cash table or Sit & Go in seconds that suits your bankroll\r\n- Enjoy all the great features of the Sky Poker Desktop tables, such as auto top up\r\n- Full account history, deposits and withdrawals all direct from your device\r\n\r\n\r\nResponsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling.  This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support in the United Kingdom please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/ and in Ireland please contact Gamble Aware at 1800 753 753 or visit http://www.gambleaware.ie/\r\n\r\nThe Sky Poker app is brought to you by Bonne Terre Limited, an Alderney registered company wholly owned by The Stars Group Inc. and licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Poker is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group. The Sky trademarks used in the app are owned by the Sky UK Limited and its affiliated companies and are used under license. To place a bet with Sky Poker you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Poker. Customers located outside of the UK or Ireland will be prohibited from using this app.",
  "summary": "Enjoy all your favourite Cash games, Tournaments and Sit &amp; Go’s",
  "installs": "50,000+",
  "score": 4.01,
  "ratings": 404,
  "reviews": 244,
  "price": 0,
  "developer": "Sky Betting and Gaming Apps",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1544702300000,
  "version": "1.9.0",
  "recentChanges": "We’ve made some changes behind the scenes to improve the stability and performance of our app. Thanks for your feedback! We hope you&#39;ll love playing Sky Poker and if you want to support us please leave a review.",
  "appId": "com.skybet.app.skypoker",
  "searchTerms": "poker"
 },
 {
  "title": "博雅德州撲克 texas poker Boyaa",
  "description": "博雅德州撲克，台灣德州撲克遊戲首選\r\n\r\n特色\r\n\r\n1、經典智慧型的遊戲德克薩斯撲克，下載立即獲得遊戲幣。\r\n2、遊戲幣天天領，登入送、任務送，活動還會送！全員獎勵日日抽，機會人人有！\r\n3、超多小遊戲，大菠蘿、大鳳梨、猜手牌、骰寶、吃角子老虎機Slot、拉霸玩到嗨。\r\n4、社交型德州撲克體驗，真人撲克對戰，還可以邀請你的facebook好友一起組局玩poker。\r\n5、多元poker玩法-Bonus、MTT、SNG、幸運轉輪賽、必下房、俱樂部（私人房）。\r\n6、專業德撲賽事（博雅爭霸賽、金幣狂歡賽等），種類齊全，選擇多樣。\r\n7、真人在線客服，你的問題我們第一時間為您解決\r\n\r\n博雅德州撲克從2008年研發至今，已經有將近11年的遊戲歷史，是現今最好的德州撲克之一。目前已經在台灣、泰國、印尼、越南、日本、俄羅斯、土耳其、葡萄牙、西班牙、德國、法國、義大利、英國、波蘭、匈牙利、希臘、中國大陸等地區和國家上線，目前全球共有數千萬玩家。\r\n全球最火爆的博雅德州撲克讓你領略“線上棋牌”的無限樂趣！精緻的遊戲畫面，極致的操作體驗，更多玩法等你來嗨！\r\n\r\n經RNG(Random Number Generator)國際認證。\r\n我們保證每一張都是隨機發出，遊戲公平，品質保證！\r\n\r\n在粉絲頁上與我們互動，讓我們知道您對遊戲的期望：\r\nhttps://www.facebook.com/boyaapoker\r\n\r\n溫馨提示：\r\n本遊戲依遊戲軟體分級管理辦法分類為輔15級。\r\n本遊戲以成年人為訴求對象。\r\n本遊戲部分畫面穿著凸顯性特征之服飾。\r\n本遊戲不提供「現金交易賭博」，也沒有機會贏得現金或實體獎品。\r\n在社交類遊戲中的練習狀況或成就，不代表日後在「現金交易賭博」中會獲得相同的成果。\r\n本遊戲為免費使用，遊戲內另提供購買虛擬遊戲幣、物品等付費服務。請注意遊戲時間，避免沉迷。",
  "summary": "Texas Hold&#39;em, resourcefulness and courage showdown!",
  "installs": "1,000,000+",
  "score": 4.259142,
  "ratings": 38936,
  "reviews": 6951,
  "price": 0,
  "IAPRange": "£0.64 - £93.99 per item",
  "developer": "Boyaa",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 17, 2012",
  "updated": 1557977869000,
  "version": "5.9.5",
  "recentChanges": "1、修復已知問題，優化遊戲體驗，遊戲更加流暢。",
  "appId": "com.boyaa.androidmarket",
  "searchTerms": "poker"
 },
 {
  "title": "American Poker 90's Casino",
  "description": "Do you like Video Poker Machines? This is the right game for you. In this Casino, you can play many VideoPoker like American Poker 90's, Fruit Poker Original, American Poker 3, Fruit Poker II, and Bonus Poker 3-7-9.\r\nEverything is for free, game is offline, and there are no ads!\r\nThere are progressive free coins, starting from 50 coins every 4 hours, and growing by 5 coins up to 150 coins for every 4 hours.\r\nBe smart and play low bets if you have a small amount of money in your wallet. For example 1 or 2. Do not play 20 coins bet if you have only 200 coins in your wallet!\r\nIf you became rich, then you can play with bets up to 1000 for free. There are a higher bets for small purchase, from 2000 up to 1 million!\r\nDo not hesitate and download this old style video poker casino game for free right now.",
  "summary": "Legendary video poker machines like American Poker and Fruit Poker",
  "installs": "100,000+",
  "score": 4.5779037,
  "ratings": 10642,
  "reviews": 3573,
  "price": 0,
  "IAPRange": "£0.89 - £45.99 per item",
  "developer": "Alligator Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 17, 2017",
  "updated": 1583929920000,
  "version": "2.2.16",
  "recentChanges": "You can find a new draggable home (lobby) screen in the game, fixed handling of android back button and, couple of small bugs was fixed.",
  "appId": "sk.alligator.games.americanpoker90s",
  "searchTerms": "poker"
 },
 {
  "title": "Texas HoldEm Poker FREE - Live",
  "description": "Play Texas Hold'em Poker with friends and millions around the world with unlimited entertainment, top-tier graphics.\r\n\r\nThe game is FREE to play. Lots of Bonus Chips. It lets you play the quick Hold'em Tables and Sit-N-Go tournaments. \r\n\r\nI. Hold'em Tables :  \r\n •  Quickly Join a table, bet and make some virtual cash to experience Las Vegas casino. RNG certified odds to win big.\r\n •  Play Live with people around the world in real time\r\n •  Chat with other players on the table\r\n •  Choose a table / tournament based on your virtual betting capacity\r\n •  Send Poker Faces while Playing. Bluff others about your hand with your poker face\r\n •  Send In-Game gifts to table mates\r\n\r\nII. Sit-N-Go tournaments :\r\n •  Play online any of the 8 rooms available for a fixed time. Works as offline simulator \r\n •  1st, 2nd and 3rd ranking people are awarded the Pot money\r\n\r\n\r\nIII. Spend your coins to buy virtual items on the Shop and Compare your rankings on the Leader Board.\r\n\r\nIV. Invite and Play with your friends or Join the table they are playing in right away. Make friends at the table as well.\r\n\r\nTry our Texas Hold'em Poker Live, Now! We are sure you will love it.",
  "summary": "Play the most authentic Poker - Texas Holdem for Free! Quick tables, Tournaments",
  "installs": "500,000+",
  "score": 3.997389,
  "ratings": 12346,
  "reviews": 3506,
  "price": 0,
  "IAPRange": "£0.99 - £199.99 per item",
  "developer": "Mywavia Studios",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 1, 2013",
  "updated": 1527847631000,
  "version": "14.6",
  "appId": "com.mywavia.poker.android",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Online (& Offline)",
  "description": "*** Now you can play poker with real players while being online or Offline. ***\r\n\r\nThis app offers classic gameplay, full Facebook compatibility and an active community. You can compete against over 1 million other players worldwide. It's exciting Las Vegas style poker on the go!\r\n\r\n* Play with players worldwide\r\n* Or play offline when you don't have internet !\r\n* FREE daily gifts and chip bonuses \r\n* access to 100's of tables \r\n* 5 to 9 person Poker tables \r\n* Beautiful graphics and deluxe casinos\r\n* You can play blackjack or spin the Lucky-Wheel while in the casino!!\r\n* Personalized profile and buddy lists\r\n* Simple interface that's easy to navigate\r\n* Login as Facebook (optional) or play as Guest (no registration needed)\r\n* Live in-game chat and animated emoticons\r\n* Plenty of gifts, snacks, and drinks to share with others\r\n* Tournaments\r\n* No limits on money you can win! (some users have won billions and even trillions!!)\r\n* Get 20000/- Starting money.\r\n* A richly-featured reward system that allows you to win big-Play for FREE Gift & FREE Texas Chips!\r\n\r\nNow you can select language of your choice. Available languages are:\r\n- German (Deutsche)\r\n- Portuguese (portugués)\r\n- French (francés)\r\n- Spanish (Español)\r\n\r\nIn short, we think you'll love it!\r\n\r\nComing Soon:\r\n* Omaha Poker\r\n* Texas Holdem tournaments\r\n* No Limit Texas hold 'em game - Be Poker Stars all over the world !\r\n\r\nEnjoy poker when you are offline or online!\r\n\r\nThis game does not offer real money gambling or an opportunity to win real money or prizes. Chips gained in the game cannot be used/sold to get real money. Practice or success at social casino gaming does not imply future success at real money gambling.",
  "summary": "Play Poker with thousands of players online or practice offline.",
  "installs": "500,000+",
  "score": 4.202403,
  "ratings": 10941,
  "reviews": 5298,
  "price": 0,
  "IAPRange": "£0.99 - £51.99 per item",
  "developer": "ZMist Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 5, 2016",
  "updated": 1550573573000,
  "version": "Varies with device",
  "recentChanges": "- Amazing new features!<br>- Now enjoy rankings in Sit-N-Go games!<br>- Fresh new UI improvements!",
  "appId": "com.byte3d.pokertexas",
  "searchTerms": "poker"
 },
 {
  "title": "Texas Poker Polski  (Boyaa)",
  "description": "Poker online z międzynarodowymi turniejami i wyzwaniami Texas Hold‘em.    \r\n\r\n(Prawdziwe turnieje i prawdziwi gracze. Jesteśmy tu, by rywalizować, zrelaksować się, potrenować i poznać nowych przyjaciół)   \r\n\r\nRZESZE CODZIENNIE AKTYWNYCH GRACZY \r\nPołączyliśmy platformy, by jeszcze łatwiej było teraz znaleźć graczy do gry, w każdym zakątku świata, o każdej porze. \r\n\r\nCZYSTY POKER \r\nUżywamy algorytmu z certyfikatem iTech Labs i wyspecjalizowanym zespołem, który dba o to, by gra była sprawiedliwa, czysta i zabawna. Najlepszy poker w sieci   \r\n\r\nPRESTIż PRAWDZIWEGO POKERA \r\nBoyaa jest międzynarodową firmą, która tworzy nowe standardy łącząc prawdziwy i sieciowy poker w globalnym otoczeniu.   \r\n\r\nDZIENNY BANKROLL, KARTY VIP I \r\nMamy wszelkie możliwe narzędzia pokerowe, więc gra dostosowuje się do Ciebie, czy jesteś nowicjuszem, graczem weekendowym, który chce poprawić swą grę, ambitnym graczem celującym w miejsca rankingowe, czy też profesjonalnym internetowym pokerzystą. Od wsparcie bankruta aż po specjalne opcje dla graczy VIP. Mamy wszystko, czego zapragniesz   \r\n\r\nMODUŁY GRY DLA WIELU GRACZY (Hold’em, Sit’N’Go, MTT, Club) \r\nGraj w Poker Texas na szybkich lub wolnych stołach, na niskich bądź wysokich stawkach. Graj bez ograniczeń. Weź udział w dużych turniejach mistrzowskich lub wejdź po prostu do pokoju Sit‘n’Go. Teraz możesz nawet utworzyć swoje prywatne pokoje pokerowe w module klubowym, tak, by samemu ustalać zasady, ciemne i graczy, z którymi chcesz grać.  \r\n\r\nINTERAKTYWNY \r\nWszystkie ikony, naklejki, przyciski są w 100% interaktywne. Kliknij na jakiegokolwiek gracza i analizuj jej/jego profil, najlepsze ręce, współczynnik zwycięstw oraz inne dane. Kliknij na zabawny element na ekranie i podziel się nim z przyjaciółmi, dealerami.  \r\n\r\nPolityka prywatności: http://www.boyaa.com/information.html  \r\nWarunki usług Boyaa: http://www.boyaa.com/mobile/termsofservice.html",
  "summary": "Online poker tournaments and international challenges Texas Hold&#39;em",
  "installs": "100,000+",
  "score": 4.167442,
  "ratings": 6573,
  "reviews": 1507,
  "price": 0,
  "IAPRange": "£0.60 - £90.99 per item",
  "developer": "Boyaa",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 4, 2014",
  "updated": 1543371932000,
  "version": "5.9.0",
  "recentChanges": "Co nowego:<br>1. Dodane gry: &quot;&quot;Sic Bo&quot;&quot;<br>2. Zoptymalizowane menu lobby i inne funkcje",
  "appId": "com.boyaa.androidmarketpl",
  "searchTerms": "poker"
 },
 {
  "title": "Poker World - Offline Texas Holdem",
  "description": "Become the World Poker Champion - play poker around the world in the most famous poker cities.\r\n\r\nPoker World is brought to you by the makers of Governor of Poker. In this great offline poker game, you're battling and bluffing your way through several continents and famous poker cities. Ever played poker in Macau? Or visited the majestic Monaco casino? Or went all in in the Bellagio in Las Vegas? This is your chance. And you'll play poker with only one goal: to become the best poker player in the world.\r\n\r\nIn Poker World, you start your first poker tournament in the United States. By winning tournaments you progress and build up your reputation as a poker player. You will be able to join bigger and more exciting poker tournaments, get better poker sponsor deals and buy cool items to show off your poker status. And don’t be surprised if you get challenged by the best players in the world. You'll play heads-up poker against these World Top players and climb your way to the top.\r\n\r\nTRY POKER WORLD - SINGLE PLAYER POKER FOR FREE, SHOW OFF YOUR SKILLS AND BECOME THE WORLD’S BEST TEXAS HOLD'EM POKER PLAYER IN THIS GREAT OFFLINE POKER ADVENTURE!\r\n\r\nGreat game features:\r\n- MORE THAN 30 HOURS of Texas Hold'em Poker play;\r\nOVER 60 POKER CITIES in the world where you can participate in challenging poker tournaments. Every tournament varies in buy-in, number of players and poker winnings;\r\n- COLLECT STATUS SYMBOLS to build up your reputation in the poker scene and get access to certain tournaments;\r\n- WORLD TOP 10: beat all World Top players and win tickets for special tournaments;\r\n- PLAY ANYTIME, ANYWHERE: Poker offline, no internet connection required:\r\n\r\nThere is no internet connection required to play this great game. And one other big advantage: you don't have to wait for real world players like you do in live multiplayer poker. Slick, fast gameplay!\r\n\r\n- THE BEST AND MOST FUN POKER AI IN THE WORLD\r\nThis poker engine is created to give you the best poker experience and the feeling you are playing against real players. We made the AI to ensure the game is great for both beginning poker players who are learning poker and experienced players. Refine your card tactics to match the style of your opponents! The offline players will play better in each new city and poker tournament!\r\n- BIG FREE WELCOME PACKAGE: 20,000 free poker chips;\r\n- MORE FREE CHIPS: Collect FREE chips every day with your daily bonus;\r\n- EARN MORE CHIPS: Watch videos and earn free bonus poker chips in this poker paradise;\r\n- GREAT HD GRAPHICS: The poker game is beautifully designed and includes HD poker graphics for a great poker experience. \r\n\r\nMillions of poker players have already enjoyed our Governor of Poker games.\r\nPlay this very exciting Texas Hold'em poker game and prove you are the best poker player in the world. Press Install and download Poker World NOW.",
  "summary": "BEST FREE OFFLINE TEXAS HOLDEM POKER GAME FROM THE MAKERS OF GOVERNOR OF POKER",
  "installs": "1,000,000+",
  "score": 3.5149503,
  "ratings": 6131,
  "reviews": 3031,
  "price": 0,
  "IAPRange": "£0.79 - £58.99 per item",
  "developer": "Youda Games Holding B.V.",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 28, 2017",
  "updated": 1588604839000,
  "version": "1.7.14",
  "recentChanges": "Minor bug fixes",
  "appId": "com.youdagames.pokerworld",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Land - Free Texas Holdem Online Card Game",
  "description": "Poker Land, the most popular free poker game, brings you the most extreme casino experience to your mobile! \r\nWith the widest selection of poker games anywhere online, you can enjoy all kinds of experience and excitement here: classic Texas Hold’em poker, Sit & Go, MTT... Poker Land also brings the world an exclusive way to play poker —Ante Mania, a brand-new mode by which you can play faster and win bigger pots! Poker Land is the home for every poker lover, just come and try this exciting and authentic poker game!\r\n\r\nFeatures of Poker Land:\r\n*Multi-table Tournaments*\r\nIn Poker Land MTT, you can compete with millions of real players and win big rewards! There are dozens of MTT tournaments every day with a huge prize pool! Think you can beat the experts? Show off your skills, defeat your opponents in the tournaments, and win your huge prize! \r\n\r\n*Ante Mania*\r\nAn unprecedented way to play Texas Hold’em Poker! With high ante and high stakes, you can experience much more intense and excitement in such a brand-new way! Instead of skills, you need more luck to win big. Dare to test your luck and courage? Join Ante Mania table!\r\n\r\n*Sit & Go Tournament*\r\nIn the SNG tournament, the game will start once the table is full. With millions of real players online, you can just sit down and get ready to go within seconds! Grab your poker cards and win generous rewards!\r\n\r\n*Free Game Items Every Day*\r\nCountless game items：Golds/Diamonds/GoCoins giveaway every day. Come and get your daily rewards, don’t miss it! Besides, you can also win big prizes on the table or in tournaments too!\r\n\r\n*Social Poker Experience*\r\nChallenge your friends and families in a private table. Compete with them on your mobile anywhere and anytime you like. It’s a great choice to improve the relationship and kill time. \r\n\r\n*Fantastic Effects and Various Emojis*\r\nWith fantastic graphics and wonderful effects, you can take your online poker games anywhere and know that you’re getting the true Vegas-style casino game. \r\nWith various emojis and stickers, you can show your feelings and reactions to other players while in the game. Talk with them and make friends here.\r\n\r\nContact Us\r\nFollow us on Facebook for exclusive rewards and bonuses!\r\nFacebook: https://www.facebook.com/pokerlandteam/\r\n\r\nTo report any issues or feedback, please contact us, we are willing to hear from every player.\r\nMessenger: https://m.me/pokerlandteam",
  "summary": "Free to play the most popular Texas Holdem Poker online card casino game.",
  "installs": "100,000+",
  "score": 4.670769,
  "ratings": 3318,
  "reviews": 1772,
  "price": 0,
  "IAPRange": "£0.89 - £23.99 per item",
  "developer": "Play Joy",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 1, 2019",
  "updated": 1588210509000,
  "version": "2.9.8",
  "recentChanges": "1. New game lobby and interface<br>2. Introduce new game: color game",
  "appId": "com.playjoygame.pokergo",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Fighter - Free Poker Trainer",
  "description": "Poker Fighter is a State of the Art Poker Trainer that lets you play poker while getting Instant Feedback from Professional Players.\r\n\r\nYou can Play, Practice and Improve using this Unique Trainer that Simulates Real Texas Hold'em Cash Games and Tournaments.\r\n\r\nThe Game is designed to offer a better access to the Poker World for Newbies and Experienced Players who want to Maximize their Winnings and Improve their understanding of the game.\r\n\r\nPoker-Fighter focuses on 6-Max Cash Games. We specialize at Online games up to $0.25-$0.50, and Live games up to $1-$3.\r\n\r\nYour Journey to becoming a Poker Shark starts Now!\r\n\r\nThis product is intended for use by those 18 or older for amusement purposes only. \r\nPractice or success at this poker trainer does not imply future success at real money gambling.\r\nThis product does not offer real money gambling or an opportunity to win real money or prizes.",
  "summary": "Poker Training, Learn Strategy, Skills, Cash, Tournaments, Play Texas Holdem",
  "installs": "50,000+",
  "score": 4.617886,
  "ratings": 1246,
  "reviews": 537,
  "price": 0,
  "IAPRange": "£1.49 - £69.99 per item",
  "developer": "Mindful Games Ltd",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 13, 2017",
  "updated": 1538757919000,
  "version": "1.2.49",
  "recentChanges": "The Most Entertaining Way to Improve Your Game!<br>New Slick Design<br>Send Feedback Feature - Tell us About Your Experience !<br>Cool Surprising Daily Challenges<br>Optimized Poker Mind<br>Multi-Languages: Spanish, English",
  "appId": "com.pokerfighter",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Online: Texas Holdem & Casino Card Games",
  "description": "Play POKER ONLINE now and TEST MULTIPLAYER TEXAS HOLD'EM POKER game! Invite your friends to the most exclusive online poker rooms in the world and compete with them anytime, anywhere, LIVE! T-Bull promises to bring an experience to the live Texas Hold 'Em poker circuit that's never been had before! \r\nMaster the poker hand rankings with Online Poker: Texas Card Game NOW! \r\n\r\nFEATURING:\r\n★ Play the No. 1 Poker App Online!★\r\n★ Join the game and play with your FRIENDS wherever you want, LIVE! ★\r\n★ Compete in TONS of challenging TOURNAMENTS! ★\r\n★ Get FREE chips every 4 hours! ★\r\n★ ENJOY real-time TEXAS HOLD 'EM poker for FREE! ★\r\n★ BECOME the best PRO POKER PLAYER and WIN unique TROPHIES! ★\r\n★ Discover the REAL POKER experience on your MOBILE! ★\r\n★ Log in daily and get EXTRA CASH! ★\r\n★ Enjoy an ORIGINAL GRAPHIC STYLE of Texas Hold 'Em Poker! ★\r\n★ Full SUPPORT for ENGLISH, Spanish, Indonesian, Thai, Spanish, Portuguese, Vietnamese, Italian, French, Traditional Chinese, German, Turkish, Japanese, Korean, Arabic, Malay, Polish, and Russian! ★\r\n\r\nTHE NO.1 ONLINE POKER APP!\r\n Were you looking for a faster poker with NO wait times? Fun games in a real poker style? Enjoy cash games, GO Poker tournaments, playing poker with friends game, big win and poker texas hold'em! Great! You're in the right place! Download Poker Online: Texas Card Game now, and join millions of poker players in an online casino for endless fun! Are you ready to face real poker stars and compete against them? Bluff and raise, improve your skills, gain experience, make new friends, and prove that you're the only poker star!\r\n\r\nPLAY WITH YOUR FRIENDS WHEREVER YOU WANT!\r\nEnter the world of online poker! Love casino games? Invite your friends to adrenaline-filled poker games through Facebook and get cash bonuses as a reward. Whether you're a beginner or already a poker superstar, Poker Online: Texas Card Game is for you! This online poker is a real poker party that gives the best poker experience! Join The poker party and play online poker!\r\n\r\nCOMPETE IN TONS OF INTERNATIONAL TOURNAMENTS!\r\nTake part in international tournaments such as the Singapore Carnival, French Joust, English Tourney, or American Series! Up the stakes, win hands, go all-in, and unlock achievements. Track your progress and status in the game! See how many Tournaments you've won and Achievements you've earned. This #1 poker app is build to be used by millions of players.\r\n\r\nVEGAS TEXAS HOLD 'EM\r\nWant to learn how to play poker? Flush, straight, three-of-a-kind, pair, and what beats what? If you love online card games, it doesn't matter whether you're a poker star or just a beginner. Playing online poker allows you to gain valuable experience! Understand and master the poker hand rankings with Poker Online! Enjoy a Las Vegas casino atmosphere and show other players who rocks!\r\n\r\nPLAY POKER DAILY AND GET CASH FOR!\r\nDownload Poker Online now and receive $100,000 in chips instantly! Come back to the game every day and get free $50,000 in chips. Everyone can win with Poker Online! PLAY THE NO. 1 POKER APP OF 2017!\r\n\r\nDownload Poker Online: Texas Card Game NOW! Finally available on Google Play! 100% to play!\r\n\r\nDiscover our other games: http://t-bull.com/#games\r\nLike us on Facebook: https://facebook.com/tbullgames\r\nFollow us on Twitter: https://twitter.com/tbullgames\r\n\r\nThis product is intended for use by those 21 or older for amusement purposes only. \r\n Practice or success at social casino gaming does not imply future success at real money gambling.\r\n This product does not offer real money gambling or an opportunity to win real money or prizes.\r\n\r\nWe're always making changes and improvements to Poker Online: Texas Card Game. To make sure you don't miss a thing, keep your updates turned on!",
  "summary": "PLAY POKER TEXAS HOLDEM AND COMPETE AGAINST YOUR FRIENDS LIVE! DOWNLOAD NOW!",
  "installs": "100,000+",
  "score": 4.144208,
  "ratings": 4318,
  "reviews": 1845,
  "price": 0,
  "IAPRange": "£0.99 - £62.90 per item",
  "developer": "T-Bull",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "May 10, 2018",
  "updated": 1525936145000,
  "version": "1.01",
  "recentChanges": "Coincidence, luck or just your skill? Find it out! The newest update brings fixes for the major bugs and improves the gameplay! Compete now!",
  "appId": "com.tbegames.and.poker_games_texas",
  "searchTerms": "poker"
 },
 {
  "title": "Rest Poker - Texas Holdem",
  "description": "Rest Poker – The new FREE ONLINE POKER game brought to you by RestPlay\r\n\r\nWith many game modes, play without getting bored and collect lots of bonuses - continue the game without interruption. Invite your friends to collect more bonuses and invite them to the table you're playing. See your odds of winning the hand with the Hand Meter so you can strategize, increase your stakes and win more chips!\r\n\r\n     Game Modes\r\nBattle Royal \r\n     Play with only 10's or above, get ready for royal flush.\r\nFold Jump\r\n     If you don't like the cards dealt, just fold and switch to another table to play without waiting for the turn to end.\r\nRest To Rest\r\n     After the flop cards are dealt, you either Rest or Fold. \r\nTurbo\r\n     Play twice as faster in turbo mode. You won't have to wait for slow players here!\r\n\r\nBonus\r\n     Start with a welcome bonus of $1.000.000, collect an hourly, daily, weekly, bonuses!\r\n \r\nFriendship\r\n     Invite your friends and play with them in the same table! Send and collect daily gifts from each friend!\r\n\r\nChat\r\n    Chat with friends at the table and meet new friends by sending a friend request.\r\n\r\nBuy more chips and increase your vip level. You'll earn bonus chips from all bonuses and purchases!",
  "summary": "Millions of chips are waiting for you in Rest Poker, win them NOW!",
  "installs": "10,000+",
  "score": 3.59,
  "ratings": 421,
  "reviews": 306,
  "price": 0,
  "IAPRange": "£2.69 - £91.99 per item",
  "developer": "RestPlay",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 4, 2020",
  "updated": 1587645260000,
  "version": "1.995",
  "recentChanges": "-Bug fixes and stability improvements<br>-Minor text fixes<br>-Fixed like and friend icons not visible on mod tables",
  "appId": "com.RestPlay.RestPoker",
  "searchTerms": "poker"
 },
 {
  "title": "PokerUp: Poker with Friends",
  "description": "♣️  PokerUp №1 app for playing poker with friends around the world! Invite up to three people to the Texas hold ‘em table or climb the leaderboard by winning duels in each poker world tour city. All for free!\r\n\r\n♣️   SOCIAL\r\nFancy a round of poker with friends? Look no further! PokerUp is the only poker app that lets you play with friends from your contacts. Chat with them before, during, or after the game. Share real-life reactions and emotions during the game with the unique instant video feature.\r\n\r\n♣️  MOBILE\r\nEnjoy an app designed with attention to detail to give you the best mobile poker experience. Play using one hand only! Gameplay has never been cooler with all the controls right under your thumb.\r\n\r\n♣️  SIMPLE\r\nNo complications, variations, or needless settings. Simply enjoy hold ‘em poker with a highly intuitive user interface and clean design. \r\n\r\n♣️  GLOBAL\r\nChallenge players all over the world in PokerUp duels and win prizes. Unlock more levels to challenge new players and compete for even bigger prizes.\r\n\r\n♣️  PREMIUM\r\nUpgrade to a Premium Account to enhance your poker experience with extras like unique table themes, Hand Strength Meter, and gameplay features like Rabbit Hunt.\r\n\r\n♣️  OTHER FEATURES AND BENEFITS:\r\n\r\n- Multiplayer Games: challenge up to 3 players from your contact list.\r\n- Messenger: use PokerUp as any other messenger to chat with your friends.\r\n- Leaderboard: challenge your friends and rise up in the friendly leaderboard.\r\n- Night Mode: enjoy poker after sunset with the stunning night theme.\r\n- Left-Handed Mode: play in comfort using your left hand.\r\n\r\n♣️  DISCLAIMER\r\n- The games on PokerUp are intended for an adult audience.\r\n- The games do not offer “real money gambling” or an opportunity to win real money or prizes.\r\n- Practice or success in social casino gaming does not imply future success in “real money gambling”.\r\n\r\nPlease send any questions you have to: support@upgames.ltd\r\n\r\nJoin us and watch the sales:\r\nFacebook: https://www.facebook.com/pokerup\r\nTwitter: https://twitter.com/poker_up_games",
  "summary": "1MM + players in Texas Holdem",
  "installs": "1,000,000+",
  "score": 4.51198,
  "ratings": 24067,
  "reviews": 9611,
  "price": 0,
  "IAPRange": "£0.89 - £98.99 per item",
  "developer": "UpGames Limited",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 15, 2017",
  "updated": 1588909840000,
  "version": "3.5.7.471",
  "recentChanges": "DAILY BATTLE &amp; WEEKLY FINALS<br><br>Stop sitting out! It&#39;s your golden hour to make yourself known to the PokerUp world! These updates will make the struggle stronger. Do you want to the Hall of Fame? - Get ready to sweat a lot!<br><br>DAILY BATTLE. Fight for your place in the Club. Take one of the prize-places to move to a new level.<br><br>WEEKLY FINALS. Only the smartest will get on this BATTLE OF TITANS. The absolute winner will enter the Hall of Fame. Hope to see you there!<br><br>Hurry Up!<br><br>PokerUp",
  "appId": "upgames.pokerup.android",
  "searchTerms": "poker"
 },
 {
  "title": "PPPoker-Free Poker&Home Games",
  "description": "PPPoker is one of the world's largest private club-based online poker platform, and boasts a global community of poker lovers!\r\n\r\nLaunched in 2016, PPPoker strives to offer the best poker experience to millions of real players from over 100 countries worldwide.\r\n\r\nIn PPPoker, you can create and play in your private Club against friends and family in the most unique and personalised online poker experience. Play across a variety of popular poker variations such as NLH, PLO & OFC, and do battle at the tables anytime you want. \r\n\r\n【Diverse Poker Experiences】Expand your Club’s community and qualify for PPPoker Live Events.\r\n\r\n【Exciting Poker Variants】Play games such as NLH, PLO, OFC, Short Deck and more!\r\n\r\n【Dynamic Poker Community】Share and discuss poker hands in our online Forum and at events.\r\n\r\n【Global Tournaments】 Compete in tournaments against players across the world!\r\n\r\n【Multi-table action】Play up to three-tables at once with ease\r\n\r\nOur motto is \"For Poker Lovers, By Poker Lovers\" - here at PPPoker we strive to provide a safe and fair gaming platform for all poker enthusiasts:\r\n\r\n【Dedicated Anti-Cheating Procedures】\r\n\r\nPPPoker is fully certified by the Gaming Laboratories International (GLI) standards and also implements several Anti-Cheating and reliability measures, including an Anti-Cheating team, Random Number Generator tests (RNG), Big Data analytics, and IP/GPS restrictions. \r\nOur Anti-Cheating team regularly generates GLI standard RNG tests to ensure randomness in the online dealing process meets the appropriate levels for an entirely fair playing environment. Club owners can implement both IP and GPS restrictions into games to ensure players do not have an unfair advantage over others. \r\nPPPoker is also proud to report our platform has a cheating detection over 99.8%, and a platform uptime of 99%. \r\n\r\n【Top-Rated Application Shielding】\r\n\r\nThe advanced built-in DDOS protection detects and identifies all kinds of threats automatically while blocking sophisticated attacks to ensure the server is secure and reliable at all times. We aim to provide a secure and steady gaming platform, which includes minimising all risks, including third-party incidents.\r\n\r\n【Disconnection Protection】 \r\n\r\nWe understand that sometimes external connection factors will table issues for our players, which can result in unnecessary downtime and potential loss. To combat the problem, our Disconnection Protection feature gives players extra 'time to act' to secure a stable connection before being sat out at the table.\r\n\r\nFor more information about PPPoker: https://bit.ly/2Vvjb7G \r\n\r\nFollow us on socia media:\r\n\r\nFacebook: https://bit.ly/2XIUyas \r\nInstagram: https://bit.ly/2RHE7HC \r\nTwitter: https://bit.ly/3eDrRSi\r\nYoutube: https://bit.ly/2xATnz1",
  "summary": "PPPoker-Free Poker App,Global Battle,Home Games,Play Poker With Friends",
  "installs": "1,000,000+",
  "score": 4.5072994,
  "ratings": 16646,
  "reviews": 7101,
  "price": 0,
  "IAPRange": "£0.99 - £97.99 per item",
  "developer": "PPPOKER",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 12, 2016",
  "updated": 1587538944000,
  "version": "3.3.0",
  "recentChanges": "Some Software Updates and Fixes",
  "appId": "com.lein.pppoker.android",
  "searchTerms": "poker"
 },
 {
  "title": "Video Poker by Pokerist",
  "description": "Welcome to the best Video Poker game!\r\nDownload the game and play for free!\r\nExplore classic and multi-hand gameplay with fantastic graphics in Video Poker.\r\nChoose between classic gameplay or multi-hand mode, where you can play up to 25 hands at once!\r\nTry your luck and and have Vegas-style fun!\r\n\r\nGame features:\r\n• FREE CHIPS – Play the game every day to get free chips!\r\n• CLASSIC AND MULTI-HAND VIDEO POKER – Immerse yourself in classic and multi-hand Video Poker and enjoy the fantastic graphics!\r\n• CHOOSE YOUR GAME – Play the most popular video poker games:\r\n- Deuces Wild\r\n- Jacks or Better\r\n- Bonus Video Poker\r\n• QUESTS – Complete daily quests to get free chips!\r\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\r\n• FAIR PLAY GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest Video Poker experience!\r\n• YOUR OWN PROFILE PAGE – Track your current status and progress in the game! Get experience and level up. See how many games you've played and achievements you've completed. Get unique properties and display them on your profile. View other players' profiles to see how you compare!\r\n\r\n♥️♦️♠️♣️ Want more than Video Poker? ♣️♠️♦️♥️\r\nTry our other games for an unforgettable 3D experience:\r\n• TEXAS HOLD'EM POKER – The most popular casino game among professional gamblers! Test your skills in amazing poker tournaments!\r\n• BLACKJACK – A simple game of “21”. An exciting 3D game that any blackjack fan is sure to enjoy.\r\n• ROULETTE – Featuring stunning 3D graphics and three table varieties: French, American, and European.\r\n• OMAHA POKER – A more dynamic version of poker with 4 cards in a hand. Have more fun with amazing combinations!\r\n• SLOTS – Explore our themed slots with lots of unique features!\r\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\r\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\r\n\r\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!\r\nhttps://facebook.com/Pokerist\r\nFollow us on Twitter and get free chips!\r\nhttps://twitter.com/KamaCasino",
  "summary": "Video Poker #1! Play for free the best classic casino game!",
  "installs": "100,000+",
  "score": 4.39,
  "ratings": 613,
  "reviews": 223,
  "price": 0,
  "IAPRange": "£0.50 - £99.99 per item",
  "developer": "KamaGames",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 26, 2019",
  "updated": 1588670748000,
  "version": "32.6.0",
  "recentChanges": "Stay home. Be safe!<br>We&#39;ve planned a lot of new features for you to enjoy!<br><br>New VIP System<br>VIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!<br><br>Weekly Rankings<br>Compete against other players and see how you rank each week!<br><br>Now MTT starts every 40 minutes!<br><br>Quicker Betting<br>Try raising a bet and you&#39;ll find a new option to bet 1/2 or the full pot! Raise faster!<br><br>Improved navigation in the lobby—now you can view playing tables in a chart.",
  "appId": "com.kamagames.videopoker",
  "searchTerms": "poker"
 },
 {
  "title": "City Poker: Holdem, Omaha",
  "description": "City Poker: Holdem, Omaha is a popular online Texas Hold'em poker customized to fit perfectly into your trendy modern life style. It's a top choice for whose willing to try their luck with millions of players from all over the world!\r\n \r\nKEY FEATURES:\r\n \r\nInstant play: just download and start playing right away!\r\nChallenging tournaments: explore the world and get unique rewards!\r\nPlay, chat, and share gifts: that's how you make friends from all the corners of the Earth!\r\nFree chips and bonuses!\r\nChoose how you want to play: you've got traditional buttons and handy gestures!\r\n\r\nThis product is intended for an adult audience.\r\nThis product does not offer real money gambling or an opportunity to win real money or prizes.\r\nPractice or success at social casino gaming does not imply future success at real money gambling.",
  "summary": "City Poker is a classic Texas Holdem Poker game made in modern style!",
  "installs": "50,000+",
  "score": 4.12,
  "ratings": 706,
  "reviews": 261,
  "price": 0,
  "IAPRange": "£0.80 - £300.00 per item",
  "developer": "Crazy Panda Mobile",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jul 7, 2017",
  "updated": 1588152784000,
  "version": "1.143",
  "recentChanges": "We&#39;ve taken into account your comments and requests in this update. So, welcome a few minor yet promising revisions that will make your gaming even more comfortable! And don&#39;t forget the new events, tournaments with unique rewards and gifts, too.<br>See you at our tables!",
  "appId": "air.ru.crazypanda.blitzpoker",
  "searchTerms": "poker"
 },
 {
  "title": "DH Texas Hold'em Poker",
  "description": "Over 30M downloads, 80K initial FREE CHIPS, 100% FREE Texas Hold'em Poker!  $80,000 initial FREE chips, DAILY gift, friends gift and online rewards - They're totally FREE! \r\n\r\nExciting features that you can only experience in DH Texas Poker:\r\n# VIP Table - Experience Las Vegas VIP!\r\n# Private Table - Play with your friends!\r\n# Game mode - Play Now, Lucky table, Private Room, Select Casino, Sit&Go\r\n# Daily login lottery\r\n# Daily special offer\r\n# Online reward\r\n# Super chip package\r\n# Facebook connect is supported.\r\n\r\nLike us on https://www.facebook.com/droidhenpoker\r\nIf you have any suggestion/comment/problem, please mailto: support@droidhen.com. \r\n\r\n============================================================================\r\nDON'T TRUST ANYONE/ANY WEBSITES WHICH REQUIRE YOU INPUT YOUR USERNAME AND PASSWORD. YOU ARE NEVER ASKED FOR PASSWORD TO GET REWARD.\r\n============================================================================\r\n\"DH Texas Hold'em Poker\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "OVER 30M PEOPLE ARE PLAYING DH TEXAS POKER!",
  "installs": "10,000+",
  "score": 3.94,
  "ratings": 470,
  "reviews": 218,
  "price": 0,
  "IAPRange": "£0.89 - £184.99 per item",
  "developer": "DroidHen",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 15, 2019",
  "updated": 1585814239000,
  "version": "1.2.2",
  "recentChanges": "Bug fixes and performance improvements.",
  "appId": "com.droidhen.texas.holdem.poker",
  "searchTerms": "poker"
 },
 {
  "title": "Poker 5 Card Draw - 5CD",
  "description": "Poker Five Card Draw Online with tournaments, rankings, achievements and a lot of players.\r\n\r\nFind fun and competitiveness in this Draw Poker app:\r\n\r\n• 4 modes to play with real people or robots\r\n• Excellent game graphics and superior gameplay\r\n• Lounges for all kinds of players\r\n• Tables with 2 to 8 players\r\n\r\n\r\nDownload now and start this great game: Poker 5CD\r\nFind thousands of people playing online.\r\n\r\n\r\nIF YOU ARE COMPETITIVE:\r\n\r\n• Join tournaments and win trophies\r\n• Compete in the ranking\r\n• Play and bet with virtual coins\r\n• Game Achievements\r\n• Track your stats of the Poker Matches\r\n\r\n\r\nOR PLAY FOR FUN:\r\n\r\n• Casual Games online\r\n• Training mode with robots\r\n• Chat in the game or privately with your friends!\r\n• Use search filters to find players\r\n• Meet people from around the world and make friends!\r\n\r\nPoker Five Card Draw Online is a complete app for amateurs and professionals card players! Download now and enjoy!",
  "summary": "Poker 5 Card Draw Online with tournament, ranking, achievements, lots of players",
  "installs": "100,000+",
  "score": 4.4393306,
  "ratings": 2407,
  "reviews": 855,
  "price": 0,
  "IAPRange": "£0.69 - £119.99 per item",
  "developer": "MegaJogos",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 2, 2017",
  "updated": 1586358278000,
  "version": "97.1.70",
  "recentChanges": "- improvements, bug fixes and performance optimizations",
  "appId": "air.br.com.poker.mobile",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Championship online",
  "description": "Join the Poker Online Championship for free with thousands of different players from all over the world! \r\n\r\nChallenge yourself in tournaments of each Poker world tour city: Moscow, Madrid, Paris, Amsterdam, London, New York and more. \r\n\r\nWin all the cups and become a World Champion and the best Poker player ever!\r\n\r\nFEATURES: \r\n♠️ Thousands and thousands of real players online – No longer waiting for competitors!\r\n♦️ Fancy a game with your friends? – Call them out to App and exchange daily gifts! \r\n♣️ The game can actually be played FOR FREE – Get lots of free chips and daily rewards!\r\n♥️ No annoying pop-up ads – Nothing’s gonna interrupt your game!\r\n♠️ More Tournaments – Participate in Seasonal tournaments which last 3 months or in Exclusive Holiday Tournaments to win more gifts! \r\n♦️ Players League – Compete against players from your League in weekly mini-Championships!\r\n♣️ Easy communication system – Prepared phrases and emoticons will help you to release all the emotions!\r\n♥️ We don’t have a chat – So nothing’s gonna put you in a bad mood 😊\r\n\r\nStay with us! We’re preparing lots of surprises and outstanding innovations for our players♥️♠️♦️♣️",
  "summary": "Become a champion of Poker! Pass career in great world capitals!",
  "installs": "500,000+",
  "score": 4.4140863,
  "ratings": 16526,
  "reviews": 5908,
  "price": 0,
  "IAPRange": "£0.79 - £90.99 per item",
  "developer": "Championship Online Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 23, 2017",
  "updated": 1560753388000,
  "version": "1.5.4.496",
  "recentChanges": "Fixed some bugs",
  "appId": "com.csogames.client.android.app.texaspoker",
  "searchTerms": "poker"
 },
 {
  "title": "CasinoLife Poker",
  "description": "Play the world’s #1 3D POKER APP!\r\nJoin the most popular POKER Game! \r\n\r\nThe most immersive poker game brings you and your avatar to the best realistic table experience on your Android.  Compete to win!   Do you have what it takes to battle your way to the Top and become a Poker Legend? \r\n\r\nKey Features: \r\n● FREE CHIPS – EVERY 4 HOURS.  Come back often! Plus, Get a Welcome Bonus of $250,000 FREE Chips just for downloading!   \r\n● POKER CAREER – Move up the Ranks and earn Big Perks! Win your way up to Legendary status.  Will you make it to the Top Rank?  \r\n● AUTHENTIC TEXAS HOLD ‘EM – Stay casual with the classic Texas Hold ‘Em cash game or turn up the heat and go for the high-stakes jackpot. It’s up to you how high the stakes go!\r\n● TEXAS HOLD’EM TOURNAMENTS – Win Texas Hold’em tournaments to earn the world’s top Trophies!   \r\n● POKER STATISTICS – Keep track of how you and your friends are playing with your poker stats! \r\n● PLAY LIVE WITH FRIENDS – Challenge your Friends to a game and Chat to make new friends.  \r\n● LEVEL UP!   As you play, you earn XP and levels.   These levels unlock cryptocurrency rewards, chips, and special tournaments!   \r\n● PLAY ANYWHERE – Start playing poker on your Android and continue on the Web version.     \r\n● CLOTHING STORE – The only Poker Game with its own clothing store!  Buy Amazing Outfits to customize your Avatar’s look and feel!  Be yourself, or dress like the fantasy experience you have always wanted! \r\n● EMOTES - The most realistic emotes and avatar animations of any Poker APP! Feel like your actually in sitting at a real life poker game!  \r\n● GUEST MODE – Rule the Roost and Play Texas Hold’em anonymously. Don’t be afraid to Go ALL IN!\r\n● FACEBOOK CONNECT BONUS – Get $500,000 additional chips when you connect your account to Facebook.\r\n● EARN CAREER TITLES - win your way up to become a Legend!\r\n\r\nStart your journey to become a Legend in CasinoLife Poker!\r\nDownload CasinoLife Poker and start playing today!\r\n\r\nWE’D LOVE TO HEAR FROM YOU - Connect with us on:  \r\nFacebook -  https://www.facebook.com/CasinoLifeOfficial\r\n\r\nAdditional information:\r\nThis product is intended for an adult audience for amusement purposes only. \r\nPractice or success at social casino gaming does not imply future success at real money gambling.\r\nThis product does not offer real money gambling or an opportunity to win real money or prizes.",
  "summary": "Best Texas Hold’em Poker Game",
  "installs": "100,000+",
  "score": 4.2008033,
  "ratings": 2515,
  "reviews": 1051,
  "price": 0,
  "IAPRange": "£0.89 - £299.99 per item",
  "developer": "KANEVA, LLC",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Oct 20, 2017",
  "updated": 1588013000000,
  "version": "4.3.15291",
  "recentChanges": "-Misc Bug Fixes<br>-Fix for some friend balances not displaying",
  "appId": "com.Kava.PokerLife",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Online",
  "description": "Poker online - is a set of popular poker games (Texas Hold'em, Omaha, 7-Stud, Draw poker).\r\nPlay online with friends or random players from around the world. Play from 2 to 9 people on virtual chips, so all kinds of game modes are not gambling and entertainment only. The game requires a permanent internet connection. \r\nWould you like to test your poker skills or learn how to play poker? Join us! \r\n\r\n• Free chips several times a day. \r\n• Four types of game (Texas Hold'em, Omaha, 7-Stud, Draw poker).\r\n• Three types of limits for each mode (Limit, Pot Limit and No Limit Poker).\r\n• Two table sizes for all game modes (large or small table).\r\n• User-friendly minimalistic interface.\r\n• No ads.\r\n• Horizontal or vertical orientation changing during play.\r\n• Private games with password protection and ability to invite friends.\r\n• Observing games of other players. \r\n• Friends, chats, smiles, achievements, leaderboards.",
  "summary": "Poker online-is a set of popular poker games (Texas Hold&#39;em, Omaha, 7Stud, Draw)",
  "installs": "1,000,000+",
  "score": 3.676512,
  "ratings": 7153,
  "reviews": 2455,
  "price": 0,
  "IAPRange": "£1.29 - £124.99 per item",
  "developer": "R-Soft LLC",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 20, 2016",
  "updated": 1586777545000,
  "version": "1.3",
  "recentChanges": " Added new assets<br>Added a new type of assets - collection<br>Added the ability to disable emoticons<br>Added ability to disable award animations",
  "appId": "com.rstgames.poker",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Forte – Texas Hold'em Poker Games",
  "description": "Go and play 100% FREE Texas Hold'em Poker!  Daily  bonus FREE CHIPS,  online achievements , different tables to play.\r\n\r\nSomeone says \"Work is for people who can't play poker\". Well, it's not me. I don't even FOLD laundry. For me life is a like a deck of cards with cycle of eat , sleep , poker and repeat . \r\nAnd if I win it's a skill, but if you win it's a pure luck. Don't get me wrong , I'm on a strict poker diet, nothing but fish and their chips ,so let's play NOW !\r\n\r\nOh, and one last thing , please after a big win, print on you t-shirt \"I just bought this shirt with your money\", just for fun for the next time when see you . It's time to click Install or I'm bluffing.\r\n\r\nKeep calm and GO ALL IN !",
  "summary": "Play FREE ONLINE POKER-the world&#39;s favorite Texas Holdem Poker game made for you",
  "installs": "10,000+",
  "score": 3.24,
  "ratings": 259,
  "reviews": 135,
  "price": 0,
  "IAPRange": "£1.79 - £114.99 per item",
  "developer": "Fortegames",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 16, 2018",
  "updated": 1587367874000,
  "version": "11.0.67",
  "recentChanges": "Minor bug fixes",
  "appId": "air.com.forteGames.pokerMobile",
  "searchTerms": "poker"
 },
 {
  "title": "Poker",
  "description": "Texas Hold‘Em and Omaha High/Low in the same app!\r\n\r\nPoker Live is the fastest-growing, social card game on Google Play with an authentic, multiplayer Las Vegas feel. Customize your Avatar, choose your favourite poker game mode and play with millions of poker players around the world!\r\nThere are hundreds of poker tables for both Texas Holdem and Omaha poker, VIP poker privilege suites, poker tournaments and poker challenges again for both Texas Holdem & Omaha.\r\n\r\nWith extra features and mini games aiming to enhance your gaming experience, Live Poker will satisfy even the most demanding poker players.\r\n\r\nThe Poker Live game has special items to buy which are purchased using our in-game currency ‘Diamonds’. Diamonds can be earned in Poker Live each day free of charge or you can purchase directly whenever you want from our store.\r\n\r\nLive Poker is a free, online, game of chance and skill for entertainment purposes only. It is not possible to win real money, real items/services/gifts or goods in kind by playing our skill games. The virtual currencies used in this game are called Chips and Diamonds and can be purchased in the ‘Store’ by using real money. Chips and Diamonds cannot be exchanged for cash or be paid out in any form and can only be used to play our game. Live Poker is intended solely for an adult audience which is eighteen years or over.\r\n\r\nTerms of Service: http://www.abzorbagames.com/terms-of-service",
  "summary": "Poker Live! Play awesome Texas Holdem &amp; Omaha for free all within the same app!",
  "installs": "100,000+",
  "score": 3.9913793,
  "ratings": 3517,
  "reviews": 585,
  "price": 0,
  "IAPRange": "£0.82 - £179.99 per item",
  "developer": "Funstage",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 7, 2014",
  "updated": 1586851078000,
  "version": "5.2.5",
  "appId": "com.abzorbagames.tango.poker",
  "searchTerms": "poker"
 },
 {
  "title": "Texas Poker English (Boyaa)",
  "description": "Poker with daily challenges, slot and minigames.\r\n11th Anniversary of our first Texas Poker 2008-2019! \r\n\r\n\r\nLOTS OF DAILY ACTIVE USERS\r\nBoyaa launched its first Texas Hold’em in 2008 so now we have players all around the world. That means that no matter when you play or where you live, you’ll find players anywhere, anytime. \r\n\r\n\r\nCLEAN POKER GAME\r\nWe have the RNG （random number generator） certified by iTech Labs that, along with a specialized customer service team, keeps the game fair, honest and fun. Online Social Poker at its best.\r\n\r\n\r\nPRESTIGE\r\nClimb up our international and regional poker rankings and enjoy beating pros and amateurs alike\r\n\r\n\r\nDAILY BANKROLL, VIP CARDS and tons of OFFERS\r\nWe have all kind of poker tools and surprises that keep the game entertaining for everyone, whether you are a beginner, a casual weekend player, an ambitious challenger or a pro. \r\nFrom daily free chips to bankruptcy relief and special services for VIP players. \r\n\r\n\r\nMULTIPLAYER MODES （Hold’em, Sit’N’Go, MTT, Club)\r\nPlay Texas Hold’em on fast or slow tables with high or low stakes. Play without limits, Play Multi-table poker tournaments or in Sit’N’Go rooms. Now you can even open your own private poker rooms in Club Mode, so you can choose the rules, the blinds, and your partners.\r\n\r\n\r\nINTERACTIVE\r\nAll the icons, emoticons, stickers and buttons are 100% interactive. Click on any player, and analyze his/her profile, best hands, winning rate and other data. Click on any playful item on the screen and share it with friends, frenemies, dealers, girlfriends, boyfriends and poker partners.\r\n\r\n\r\nThe app is designed for an adult audience. This is a social poker game with virtual chips that can only be purchased through the Google Pay application.\r\n \r\nPrivacy Policy:http://www.boyaa.com/information.html\r\nBoyaa Terms of Service: http://www.boyaa.com/mobile/termsofservice.html",
  "summary": "Online Poker with International Texas Hold’em Tournaments and Challenges",
  "installs": "1,000,000+",
  "score": 4.1540236,
  "ratings": 74417,
  "reviews": 19029,
  "price": 0,
  "IAPRange": "£0.50 - £94.99 per item",
  "developer": "Boyaa",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 25, 2012",
  "updated": 1543808058000,
  "version": "5.9.0",
  "recentChanges": "1. Added game : &quot;&quot;Sic Bo&quot;&quot; <br>2. Optimized lobby menu and other functions",
  "appId": "com.boyaa.fben",
  "searchTerms": "poker"
 },
 {
  "title": "Winning Poker™ - Free Texas Holdem Poker Online",
  "description": "☆The Best FREE Texas Holdem Poker Games☆\r\n\r\nAre you ready to face real poker stars and compete against them? Bluff and raise, improve your skills, gain experience, make new friends, and prove that you're the only poker star! Winning Poker™ - Free Texas Holdem Poker Game is a classic Texas Holdem Poker game with a fast-paced authentic feel, amazing graphics, and tons of exciting levels! \r\n\r\nYou will instantly receive 10,000 FREE chips upon signing up. Run out of chips? Check in daily or try your luck at the Super Roulette for FREE chips and AMAZING gifts! Download now and kickstart an epic career in online Texas Holdem!\r\n\r\nDon’t sit around at empty tables waiting for other players. At Winning Poker™ - Free Texas Holdem Poker Game, you’re only a tap away from the ACTION with real, authentic, and skilled players from around the globe! Get on the leaderboard and be the greatest poker SHARK of them all! Enjoy cash games, Sit and Go Poker tournaments, playing poker with friends game, big win and poker texas hold'em! \r\n\r\nGame features:\r\n✅Receive FREE chips daily!\r\n✅Classic Texas Holdem gameplay!\r\n✅Play with friends and send each other gifts!\r\n✅ Chat with other players!\r\n✅Test your competitive edge in Sit N’ Go tournaments.\r\n✅Regular updates with exciting new game modes!\r\n✅Exciting Level challenges with AMAZING prizes waiting for you!\r\n✅Unlock unique in-game tasks to earn boatloads of chips!\r\n✅A focus on community: share, like, and enjoy your online poker stories and experiences with your friends in real-time!\r\n✅Never-ending list of challenging missions to test your skills!\r\n✅Customizable Avatar Frames to showcase your individuality and dazzle in front of your friends!\r\n✅Beautiful and unique card back designs to add additional flavor to your game!\r\n✅Disconnected with pocket Aces in other apps? Winning Poker™ - Free Texas Holdem Poker Game was built to provide a smooth experience, especially when you have the nuts! \r\n\r\nTexas Holdem Poker is the world's favorite online poker game. It attracted millions of fans worldwide. There are small, medium and large tables, depending on your bankroll. It doesn't really matter whether you are a newbie without basic knowledge of rules or a weathered poker-shark, you will find a table suitable for you.\r\n\r\nEnter the world of free, online poker! Join Winning Poker™ - Free Texas Holdem Poker Game to feel the thrill of real entertainment! 100% FREE to play! \r\n\r\nPlay Poker online in this great multiplayer Texas Hold'em Poker game and enjoy Texas Holdem in Cash games, Sit & Go tournaments and Multi-Table Tournaments. Whether you just started to play or you’re already a poker superstar, Winning Poker™ - Free Texas Holdem Poker Game suits all levels. In this Texas Holdem poker game, you will be able to start your poker journey at the stake level of your choice.\r\n\r\nChallenge your friends to a card game or play against any of the thousands of worldwide poker stars. You can invite other poker players to your poker table, chat with them and exchange poker game strategies. With cash tables in a range of amounts and daily poker tournaments, you will feel the exciting rush of going All-In!\r\n\r\nMillions of poker players have already enjoyed our Winning Poker™ - Free Texas Holdem Poker Game. Play this very exciting Texas Hold'em poker game and prove you are the best poker player in the world. Press Install and download Poker World NOW. \r\n\r\nEnjoy playing our free Texas Holdem Poker game? Please rate us, your feedback counts!\r\n\r\nWe're always making changes and improvements to Winning Poker™ - Free Texas Holdem Poker Game. To make sure you don't miss a thing, keep your updates turned on! \r\n\r\n☆Follow us for exclusive chips offers and bonuses: \r\nFacebook: https://www.facebook.com/playwinningpoker/\r\n\r\n*ATTENTIONS:\r\n\r\nWinning Poker™ - Free Texas Holdem Poker Game is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "🏠Play Best Free Texas Hold&#39;em Poker online with FREE CHIPS and BONUSES!🏠",
  "installs": "10,000+",
  "score": 3.7821782,
  "ratings": 101,
  "reviews": 47,
  "price": 0,
  "IAPRange": "£0.99 - £91.99 per item",
  "developer": "Triple Sevens Games - Top Free Slots Casino Games!",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 30, 2019",
  "updated": 1583320137000,
  "version": "Varies with device",
  "recentChanges": "A new update is here! This update makes our players have a better gaming experience!<br><br>Remember to rate Winning Poker. We love to hear from our fans. Your enthusiasm is what keeps us going!<br>https://www.facebook.com/playwinningpoker/",
  "appId": "texas.holdem.poker.winning.android",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Jet: Texas Holdem and Omaha",
  "description": "Welcome to Poker Jet—a world tournament of Poker filled with risk and adrenaline! Play Texas Hold ‘em or Omaha poker online with thousands of users from all over the world!\r\n\r\nIn Poker Jet, you’ll find:\r\n* The classic Texas Hold ‘em cash game\r\n* The largest number of Omaha poker players\r\n* Weekly world poker club competitions\r\n* Omaha poker tournaments\r\n* Daily quests with rewards\r\n* Tournaments to suit any taste\r\n* Play poker with friends\r\n* Slots and other mini-games\r\n* A leaderboard where the best players can rise to the top\r\n* Talk to players across the globe\r\n\r\nSpend time in an elite casino atmosphere playing free poker and chatting with friends from all over the world! Be like a WSOP pro and welcome aboard Poker Jet! The poker party begins!\r\n\r\nAdditional information:\r\n· This game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.\r\n· The game is free to play; however, in-app purchases are available for additional content and in-game currency. In-app purchases range from $0.99 to $99.99 USD.\r\n\r\nEnd-user License Agreement: \r\nhttps://eula.socialquantum.com/",
  "summary": "Online Texas Hold ‘em and Omaha Poker.",
  "installs": "1,000,000+",
  "score": 3.972898,
  "ratings": 91120,
  "reviews": 20959,
  "price": 0,
  "IAPRange": "£0.89 - £90.99 per item",
  "developer": "Social Quantum Ltd",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Oct 29, 2012",
  "updated": 1564040701000,
  "version": "31.9",
  "recentChanges": "The Poker Jet team is always trying to improve the game for you! We have removed a whole range of errors in our latest update, increased performance and improved the stability of the app. Hurry over to the tables and show everyone who’s boss!",
  "appId": "com.socialquantum.pokerjet",
  "searchTerms": "poker"
 },
 {
  "title": "Texas Hold'em Poker",
  "description": "There are two kinds of poker modes: common tables and tournaments available in Texas Hold'em Poker. You can choose fast or slow mode, the size of the blinds. The game is a good choice for your leisure play.\r\n\r\n== FEATURES ==\r\n\r\n- A large number of free chips — free downloading to get 50,000 chips for a welcome gift ( login by Facebook to get 80,000 chips at the first time). Every six hours to get free chips for daily bonus. \r\n- Various modes: single table poker, 5-player S-N-G, 9-player S-N-G, general-tables and fast-tables.\r\n- Friends list: keep abreast of friends ranking; friends can be free to increase the stack of gifts; each pack can receive up to 200 thousands chips.\r\n- Social Chat: Chat with friends, play together, give each other gifts.\r\n- Compact interface: interface is simple, beautiful, easy to operate, easy to use.\r\n- Grading system: a special rating system, each upgrade will get a large number of free chips, the higher level, the higher reward.\r\n\r\nStay tuned for Texas Pokers to relax and add a touch of joy to your life!\r\n\r\nTips:\r\n       Designed for adults only for entertainment and practice purposes, this product is not intended to provide true gambling content or monetary transaction rewards.\r\n       Exercises and achievements in social gambling games does not means that you will be able to win money in real gamble games in the future.",
  "summary": "A classic Online Texas Hold&#39;em Poker Game with Exciting Free Rewords Everyday!!!",
  "installs": "500,000+",
  "score": 4.162071,
  "ratings": 14923,
  "reviews": 4711,
  "price": 0,
  "IAPRange": "£0.89 - £98.99 per item",
  "developer": "Free Puzzle Games, Ltd.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Oct 15, 2016",
  "updated": 1550571324000,
  "version": "Varies with device",
  "recentChanges": "fix login bug",
  "appId": "com.fruitgames.texaspoker",
  "searchTerms": "poker"
 },
 {
  "title": "Fun Texas Hold'em Poker",
  "description": "Fun Texas Hold'em Poker, a poker game absorbing a large number of players from all over the world, \r\nTests your psychological quality, card-counting abilities and other skills.\r\n\r\nImpressive designing concepts, more attractive;\r\nAdopting regular Texas Hold'em rules,\r\nNo-limit Hold'em game.\r\nFree to download, full of wonderfulness and excitements!\r\nJoin Fun Texas Hold'em Poker now,\r\nCompete with poker masters worldwide, and make friends with them,\r\nEnjoy a different poker game experience!\r\n\r\nFree to download, and enjoy the whole game experience;\r\n1-click access to the poker tables, play at anytime, save you a huge amount of time;\r\n\r\n♠ Free to download, and enjoy the whole game experience;\r\n♥ 1-click access to the poker tables, play at anytime, save you a huge amount of time;\r\n♦ Meet poker masters worldwide, no matter you are a newbie without basic knowledge of rules, or a poker master, you can find a table suitable for you here;\r\n♣ Magnificent game scenes and interface, enjoy the pleasing game environment;\r\n♠ Simulated visual changes of human, one finger is enough to take control the poker table;\r\n♥ No-limit Hold'em game, try more different game strategies;\r\n♦ No registration and network required, enjoy the game effortlessly without any trouble;\r\n♣ Rich and varied achievement and daily missions, have a much fuller poker game experience;\r\n♠ Win fabulous rewards everyday and have more fun.\r\n\r\nDownload Fun Texas Hold'em Poker now, and take the well-prepared gift!\r\n\r\nIf you meet any problems in the game, using the contact customer service in the game\r\nFun Texas Hold'em Poker service mailbox: cs@cubeace.com\r\nSome musical material in Fun Texas Hold'em Poker comes from maoudamashii\r\n\r\nThis product is intended for use by those 18 or older for amusement purposes only. This product does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at real money gambling. When you start using this product, it means you accept the terms of use given by Cubeace, and trust on how we handle your personal information. For more information, please visit our website, www.cubeace.com.  Social network terms of service may be applicable as well.",
  "summary": "The world&#39;s best card game is now FREE for a limited time only! Download NOW!",
  "installs": "500,000+",
  "score": 4.452281,
  "ratings": 33410,
  "reviews": 6515,
  "price": 0,
  "IAPRange": "£0.77 - £96.60 per item",
  "developer": "Cubeace",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 12, 2015",
  "updated": 1570630264000,
  "version": "19.10.09",
  "appId": "com.luckystargame.texaspoker",
  "searchTerms": "poker"
 },
 {
  "title": "Texas game play Poker",
  "description": "Play POKER ONLINE now and TEST MULTIPLAYER TEXAS HOLD'EM POKER game! Invite your friends to the most exclusive online poker rooms in the world and compete with them anytime, anywhere,",
  "summary": "Play Texas Hold&#39;em Poker online and enjoy the best card multiplayer tournaments!",
  "installs": "50,000+",
  "score": 4.09,
  "ratings": 500,
  "reviews": 196,
  "price": 0,
  "developer": "atdapps inc",
  "genre": "Casino",
  "contentRating": "Parental guidance",
  "contentRatingDescription": "Parental Guidance Recommended",
  "released": "Jan 12, 2020",
  "updated": 1584881491000,
  "version": "1.0.3",
  "recentChanges": "new",
  "appId": "com.atdapps.casinocards",
  "searchTerms": "poker"
 },
 {
  "title": "MONOPOLY Poker - The Official Texas Holdem Online",
  "description": "Welcome to the official Texas Hold’em Poker Game of MONOPOLY. Are you ready to conquer the Poker empire ?\r\n\r\nMONOPOLY POKER FEATURES️: \r\n \r\nMASTER TEXAS HOLDEM POKER - There are three types of Texas Holdem you can play including: Cash Games, Sit & Go Tournaments, and super fast Spin & Play Rounds.\r\n\r\nFREE CHIPS EVERY 4 HOURS - Receive a free stack of poker chips several times a day so you can play for even longer!\r\nDOMINATE THE LEAGUES - Beat the other players and prove that you’re a true card shark when it comes to Texas Holdem poker.\r\n\r\nWIN THE RINGS & FEEL THE GLORY - Earn as many of the Champions Rings as you can in the Sit & Go Tournaments.\r\n\r\nCLIMB THE LEADERBOARD - Only the best players will reach the highest spots! \r\n\r\nHIGH QUALITY GRAPHICS - Enjoy top notch graphics and animations.\r\n\r\nCOMPETE AGAINST YOUR FRIENDS - MONOPOLY Poker is a multiplayer game. Invite your friends to play with you in the tournaments...but will you be able to beat them? \r\n\r\nWIN TOURNAMENTS AROUND THE WORLD - Show off your Poker skills from São Paulo to Las Vegas.\r\n\r\nHIGHER STAKES, BIGGER PAYOUTS - The payouts will get bigger and better as you participate in more and more multiplayer tournaments.\r\n\r\nSPIN & PLAY - Press your luck and find out if you can win a huge jackpot in this version of Texas Holdem. \r\n\r\nPLAY ANYWHERE AND ANYTIME - You can enjoy this online poker game whenever and wherever you are with your phone or tablet. \r\n\r\nPLAYING FAIR - This is a Texas Holdem PvP game that plays by the rules to keep things fair. \r\nMR MONOPOLY shuffles the cards while using the best proven methods. You won’t find any roulette or bingo style poker here! \r\nAll the thrills of Las Vegas can be found at each one of the Texas Holdem tables that are waiting for you in this challenging free online poker game.\r\nWIN BIG BUCKS\r\n\r\nPlay your cards right during each round and earn the Jackpot. Just like in a Texas Holdem tournament in a real casino, you’ll need to strategically raise the stakes and know when it’s time to fold. Use your poker skills after MR MONOPOLY passes out the cards and carefully consider how many chips you’re willing to risk during each exciting round.  \r\n\r\nThis Texas Holdem card game, which is one of the world’s best multiplayer card games, does not feature real money or real gambling.\r\nTHREE AWESOME VERSIONS OF TEXAS HOLDEM\r\n\r\nShow off your skills during your attempts to earn the Champions Rings in the Sit & Go Tournaments and make it to the top of the leaderboard. The more chips you win, the higher you’ll rise in the rankings. The competition will get more intense, though. You can even play with your friends in this addictive and free multiplayer poker game. Find out if you can collect all of their chips while you use your favorite bet strategy. Download the game today, and get ready for all sorts of cool and challenging poker excitement!\r\nDo you want to join poker tournaments and become a master of poker? Download MONOPOLY Poker now and start playing today for free! The classic Texas Hold’em card game, now for mobile and tablets!\r\nMONOPOLY Poker is a Play-For-Fun Poker game that is intended for amusement only.\r\nAll in-game sales are final. The games are intended for an adult audience (i.e. intended for use by those 21 or older). The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling\".\r\n\r\nThe MONOPOLY name and logo, the distinctive design of the game board, the four corner squares, the MR. MONOPOLY name and character, as well as each of the distinctive elements of the board and playing pieces are trademarks of Hasbro for its property trading game and game equipment. © 1935, 2020 Hasbro. All rights reserved.",
  "summary": "Conquer the Poker Empire in this Texas Holdem online card game",
  "installs": "500,000+",
  "score": 3.8039703,
  "ratings": 4073,
  "reviews": 1546,
  "price": 0,
  "IAPRange": "£0.89 - £86.99 per item",
  "developer": "Youda Games Holding B.V.",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "May 7, 2020",
  "updated": 1588247496000,
  "version": "0.4.4",
  "recentChanges": "- Added a &quot;Deals&quot; button to easily navigate through all the available deals<br>- Bugfixes",
  "appId": "com.youdagames.monopolypoker",
  "searchTerms": "poker"
 },
 {
  "title": "Texas HoldEm Poker Deluxe Pro",
  "description": "Top-rated Poker App on Facebook!  \r\nFASTEST growing Poker App on Android!\r\n\r\nTexas Hold'Em Poker Deluxe Pro offers classic gameplay, full Facebook compatibility and an active community. Compete against over 16 million other players on Facebook, iPad, iPhone, and Android. It's exciting Las Vegas style poker on the go! \r\n\r\nJoin now and receive $30,000 in chips for FREE!\r\n\r\nGame Features:\r\n* FREE daily gifts and chip bonuses \r\n* 1-click access to 100's of tables \r\n* 5 to 9 person Poker tables \r\n* Sit-n-Go Tournaments\r\n* Shootout Tournaments\r\n* Beautiful graphics and luxurious casinos\r\n* Simple interface that's easy to navigate\r\n* Personalized profile and buddy lists\r\n* Fast registration via Facebook Connect (optional)\r\n* Live in-game chat and animated emoticons\r\n* Plenty of gifts, snacks, and drinks to share with others\r\n* Help function, players can use it to detail any problems they encounter and receive a reply from Live Support within 3 business days\r\n* Unlock special prizes in the Facebook App (English only)\r\n\r\nAnd more is coming soon....!",
  "summary": "★★★★★ Get $30,000 chips FREE for your first time playing.",
  "installs": "500,000+",
  "score": 4.30071,
  "ratings": 29606,
  "reviews": 10283,
  "price": 0,
  "IAPRange": "£1.26 - £98.99 per item",
  "developer": "IGG.COM",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Apr 20, 2012",
  "updated": 1584000336000,
  "version": "2.1.0",
  "appId": "com.igg.pokerdeluxepro",
  "searchTerms": "poker"
 },
 {
  "title": "Paddy Power Poker - Texas Hold'Em & Jackpots",
  "description": "Introducing Paddy Power’s brand spanking new Poker app!  Enjoy everything Paddy Power Poker has to offer on the go.\r\n\r\nFEATURES:\r\nQuick Access to Games: Quick launch icons allow customers to join a game with one tap. Choose from Texas hold ‘em to speed games and tournaments and play with poker customers around the world. Get quick access to both cashier and missions features.\r\n\r\nTournaments: If you’re new to Poker then why not improve your Poker skills by entering our daily tournaments. \r\n\r\nPoker Casino: To wind down after a tough Poker session, why not try out the Poker Casino. We have all your favourites with Roulette and Blackjack and we’re always releasing new games.\r\n\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 (UK)/ 1800 753 753 (IE)  or visit https://www.begambleaware.org/ for UK/ http://www.gambleaware.ie/ for IE.",
  "summary": "Quickly Access Our Poker Games, Enter Our Daily Tournaments and Try Poker Casino",
  "installs": "10,000+",
  "score": 3.85,
  "ratings": 327,
  "reviews": 198,
  "price": 0,
  "developer": "PaddyPower PLC",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1587025126000,
  "version": "20.1.06002",
  "recentChanges": "We always strive to provide our players with the best mobile poker experience, that’s why we’re always making improvements to the app. If you like what we’re doing, please take a moment to rate our app and let us know!",
  "appId": "com.betdash",
  "searchTerms": "poker"
 },
 {
  "title": "Fruit Poker Classic",
  "description": "Re-live the excitement of one of the most popular video poker games ever created, Fruit Poker on your Android device. \r\n\r\nEnjoy more bonuses than ever, authentic 90's graphics and sounds in this \"Jacks or Better\" style slot machine\r\n\r\nThe Classic Fruit Poker casino slot machine. Get the highest combination of cards, double or nothing, collect cherries and more. This game is guaranteed trip down memory lane",
  "summary": "Fruit Poker Classic Video Poker Slot Machine Game",
  "installs": "100,000+",
  "score": 4.1032257,
  "ratings": 3121,
  "reviews": 913,
  "price": 0,
  "IAPRange": "£1.19 - £57.99 per item",
  "developer": "Gengolia",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 5, 2017",
  "updated": 1577638992000,
  "version": "0.3.5",
  "recentChanges": "Now you can skip unwanted ads very easily",
  "appId": "com.gengolia.fruitpokerClassic",
  "searchTerms": "poker"
 },
 {
  "title": "Fulpot Poker : Free Texas Holdem,Omaha,Tournaments",
  "description": "Start to join the World famous Free online poker games, Texas Holdem, Omaha and Poker Tournaments with EXTREME INTENSE POKER ACTION!\r\n\r\nPlay the GREATEST POKER EXPERIENCES at Fulpot Poker, now on Android mobile devices!\r\nPut your extraordinary poker skills on the tables & win BILLIONS of chips~\r\n\r\n========== Game Features =========\r\n\r\n*SIT & GO TOURNAMENTS*\r\nDon't wait up anymore, just enjoy the tournaments!\r\nOnly need 3 people to start the game and it's on 24/7, so enjoy the fast tournament and be the winner!\r\n\r\n*AUTHENTIC POKER ACTION*\r\nJust as Classic alike real poker games in Las Vegas Casino! \r\nRoll out the poker cards with full of tension, let your heart goes pit-a-pat.\r\n\r\n*DEAL FAIR & PLAY FAIR POKER*\r\nFair competition against players!\r\nToday could be a good run for gameplay, now’s the time for BIG win.\r\n\r\n*VARIOUS POKER GAMES IN ONE HAND*\r\nChoose any poker game channel for your PERFECT Poker Party!\r\n\r\nVegas cash game style! Low to High stakes, variety ways to pick any tables, find the hottest place for big betting~\r\n\r\nDo you want to experience poker in real vegas style? Then, Texas Hold'em Poker is the right place to bet. Real Gamblers know well how to poker in the house! Have a authentic feelings opening your own cards in 3D mode!\r\n\r\nNeed more Thrilled? Omaha Holdem Poker is what we offer for huuuge WIN! Try to beat all - playing 4 cards in Omaha holdem\r\n\r\n*Table Change Newly Added*\r\nMove to a different table easily.\r\n\r\n*Prove your Skills*\r\nBased on the league point you earned thruough the game, it will be decided whether you get to Promoted, Remained, or Demoted weekly.\r\nSweet rewards weekly based on your League standing MASTER, PRO, AMATEUR, BEGINNER, and NEWBIE.\r\nThe higher league you reach, the better benefits you get! League-only Package with up to 200% Bonus Benefit.\r\n\r\n*Real-Time live Tournaments*\r\nOnce you join, it will make you addictive!\r\nMake your own choice how to double up your in-game money.\r\nWorld wide players are ready to begin their favorite poker tournaments and you are the part of them!\r\nLots of Fun, High prizes guaranteed! It's time to showdown your poker sklls.\r\n\r\n*Turn to spin for Free Bonus chips!* 'COMING SOON!'\r\nEvery day and night is FREE to spin for Biggest jackpot at Fulpot Poker~\r\nSpin the wheel for free winning up to millions of free chips! \r\nDo not miss this exlusive offer!\r\n\r\n*Mission is Possible*\r\nDaily missions, shoot out for quests and make your poker night more pleasant!\r\nCharge Free rewards for each quest you have achieved.\r\n\r\n*Check-In Bonus*\r\nVisit daily and earn more free game money chips!\r\n\r\n*Poker with best poker friends*\r\nSecret to all, xoxo invite friends and start playing Texas holdem games!\r\nFor friends invitation, you will get Free charge of Chips;-)\r\n\r\n*Communications with players*\r\nMost entertained at Poker is to interact with players. \r\nExpress emotions with funny emoticons to competitors! Tell something to hide your hands.\r\n\r\n*You are always welcome to visit us on social networks*\r\nBe our biggest fan, we all love playing poker and we love to get any feedback from you!\r\nVisit us on Facebook (http://facebook.com/fulpot) and on Twitter (http://twitter.com/fulpot)!\r\n\r\nThe games are intended for an adult audience. We do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "Join the most AUTHENTIC LIVE POKER TOURNAMENTS with all players in the World!",
  "installs": "100,000+",
  "score": 4.4175935,
  "ratings": 9936,
  "reviews": 5503,
  "price": 0,
  "IAPRange": "£0.79 - £94.99 per item",
  "developer": "ME2ON Co., Ltd.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 4, 2016",
  "updated": 1589153073000,
  "version": "2.0.29",
  "recentChanges": "● Enjoy the break time of tournaments with Match the Cards!<br>● Check your play tendency at the improved profile page!<br>● Now you can combine the 300k tickets at the Create Ticket!<br>● Final Table of tournaments is improved with the new dealer!",
  "appId": "com.me2on.fulpotgenius",
  "searchTerms": "poker"
 },
 {
  "title": "Jolly Card Poker",
  "description": "Play authentic video poker just like the casino.\r\nJolly Card Video Poker is old gamble Poker machine.\r\nIt's intended for all who like playing slot machine poker.\r\n\r\nDefault BET value is 10.\r\nBET might be changed only before new DEAL.\r\nPlayers can change BET value between 1 and 99 tapping on it.\r\nOn long tap (tap and hold about 3 seconds) the BET dialog will show.\r\n\r\nAuto Hold feature automatically puts the desired cards on hold. Therefore the player automatically plays according to the optimal strategy. Players can switch Auto Hold feature ON or OFF tapping on it.\r\n\r\n- - - - - - \r\n\r\nv.1.2\r\n- Enabled BET value up to 99. Long tap (tap and hold about 3 seconds) the BET dialog will show.\r\n- Fixed issue with Street and Street Flush (ex. 8-9-10-J-Q)\r\n\r\nv.1.1\r\n- Joker card was fully implemented.",
  "summary": "Play authentic video poker just like the casino.<br>Old gamble Poker machine.",
  "installs": "100,000+",
  "score": 4.4657536,
  "ratings": 3957,
  "reviews": 695,
  "price": 0,
  "developer": "Ivan Marinković",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 22, 2012",
  "updated": 1491870423000,
  "version": "2.0",
  "recentChanges": "v.2.0<br>- Fixed auto save Credits on exit<br>- Daily bonus<br>- Free Credits for video ads<br>- Added Bet 99 in the Bet dialog<br>- Facebook connection<br>- Issues reported by users were fixed",
  "appId": "com.solvus_lab.android.jolly_card",
  "searchTerms": "poker"
 },
 {
  "title": "Poker is Allin",
  "description": "In the 1950s’ United States, everyone was chasing the American dream, but your dream had already come true, and it only happened on the table of Texas Hold’em Final in Las Vegas. But losing one particular game wiped out everything you’ve ever owned. At this moment, you finally understood that the so-called American dream for you was just a dream. After that, you lost all the courage and vowed to never play any poker game.\r\n\r\nYou decided to retire, and stayed low in an ordinary ranch in Texas. You worked as a cowboy for three years in that ranch, away from the hassles of the world, but right now a rumor drags you back to reality. Your \"enemy\" who won over you and became the king of poker with despicable means three years ago is sending invitations to all poker players around America to come to Las Vegas. Whether it is another normal game or a conspiracy he set for you, all the puzzles require you to solve by yourself. After some struggles and with encouragement from friends who you care about, you decided to start a new journey.\r\n\r\nMy dear friend, whether to return to the top, or to fall in front of your \"enemy\" once again, you are going to choose your own destiny. \r\n\r\nKey features:\r\n\r\n1. The world's first 3D Texas Hold'em poker game.\r\n2. Story mode: From losing everything to returning to the top of the game. Get your revenge.\r\n3. 3D character creation: You can customize the appearance of your character as you wish, including amazing accessories and tattoos. It's your choice!\r\n4. Travel back to the 1950s: From Texas cowboy town, to the sin city Chicago, to the casino city Las Vegas, we will take you around the United States to relive the golden age of the last century.\r\n5. Authentic scene on poker table: Plenty dialogues, lifelike actions. You can also tip the dealer. Everything will make you feel like in the real scene.\r\n6. Multiple modes: Win over your opponents at the poker table in multiplayer modes.\r\n7. Tournaments: You can always take challenge in the tournaments such as SNG and MTT.\r\n8. Continuous play: You can connect your account to Facebook and continue your game.\r\n9. Guest mode: Rock the tables and play Texas Hold'em anonymously.\r\n\r\nNote:\r\n\r\nThis game is only for adults who are 17 or older.\r\nThis game is for entertainment purposes only and does not offer real–money gambling or the chance to win real money or prizes. \r\nThe practice or success in social casino games does not mean real-money gambling success.\r\nThe game is free to play, however, in-app purchases are still available for additional content and in-game currency.\r\n\r\nSend mails to pokerisallin3d@gmail.com when you meet any problems or have suggestions. Follow our facebook fan page https://www.facebook.com/Pokerisallin/ to stay updated on all the latest update or to chat with other players! We love your feedback!",
  "summary": "Classic 3D Texas Holdem Poker!",
  "installs": "10,000+",
  "score": 3.66,
  "ratings": 295,
  "reviews": 157,
  "price": 0,
  "IAPRange": "£0.79 - £184.99 per item",
  "developer": "Wild Poker",
  "genre": "Casino",
  "contentRating": "PEGI 16",
  "contentRatingDescription": "Drugs, Simulated Gambling",
  "released": "Dec 12, 2019",
  "updated": 1576251835000,
  "version": "1.0.4",
  "recentChanges": "Christmas Activities:<br>-New skins, accessories, table props are now available, and there are exclusive Christmas items to make your own Christmas theme.<br>-Added new Christmas gift packages and New Year special gift package.<br><br>New Feature:<br>-Added Facebook sharing feature.<br>-Added one-click pick-up feature for obtaining rewards.<br>-Added notification and announcement news feature.<br><br>Others:<br>-Optimized the login steps.<br>-Optimized the matchmaking system.<br>-Improved the game’s stability.<br>-Fixed BUGs",
  "appId": "com.fotoable.NutsPoker",
  "searchTerms": "poker"
 },
 {
  "title": "Full Tilt: Online Poker & Casino Games with Slots",
  "description": "A POKER AND CASINO APP TAILORED FOR MOBILE\r\nFull Tilt’s mobile casino and poker app lets you play poker games like Texas Holdem poker and Omaha poker, as well as Slots, Blackjack and Roulette, all in one place. Download this casino app and you can enjoy your favorite poker and casino games anytime, anywhere.\r\n\r\nTHE BEST POKER GAMES AVAILABLE 24/7\r\nWin real cash when you play in Full Tilt’s online poker and casino games. Try our huge variety of slots games to win big Jackpots, or immerse yourself in our live casino games, including live blackjack and live roulette.\r\n• Hit Texas Holdem poker and Pot Limit Omaha poker tables\r\n• Never wait for a seat at our huge selection of poker tournaments\r\n• Play poker for play money and buy Play Chip bundles and become an instant high roller\r\n• Win a share of up to 2,000 times your buy-in with Spin&Go poker tournaments\r\n• Also available: fast-paced Zoom and Ring Games\r\n\r\nAMAZING CASINO GAMES LIKE ROULETTE AND BLACKJACK\r\nPlay the world’s most popular online casino games, such as online Blackjack, online Roulette and online Slots games\r\n• Enjoy a great Online Roulette experience at our state-of-the-art roulette tables\r\n• Beat the dealer with our exciting multiplayer Blackjack games\r\n\r\nALL YOUR FAVORITE SLOTS GAMES\r\nFrom Starburst to Jack and the Beanstalk, Full Tilt casino offers all your favorite slot games, with huge real money casino prizes. \r\n• All the most popular slots available\r\n• Play for a chance to win huge progressive jackpots\r\n• New slots are also added regularly to ensure all the newest slot games are always made available.\r\n\r\nLIVE CASINO WITH LIVE ONLINE BLACKJACK AND ROULETTE\r\nThe Live Online Casino experience invites you to join the hustle and bustle of a brick and mortar casino without having to step away from your screen. \r\n• Pit yourself against the dealer at Live Online Blackjack\r\n• Play at exclusive Live Online Roulette tables or share the highs and lows with everyone\r\n• Live Online Ultimate Texas Hold’em offers another spin on classic poker, as you try to beat a real dealer\r\n\r\nFEATURES AND BONUSES ON THE FULL TILT CASINO AND POKER APP \r\n• Make real money deposits quickly and easily using your mobile device\r\n• Never miss a promotion or special offer with our Push Notifications, keeping you in the game at all times \r\n• The Deal - one five-card hand can unlock a wealth of prizes, including a 50% share of the progressive jackpot. \r\n\r\nDownload the Full Tilt online poker and casino app now!\r\n\r\nJoin our poker community on social media and connect with poker players from around the world.\r\n\r\nhttps://www.facebook.com/Fulltiltpoker\r\nhttps://twitter.com/FullTiltPoker\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.\r\n\r\n*********************************\r\n\r\nFree £20 Promotion Terms and Conditions\r\n\r\n- Offer only available to players who have never made a real money deposit and make a first deposit of $10 or more.\r\n- The $20 Free Play will be credited daily from deposit date: Day 1 = 5 x $1 S&G (Spin & Go) tickets + $1 Million Freeroll ticket, Day 2 = 5 x $1 S&G tickets, Day 3 = 5 x $1 S&G tickets, Day 4 = $5 cash bonus, Day 5 =5 x $1 S&G tickets, Day 6 = $5 cash bonus\r\n- We reserve the right to withhold rewards if there is reason to suspect that a deposit is fraudulent, or that it has not been made with the intention of using it to play real money games\r\n- All Spin & Go tickets issued as part of the $20 Free Play promotion expire 21 days from issue\r\n- Any unused tickets issued as part of this promotion will be forfeited\r\n- Tickets cannot be redeemed for cash or any other value, or be transferred\r\n- A cashout at any time during the bonus period will leave you ineligible to claim this bonus",
  "summary": "Get £20 FREE PLAY and play Poker, Slots, Blackjack, Roulette and other games!",
  "installs": "50,000+",
  "score": 3.22,
  "ratings": 352,
  "reviews": 243,
  "price": 0,
  "developer": "Stars Mobile Limited",
  "genre": "Card",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Aug 9, 2017",
  "updated": 1559203839000,
  "version": "1.111.5",
  "recentChanges": "We never stop improving our app to provide the best mobile poker experience to our millions of players across the world. If you like our work please take a moment to rate our app and let us know!",
  "appId": "uk.fulltilt.fulltilt",
  "searchTerms": "poker"
 },
 {
  "title": "德州撲克 神來也德州撲克(Texas Poker)",
  "description": "= 【Rated 5 stars by our players! Taiwan’s favorite Texas Hold’em and Show Hand game】 =\r\n\r\nOver 10 million poker players online, tap once and join a table! Bring on the chips!\r\nThe most exciting Texas Hold’em game out there! Give it a try—no need to register!\r\n♠ New to poker? Don’t worry! Our system will instantly analyze your hand’s strength for you!\r\n♠ We’ll give you 30,000 chips to start—FREE!\r\n♠ Poker for Pros: Authentic play style—Join tables in no time!\r\n♠ Authentic Poker experience—just like the real thing!\r\n♠ Internationally certified fair dealing system\r\n♠ Experience the realistic feeling of a casino: Slots, Blackjack, Sic Bo\r\n♠ Try our original 8-A Royal Show Hand for action-packed hands!\r\n\r\n= Features (Texas Hold’em, Showhand)=\r\n♣ Authentic Texas Hold'em-style Poker that‘s taking over Taiwan!\r\n♣ Over 10 million players love our game—fastest tables in Taiwan!\r\n♣ Play against real players in an authentic casino-like experience!\r\n♣ Royal/Omaha-style Poker: Royal flushes for days!\r\n♣ Claim stacks of FREE poker chips with daily challenges!\r\n♣ Rejoin system reconnects you if you lose your connection\r\n♣ Try your luck at other games like Blackjack and tons of slots\r\n♣ Intuitive UI⁠—show your cards and go all in with one tap!\r\n♣ Use emotes to interact with other players for even more fun!\r\n\r\n－Texas Hold’em Updates－\r\n♥ Royal Hold'em mode－huge hands all day!\r\n \r\n= Additional Notes =\r\n♦ Users can use their existing Gamesofa, Facebook, or Yahoo accounts to play\r\n♦ If you want to use an MSN, Google, or other account to login, please see our “Account Conversion” page for more details: https://www.godgame.com.tw/mobile_app/?game=19#1\r\n♦ This product is intended for use by those 18 or older.\r\n♦ This app does not offer “real money gambling” or an opportunity to win real money or prizes.\r\n♦ User performance in this app is no indication of user performance or skill in genuine gambling.\r\n♦ This game is rated 15+ by the Taiwan Digital Game Rating Committee.\r\n♦ Portions of this game contain portrayals of sexually suggestive clothing, alcohol, and tobacco.\r\n♦ This game is free to play and includes virtual currency and goods, as well as paid services. Remember to take breaks!\r\n=============================\r\nGamesofa- Fun in five easy minutes\r\n=============================\r\nWant to play more?\r\nGamesofa website: http://www.gamesofa.com\r\nMore games: http://www.gamesofa.com/mobile/\r\n\r\n\r\n【超多評鑑五顆星，台灣玩家激推線上德州撲克、梭哈品牌】\r\n千萬撲克玩家鬥心機，按一下就入桌! 玩神來也，「賭神」來也!\r\n免註冊，免費體驗 最刺激的撲克牌遊戲 Texas Poker!\r\n♠ Poker新手不用怕: 牌力分析，免費玩送30,000籌碼!\r\n♠ Poker高手爽快贏: 正宗撲克玩法，快速湊桌、隨時開打!\r\n♠ 真Poker體驗: 國際機構認證，公平發牌機制，絕對真實!\r\n♠ 真Casino體驗: 拉霸機台、Slots、21點、骰寶隨你玩\r\n♠ 首創梭哈８～Ａ Royal玩法，輸贏更大更刺激!\r\n\r\n－遊戲特色(Texas Poker, Showhand)－\r\n♣ 撲克牌主流玩法，Texas Hold'em席捲台灣!\r\n♣ 千萬玩家推薦，挑戰全台最快配桌!\r\n♣ 真人撲克牌對戰，實境Casino體驗\r\n♣ 皇家/奧瑪哈德撲: 皇室玩法，同花順贏不停!        \r\n♣ 德撲幣送超多：打Poker解任務，天天領籌碼!\r\n♣ 斷線重連系統，網路斷線也不怕\r\n♣ 21點、拉霸slot多種機台，打撲克牌外還能試手氣\r\n♣ 介面簡單、一鍵All-in梭哈最爽快\r\n♣ 互動道具表心意，跟朋友打Poker更有趣\r\n\r\n－德州撲克(Texas Poker)改版內容－\r\n♥ 皇室撲克(Royal hold'em)玩法，天天拿大牌！\r\n\r\n－其他說明－\r\n♦ 原「神來也會員」或「Facebook」、「Yahoo」帳號直接玩\r\n♦ 若您之前使用MSN, Google等帳號登入神來也遊戲，想在手機上繼續使用該帳號，請參考「帳號轉換及登入教學說明」https://www.godgame.com.tw/mobile_app/?game=19#1\r\n♦ 本遊戲以成年人為訴求對象\r\n♦ 本遊戲不提供「現金交易賭博」，也沒有機會贏得現金或實體獎品\r\n♦ 玩社交類賭博遊戲時的玩法或成績不錯，不代表日後以「金錢賭博」時會獲得相同的成果\r\n♦ 本遊戲依中華民國遊戲軟體分級管理辦法分類為輔15級\r\n♦ 本遊戲部分畫面穿著凸顯性特徵之服飾及菸酒畫面。\r\n♦ 本遊戲為免費使用，遊戲內另提供購買虛擬遊戲幣、物品等付費服務。請注意遊戲時間，避免沉迷\r\n\r\n=============================\r\nGamesofa 5分鐘．想樂最輕鬆\r\n=============================\r\n想玩更多？\r\nGamesofa官網 http://www.gamesofa.com\r\n更多神來也遊戲 http://www.gamesofa.com/mobile/",
  "summary": "Rated 5 stars by millions of players<br>30000 free chips &amp; Heaps of daily bonuses",
  "installs": "1,000,000+",
  "score": 4.2096972,
  "ratings": 72380,
  "reviews": 10848,
  "price": 0,
  "IAPRange": "£0.79 - £299.99 per item",
  "developer": "Gamesofa Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 17, 2012",
  "updated": 1587624325000,
  "version": "5.6.6",
  "recentChanges": "- 挑戰【賭神之路】，完成任務奪排行<br>- 優化武鬥流程，輸贏原因一目了然！<br>- 輕鬆比較戰績！對手實力一目瞭然",
  "appId": "com.godgame.texasholdem.android",
  "searchTerms": "poker"
 },
 {
  "title": "ATHYLPS - Poker Outs, Poker Odds, Poker Trainer",
  "description": "ATHYLPS - Poker Outs and Odds Trainer. With it, you can learn the basics of poker, improve your game with the help of specially selected exercises and track your results. 🎯\r\n\r\n🎓Master poker\r\nIn our app you can find poker rules, the description of all combinations and stages of the game. Examples of typical situations will help you quickly learn game principles and start playing poker with your friends tonight.\r\n\r\n💪Exercise\r\nATHYLPS randomly generates game situations, which makes it possible to practice without losing money in a real game.\r\n\r\nOur exercises will help you hone the fundamental skills needed at the poker table. You will learn:\r\n- Quickly spot poker hands\r\n- Count outs\r\n- Count the pot odds\r\n- Use rule \"4 and 2\"\r\n- From a probabilistic point of view, understand whether you need to accept a bet\r\n\r\n🏆Test your knowledge\r\n- Take exercises in Practice mode to improve your skills\r\n- Find out how many correct decisions you can make under the pressure of a timer in Competitive mode\r\nGet bonus points and time for the correct answers. Set personal records🏅\r\n\r\n📈Track results\r\nExercise every day and track your improvements with our informative statistics for each exercise.\r\n\r\nIn the Statistics you'll see:\r\n- Average time you give an answer in exercise\r\n- Correct/Incorrect answers ratio\r\n- Time you spend in exercises\r\n\r\n👉Join to community:\r\nTelegram: https://t.me/athylps\r\n\r\nDownload ATHYLPS today and become a better poker player!",
  "summary": "Poker trainer that helps you learn poker outs, poker odds, poker hands",
  "installs": "10,000+",
  "score": 4.4444447,
  "ratings": 72,
  "reviews": 45,
  "price": 0,
  "IAPRange": "£1.49 per item",
  "developer": "Sergey Opivalov",
  "genre": "Card",
  "contentRating": "PEGI 3",
  "released": "Oct 16, 2019",
  "updated": 1587306908000,
  "version": "1.1.0",
  "recentChanges": "Great update is coming!<br>We are carefully listening to our users and develop amazing hints for Practice mode as many of you guys asks. <br>- Combinations exercise now splitted at two exercises: Resolving combinations and Hands Ranking<br>- Draw cases now take into account in all related kinds of exercises<br>- Numeric keyboard for Outs exercises looked too complicated and replaced with keyboard with predefined variants. Same for Odds exercises<br>- Hints added for all exercises in Practice mode",
  "appId": "com.binarymaze.athylps",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Arena: texas holdem game",
  "description": "Grab your poker chips and play the best free online Texas Holdem poker from MY.COM!\r\n\r\nYour hand is ready — start playing poker right now!\r\n\r\nGet your friends and play with them stunningly addictive Texas Hold`Em poker, rendered with amazing graphics and user-friendly interface — just like in a real poker casino!\r\n\r\nWin, bluff and talk with other poker players via in-game chat! And, of course, give them poker gifts and presents!\r\n\r\nUnfamiliar with rules of Texas Holdem poker? Not a problem! Poker Arena works great for both newbies and pros! Tutorial & virtual assistant along with table of poker combinations plus visual demo of the strength of your current poker hand!\r\n\r\nFinally, you can play Poker Arena offline: hone your poker skills in the dramatic single player poker campaign called “Trixie’s Story” or via Training mode, competing against virtual poker opponents!\r\n\r\nHere you can download the official version of Poker Arena for your Android devices.\r\n\r\nSuper Texas Holdem Poker Features:\r\n\r\n- Free to play online & offline poker!\r\n- Thousands of poker players available 24/7!\r\n- Bonus poker chips for playing every day!\r\n- Weekly Texas Holdem poker tournaments!\r\n- Tons of poker gifts and presents!\r\n- Single player & Training mode available offline!\r\n- Tutorial and useful tips for newbies!\r\n- In-game chat!\r\n- Visual demo for your current poker hand strength!\r\n- Built-in table of poker combinations!\r\n- Regular updates and improvements!\r\n\r\nBring your friends and take your places at the poker table!\r\n\r\nPoker Arena from MY.COM is all you need for the winning!",
  "summary": "Grab your chips and play the best free online poker!<br>Start playing right now!",
  "installs": "1,000,000+",
  "score": 4.0909595,
  "ratings": 54363,
  "reviews": 13405,
  "price": 0,
  "IAPRange": "£0.65 - £65.19 per item",
  "developer": "My.com B.V.",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 10, 2013",
  "updated": 1582794444000,
  "version": "2.04.82",
  "recentChanges": "♦ We caught some annoying bugs and removed them from the application. Now the game is more stable and faster. Play and win! ♥",
  "appId": "air.ru.mail.games.pokerarena",
  "searchTerms": "poker"
 },
 {
  "title": "Tournament Poker Coach",
  "description": "Master the strategies of no-limit Holdem tournaments including daily fast tournaments in your local card room, online MTBs or major WSOP, WPT or HPT events by having your own coach in your pocket. \r\n\r\nPoker Coach professionals evaluate your every move and reward you for making quality decisions. \r\n\r\nPlay challenging hands, actually played inmajor events or simulated for training, from a variety of tournament structures, levels and stack sizes facing a rangeof opponent’ skills and receive instant and detailed feedback.\r\n\r\nPractice and refresh your skills before showing up to any tournament and significantly increase your chances to reach the final table and win. \r\n\r\nFeatures: \r\n\r\n* Poker hands are packaged into Hand-Packs™, covering various aspects of Hold'em tournament strategies from the fundamentals to advanced professional play. \r\n* Win in-app currency, called ProCoins, based on the merit of your play, not the outcome of the hand. Use ProCoins to unlock Bonus Hand-Packs. \r\n* Game scenarios crafted or actually played by world-class poker coaches\r\n* Each move is followed by detailed explanations that open your eyes to opportunities to win pots. \r\n* Play for FREE an entire preview Hand-Pack! You can also PREVIEW a hand from each Premium Hand-Pack. \r\n* No account creation. Just start playing to improve your poker skills.\r\n\r\nPrivacy Policy:\r\nhttp://support.gamoz.net/privacy.html",
  "summary": "Challenge and improve your no-limit Holdem skills by having your own coach.",
  "installs": "50,000+",
  "score": 4.1809525,
  "ratings": 1061,
  "reviews": 289,
  "price": 0,
  "IAPRange": "£2.28 - £60.99 per item",
  "developer": "Gamoz, Inc",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 13, 2015",
  "updated": 1583735016000,
  "version": "1.4",
  "recentChanges": "Bug fixes and other improvements",
  "appId": "net.gamoz.wpt",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Night in America",
  "description": "PLAY NOW and win a chance to play poker on NATIONAL TV! This is the official social poker app published by the hit TV series Poker Night In America! Play FREE Texas Hold’em Poker against millions of other players, invite your friends, and have your very own Poker Night. Our weekly sweepstakes lets you win REAL WORLD PRIZES, including a chance to live your poker dream and PLAY AGAINST POKER CELEBRITIES on national television!\r\n \r\nGame features:\r\n* FREE CHIPS – Come back to the game every day for huge bonuses and get free chips.\r\n* REAL WORLD PRIZES – Play to enter a sweepstakes for chances to win amazing prizes including Poker Night in America gear, meeting famous poker pros, or the ultimate prize - to be able to play poker on TV against REAL POKER CELEBRITIES!  Each taping is also streamed on Twitch with LIVE CARD GRAPHICS!\r\n* PLAY WITH FRIENDS – Invite your friends to the game through email or Facebook and get bonuses as a reward.\r\n* TOURNAMENTS – Master your poker skills! Participate in WEEKLY Sit n' Go and Shootout tournaments where you can WIN unique Trophies and top our Leaderboard.\r\n* GET REWARDS – Up the stakes, win hands, go all-in and unlock achievements.  Bet Big to Win!\r\n* YOUR PROFILE PAGE – Track your progress and status in the game! See how many Tournaments you've won and Achievements you've completed. You can even see how many Properties on each player profile!\r\n* CHAT WITH OTHER PLAYERS – Have even more fun at the poker tables with our easy to use in-game instant messenger!\r\n* FAIR HAND DEALING GUARANTEED – Our Certified Random Number Generator (RNG) brings you the best and fairest game experience.\r\n* LEARN TO PLAY – Are you new to poker but always wanted to try it? Our simple to follow tutorial mode will help you take the first steps.  Learn everything you need to know about winning combinations and the rules of the game quickly.\r\n* SMOOTH INTERFACE – A simple and attractive interface which gives you the ability to call, fold or raise the stakes with just one tap.\r\n* NO REGISTRATION – Get straight into the action. Use guest mode to use our poker app without registration.\r\n* SINGLE ACCOUNT – Start playing on your smartphone then continue playing on tablet without losing your progress.\r\n \r\nFollow us on Twitter, Twitch, YouTube, and Facebook!\r\ntwitter.com/PokerNightTV\r\ntwitch.tv/PokerNightTV\r\nyoutube.com/PokerNight\r\nfacebook.com/PokerNightInAmerica\r\nThis game is only available to people of legal age. Success in playing this game does not imply your success in a similar real-money casino game.",
  "summary": "This is the official app published by the hit TV series Poker Night In America!",
  "installs": "50,000+",
  "score": 3.6269841,
  "ratings": 1266,
  "reviews": 557,
  "price": 0,
  "IAPRange": "£0.89 - £92.99 per item",
  "developer": "Rush Street Productions dba Poker Night in America",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 1, 2017",
  "updated": 1573730206000,
  "version": "28.8.0",
  "recentChanges": "Your favorite game is even better! We fixed minor bugs and optimized performance.",
  "appId": "com.pokernight.pokerandroid",
  "searchTerms": "poker"
 },
 {
  "title": "Offline Poker - Tournaments",
  "description": "There’s no better feeling in poker than winning a poker tournament! This is your chance. And you'll play offline poker with only one goal: to become the champion!\r\n\r\nBy winning tournaments you will be able to join bigger and more exciting offline poker tournaments. And in the end you will  be able to try yourself in Grand Final Tournament\r\n\r\nBecome the World Offline Poker Tournament Champion - play offline MTT poker anywhere anytime, on your Android device!\r\n\r\nRefine your card tactics to match the style of your opponents! The offline players will play better in each new league and offline tournament!\r\n\r\nNow you can organize local multiplayer tournament that can be played offline. You just need to be connected to the same WiFi network or hotspot. No need to register, just create a game, connect and play tournament poker!\r\n\r\nThis game includes different variants of poker:\r\n***Texas Holdem No Limit\r\n***Omaha Pot Limit \r\n***2-7 Triple Draw Pot Limit (Lowball) \r\n***Omaha Hi Lo Pot Limit",
  "summary": "Play offline tournament poker anywhere anytime, on your Android device",
  "installs": "100,000+",
  "score": 4.15,
  "ratings": 746,
  "reviews": 329,
  "price": 0,
  "IAPRange": "£0.89 - £18.49 per item",
  "developer": "SoftForYou",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 10, 2018",
  "updated": 1572329380000,
  "version": "1.9.10",
  "recentChanges": "Added Omaha Hi Tournaments, Deuce to Seven Triple Draw Tournaments, Omaha Hi Lo (Omaha 8)<br>Offline Poker, MTT Poker Tournaments. Play poker with friends (Wi-Fi connection)",
  "appId": "com.sfy.mttpoker",
  "searchTerms": "poker"
 },
 {
  "title": "Video Poker:Free Classic Casino Offline Poker Game",
  "description": "- The #1 Video Poker game around is even better! -\r\n- Highest Rated Video Poker Game in the Store! -\r\n- More than 48 different Video Poker Games! -\r\n- Play your way to success and become the top Video Poker player in the world! - \r\n\r\nVideo Poker Classic is one of the most addictive video poker apps you'll find in the Store.\r\n\r\nVideo Poker Classic features your favorite video poker games with real card shuffling,casino paytables,real dealing,skills trainers,and the full Las Vegas experience.\r\n\r\nWith the most number of video poker games,the most realistic casino experience,and the best game features,Video Poker Classic is a must download!\r\n\r\nFeatures:\r\nFast game play!\r\nFREE to play with FREE Credits every two hours!\r\nHold multiple cards at the same time! Just slide your fingers across!\r\nDouble or Nothing option after each winning hand!\r\nSame card shuffling like in real casinos!\r\nChange game speed for slow or fast play!\r\nOffline support – play anytime, anywhere \r\n\r\n48 Video Poker Games, More Than Anyone!\r\n* - Jacks or Better\r\n* - Joker Poker\r\n* - Double Joker Poker\r\n* - Deuces & Joker Poker\r\n* - Deuces Wild\r\n* - Deuces Wild Bonus Poker\r\n* - Joker Poker (Aces or Better)\r\n* - Triple Deuces Wild\r\n* - Double Bonus Deuces Wild\r\n* - Bonus Deuces Wild\r\n* - Double Deuces Wild\r\n* - Super Bonus Deuces Wild\r\n* - Loose Deuces\r\n* - All American\r\n* - Triple Double Bonus Poker\r\n* - Double Bonus Poker\r\n* - Double Double Bonus Poker\r\n* - Aces & Faces\r\n* - White Hot Aces\r\n* - 2 Ways Royal\r\n* - Super Double Bonus\r\n* - Super Double Double Bonus Poker\r\n* - Double Double Bonus Poker Plus\r\n* - Super Aces Bonus Poker\r\n* - Triple Bonus Poker Plus\r\n* - Double Jackpot Poker\r\n* - Tens or Better\r\n* - Bonus Poker Deluxe\r\n* - Bonus Draw Poker\r\n* - Double Bonus Draw Poker\r\n* - Double Double Draw Poker\r\n* - Triple Double Draw Poker\r\n* - Triple Bonus Poker\r\n* - Ultra Bonus Poker\r\n* - Bonus Poker\r\n* - Double Aces & Faces\r\n* - Double Double Aces & Faces\r\n* - Aces & Eights\r\n* - Royal Aces Bonus Poker\r\nand more...",
  "summary": "48 Offline Video Poker Games,Play and become top Video Poker player in the world",
  "installs": "100,000+",
  "score": 4.6787148,
  "ratings": 2507,
  "reviews": 838,
  "price": 0,
  "IAPRange": "£0.99 - £97.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 18, 2018",
  "updated": 1571118560000,
  "version": "1.10.2",
  "recentChanges": "Fix Bugs;<br>Support Multi Hand Play,From One Hand To 50 Hands;<br>Thank You!",
  "appId": "com.sagafun.classicvideopoker",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Omaha - Free casino game",
  "description": "\"If, after the first twenty minutes, you don't know who the sucker at the table is, it's you.\"\r\n\r\nBored with Texas Holdem? Or maybe just looking for additional challenge? You are in the right place, cause Poker Omaha is the natural next step for every Texas Holdem player!\r\nSit at the tables with four cards apiece and create the best hand to win! You think it's easy? Join the game and check out for yourself. Poker Omaha has everything that experienced Poker players are looking for!\r\n\r\nFeatures:\r\n★ Welcome Bonus and everyday Free GameChips to let you join the tables immediately\r\n★ Thousands of players available to play with at any time\r\n★ Variety of tournaments and cash tables available to suit your needs best\r\n★ Play up to 4 tables at the same time\r\n★ Compete in the best tournaments \r\n\r\n\r\nThe game is intended for an adult audience.\r\nThe game does not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\nPractice or success at online poker or social casino gaming does not imply future success at cash poker games or \"real money gambling\".",
  "summary": "Next step for every poker player! Play OMAHA - second poker variation. Try now!",
  "installs": "100,000+",
  "score": 4.3190475,
  "ratings": 4219,
  "reviews": 1314,
  "price": 0,
  "IAPRange": "£0.89 - £92.99 per item",
  "developer": "GameDesire",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 29, 2015",
  "updated": 1560448351000,
  "version": "4.1.1",
  "recentChanges": "- minor bug fixes",
  "appId": "eu.ganymede.omahahd",
  "searchTerms": "poker"
 },
 {
  "title": "Celeb Poker - Texas Holdem",
  "description": "Raise the stakes and compete with the elite poker players in the cozy rooms of Celeb Poker. Play you favorite games online whether it is Holdem, Omaha or Omaha Hi/Lo.\r\n\r\nYOU ARE A SHARK STARVING FOR NEW EXPERIENCE?\r\n•Texas holdem, Omaha or even Omaha Hi/Lo with the great variety of stakes - the choice is all yours\r\n•Multi-table functionality.  When game gets boring play several ring games and a couple of tournaments all at once\r\n•Sit-n-Go tournaments for authentic casino experience\r\n•Multi Table Tournaments to win big. You can increase your buy-in 50 times in just one tournament\r\n•Fair play matters. Certified RNG and collusion prevention guarantee that your  skill is the only thing that really matters at the table.\r\n•Leaderboards both Global and country  for competitive gameplay. Climb up the ladder and become the Poker Celeb recognized at every table. Or find new buddies in your country\r\n•Promo tournaments with unique rewards and special trophies to stand out of the crowd\r\n•Play incognito - download and play instantly leaving no personal data\r\n•Exclusive service - our Customer Care will provide you with helpful and timely response\r\n\r\nYOU NEED CASUAL RELAXING ONLINE GAME?\r\n•Welcome bonus of $25,000\r\n•Free chips daily. Real money gambling makes you pay, while our application does not. Get Enormous bonuses and free chips giveaways from our lovely dealers every day\r\n•New friends from around the world and lots of hilarious gifts\r\n•Learn to play, get more experience and master you holdem skill with clean and simple tutorials and hand combinations explanations.\r\n•Hand strength meter helps you leave the math behind and concentrate on the game itself\r\n•Simple interface to call,fold or raise with one tap\r\n•Reward driven gameplay - every hand won, every tournament played, every  buddy found - all lead to new achievements and ranks\r\n•Slots to play when you get tired of cards\r\n\r\nJoin our community of  Celebs on social media for new tips, tricks and free chips:\r\nFacebook: https://www.facebook.com/viadenpoker\r\nTwitter: https://twitter.com/playcelebpoker\r\n\r\nThis game is intended for adult audience and neither offers real money gambling nor an opportunity to win real money. Success at social gaming cannot imply future success at real money gambling. Use of this application in governed by Celeb Poker terms of service: \r\nhttp://www.celebpoker.com/terms-of-use.html",
  "summary": "Vegas Poker in your pocket with daily chip giveaways. Join and Rock!",
  "installs": "1,000,000+",
  "score": 4.2983017,
  "ratings": 22267,
  "reviews": 9401,
  "price": 0,
  "IAPRange": "£0.59 - £129.90 per item",
  "developer": "WizplayOS Cyprus Limited",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 24, 2011",
  "updated": 1539332751000,
  "version": "4.1.8",
  "recentChanges": "Updated to support Android 9 Pie",
  "appId": "com.viaden.winner",
  "searchTerms": "poker"
 },
 {
  "title": "Appeak – The Free Poker Game",
  "description": "The Free Poker App that you will love. Millions of players can’t be wrong!\r\n\r\nThe Appeak Texas Holdem Free Poker app is the fastest, most fun and most challenging free Texas Holdem poker app out there – and you can begin playing in seconds, not hours.\r\n\r\nAppeak Texas Holdem is one of the few Holdem free poker apps that gives you the real feel of Texas Hold'em as it's played in poker rooms around the world – not some video poker knock-off.\r\n\r\nThis is free poker at its best with non-stop fast-paced Holdem action. Just press the Play Now button and you'll be instantly betting and raising in a play-money poker game almost as good as live poker.\r\n\r\nYou'll be folding mediocre poker hands and crunching poker odds like a pro in no time after a little practice in the Appeak app. The app offers great help features for beginners like a four-color deck (makes it easy to see what your hand is) and holdem rules section.\r\n\r\nStakes are categorized into tiny, small, medium and big and you automatically earn up to 7,000 free chips in daily bonuses.\r\n\r\n1 Million+ Downloads! 100,000 Active Players! Up to 7,000 Daily Chips!\r\n\r\nJust a few of the perks of the Appeak Texas free poker app:\r\n• Over 100,000 active players and over 1,000,0000 downloads\r\n• Up to 7,000 free chips added to your account daily\r\n• In-game challenges to grow your chip stack quickly\r\n• New games starting up instantaneously, anytime you log in\r\n• Both cash games (which you can leave at any time) and Sit & Go tournaments for players of all skill levels\r\n• An exclusive leaderboard for bragging rights over friends and opponents.\r\n• Over 40 unique avatars to choose from\r\n• MANY MORE!\r\n\r\nNo matter if you are just trying to learn Texas Holdem poker or you are already a pro player, there`s no better free poker app for you\r\n\r\nDon't be fooled by imitation video poker apps – this is real Holdem poker!",
  "summary": "Play Poker against people all over the world with this free poker app!",
  "installs": "1,000,000+",
  "score": 3.451115,
  "ratings": 14686,
  "reviews": 4895,
  "price": 0,
  "IAPRange": "£2.34 - £134.99 per item",
  "developer": "Appeak",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jul 11, 2010",
  "updated": 1572992352000,
  "version": "3.1.0",
  "recentChanges": "Facebook fixes",
  "appId": "com.appeak.poker",
  "searchTerms": "poker"
 },
 {
  "title": "GC Poker 2: WebCamera-tables, Texas Hold'em, Omaha",
  "description": "Get wrapped up into exciting world of online poker. Popular Texas Hold'em and Omaha at the webcam tables and feel new sensations and emotions! Improve yourself and enjoy the game.\r\n\r\nGAME FEATURES:\r\n♠ Live poker with friends. Play at the webcam tables and watch the real emotions of real players.\r\n♠ Free poker games in any time including Texas Holdem, Omaha and engrossing SitNGo tournaments. \r\n♠ Simple and attractive interface.\r\n♠ Free chips for the first entrance and for each day of visiting the game.\r\n♠ Play using any account at any social networking site such as Facebook, Google, Odnoklassniki, Vkontakte and save  your achievements or use Guest mode. Start playing via your cell phone or pad and resume your game in any social networking site having saved your progress.\r\n♠ Get the gifts, likes and rewards for the collections and achievements and gain VIP status.\r\n♠ Go to the top of players ratings in various categories. \r\n♠ Test your luck in mini-games.\r\n \r\nGC Poker 2 wishes you a good luck and loot!",
  "summary": "WebCam poker with real opponents!",
  "installs": "10,000+",
  "score": 4.23,
  "ratings": 178,
  "reviews": 79,
  "price": 0,
  "IAPRange": "£1.00 - £89.99 per item",
  "developer": "GC Tech",
  "genre": "Card",
  "contentRating": "PEGI 16",
  "contentRatingDescription": "Use of Alcohol/Tobacco, Simulated Gambling",
  "released": "Mar 26, 2018",
  "updated": 1568963322000,
  "version": "1.9.0",
  "recentChanges": "In this release, we have included a number of general improvements and feature updates",
  "appId": "air.com.gctech.GCPokerTwo",
  "searchTerms": "poker"
 },
 {
  "title": "Sohoo Poker-Texas Holdem Poker",
  "description": "Sohoo Poker is the world's best and the most interesting poker game, including Texas Hold ' Em and Omaha, but also rich Texas games, you can enjoy the joy of the game with millions of players from all over the world. More abundant variant rules of Texas Hold'em will also be added to the game, come and download our APP, and start the game now!\r\n\r\nGame Features:\r\nFree Chips - By downloading the game you will receive lots of chips for free! In addition, by logging in daily, completing exclusive daily missions, upgrading and inviting friends can also get plenty of chips!\r\n\r\nSohoo Points - Important growth system in Sohoo Poker. You can receive Sohoo Points by upgrading and completing missions, then redeem them for various in-game goods, such as chips, collections and tournament tickets. Abundant items are waiting for you!\r\n\r\nReal Gaming Experience - We have carefully studied the rules and details of Texas Hold'em in order to as much as possible provide players with the realest and the best Texas Hold'em poker, and to ensure that players can not only enjoy the thrill of Texas Hold’em, but also have fun in the world of Sohoo Poker.\r\n\r\nGorgeous art style and scene special-effects - The art style of Sohoo Poker is in line with the public aesthetic standard, at the same time provides players with an immersive feeling of playing Texas Hold'em at the real poker table.\r\n\r\nFair Play - To make Sohoo Poker a wonderful Texas Hold'em game, we believe that creating a fair game environment is the most important target. So after optimizing our algorithm over and over again, we finally got the international RNG certification!",
  "summary": "Enjoy the most authentic and professional poker game: Texas Hold&#39;Em/Omaha.",
  "installs": "100,000+",
  "score": 4.052174,
  "ratings": 4717,
  "reviews": 1195,
  "price": 0,
  "IAPRange": "£0.99 - £199.99 per item",
  "developer": "Sohoo Poker",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Apr 21, 2019",
  "updated": 1586757704000,
  "version": "5.0.10",
  "recentChanges": "We update the game regularly, and make it better for you to enjoy the best and professional Texas Hold’em game!",
  "appId": "com.sohooltd.sohoopoker",
  "searchTerms": "poker"
 },
 {
  "title": "EasyPoker - Poker with your Friends",
  "description": "Ready for online poker with friends?\r\n\r\nEasyPoker is a completely new take on digital poker. Our app lets you play a social face to face game of live multiplayer poker with up to 12 friends - anytime, anywhere.\r\n\r\nThe app is free to play with an unlimited amount of games and you don’t buy virtual chips, play money or gold.\r\n\r\nThink of the EasyPoker app as a digital poker set.\r\nYou and your friends want to play a game of live poker but have no deck of cards or chips? No problem at all. Just fire up the free EasyPoker app and we will take care of it! Cool right?\r\n\r\nOur app brings together the best of digital poker and traditional live face to face poker. Now you can play multiplayer F2F poker with your friends, without having to bring a poker set with you at all times. Imagine playing a game of live multiplayer poker around the campfire, at the beach, the bar, the park, in the train, while waiting for food in the restaurant, when skydiving - Really, it’s only limited by your imagination. You and your friends just need the free EasyPoker app on your smartphones and we’ll take care of the rest. \r\n\r\nWhy choose between the convenience of digital poker and the social experience live poker? We’ve combined the two!\r\n\r\nThe EasyPoker gameplay is designed specifically for playing face to face poker with people in the same place as you. Basically just think of EasyPoker as a digital poker set that fits in your pocket.\r\n\r\nGet cool features perfectly designed for a multiplayer game of poker.    \r\n\r\n• Multiplayer Texas Hold’em.\r\n• Cross platform capability (Android, iPhone).\r\n• Provides both cards and chips.\r\n• Fast and intuitive connection of devices. \r\n• Easily arrange order.\r\n• One hand gameplay.\r\n• Tab and hold to see your cards (bad news for peekers).\r\n• No timer - you decide when to deal.\r\n• No credit card registration.\r\n• Free to play.     \r\n\r\nEasyPoker is Not your classic poker app. Far from it actually. We’re not an online casino or betting platform designed to lure your hard earned cash out of your pocket. Actually we don’t facilitate any betting of real money at all. We’re just the poker set you can bring anywhere. This also means that we don’t connect you with bots or strangers around the world. You will simply have to be in the same place as your friends, when using the free EasyPoker app. Like you would when using a classic physical poker set.\r\n\r\nOur mission is not to replace the physical poker set - if you have a deck of cards and poker chips, then by all means, use them! We still would.  \r\nOur purpose is to facilitate the social experience of poker when you don’t have a poker set with you - or sitting around a table big enough for your whole crew. \r\n\r\nThe EasyPoker app is meant to be played live in company of good friends. At its core, the poker game has always been a social activity. And we think it’s funnest when played face to face. Reading your opponents tells is a big part of the original game. After all it’s called a “poker face” - not a “poker avatar”. Unfortunately, with online poker, a lot of this has been lost. But we’re bringing it back! Dust off your best poker faces and get ready to play live face to face poker again. Yes!\r\n\r\nWe want you to be a part of this!\r\n\r\nThe team behind EasyPoker is small - but really fast moving. We’re five danish guys constantly making improvements and testing new features to get the best live poker experience possible. And we would love to hear suggestions and feedback from you! Visit our website to send in your feedback. We’re excited to hear from \r\nyou! There’s never long from idea to final feature so please don’t hesitate to message us. \r\n\r\n\r\nPlease notice that the EasyPoker app does not include any kind of real money gambling features.",
  "summary": "Multiplayer poker with your friends",
  "installs": "10,000+",
  "score": 3.03,
  "ratings": 212,
  "reviews": 140,
  "price": 0,
  "IAPRange": "£5.49 - £36.99 per item",
  "developer": "EasyPoker ApS",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 26, 2018",
  "updated": 1588696183000,
  "version": "0.9.21",
  "recentChanges": "We wanna thank all users for providing feedback and suggestions for making a better online poker app to play with friends. <br><br>New in this update:<br><br>- Optimized backend for more stable connection.<br>- Updated UI showing player actions.<br>- Fixed issue with stacks looking weird.<br>- Removed limit for rebuy amount.<br>- Introduced native UI alerts for better UX.<br>- Fixed issue with &#39;Quit Game&#39;.<br>- Fixed other small bugs and updated logic.",
  "appId": "com.Easy.Poker",
  "searchTerms": "poker"
 },
 {
  "title": "WebCam Poker Club: Holdem, Omaha on Video-tables",
  "description": "Immerse yourself into exciting world of poker! Get new sensations and emotions with popular Texas Holdem and Omaha combined with Video-tables! Improve yourself and enjoy the game! \r\n\r\nGAME FEATURES:\r\n♠Free  live poker with your friends. Play via WebCams tables. \r\n♠ Free poker games in any time including Texas Holdem, Omaha and engrossing SitNGo tournaments. \r\n♠ Simple and attractive interface.\r\n♠ Free checks for the first entering and every 3 hours.\r\n♠ Play using any account at any social networking site such as Facebook, Google, Odnoklassniki, Vkontakte and save  your achievements or use Guest mode. Start playing via your cell phone or pad and resume your game in any social networking site having saved your progress.\r\n♠ Get the gifts, likes and rewards for the collections and achievements and gain VIP status.\r\n♠ Go to the top of players ratings in various categories. \r\n♠ Test your luck in mini-games.\r\n\r\nThis product is intended for use by those 21 or older for amusement purposes only. \r\nPractice or success at social casino gaming does not imply future success at real money gambling.\r\nThis product does not offer real money gambling or an opportunity to win real money or prizes.\r\n\r\n \r\nWebCam Poker Club wishes you a good luck and loot!",
  "summary": "WebCams poker with live Video-tables!",
  "installs": "10,000+",
  "score": 4.36,
  "ratings": 210,
  "reviews": 104,
  "price": 0,
  "IAPRange": "£1.00 - £89.99 per item",
  "developer": "GC Tech",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 2, 2018",
  "updated": 1587807306000,
  "version": "1.6.4",
  "recentChanges": "Fixed some minor bugs.",
  "appId": "air.com.gctech.WebCamPokerClub",
  "searchTerms": "poker"
 },
 {
  "title": "Poker  ZingPlay Texas Hold'em",
  "description": "Welcome to Poker ZingPlay, brand new application card game of Poker, Texas Holdem. Poker ZingPlay will give fun moment like real experience in casino.\r\n\r\nBrand new poker game Poker ZingPlay is ready to give a sense of novelty for you, even you never play Poker, Texas Holdem or you love to bet and play card game, casino game such as Pusoy, Bingo... You will in love to play Poker ZingPlay with stunning graphics and high-quality sound performance.\r\n\r\nYou will sense of excitement and fun in Poker ZingPlay because of techniques of each poker players based on remember, calculation or luck that make you enjoy while playing poker.\r\n\r\n♠♥♦♣ Poker ZingPlay Feature ♠♥♦♣\r\n\r\n• Free download and free play and get free gold at the beginning.\r\n• Spin for free gold every 2 hours.\r\n• Poker ZingPlay League – Challenge your skill and luck in Poker ZingPlay league,  higher rank more rewards.\r\n• Free gold every day.\r\n• Freedom to choose table bet.\r\n• Run out of gold!? Don’t worry!! Poker ZingPlay support system will give you free gold. \r\n• Daily mission – Complete mission get many rewards.\r\n• Big event with special rewards every month.\r\n• Cool emoji function to chat with friends and opponents.\r\n• Challenge your skill and beat opponents in World series.\r\n• Bet and win big jackpot in Poker ZingPlay\r\n• Sense of fun with friends around country and South East Asia.\r\n• Easy to play and normal rule like real poker.\r\n• Poker ZingPlay is card game that not bet with real money and cannot exchange gold in-game to real money.\r\n\r\nPoker ZingPlay is available to give sense of fun and excitement of play poker to you.",
  "summary": "Poker ZingPlay the best poker game on mobile",
  "installs": "50,000+",
  "score": 4.37,
  "ratings": 455,
  "reviews": 193,
  "price": 0,
  "IAPRange": "£0.89 - £89.99 per item",
  "developer": "VNG GAME STUDIOS SEA",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Oct 29, 2018",
  "updated": 1551799216000,
  "version": "2.2.579",
  "recentChanges": "- Tuning game logic<br>- Fix minor bugs",
  "appId": "com.seazp.texasholdem",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Texas Boyaa",
  "description": "♠Kelebihan Kami♠\t\t\t\t\t\r\n√ Poker atau Texas Poker no 1 yang paling diminati para pemain Indonesia\t\t\t\t\t\r\n√ Texas Poker kami mendapatkan peringkat 1 di HongKong, Thailand. Mendapatkan peringkat depan untuk Poker Online di wilayah Malaysia, Singapore, dan wilayah ASEAN lainnya.\t\t\t\t\t\r\n√ Poker Online kami telah memiliki pengguna sebanyak poker 88 juta pemain online di seluruh dunia.\t\t\t\t\t\r\n√ Poker Boya Memiliki 20 lebih jenis versi bahasa asing, yaitu dalam versi bahasa Thailand, Indonesia, Vietnam, China, Jerman, Perancis, Spanyol, Itali dan lain-lain. \t\t\t\t\t\r\n√ Berpengalaman dalam sistem operasional Poker Online dan teknik permainan Texas Holdem Poker secara internasional\t\t\t\t\t\r\n\t\t\t\t\t\r\n♠Spesialisasi kami ♠\t\t\t\t\t\r\n√ Desain Texas Holdem Poker yang bertaraf Internasional; \t\t\t\t\t\r\n√ Poker online yang dikhususkan untuk para pemain Dewa Poker terhebat di Indonesia\t\t\t\t\t\r\n√ Undang teman/buddies di Texas Holdem Poker, emotikon yang imut dan lucu, saling berbagi alat, dan hadiah super mewah dengan sahabat lainnya. Sambil bermain kartu sambil mendapatkan teman/pasangan baru. \t\t\t\t\t\r\n√ Beragam macam kegiatan/event Poker Texas, dan hadiah intan, Chip, bertebaran dimana-mana seakan kamulah Jutawan Dewa Poker Dunia!\t\t\t\t\t\r\n√ Bermain Poker online di perangkat PC atau Mobile manapun tanpa ada perbedaan, agar anda bisa menjadi Dewa Poker tanpa halangan!\t\t\t\t\t\r\n√ Selain bermain kartu Texas Hold em poker, kamu juga dapat bermain game Kasino seperti Sic Bo, Slots, Tebak Kartu, Putar Piring, Lotre, Jackpot dan lain-lain. Mini games yang seru yang mendapatkan chips gratis!\t\t\t\t\t\r\n√ Login berhadiah untuk para Dewa Poker, Pokoknya kami membuat anda puas! \t\t\t\t\t\r\n\t\t\t\t\t\r\nBanyak pemain Holdem poker texas kami yang dijuluki Dewa Poker  karena telah mengikuti Turnamen BPT(boyaa poker tour) Asia 2019,\t\t\t\t\t\r\njika kamu ingin seperti para pemain Dewapoker ini silahkan download sekarang juga dan belajarlah dari mereka!\t\t\t\t\t\r\nBerbeda dengan permainan poker lainnya, Poker Texas Boyaa selain menyediakan hiburan ke pemain, juga fokus dalam mengembangkan keterampilan teknik bermain kartu, \t\t\t\t\t\r\ndemi membuat suasana Game Poker terasa lebih cocok untuk para Dewa Poker.\t\t\t\t\t\r\nKami berkomitmen untuk terus menjadi Poker Online pertama di Indonesia. Kami ingin menciptakan sebuah media yang menggabungkan hiburan dan pertandingan dalam permainan kartu.\t\t\t\t\t\r\n\t\t\t\t\t\r\nCatatan: \t\t\t\t\t\r\n♤ Poker Online kami tidak mengandung unsur perjudian. Seluruh chip dalam poker tidak dapat ditukar ataupun diuangkan menjadi uang asli, poker pulsa atau barang asli apapun.\t\t\t\t\t\r\n♤ Poker Boyaa hanya ditujukan untuk kesenangan bermain kartu Poker online dan melatih ketangkasan dalam bermain poker agar bisa seperti Dewa Poker, sangat cocok dimainkan saat waktu santai atau waktu istirahat\t\t\t\t\t\r\n\t\t\t\t\t\r\nJika Ada Pertanyaan, Silakan Hubungi Kami:\t\t\t\t\t\r\nEmail: android.id@boyaa.com\t\t\t\t\t\r\nFacebook: https://www.facebook.com/idpokerboyaa\t\t\t\t\t\r\nGrup Pemain: https://www.facebook.com/groups/boyaafansgroup/",
  "summary": "Free Texas holdem poker, Turnamen Poker, Slots",
  "installs": "5,000,000+",
  "score": 3.9078312,
  "ratings": 144743,
  "reviews": 35167,
  "price": 0,
  "IAPRange": "£0.89 - £144.99 per item",
  "developer": "Boyaa",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 29, 2016",
  "updated": 1565835359000,
  "version": "5.9.1",
  "recentChanges": "Pembaharuan Fungsi:<br>1. Skin Hari Kemerdekaan baru<br>2. Perbaikan bug permainan.<br>3. Event Perayaan baru",
  "appId": "com.boyaa.androidmarketid",
  "searchTerms": "poker"
 },
 {
  "title": "GG Texas Poker",
  "description": "♠ Texas Hold’em Poker là trò chơi phổ biến nhất trên thế giới hiện nay, với đặc điểm dễ chơi nhưng khó thạo, đòi hỏi sự kiên trì và kỹ thuật cao, game luôn đem đến cho người chơi những cảm giác hồi hộp đến từng giây.\r\n♠ GG Texas Poker được phát triển bởi đội ngũ kĩ thuật có trình độ cao, mang đến người chơi những trải nghiệm tuyệt vời nhất.\r\n♠ Với nhiều kiểu chơi phong phú cùng những giải đấu hấp dẫn, các sự kiện lớn với những phần thưởng độc đáo, tin rằng GG Texas Poker sẽ là món ăn tinh thần không thể thiếu đối với các người chơi. \r\n♠ Đây là một trò chơi miễn phí, chủ yếu dành cho người chơi ở độ tuổi trưởng thành và chỉ phục vụ cho mục đích giải trí.\r\n♠ Hãy tải game và tận hưởng ngay những giờ phút thú vị cùng GG Texas Poker!",
  "summary": "GG Texas Hold&#39;em Poker is the poker game Texas the most popular in the world today!",
  "installs": "100,000+",
  "score": 4.5478263,
  "ratings": 2308,
  "reviews": 1062,
  "price": 0,
  "IAPRange": "£0.89 - £91.99 per item",
  "developer": "jogamer",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 8, 2017",
  "updated": 1569511154000,
  "version": "1.2.5",
  "recentChanges": "GG Poker VN mang đến người chơi <br>những trải nghiệm tuyệt vời nhất.<br>1.Game Baccarat, giàu có không phải là một giấc mơ;<br>2.Game xe sang, chiến thắng không ngừng;",
  "appId": "com.ggpoker.vntexas",
  "searchTerms": "poker"
 },
 {
  "title": "Texas Hold’em Poker + | Social",
  "description": "Get in on the best free Texas Hold’em Poker and Vegas slots app with Texas Hold’em Poker +! Get 25,000 FREE chips just for downloading. Play poker with friends and other live players for FREE! Keep the card games going with our generous daily free chips bonuses, gifts, rewards and a big chips bonus every 4 hours.\r\n\r\nCasino games are even better with friends! Don’t get stuck playing Texas Hold’em with random players every game- Play at the same table with people you know or make new poker friends! Show them who’s poker king – invite your friends from the front page with a tap. \r\n\r\nTexas Hold’em online has a winning hand with Texas Hold’em Poker + !\r\n\r\nGreat features in Texas Hold’em Poker +:\r\n\r\nMultiplayer Games – Social Games of Poker for All Players\r\n- Online Poker - Gamble with a huge variety of tables from beginners to high rolling poker stars\r\n- Multiplayer Poker Games – Play with poker friends – and enemies – to increase competition\r\n- Social Games – Chat and share emojis with other players\r\n\r\nCasino Gameplay, Enhanced - Gamble in a Las Vegas Casino\r\n- Las Vegas Style - Gamble with real competition against poker stars in an authentic casino\r\n- Las Vegas Casino Games With Perks - Online poker has the benefit of the free Hand Strength Meter. Win more by calculating the win odds for your hand\r\n- Las Vegas Gifts – Share the glitz and glam of Las Vegas with your friends! Send them crowns, suits, food and pets to share the good life together\r\n\r\nTexas Hold’em Made Easy – Virtual Games of Poker for All Skill Levels\r\n- Poker Now - Poker games give you instant action with Play Now functionality \r\n- Intuitive Controls - Gamble on an easy to use and intuitive play interface\r\n- Video Poker Bonuses – Las Vegas style soundtrack will make you feel like you’re playing poker at a real casino table!\r\n\r\nPoker Tournament – Join Tournaments to Win Big\r\n- Multiplayer Poker Tournaments – Join in on regular tournaments for your chance to win it all\r\n- Multiple Skill Levels – Three poker skill-based brackets let players of all experience levels join\r\n\r\nCasino Slot Games – Play Customizable Las Vegas Slots\r\n- Free Slot Spins - Daily Free Spin bonus with huge jackpot rewards\r\n- Custom Slot Machine – Slot games let you customize lines played and bet per line, and watch your bet change in real time\r\n- Jackpot! – Win big and use your cash to play poker or spin more slots\r\n\r\nCard Games for Free – Enjoy Regular Free Bonuses\r\n- Free Poker Chips - Return for bonus chips every 4 hours\r\n- Free Texas Hold’em – Come back for endless free poker games\r\n\r\nLive Hold’em Stats - Texas Hold’em Poker + Stat Tracking\r\n- Sync your chips and stats across your devices with Facebook connect or by logging into your profile\r\n- Live hold’em results in real time! Easily track your wins and skill level\r\n\r\nGet in on the best free Texas Hold’em Poker app and receive 25,000 FREE chips just for downloading! Keep the poker competition going against friends and other live players for FREE with generous daily chips bonuses, gifts, rewards, and a big chips bonus every 4 hours.\r\n\r\nExperience the greatest social betting app with Texas Hold’em Poker +!\r\n\r\nContact us with any questions or comments about Texas Hold’em Poker + atsupport@boqugames.com.\r\nTexas Hold’em Poker + is produced by Boqu Games.\r\nTexas Hold’em Poker + does not offer real money gambling and is played for fun only.",
  "summary": "Texas Hold’em Poker like never before! Multiplayer poker games with friends",
  "installs": "500,000+",
  "score": 4.119306,
  "ratings": 4631,
  "reviews": 1680,
  "price": 0,
  "IAPRange": "£0.74 - £77.52 per item",
  "developer": "Boqu Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Sexual Innuendo, Gambling",
  "released": "Sep 22, 2015",
  "updated": 1484740099000,
  "version": "2.1.7",
  "recentChanges": "- Improved stability<br>- Numerous bug fixes",
  "appId": "com.boqugames.poker",
  "searchTerms": "poker"
 },
 {
  "title": "World Poker Tour - PlayWPT Free Texas Holdem Poker",
  "description": "Play poker games online with players worldwide with PlayWPT! Dominate multiplayer online poker tournaments and see who’s best in online poker! PlayWPT brings you the best in authentic poker. \r\n\r\nDon’t settle for the all-in Texas Hold’em Poker in other social casino games! PlayWPT is an innovative online poker app for beginners and pros alike. Compete in Texas Holdem tournaments and enjoy a mobile casino created from the World Poker Tour’s 15 years of card game experience.\r\n\r\nPlayWPT is a competitive poker environment with an authentic poker experience. Try your hand at the international World Poker Tournament and put your Holdem skills to the test! Play against your friends or compete in elite free poker games around the clock with various live play poker games, Las Vegas style tournaments, and quick sit-n-go’s. Raise, check or fold, just make sure to win the pot!\r\n\r\nPlay card games for free and become a Texas Holdem pro with PlayWPT Poker!\r\n\r\nPlayWPT Poker Features:\r\n\r\nTexas Holdem Poker\r\n• Play online poker games for free!\r\n• Live Holdem games offered daily. Play poker with friends or compete against the community.\r\n• Poker tournaments available for novice and pro players with a different buy-in per table.\r\n\r\nJackpot – Free Lucky Spin\r\n• WPT lets you claim FREE GOLD every two hours by giving the wheel a spin!\r\n\r\nWPT Rewards\r\n• Collect and win just for playing at our high-stakes poker tables.\r\n• Las Vegas style poker with a Reward Points to earn more virtual gold.\r\n• Poker Reward Points can be exchanged for more gold!\r\n\r\nPlay Poker with Friends\r\n• Play poker with friends to keep your poker skills honed.\r\n• Compete in online poker tournaments against players around the world.\r\n\r\nTake Poker Games Anywhere\r\n• PlayWPT Poker bankroll is connected to all your devices.\r\n• Poker games can start on your phone and be continued on your tablet or Facebook!\r\n\r\nCustomize Poker Players\r\n• Poker is even more fun as you play as your favorite avatars!\r\n• Collect more avatars when you win more Gold!\r\n• Customize your virtual avatar with different clothes, hairstyles and more!\r\n\r\nSocial Games with Animated Emojis\r\n• Celebrate poker wins or bemoan a bad beat with an animated emoji. \r\n• Real animated emojis let opponents know EXACTLY how you feel!\r\n\r\nPlay in competitive Vegas-style Texas Holdem tournaments for free without having to visit a casino! Compete in online poker games to improve your poker skills and best some of the greatest poker players in the world.\r\n\r\nDownload today and become a Holdem champ.\r\n\r\nNote:\r\n\r\n• The games are intended for an adult audience.\r\n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n• Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "Texas Holdem Poker from WPT - Multiplayer Online Poker - Where Skills Matter!",
  "installs": "100,000+",
  "score": 4.015968,
  "ratings": 5043,
  "reviews": 2032,
  "price": 0,
  "IAPRange": "£0.89 - £179.99 per item",
  "developer": "CaptivePlay",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 19, 2017",
  "updated": 1563773684000,
  "version": "19.9.95",
  "recentChanges": "Improved gameplay<br>Fixed bugs",
  "appId": "com.playwpt.mobile.poker",
  "searchTerms": "poker"
 },
 {
  "title": "Texas Holdem Poker Offline:Free Texas Poker Games",
  "description": "Play solo from your phone and enjoy the best Vegas Casino Poker offline. You might be a good poker player, you might be great at Texas Holdem, but can your poker skills grant you our champion?  We've just turned the POKER ON and enhanced our poker casino experience with all poker master. Looking for something more exciting than Las Vegas poker games, where you can truly test your poker strategy?  \r\n \r\nJoin the world’s most popular Poker game. It's Texas Hold'Em Poker the way YOU want to play! You'll play poker with only one goal: to become the best poker player in the world.\r\n\r\nPlay the world's Most Authentic Poker App! The most prestigious poker brand raises the stakes with the authentic poker experience on Android devices. In this great offline poker game, you're battling and bluffing your way through several continents and famous poker stories.\r\n\r\nGreat game features:\r\n- PLAY ANYTIME, ANYWHERE: Poker offline, no internet connection required\r\nThere is no internet connection required to play this great game. And one other big advantage: you don't have to wait for real world players like you do in live multiplayer poker. Slick, fast gameplay!\r\n\r\n- THE BEST AND MOST FUN POKER AI IN THE WORLD\r\nThis poker engine is created to give you the best poker experience and the feeling you are playing against real players. We made the AI to ensure the game is great for both beginning poker players who are learning poker and experienced players.\r\n\r\n- FAIR PLAY – Just like a Vegas casino! Poker is officially certified to play like a real table experience.\r\n\r\n- AUTHENTIC TEXAS HOLD ‘EM – Stay casual with the classic Texas Hold ‘Em Cash game or go for the high-stakes.\r\n\r\n- Free chips every 4 hours\r\n\r\n- EARN MORE CHIPS: Watch videos and earn free bonus poker chips in this poker paradise;\r\n\r\n- GREAT HD GRAPHICS: The poker game is beautifully designed and includes HD poker graphics for a great poker experience. \r\n\r\nPlay this very exciting Texas Hold'em poker game and prove you are the best poker player in the world. Press Install and download Poker NOW.",
  "summary": "Play Texas Holdem Poker Games offline, you can play Poker online or offline now!",
  "installs": "100,000+",
  "score": 4.48,
  "ratings": 826,
  "reviews": 379,
  "price": 0,
  "IAPRange": "£1.89 - £93.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 5, 2018",
  "updated": 1557996498000,
  "version": "1.5.2",
  "recentChanges": "Fixed a serious crash bug on some machines;<br>Poker Game Improvement!",
  "appId": "com.sagafun.poker",
  "searchTerms": "poker"
 },
 {
  "title": "Poker Extra - Texas Holdem Casino Card Game",
  "description": "If you're ready let's start to play some Hold'em Poker. \r\n\r\nPoker Extra lets you play it on your Android device! Challenge with friends and new poker players! \r\nBecoming a poker star is a long journey; you will start as a rookie and work all the way up to become a high roller with the ultimate goal to become a VIP Poker star. The variety of poker games gives every player the desired poker experience. Poker Extra gives you a thousands of chips, gifts for free. You can play with your guest account or your Facebook account. If you like casino games such as solitaire, slotsgames, gin rummy and spades, this is definitely the game for you! \r\n\r\n\r\nPLAY WITH POKER BUDDIES – Invite your friends, kick back and make it a poker night anytime!\r\nREGISTRATION – Connect with Facebook or use guest mode to play pocker without Facebook registration\r\nOFFICIAL CASH GAME EXPERIENCE – Try your hand at Texas Hold’Em, High Stakes Table, and more for FREE.\r\nLEARN HOW TO PLAY LIKE A REAL PRO - This your first step to become a real professional poker player!\r\nJOIN ONLINE POKER TOURNAMENTS - Become a champion!\r\n\r\nFree online gaming experience is here, download and install now!\r\n\r\nPoker Extra is intended for an adult audience. Poker Extra do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at casino gaming does not imply future success at \"real money gambling\".",
  "summary": "Ultimate Vegas casino card game experience. Learn how to play poker like a pro!",
  "installs": "50,000+",
  "score": 4.3560977,
  "ratings": 2061,
  "reviews": 851,
  "price": 0,
  "IAPRange": "£0.99 - £52.99 per item",
  "developer": "Digitoy Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 1, 2016",
  "updated": 1577170281000,
  "version": "Varies with device",
  "recentChanges": "- Bug fixes and improvements.",
  "appId": "com.digitoygames.pokerextra",
  "searchTerms": "poker"
 },
 {
  "title": "POKER Masters - The Ultimate Texas Hold'em",
  "description": "Join the best poker game which stays true to authentic Texas Hold'em. It brings you a real feeling of traditional poker game.\r\n\r\n[POKER Masters features]\r\n\r\nFREE CHIPS EVERYDAY - Get $ 400,000 bonus chips for your first signup. The more friends you have, the more free chips you can get. Get up to $ 50,000,000 chips of bonus with Daily Spin!\r\n\r\nAUTHENTIC TEXAS HOLD 'EM - We stay true to the Texas Hold'em poker. It's a fair poker game that only competes with real poker skill and experience. Poker Masters will be the best choice if you are looking for authentic poker.\r\n\r\nLIGHT AND FAST SYSTEM - We removed unnecessary resource downloads, useless event systems and other factors which was disturbing game play. So the game speed is much faster than other poker apps in all parts of the app, including sign-in and UI transitions. It makes you can totally concentrate in the poker play itself.\r\n\r\nUNIQUE PRIZE POOL - Experience the league system and tremendous prize pool system that you can not see anywhere. World Class league prize pool is at least 100M Chips and over. Win the highest league and become the Master of poker.\r\n\r\nPLAY ANYWHERE - Have fun POKER Masters anywhere. You can play both of web and mobile versions. All you need is just login with Facebook account.\r\n\r\nTALK TO US – Let us know what you'd like to see next by hitting us up on Facebook.\r\nFacebook: https://www.facebook.com/pokermasterofficial/\r\n\r\nCollection and use of personal data are subject to Diamondgames' Privacy Policy. Both policies are available in the Application License Agreement below as well as at www.diamondgamez.net. Social Networking Service terms may also apply.\r\n\r\nAdditional information:\r\n· This game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.\r\n· The game is free to play; however, in-app purchases are available for additional content and in-game currency. In-app purchases range from $0.99 to $99.99 USD.\r\n· Use of this application is governed by Diamond games’ Terms of Service, found at www.diamondgamez.net/eula.html.\r\n· For information about how Ultimate Games uses personal data, please read our privacy policy at www.diamondgamez.net/policy.html.",
  "summary": "Authentic texas hold&#39;em poker game",
  "installs": "100,000+",
  "score": 3.29,
  "ratings": 892,
  "reviews": 319,
  "price": 0,
  "IAPRange": "£0.99 - £99.99 per item",
  "developer": "K&T Studio",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 5, 2018",
  "updated": 1553575611000,
  "version": "1.0.9",
  "recentChanges": "Minor bug fix",
  "appId": "mbs.diamond.pokermasters",
  "searchTerms": "poker"
 },
 {
  "title": "Video Poker Free - Casino Card Game",
  "description": "Play POKER OFFLINE FREE! Get our VIDEO POKER GAME and enjoy hours of fun anytime anywhere on your mobile device! Download now one of the best free video poker game for Android!\r\n\r\nUnlike blackjack games or texas holdem poker, video poker card games are easy to learn, simply select a video poker casino game of your choice, choose a bet and start drawing cards from video poker wizard!\r\n\r\nGAME FEATURES: \r\n\r\n- 100% Free to Play this video poker game free app will makes you addict\r\n- 8 Video Poker Games Variants in 1 Casino App: Classic Jacks or Better, Aces & Faces, Joker Poker, Super Double Bonus Poker, Triple Double Bonus Poker, Double Joker, White Hot Aces and American Poker! \r\n- Learn the basics and perfect your skills with Jacks or Better\r\n- Test your luck and knowledge with 7 highly rewarding Video Poker variants\r\n- Retro style high definition graphics and soundtrack\r\n- Sounds and feels just like real-life casino Video Poker games\r\n- User-friendly interface and highly addictive gameplay\r\n- No registration needed, just download the app and play instantly\r\n\r\nFor almost 50 years, well-known casino game - Video Poker is gambler’s #1 alternative of choice to slot machines. Today, there is not a single casino in the world that does not have multiple rows of the most iconic, easy to play, casino game - Video Poker! \r\n\r\nUnlike slot machines, Video Poker is a game of luck and skills that requires players to know the basic hands of poker to have an influence on the outcomes of each hands! \r\nVideo Poker is also a game in which the maximum prizes are higher than in Blackjack or Roulette, lower than in most slot machines, but where payouts occur more frequently.\r\nFinally, Video Poker is known to be THE CASINO GAME with the smallest house-edge, meaning that applying the right strategy and knowing your poker hands can make make you beat the house every time! \r\n\r\nThanks to video poker you now have access to all the thrills of real life casino classic video poker and popular variants, at the tip of your fingers! \r\n\r\nIdeal to learn the basics, perfect your knowledge and master the strategies of each of the different existing variants, VIDEO POKER is your ideal partner spend some time and have some fun while becoming a pro gambler!\r\n\r\nCheck our other games! \r\n\r\nThis Video Poker game is a gambling simulation game, it neither involves real money gambling, nor provides any means to win real money or prize.",
  "summary": "Play FREE Video Poker games! Test your luck with 7 highly rewarding variants!",
  "installs": "50,000+",
  "score": 4.31,
  "ratings": 185,
  "reviews": 86,
  "price": 0,
  "IAPRange": "£0.89 - £12.49 per item",
  "developer": "Zariba Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 23, 2018",
  "updated": 1574321676000,
  "version": "1.1.21",
  "recentChanges": "Bug fixes and performance improvements",
  "appId": "com.zariba.videopoker",
  "searchTerms": "poker"
 },
 {
  "title": "Ruby Seven Video Poker | #1 Free Video Poker",
  "description": "Whether you enjoy the classics like Jacks or Better and Jokers Wilds or new ways to play Video Poker like the Ruby Seven exclusive Best in 60 Poker we have your new favorite way to play Video Poker for FREE! \r\n\r\n- Authentic video poker including world-famous Multi-Strike Poker™!\r\n- TOURNAMENTS! Play against other users to win the jackpot!\r\n- Play to win in the NEW Deuces Wild Bonus Poker room!\r\n- FREE Bonus Credits every 3 hours!\r\n- Daily Scratcher bonus - win up to 100,000! \r\n- Best in 60 - race the clock against other players to get the best hand! \r\n- Classic favorites like Bonus Poker, Jacks or Better, Jokers Wild, and more!\r\n- Double or Nothing- Go all in with your chance to win big! \r\n- Compete for the top spot on our Daily, Weekly and All-Time Leaderboards!\r\n\r\nCurrently one of the top-rated video poker games! Ruby Seven Video Poker will become your favorite FREE video poker app!\r\n\r\nThe games are intended for an adult audience.\r\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\nPractice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\nMulti-Strike Poker is a trademark of IGT.",
  "summary": "Classic video poker to IGT’s Multi-Strike- your new favorite FREE Video Poker!",
  "installs": "500,000+",
  "score": 4.5986547,
  "ratings": 4479,
  "reviews": 956,
  "price": 0,
  "IAPRange": "£0.89 - £104.99 per item",
  "developer": "Ruby Seven Studios Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 16",
  "contentRatingDescription": "Use of Alcohol/Tobacco, Simulated Gambling",
  "released": "Oct 17, 2014",
  "updated": 1559277596000,
  "version": "4.3.0",
  "recentChanges": "Hi Video Poker friends! The best video poker app keeps getting better!<br>With this update we have improved your experience. Play your favorite video poker games with even more credits, wins and fun!<br>Download or update now to join the fun!",
  "appId": "com.rubyseven.rsvideopoker",
  "searchTerms": "poker"
 }
]