[
 {
  "title": "Scratch Off (Scratchers Games)",
  "description": "【Real Scratchers Experience】 \r\nAll the scratch tickets are addictive!!\r\nTry your luck by playing 30 different scratch cards! \r\nIf luck is on your side, you may win BIG!!\r\nDownload Scratch Off (Scratchers Games) today & bring all the fun of your favorite scratch off wherever you go!!\r\n\r\n【New Scratchers】\r\n● Crossword\r\n● Deluxe Cashword\r\n● Loose change multiplier\r\n● Vegas Slots\r\n● Neon 9's\r\n● 7-11-21\r\n● Winner Winner Chicken Dinner\r\n● Wheel of Fortune\r\n\r\n【Features in this instant lottery game】\r\n● Easy to win big!\r\n● Real scratch off tickets experience! \r\n● If you win, you could BET to get DOUBLE prize! \r\n● Scratch tickets can be easy saved or shared to your friends.\r\n● Scratcher can be zoom in / zoom out.\r\n\r\nOnly for entertainment purpose and could not win real money from this game.\r\n\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Try your luck &amp; win today! Experience the same fun as playing real scratchers!",
  "installs": "1,000,000+",
  "score": 4.427484,
  "ratings": 48033,
  "reviews": 16518,
  "price": 0,
  "IAPRange": "£0.79 - £179.99 per item",
  "developer": "SHOCKTECH",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 5, 2014",
  "updated": 1581305310000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.shocktech.guaguahappy_classic",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lotto Scratch – Las Vegas",
  "description": "No.1 Free lottery scratch tickets app by Las Vegas casino.\r\nTons of scratch offs you can scratching.\r\n\r\nInclude:\r\nCrossword scratch ticket, Mahjong scratch-offs, Blackjack scratcher, Super Slots and 777, Cashword, 10X scratch off, Wild Cherry scratchcard, Gold Rush scratchcard, 3X big cash lotto scratch cards and more.\r\n\r\nIf you like instant lottery(instant games), you’ll definitely like this scratch-its game. \r\n\r\nMore update lottery tickets: \r\n1. Crossword\r\n2. Loteria\r\n3. Pinball \r\n4. BlackJack 21\r\n5. Bingo\r\n6. Hold'em Poker\r\n\r\nand more other lottery scratch cards like Homerun scratch-off, Bonus Hearts, Mother's Day scratchies, and Dragon Boat Festivel lottery ticket...etc.\r\n\r\nMore scratchers will be release soon. Try your luck today with Bunny Scratch!!\r\n\r\nOnly for entertainment purpose and could not win real money from this game.\r\n\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Las Vegas Lotto Scratchers.<br>Best national lottery scratch cards game ever.",
  "installs": "1,000,000+",
  "score": 4.6806765,
  "ratings": 81303,
  "reviews": 20796,
  "price": 0,
  "IAPRange": "£0.79 - £184.99 per item",
  "developer": "Lotto Scratch Powerball",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 31, 2015",
  "updated": 1579370555000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.bunny_scratch.las_vegas",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Golden Scratch Cards",
  "description": "Do you like scratch cards? Of course you do.\r\nCheck whether your day is a happy day. Perhaps you will be lucky and you will get big cash. Funny graphics, simple rules will guarantee you a great fun!\r\nJust be careful! Our scratch cards are addictive.\r\n\r\nIn the application you will find scratch cards such as:\r\nHalloween Monsters - Trick or treat.\r\nHappy Ladybug - Nice day in the meadow.\r\nTwo hearts - Scratch cards for lovers.\r\nMoney on the farm - Not only in the city you can earn!\r\nThis is robbery - Big emotions and fast cash.\r\nTreasures of the wild west - Indians, cowboys and stagecoaches full of money.\r\nFinders keepers - Money lies on the street. Take them.\r\nMatryoshka dolls - Popular Russian toys with a surprise.\r\nEaster eggs - Bunny and chick - find them all.\r\nGrandmother's pension - Extra cash from grandmother.\r\nYeah! Goal! - Scratchcard for soccer fans.\r\nSummer time - Holidays, beach, sun and treasures.\r\nFortune cookies - Check Chinese divination.\r\nTasty friends - Shop full of fruits, vegetables and zombies.\r\nGolden train - Find a real treasure underground.\r\nSanta's sack - Santa Claus has something special for you.\r\nChristmas tree - Eve, sweets and lots of money!\r\nHappy New Year - New Year's Eve time to start.\r\n\r\nBut it is not everything! New scratch cards will appear soon.\r\nIf you have a scratchcard idea then write in the comment.\r\n\r\nFeel the thrill and join the list of the Richest Scratchers :-)",
  "summary": "Money doesn&#39;t buy happiness? Nonsense! Play and become a millionaire.",
  "installs": "100,000+",
  "score": 3.2479339,
  "ratings": 2440,
  "reviews": 972,
  "price": 0,
  "IAPRange": "£4.59 - £8.99 per item",
  "developer": "Ready Square",
  "genre": "Card",
  "contentRating": "PEGI 3",
  "released": "Oct 18, 2017",
  "updated": 1548914783000,
  "version": "1.0.6",
  "recentChanges": "Bugs fixed.<br>Smaller app size.",
  "appId": "air.com.readysquare.scratchcards",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Day - Win Real Money",
  "description": "Lucky Day is a 100% Free Sweepstakes App! \r\n\r\nLucky Day is a free mobile gaming app that allows users to win money and prizes, no purchase is necessary.\r\n\r\nLucky Day offers free scratcher, lotto, and raffle games for a chance to win real money and rewards. With daily opportunities to win up to $100,000 in cash instantly, earn rewards, or enter raffles! \r\n\r\nLucky Day is a free lifestyle experience on your mobile device. We change lives daily by offering hundreds of games for our players to scratch and have a chance to win real money instantly.\r\n\r\nPlay your free daily lotto and scratch cards for a chance to win real money and prizes. New scratch cards are available daily for your chance to win up to $10,000 instantly. You can also enter sweepstakes contests, raffle giveaways, and the daily lotto. \r\n\r\nOur mission is to give everyone a free chance to have a Lucky Day because we believe you shouldn’t have to risk losing for the chance to win! \r\n\r\nLucky Day is 100% free to download and play with no in-app purchases or deposits. \r\n\r\nLucky Day Features: \r\n\r\nWIN REAL MONEY\r\n✔ Win the jackpot prize of $100,000 by entering the daily lotto!\r\n✔ Win up to $10,000 by matching 3 winning symbols on the instant win scratch cards!\r\n\r\nEARN REWARDS \r\n✔ Earn gift cards from top brands including Amazon, Walmart, Dunkin Donuts, Target, etc.\r\n✔ Enter cool raffle giveaways to win HUGE prizes! \r\n\r\nENJOY PLAYING DAILY\r\n✔ Enter the daily lotto and reveal the results at 7 pm PT for your chance to win!  \r\n✔ New scratch cards daily at 12 am PT.  \r\n✔ Bonus scratch cards daily at 10 am PT and 6 pm PT.  \r\n✔ Play Lucky Day for 5 minutes a day to test your luck and get lucky.  \r\n\r\nOver $5 Million in cash and rewards have been awarded to Lucky Day players, and we have 30,000 new winners every week! Lucky Day brings you free scratchers, lotto, and raffle games for a chance to win cash and prizes. With thousands of real winners daily, you could be next!\r\n\r\nCongratulations to some of our recent winners:\r\n♥ Christopher E. from Albuquerque, NM who won the $1,000 Raffle in December 2018\r\n♥ Luis V. from Waterbury, CT who won the $1,250 Lucky Night Scratcher in January 2019\r\n♥ Jayda P. from Atlanta, GA who won the $400 Raffle in January 2019\r\n\r\nDownload Lucky Day and see if today is your lucky day!\r\n\r\nFor all the latest news and exclusive winning opportunities, make sure to Like and Follow Lucky Day on social media!\r\nFacebook: @luckydayapp\r\nInstagram: @luckydayapp\r\nTwitter: @luckydayapp\r\nFor feature requests or feedback, please send us an email to support@luckydayapp.com. \r\n\r\nThese sweepstakes are devised as non-gambling promotions and are intended solely for entertainment purposes. \r\n\r\n*Google Inc. does not sponsor, nor is any way affiliated with Lucky Day and/or the sweepstakes prizes.",
  "summary": "Win money &amp; prizes with your free daily lotto and scratch cards on Lucky Day!",
  "installs": "10,000,000+",
  "score": 4.3792768,
  "ratings": 923687,
  "reviews": 384847,
  "price": 0,
  "developer": "Lucky Day Entertainment, Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 30, 2015",
  "updated": 1588705384000,
  "version": "6.8.2",
  "recentChanges": "Thanks for playing Lucky Day! To improve our app for you, we bring updates to Google Play regularly.<br>- Improved User Experience <br>- Performance Improvements <br>- Bug Fixes",
  "appId": "com.luckyday.app",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Scratch UK Edition WIN MONEY- OH LUCKY DAY!",
  "description": "Win £500 INSTANTLY! \r\nPlay fun Scratchcards - Match 3 to win Stars! Every hour, new scratch off tickets are ready to scratch. With great themes like Zeus, Oz, Buffalo, Tikis, and Forest Fairies, you will be transported to a magical place.\r\n\r\nLucky Scratch is a fun game you can play wherever you go and play some fun scratchers!\r\n\r\nLucky Scratch is 100% free to download and play with no in-app purchases or deposits. Players can enter sweepstakes in the application. No purchase of fee is necessary to play or win, and no purchases are available in the app, thus they cannot increase your chances of winning.\r\n\r\nDownload Lucky Scratch and see if today is your lucky day!\r\n\r\nFor all the latest news and exclusive winning opportunities, make sure to Like and Follow Lucky Scratch on social media!\r\n\r\nFacebook: @luckyscratchapp\r\nInstagram: @luckyscratchapp\r\nTwitter: @luckyscratchapp\r\n\r\nFor feature requests or feedback, please contact support@luckyscratchapp.com.\r\n\r\n\r\nFor rules about our Sweepstakes, including specific start and end dates, number of winners, and how to enter,  please see www.luckyscratchapp.com/rules.\r\n\r\nFor terms of service, please see www.luckyscratchapp.com/tos\r\n\r\n\r\nSuccess within this game does not imply future success with real money gambling. This game does not offer real money gambling. This game is intended for an adult audience.\r\n\r\n\r\nSweepstakes are sponsored by Fort Mason Games, Inc. \r\nGoogle Inc. is not a sponsor nor in any way affiliated with Sweepstakes promotions in Lucky Scratch App.",
  "summary": "Play Lottery Style Free Scratchers, Scratch Cards, and Scratch off tickets!",
  "installs": "1,000,000+",
  "score": 3.5261881,
  "ratings": 21765,
  "reviews": 10544,
  "price": 0,
  "developer": "Lucky Scratch & Other Apps by Fort Mason Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 25, 2019",
  "updated": 1585774365000,
  "version": "47.0.0",
  "recentChanges": "SCRATCH- MATCH- WIN! Play the Daily Lucky 6 Lotto, Hourly Bingo, and Huge Sweeps!",
  "appId": "com.luckyscratchapp.free.scratchers.winrealmoney.lucky.day",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Las Vegas Scratch Ticket",
  "description": "This Las Vegas scratch-off game is suitable for passing time.\r\n\r\nYou will have REAL lottery scratch card experience.\r\n\r\nLots of lotto scratch-offs you can scratching with Las Vegas theme.\r\n\r\nAll the lottery tickets you can play for free. Include Crossword, Blackjack, Vegas slots, Cashword, Diamond 777 scratchers...\r\n\r\nIf you like to play instant lottery, DO NOT miss this game.\r\n\r\nOnly for entertainment purpose and could not win real money from this game.\r\n\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "This Las Vegas Scratch Card Game will bring you real lotto scratcher experience",
  "installs": "1,000,000+",
  "score": 4.545323,
  "ratings": 62403,
  "reviews": 14989,
  "price": 0,
  "IAPRange": "£0.89 - £184.99 per item",
  "developer": "SHOCKTECH",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 15, 2014",
  "updated": 1574651534000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.shocktech.scratchfun_lasvegas",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Day",
  "description": "Play FREE scratchcards every day - all risk free with Scratch Day. Scratch Day offers players daily opportunities to win cash, completely risk free. \r\n\r\nScratch Day is free to download and play with no in-app purchases or deposits. Facebook login required.\r\n\r\nScratch Day Features:\r\n\r\n** WIN **\r\nMatch 3 winning symbols on our instant win scratchcards to win big.\r\n\r\n** EARN REWARDS **\r\nEarn tokens as you play!\r\n\r\n** NEW FREE SCRATCHCARDS EVERY DAY ** \r\nNew scratchcards released 3 times a day at midnight,  4pm  and 8pm (GMT)\r\nMaximise your chance of winning by playing daily!\r\n\r\n\r\nLike and Follow us on Social Media for even more exciting winning opportunities, to see our winners gallery and all the latest updates from the team:\r\n\r\n👍 Facebook: https://www.facebook.com/scratchdayapp/\r\n👍 Instagram: @vikerdaygames\r\n👍 Twitter: @vikerdaygames\r\n\r\n\r\nScratch Day does not endorse or promote gambling. Scratch Day scratchcards are intended solely for entertainment purposes. \r\n\r\nScratch Day does not require any details from its players other than an email address to make payments to winners via PayPal. \r\n\r\n*Google is not a sponsor, nor is involved in any way with this app, nor do they endorse this service or sponsor, or any prize redemptions.\r\n\r\n*Scratch Day is a free mobile app that allows users to win with no purchase necessary.\r\n\r\nScratch Day is operated by Viker Limited, registered at: 200 Union St, London, SE1 0LX, a company incorporated under English law (company number: 06290437).\r\n\r\nSee our website at www.viker.co.uk for further information about us.\r\n\r\n© Viker Limited. All rights reserved.",
  "summary": "Free Scratchcards Everyday!",
  "installs": "1,000,000+",
  "score": 4.125624,
  "ratings": 134673,
  "reviews": 61374,
  "price": 0,
  "developer": "Viker",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 14, 2019",
  "updated": 1588777704000,
  "version": "3.11.1",
  "recentChanges": "Easter is here! Update now to join our Easter bunnies on an egg hunt!",
  "appId": "com.viker.scratchattack",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch-a-Lotto Scratch Card Lottery FREE",
  "description": "Scratch-a-Lotto the NEW and BEST Scratch Card Lotto game from Mobile Amusements!\r\n\r\nWith a HUGE SELECTION of Scratch Card games, UNLIMITED FREE COINS and Mega prize payouts, try to win as much cash as possible by also playing bonus prize gambling features such as Roulette, Higher or Lower Cards and Lucky Dice to accumulate virtual credit prizes.\r\n\r\nAs you progress to the locked higher priced Scratch Cards, you'll be able to win and unlock even more fantastic higher prize payouts.\r\n\r\nFeeling lucky? Welcome to Scratch-a-Lotto and attempt to win BIG!\r\n\r\nGood Luck!\r\n\r\nFeatures:\r\n\r\n* Exciting collection of new themed Scratch Cards.\r\n* Enjoy the Scratch Card experience without losing real money.\r\n* Gamble winning payouts to gain even more cash.\r\n* Win MEGA BIG!\r\n* Easy to pick up and play scratch lotto fun.",
  "summary": "Scratch-a-Lotto the NEW and BEST Scratch Card Lotto game from Mobile Amusements!",
  "installs": "50,000+",
  "score": 4.28,
  "ratings": 237,
  "reviews": 79,
  "price": 0,
  "developer": "Mobile Amusements",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 20, 2017",
  "updated": 1563617513000,
  "version": "14.0",
  "recentChanges": "Latest improved version.",
  "appId": "com.mobileamusements.ScratchaLottoFREEFREE",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch cards!",
  "description": "Fake money, true fun!\r\nScratch Cards is a virtual version of the famous scratch card games. Just scratch the grey area and find out if you've got the winning ticket to win huge amount of (virtual) money! \r\n\r\nCollect all tickets and bonuses\r\n- 8 different tickets to unlock\r\n- Crazy power-ups like the monkey's paw\r\n- A god mode to win easier but also a Human mode to simulate the real scratchcards\r\n\r\nOnly 2 advices\r\nIt's addictive :)\r\nDon't use coins on your device display.",
  "summary": "The most addictive scratchcard simulator (completely free)",
  "installs": "1,000,000+",
  "score": 3.6693292,
  "ratings": 7331,
  "reviews": 1802,
  "price": 0,
  "developer": "CaiPiroska",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 17, 2011",
  "updated": 1466961528000,
  "version": "Varies with device",
  "appId": "ginlemon.scratchdemo",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Card Billionaire Lottery",
  "description": "Scratch Card Billionaire! is an awesome free scratch card game. Do you want to know how much lucky are you?\r\n\r\nYou can choose and play with scratch cards inspired by the most famous casino games as poker, slots or blackjack and many others.\r\n\r\nEach scratch card has its own price, lucky, rewards and rewards probability distribution: search the bests scratch cards to earn more virtual money!\r\nYou can spend your virtual money buying scratch cards, buying lucky boxes to increment your lucky, or buying bigger coins to scratch faster.\r\n\r\nNOTE: You cannot win real money in this game!",
  "summary": "Scratch Card Billionaire is a virtual version of the famous scratch card games",
  "installs": "1,000+",
  "score": 4.0588236,
  "ratings": 17,
  "reviews": 4,
  "price": 0,
  "IAPRange": "£2.49 - £10.99 per item",
  "developer": "Foes",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Jul 16, 2019",
  "updated": 1569569430000,
  "version": "1.0.1",
  "recentChanges": "Bug Fixed",
  "appId": "com.cuzw.foes.scratchcard.billionaire",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Lottery Scratchers",
  "description": "Lucky Lottery Scratchers is the most realistic and authentic scratch-off lottery ticket game on Google Play!\r\n\r\nIf you like instant win scratch-off tickets, you will love Lucky Lottery Scratchers!\r\n\r\nThere are many types of scratch-off games and scratcher cards to play including \"Double Dollar,\" \"Money Rain,\" \"Lucky 777,\" \"Diamond Millions,\" and more!\r\n\r\nUse your finger to \"scratch\" card surface to match winning numbers to your numbers, or to reveal bonus multipliers.\r\n\r\nGame types include special Bingo cards and also bonus games.\r\n\r\nFree hourly and daily bonus credits are awarded just for playing!\r\n\r\nOur VIP program provides rewards to the best players.\r\n\r\nNo Internet connection is required to play -- offline play is supported!\r\n\r\nThere are hundreds of game levels to play and Lucky Lottery Scratchers is designed to work with phones and tablets.\r\n\r\nDownload Lucky Lottery Scratchers today and let us know what you think by leaving a review!\r\n\r\n\r\nPlease Note:\r\nLucky Lottery Scratchers is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes.  Practice or success at social casino gaming does not imply future success at real money gambling.  Lucky Lottery Scratchers is for entertainment purposes only and offers only a simulated gambling experience.",
  "summary": "The Best and most realistic Instant-Win Scratch-Off Lottery Ticket Game",
  "installs": "50,000+",
  "score": 4.6216216,
  "ratings": 2630,
  "reviews": 836,
  "price": 0,
  "IAPRange": "£0.89 - £189.99 per item",
  "developer": "41 Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 8, 2019",
  "updated": 1573171648000,
  "version": "1.0.2",
  "recentChanges": "Introducting Lucky Lottery Scratchers!",
  "appId": "com.FortyOneGames.Scratchers",
  "searchTerms": "scratch cards"
 },
 {
  "title": "VIP Scratch Cards",
  "description": "Enjoy the excitement of realistic scratch cards — for free. VIP Scratch Cards welcomes you to scratch thrilling new cards based on some of the world's most popular scratchies. VIP Scratch Cards is one of the hottest new casino games.\r\n\r\nLevel up and unlock new scratch cards progressively as you play. Scratch off bonus panels to win bonus money. \r\n\r\nWin massive jackpots in a range of scratch off designs including: \r\n\r\n - Booty Cove: Bask in the calming waters of Booty Cove. A good chance to win big! Win up to 10,000 coins\r\n - Luxury Club: 13 chances to win up to 100,000 coins\r\n - Hearts: two different fun game modes with your chance to win 100,000\r\n - Candy Cash: multiply your winnings up to 10 times\r\n - Over the Moon: win up to 250,000 coins\r\n\r\nPlus fun seasonal games such as Merry Money and Spooky Cash. More designs every new season!\r\n\r\nVIP Scratch Cards is a simulated gambling app. You are not betting real money and cannot win real money while playing this game.",
  "summary": "Scratch thrilling new cards based on some of the world&#39;s most popular scratchies",
  "installs": "10,000+",
  "score": 3.8955224,
  "ratings": 67,
  "reviews": 24,
  "price": 0,
  "IAPRange": "£0.99 - £2.69 per item",
  "developer": "Firecannon",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 25, 2018",
  "updated": 1542009896000,
  "version": "1.3",
  "recentChanges": "New scratch card design: Fortune Cat. Will Fortune Cat bring you good fortune?",
  "appId": "com.Firecannon.VIPScratchCards",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratcher & Clicker",
  "description": "Scratcher & Clicker is a free cash scratch off game. Test your luck by playing 50+ lottery scratch cards!\r\nPlay all your favorite lottery scratch offs without having to lose real money!\r\n\r\nFeatures:\r\n• 50+ lottery scratcher tickets\r\n• Real scratching effect\r\n• Instant win ticket analytics\r\n• You will never lose pocket money by playing these free cash lottery scratchers \r\n• Spin the free gift  machine and redeem gift bonus per 100 scratch tickets scratched\r\n• Spin bet machine to increase earnings\r\n• Play fun clicker game, defeat pirates and become super clickers\r\n• Best time passer & pressure reducer\r\n\r\nList of scratch off tickets:\r\nCrossword\r\nBingo\r\nHold'em Poker\r\n7-11-21\r\n100X The Cash\r\nMoney Money Money\r\nBlackjack\r\nCashword\r\nVegas Slots\r\nLotto money\r\nLoteria\r\nHalloween\r\nZodiac\r\nTic Tac Toe\r\nSet for Life\r\nDid I Win?\r\nNeon 9's\r\nJewel 7's\r\nPinball\r\nFlorida flamingo...more lotto tickets will be available soon.\r\n\r\nInstant lottery (instant games) lovers don't miss this lottery scratchers game.\r\nTry your luck today with Bunny Scratch!\r\nOnly for entertainment purpose and could not win real money or real prize from this game.\r\n\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Free lottery scratch off game<br>50+ lotto scratchers as playing real scratch offs",
  "installs": "1,000,000+",
  "score": 4.6223426,
  "ratings": 26613,
  "reviews": 8006,
  "price": 0,
  "IAPRange": "£0.79 - £179.99 per item",
  "developer": "Lotto Scratch Powerball",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 22, 2015",
  "updated": 1581060367000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.bunny_scratch.fl",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Classic Scratchcards",
  "description": "The best app for fans of scratchcards.\r\nWith our application you can play wherever you want and when you want.\r\nTo play, you do not need real money .\r\nWe provide cash on start, simple rules, fast gameplay and big wins.\r\n\r\nCheck if today is your lucky day.\r\nScratch, have fun and become a millionaire.\r\n\r\nIn the application you will find 8 scratchcards:\r\nExtra Salary\r\nMega Cash\r\nHappy Birthday\r\nDiamond 7\r\nPiggybank\r\n500+\r\nHidden zodiac\r\nNeon 6\r\n\r\nBut it is not everything! New scratch cards will appear soon.\r\nIf you have a scratchcard idea then write in the comment.",
  "summary": "The best classic scratchcards that everyone knows and love.",
  "installs": "100,000+",
  "score": 3.7802691,
  "ratings": 2251,
  "reviews": 872,
  "price": 0,
  "IAPRange": "£1.79 - £2.49 per item",
  "developer": "Ready Square",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 30, 2018",
  "updated": 1522497268000,
  "version": "1.0.0",
  "recentChanges": "New scratchcards",
  "appId": "air.com.readysquare.classicscratchcards",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Bling Pro",
  "description": "Download Scratch Bling Pro today and play the best and most authentic Scratch Card game for mobile and tablet. It’s free to play and guaranteed to keep you entertained for hours. Get scratching now.\r\n\r\n*FEATURES*\r\n\r\n- Authentic Scratch Card Experience\r\n- Lots of different games and cards to choose from\r\n- 100’s of ways to win\r\n- Gamble mode: Slots, HI/LO, Coin Toss and more\r\n- Free hourly bonuses\r\n\r\nPlay the Best and most Authentic Scratch Card game on the market\r\n\r\nSupport: info@peepsinabox.com\r\nVisit peepsinabox.com for promotions and bonus cash.\r\n\r\n*Bling Dollars are virtual and therefore non-refundable",
  "summary": "DOWNLOAD SCRATCH BLING PRO AND PLAY THE BEST, MOST AUTHENTIC SCRATCH CARD GAME",
  "installs": "10,000+",
  "score": 4.2083335,
  "ratings": 96,
  "reviews": 43,
  "price": 0,
  "IAPRange": "£0.79 - £35.99 per item",
  "developer": "Peeps in a Box ltd.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 25, 2017",
  "updated": 1493147052000,
  "version": "1.0.8",
  "recentChanges": "* facebook sharing enabled<br>* improved UI sensitivity<br>* greater payout ratio",
  "appId": "com.peepsinabox.scratchblingpro",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Tickets - Super Lottery",
  "description": "Welcome to Scratch off Tickets - Lotto Scratchers! Prepare your lucky fingers!\r\n\r\nTry your luck and win in the most realistic online loteria scratch off card game!\r\nBuy a ticket and start scratching. It's so fun and easy.\r\n...and do you know what is the biggest deal ? It is 100% free to play so you don't have to spend real money! Just scratch it and win huge!\r\n\r\n\r\nHOW TO PLAY \r\n1. Swipe right to show list of scratchers\r\n2. Click \"buy ticket\" (for virtual in-game currency)\r\n3. Pick a card and scratch it to show if you are instant winner\r\n\r\n\r\nFeatures\r\n• 10+ unique & beautiful lottery scratch off themes\r\n• The most realistic scratching effect\r\n• Get a free loteria ticket every day as a bonus\r\n• Super Scratch - Lotto Tickets game is completely free and you won't spend a single dollar\r\n• Analytics at the back of the scratching card to track your game progress\r\n• Fun and stress free game to play anywhere / anytime\r\n\r\nList of scratchcards:\r\n• Happy money - Florida Lottery scratch-off type\r\n• Poker - Texas Lottery style\r\n• Wanted - cash reward\r\n• Hockey match - Ontario, Canada type\r\n• Eldorado - Aztec pyramid raspar\r\n• Devil's numbers - California Scratchers simulation\r\n• \"Lucky slots\" 777 - Michigan Lotto type\r\n• Homerun Baseball league - sport scratchoff\r\n• Cash vault - Colorado Lottery style\r\n• BIG money - scratch it & win big\r\n• Valentine Lottery - do you have \"love\" luck?\r\n• Coffee pause - reward loteria ticket\r\n\r\n- Scratch it now!\r\n\r\n\r\nSo what are you waiting for? Start scratching tickets now!\r\nGOOD LUCK!\r\n\r\nNOTE\r\n\r\nScratch Tickets - Super Lotto is intended for an adult audience & for entertainment purposes only. Success in this game does not imply future success in real world lotto cash gambling. This game has only virtual online money currency and scratchers which cannot be cashed out or redeemed for real money.",
  "summary": "Lucky day? Get real scratch off lotto ticket experience. Just scratch it &amp; win!",
  "installs": "50,000+",
  "score": 4.086093,
  "ratings": 1515,
  "reviews": 649,
  "price": 0,
  "IAPRange": "£1.69 - £41.49 per item",
  "developer": "VIVUGA GAMES",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 5, 2019",
  "updated": 1583326625000,
  "version": "1.1.6",
  "recentChanges": "We&#39;ve added spanish language and did some optimizations. Happy scratching!",
  "appId": "com.vivuga.scratchtickets",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Night - Free Lottery Games, Real Rewards",
  "description": "Play your way to a lucky night. \r\n\r\nLucky Night is a free mobile gaming app that allows users to win rewards and prizes, no purchase is necessary.\r\n\r\nLucky Night is the best way to try your luck and collect rewards by playing all your favorite games. \r\n\r\nLucky Night is 100% free with no deposits or purchases required to play or win.\r\n\r\nSo, let loose with the hottest scratchers, lottos, raffles, mini games, daily challenges, and more. There's always a way to win prizes, rank up on the leaderboard, or entertain yourself with amusing games & goodies. \r\n\r\nHere's what you can do with Lucky Night:\r\n✔ Play 100% free scratchers with instant rewards \r\n✔ Pick your lucky lotto numbers every day\r\n✔ Enter raffles daily, weekly, and monthly for the chance to win big cash prizes\r\n✔ Exchange your Lucky Night Tokens for gift cards to your favorite brands & merchants (like Amazon, Target, Walmart, and more)\r\n\r\nYou can't win if you don't play. So, what are you waiting for? Download Lucky Night and get ready for more winning moments. We win when you win.\r\n\r\nRemember:\r\n- Nothing in the app costs real money. No purchases are necessary. It's 100% free to play. That means no micro transactions.\r\n- The sweepstakes are non-gambling promotions for entertainment. They're only intended for adult audiences.\r\n- Our game is fun to play, but it doesn't imply future success with \"real money gambling\".\r\n- The brands represented aren't sponsors of the rewards or affiliated with the companies.\r\n\r\n*Google Inc. does not sponsor, nor is any way affiliated with Lucky Night and/or the sweepstakes prizes.",
  "summary": "Try your luck to win rewards with 100% free scratch card games on Lucky Night!",
  "installs": "1,000,000+",
  "score": 4.280313,
  "ratings": 15526,
  "reviews": 5964,
  "price": 0,
  "developer": "Lucky Games Studio",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Dec 5, 2019",
  "updated": 1587579156000,
  "version": "1.5.4",
  "recentChanges": "Welcome to Lucky Night! To improve our app for you, we bring updates to Google Play regularly.<br>- Try your luck with daily scratchers <br>- Enjoy playing for free daily",
  "appId": "com.luckynight.app",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch x Scratch - Win Prizes & Redeem Rewards",
  "description": "Attentions! You are given an exclusive opportunity to enjoy the special slot experience with Scratch x Scratch! In this app, we offer you new & fancy scratch cards games with brand-new interfaces. \r\n\r\nScratch x Scratch is especially amazing, because it doesn’t need real money to play! You can have daily free tickets to play all scratch cards. By playing scratch cards, you can earn coins for big prizes!\r\n\r\nWhat’s the new game?\r\n- Play Black Jack in the sin city, may the Goddess of Luck be with you.\r\n- Mummy is coming...Is your time enough to escape from the pyramid?\r\n- Amazing! You match the caller’s number with one shot!\r\n- Snake vs Block is on scratch cards! Beat blocks to win lots of coins!\r\n- Rush for as much gold as you can, and be a millionaire! \r\nAnd more for you...\r\n\r\nAll cards are carefully designed with playful themes, download and check it out NOW! \r\n\r\n* This game is not affiliated by any other companies.\r\n* This game does not need real money in.\r\n* Playing this game does not imply future success at “Real Money Gambling”.\r\n* \"Scratch x Scratch - Win Prizes\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Time to double your scratch-card experiences, earn coins and redeem rewards!",
  "installs": "500,000+",
  "score": 4.5975146,
  "ratings": 19227,
  "reviews": 5398,
  "price": 0,
  "developer": "SCRATCH LAB",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jul 12, 2017",
  "updated": 1547014299000,
  "version": "1.4.6",
  "appId": "com.glottery.trilobite",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lottery Scratch Off - Mahjong",
  "description": "Lottery Scratch Off - Mahjong is a free scratch off game.\r\n\r\n40 scratchers free to play: Mahjong, Roll the dice, Red envelope scratch ticket…and more.\r\n\r\nIf you like lottery game, especially instant game, try Lottery Scratch Off - Mahjong and scratch big win prize!\r\n\r\nOnly for entertainment purpose and could not win real money from this game.\r\n\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Scratch ticket for Lunar New Year.<br>Lots of instant scratchoff to play &amp; win big!",
  "installs": "500,000+",
  "score": 4.573563,
  "ratings": 26196,
  "reviews": 4784,
  "price": 0,
  "IAPRange": "£0.79 - £41.99 per item",
  "developer": "YouSee Design",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 24, 2015",
  "updated": 1579708638000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.yousee.scratchfun_chinese_new_year",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Scratch! Scratch Cards",
  "description": "Lucky Scratch! is an awesome free scratch card game. Do you want to know how much lucky are you?\r\n\r\nYou can choose and play with scratch cards inspired by the most famous casino games as poker, slots or blackjack and many others.\r\nEach scratch card has its own price, lucky, rewards and rewards probability distribution: search the bests scratch cards to earn more virtual money!\r\n\r\nYou can spend your virtual money buying scratch cards, buying lucky boxes to increment your lucky, or buying bigger coins to scratch faster.\r\n\r\nThe game emulate the realistic scratch actions of real scratch cards, with realistic sounds too.\r\nAn advanced algorithm recognises when the card has been scratched.\r\n\r\nYou can compare your lucky with the other players, with a global leader board.\r\n\r\nNOTE: in this game you cannot win real money!",
  "summary": "Lucky Scratch! is a wonderful free scratch card game. How much lucky are you?",
  "installs": "100,000+",
  "score": 3.7839196,
  "ratings": 2002,
  "reviews": 373,
  "price": 0,
  "developer": "MFT Labs",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 6, 2014",
  "updated": 1427231609000,
  "version": "1.3.1",
  "appId": "com.mftlabs.luckyscratch",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Happy Scratch",
  "description": "Play the new popular game including scratch cards and claw machine every day! 100% free to play! Check your fortune today! Happy scratch is a great day that you can earn free rewards easily. \r\n\r\nBegin your journey of happy scratch for a chance to win bonus and big prizes. We wish you good luck on daily lucky scratcher and claw machine games, which cost you nothing, just enjoy playing!\r\n\r\n★★★★Game Features★★★★\r\n\r\n►You will have free chance to scratch cards everyday!\r\n►Daily bonus with abundant coins. Chances to win jackpot!\r\n►Enjoy the game whenever you want. No internet required after installation!\r\n\r\n★★★★User Experience Improvement★★★★\r\nPlease contact our email to give us suggestions and comments for better user experience.",
  "summary": "Scratch cards everyday to win you lucky rewards ! more free are waiting for you!",
  "installs": "1,000,000+",
  "score": 4.412584,
  "ratings": 55657,
  "reviews": 13443,
  "price": 0,
  "developer": "Happy Scratch Studio",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Oct 18, 2019",
  "updated": 1589042665000,
  "version": "2.0",
  "appId": "com.happy.scratch.spin.lucky.rewards.redeem.cards",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Royale",
  "description": "Take your scratchcard game to the next level with Scratch Royale from Viker.\r\n\r\nFree to download, free to play and no in-app purchases. Just scratch the cards, match 3 symbols and win big! \r\n\r\nPlayed all your cards? No worries! Our scratchcards are refreshed, 3 times every day at 9am, 3pm and 9pm (GMT), more than any other free-to-play scratchcard game.\r\n\r\n\r\nMake the most of every moment and scratch for your chance to win real money. You’ve got nothing to lose! Today could be your lucky day!\r\n\r\nGet scratching, start winning! \r\n\r\nAbsolutely no purchase necessary. Facebook login required.\r\n\r\nLike and Follow us on Social Media for news, updates, our winner's gallery and even more exciting competitions :\r\n\r\nFacebook: https://www.facebook.com/scratchroyale\r\nInstagram: @scratchroyale\r\nTwitter: @scratch_royale\r\n\r\nScratch Royale does not endorse or promote gambling. Scratch Royale scratchcards are intended solely for entertainment purposes. \r\n\r\nScratch Royale does not require any personal details from its players just login via Facebook to get started. An email address may be requested after you have won. \r\n\r\n*Google is not a sponsor nor is it involved in any way with this app, nor do they endorse this service or sponsor any prize redemptions.\r\n\r\n*Scratch Royale is a free mobile app that allows users to win with no purchase necessary.\r\n\r\nScratch Royale is operated by Viker Limited, registered at: 200 Union St, London, SE1 0LX, a company incorporated under English law (company number: 06290437).\r\n\r\nSee our website at www.viker.co.uk for further information about us.\r\n\r\n© Viker Limited. All rights reserved.",
  "summary": "Win Real Money with Free Scratchcards Every Day!",
  "installs": "500,000+",
  "score": 3.2198186,
  "ratings": 15424,
  "reviews": 6869,
  "price": 0,
  "developer": "Viker",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "May 31, 2019",
  "updated": 1566478357000,
  "version": "1.61",
  "recentChanges": "The biggest &amp; best scratchcard game is now live 🚀",
  "appId": "com.viker.scratchking",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lottomart - #1 UK Games, Scratch Cards & Lotto App",
  "description": "🔥 Games, Scratch and Lotto New Player Welcome Offers Available 🔥\r\n\r\nLottomart - UK’s favourite lottery and games destination. \r\n\r\nIt’s no wonder we are creating such a buzz - Lottomart creates winners! Here are a few of our recent winners:\r\n\r\n🚀 Daniel B. of Stoke won £137k with a Boosted lotto bet on Irish Lotto\r\n🚀 Desiree D. of London won £31kwith a Boosted lotto bet on Great British Jackpot\r\n🚀 Rachael T. of Bradford won £30k on a Cleoscratcha scratchcard\r\n\r\nLottomart is the home of Boost - the most exciting new way to bet the lottery where you “slide to decide” between bigger jackpots or more chances of winning. Our biggest lottery winners won because they Boosted their bets! Will you be next?\r\n\r\n6 Reasons you should join the thousands who play everyday at Lottomart\r\n\r\n‣ LOTTO JACKPOTS - Bet on the biggest jackpots worldwide for chances to win hundreds of millions in lotto jackpots every week!\r\n‣ SIMPLE, FUN, and EASY - The quickest and easiest app to use on the market.\r\n‣ BOOST for more chances to win - This unique feature allows you to choose between bigger jackpots or more winning chances on any lotto draw.\r\n‣ EXCLUSIVE SCRATCH CARDS - Win up to £150,000 on our unique selection of BIG prize scratch cards.\r\n‣ MASSIVE SELECTION OF CASINO GAMES - With over 100 video slots and the most popular table games you won’t be disappointed.\r\n‣ INSTANT REWARDS - Earn diamonds with every purchase and use them to pay for lotto bets or play scratchcards.\r\n\r\nCasino Games\r\n\r\n‣ European Blackjack\r\n‣ Roulette\r\n‣ American Roulette\r\n‣ Queen of the Crystal Rays\r\n‣ Lara Croft - Temples and Tombs\r\n‣ Thunderstruck II\r\n‣ Mega Moolah\r\n‣ Lucky Leprechaun\r\n‣ Immortal Romance\r\n‣ Medusa\r\n‣ Wild Cats\r\n‣ Royal Gems\r\n‣ Gold'orado\r\n‣ Jackpot Quest\r\n‣ Hot & Heavy\r\n‣ Wild Thirst\r\n‣ Agent Jane Blonde Returns\r\n‣ Gallantry\r\n‣ And MANY more\r\n\r\nExclusive Scratch Cards\r\n\r\n10 exclusive scratch cards ranging from 10p to £3 per card\r\n\r\nNew Live Dealer Casino Games!\r\n\r\n‣ Live Deal Or No Deal\r\n‣ Live Monopoly\r\n‣ Live Roulette\r\n‣ Live Blackjack\r\n‣ Live Dream Catcher\r\n\r\nLotto\r\n\r\nCheck out all our US, UK and Euro lotto jackpots:\r\n\r\n‣ Irish Lotto\r\n‣ Mega Millions\r\n‣ US Powerball\r\n‣ Europe Millions*\r\n‣ EuroJackpot\r\n‣ Cash4Life\r\n‣ Quick Lotto\r\n‣ Superenalotto & More...\r\n\r\n\r\n *Only The National Lottery app can sell tickets on the Euromillions. If you like the Euro Millions you will love this similar draw. \r\n\r\nDefault Welcome Offers* (See promotions section in app for full promo eligibility)\r\n \r\n‣ Welcome offers are available only on your first purchase:\r\n---Casino match bonus up to £100 - 100% Deposit bonus\r\n---Lotto buy 1 get 1 free Offer + 10 additional games spins on purchase of either a lotto bet\r\n---10 free 5k scratchcards Offer + 10 additional games spins on purchase of any scratchcards.\r\n‣ Minimum purchase required to qualify for welcome offers. \r\n‣ Stake limits and game contribution limits apply \r\n‣ Consult terms within the app for full promotion terms and general terms.\r\n \r\n *See promotions section in app for full promo eligibility. Promotional Terms and Conditions apply and we reserve the right to modify, extend, or suspend a promotion at any time..\r\n\r\nYou must be 18 years of age or older to play at Lottomart.\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact BeGambleAware.org at 0808 8020 133 or visit www.begambleaware.org.\r\n\r\nWe are licensed by the UK Gambling Commission (UKGC), license 000-051833-R-329042-001, issued 20 July 2018. Our jackpot prize payouts are covered by leading insurers to guarantee the payment of your jackpot winnings.",
  "summary": "UK&#39;s fastest-growing gaming app - Play real money Games, Lotto &amp; Scratch Games",
  "installs": "10,000+",
  "score": 4.18,
  "ratings": 171,
  "reviews": 50,
  "price": 0,
  "developer": "Lottomart",
  "genre": "Entertainment",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Nov 7, 2018",
  "updated": 1588064095000,
  "version": "2.52",
  "recentChanges": "‣  👌 14 New Red Tiger Daily Jackpot Slots Games!<br>‣  👍 Bugs Fixes",
  "appId": "com.lottomart.lottery.bet",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Card - Free Daily Scratch Cards Real Rewards",
  "description": "Lucky Card offers FREE scratch cards to scratch EVERY day. Earn coins through completely free scratch cards and trade these in for real gift cards at your favourite places. Gift cards for Amazon, Paypal, Starbucks and more! Lucky Card offers free brand new scratch cards offered to you every day for you and your friends to enjoy. Scratch and redeem to your hearts content. \r\n\r\nEach lucky scratch card is specifically designed so that you can play your favourite games with the things you love. Paris, Nachos and Sushi with more to come. With beautiful designs for all your favourites and new scratch games each day, what’s not to love? Games are completely free to play and not one penny is required to play through every scratch card available. If you run out of cards and want more scratches, don’t worry! You can choose to continue and continue your winning streak and claim your real prizes and rewards. Make money and have fun doing it without any risk of losing your hard earned money. Any scratch card could be the winning card so get scratching now! \r\n\r\nThis free scratcher app is the place to come to test your luck, scratch for your coins and fill your paypal account with your redeemed prizes! Get rich or scratch trying!\r\n\r\nScratch Cards Include:\r\n\r\nLost in Paris - A daily scratchcard designed to get you lost in Paris. Scratch, win and enjoy the rewards!\r\n\r\nSushi Madness - A daily scratchcard for the sushi lovers among us!\r\n\r\nNachos Time - A daily scratchcard for those of us that like a night in with a drink and a big pile of nachos.\r\n\r\nAnd many more lucky scratch cards coming soon!\r\n\r\nCome back every day to scratch your favourite scratch cards to win real prizes. To help you along the way, there is a free daily bonus for each day you come back. The daily bonus get bigger and bigger each day that you come back and scratch so make sure to claim your daily prizes! Get rich quick with these amazing daily bonuses.\r\n\r\nLove a card or get a big win? Share your best wins, show off your redeemed prizes and help get your friends rich as you play by sharing your favourite scratch card wins with your friends, family and followers. \r\n\r\nIf you love playing scratch cards but can’t afford the high street cost or even just love to scratch, Lucky Card is the place to be. Scratch for free, Win for free and redeem to your hearts content using wonderfully and beautifully designed scratch cards, amazing prizes to be redeemed and a bunch of fun for you and all your friends. More games and prizes to come in the future so be sure to come back to us and reap the benefits and free prizes to be redeemed for real life rewards. The daily scratcher to scratch to your hearts content. \r\n\r\nHow to Play:\r\n\r\nCreate your account - Choose to either log in as a guest or register with your email address. If you log in as a guest, be sure to register before you leave to ensure you don’t lose your coins!\r\n\r\nClick your favourite scratch card, whether it be Sushi Madness, Lost in Paris or more! \r\n\r\nScratch your favourite scratch card in the scratch here section.\r\n\r\nMatch three of the same icons and win!\r\n\r\nClaim your daily bonus and come back each day for ever increasing rewards. \r\n\r\nWhen you are ready, redeem your coin balance for rewards and prizes by clicking in the top left to open the navigation bar. Tap the store button and browse through our range of gift cards. Choose your favourite and redeem! \r\n\r\nTrack your order through the orders tab located in the navigation bar. \r\n\r\nSo why wait! Download Lucky Card today, play free scratch cards and redeem away!",
  "summary": "Free Daily Scratch Card App for Real Money Prizes at Your Favourite Places",
  "installs": "100+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "Clout Dev Limited",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Mar 3, 2020",
  "updated": 1585578308000,
  "version": "1.2",
  "recentChanges": "Push Notifications to remind people of juicy new cards and extra chances to win!",
  "appId": "luckycard.windaily.giftcards",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Dollar – Scratch off Games For Money",
  "description": "Lucky Dollar is a 🆓free scratch off app where you can 💰 win real money, gift cards and prizes 💰. \r\n\r\nIt is 100% free to play, and no purchase necessary.\r\n\r\n\r\nTest your luck today by playing free lottery scratcher to win real money! You might get lucky and 🤞 win big 🤞 by hitting one of the jackpots, up to $100,000! Test your luck with one of the best ❤️ win money apps ❤️ Lucky Dollar.\r\n\r\n\r\n📥 Download the Lucky Dollar app NOW to play free scratch offs and 🏆 win cash money! \r\n\r\n\r\nThere are multiple ways to 🤑 win money for free on Lucky Dollar. Play free scratch off to win Cash prizes. More lottery scratcher you scratch, higher chance you have to win 🏆 free  $10 Daily Giveaway and other prizes! \r\n\r\n\r\nAlso, check out our announcements or social media for a ⚡ Flash or monthly $100 giveaways! There are always giveaways and sweepstakes running, on top of random free rewards throughout the day, so make sure to turn on and check your notifications!\r\n\r\n\r\nIf you’re feeling lucky, capitalize on it to 🍀 win big money by playing free scratch off money games on Lucky Dollar! 🍀 \r\n\r\n\r\nLucky Dollar also provides 💵 instant wins in real money, gift cards and cash prizes through free scratch off card, raffles/sweepstakes and giveaways. Unlike other apps, you actually win and you get paid! We have the best odds of winning, and some have guaranteed winners every set. Our premium cards, VIP scratch card, gives you a real chance to win $1,000 at 1 to 1,000 odds. That means, today could be your 🤞 lucky day and 🏆 win real money for free! \r\n\r\n\r\nDownload Lucky Dollar Now to 🌪️ Play lotto scratcher win real money 🌪️  \r\n\r\n\r\nLucky Dollar also has the lowest redemption amount in the industry. Only $1.00 minimum to redeem coins. Most users play lotto games 💸 win gift cards and real money 💸 and get paid within a week of playing! This is because Lucky Dollar provides 💯real chance and 💯real odds for users to win with each money game of scratch off and lottery scratcher. \r\n\r\n\r\nYou can also earn coins by completing offers for millions of coins. Coins are easy to collect, and another way to redeem real money and gift cards. \r\n\r\n\r\nOr, you can win more by entering the daily, weekly, and monthly sweepstakes! On top of ⚡ lotto games win real money, there are flash giveaways and Happy Hours as well, where you can 🍹 win gift cards and real money! Simply check-in or play a free lottery scratch off to enter to win!\r\n\r\n\r\nMost importantly, Lucky Dollar always 🔥 pays out! Only $1.00 minimum needed to cash-out coins. This is the lowest minimum you can find anywhere! Redeem your lucky winning via 🔥 Pay-pal or Amazon Gift cards 🔥. \r\n\r\n\r\nCash balance can also be redeemed at $50! What better way to win and 🤞 earn big money than to play games for money! Download Lucky Dollar now, and scratch to see if it’s your lucky day! 🤞\r\n\r\n\r\n🍀 Highlights on our Free Lotto Scratcher money games 🍀\r\n\r\n* (Coming Soon) VIP cards with the best chances to win: Every 1 out of 1,000 entrants wins $1,000!! \r\n* All money games (scratch offs) are free to play! Play unlimited lotto games, scratch cards, all for free.\r\n* Lowest Redemption minimum for free money is only $1.00.\r\n* You win and receive real money or gift cards via Pay-pal or Amazon Gift cards.\r\n\r\n\r\nVisit our social media pages, facebook, twitter, and instagram for daily free promotions and winner announcements. Win money for free on Lucky Dollar’s scratch games or through giveaways and promotions! Let today be your lucky day on Lucky Dollar! Big wins = Happy day!\r\n\r\nfacebook: https://www.facebook.com/luckydollarapp/\r\ntwitter: twitter.com/luckydollarapp\r\ninstagram: instagram.com/luckydollarapp\r\nwebsite: luckydollarapp.com\r\n\r\n\r\nThese sweepstakes are devised as non-gambling promotions and are intended solely for entertainment purposes. \r\n\r\n\r\nLucky Dollar is 100% free to play, and no purchase is necessary to win real money and gift cards.\r\n\r\n\r\nGoogle Inc. does not sponsor, nor is any way affiliated with Lucky Dollar.",
  "summary": "Win Real Money &amp; Gift Cards playing Free Scratch Off Cards with Best Odds",
  "installs": "1,000,000+",
  "score": 3.9149108,
  "ratings": 37835,
  "reviews": 18636,
  "price": 0,
  "developer": "Win Real Money Games",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Jul 24, 2019",
  "updated": 1583418447000,
  "version": "4.4",
  "recentChanges": "Bug Fixes.",
  "appId": "com.luckydollarapp",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Lotto UK WIN REAL MONEY It's your LUCKY DAY!",
  "description": "Lucky Lotto is a new FREE game where you can WIN REAL MONEY. See if today is your lucky day! If you dream of a big cash payout from EURO Millions,  Mega Millions, Keno, Powerball, and scratchers, this daily lottery sweepstakes game is for you! It’s from the makers, of Lucky Scratch, so you know it’s legit and pays out real money daily. \r\n\r\nLucky Lotto is 100% free to download and play with no in-app purchases or deposits to win real cash. \r\n\r\nLucky Lotto Features:\r\n✔ Free to play\r\n✔ WIN REAL MONEY up to £10,000\r\n✔ HUGE jackpots\r\n✔ Choose 4 lucky lotto numbers every day\r\n✔ Fast and fun random number picker\r\n✔ Enter 2nd Chance Sweepstakes to win your choice of real gift cards from top brands like: VISA, Mastercard, Dunkin Donuts, Dominos Pizza, Amazon, and many more!\r\n✔ The TRUSTED daily lottery app because it’s from the makers of Lucky Scratch\r\n\r\nBe sure to follow us on social media for more fun and sweet prize giveaways!\r\nFacebook: @luckylottoapp\r\nInstagram: @luckylottoapp\r\n\r\nFor support please email us at:  support@luckylottoapp.com\r\n\r\nThese sweepstakes are devised as non-gambling promotions and are intended solely for entertainment purposes.\r\n\r\n*Google Inc. does not sponsor, nor is any way affiliated with Lucky Lotto and/or the sweepstakes prizes.",
  "summary": "Play the UK&#39;s Free Daily Lottery to win real money up to £10,000",
  "installs": "10,000+",
  "score": 3.64,
  "ratings": 123,
  "reviews": 41,
  "price": 0,
  "developer": "Lucky Scratch & Other Apps by Fort Mason Games",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Nov 11, 2019",
  "updated": 1574726207000,
  "version": "5.0.0",
  "recentChanges": "Play every day to win big!",
  "appId": "com.luckylottoapp.free.lotto.winrealmoney.luckyday.daily",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Time",
  "description": "About this game\r\n\r\nEnjoy Free Scratch cards Everyday!\r\n\r\nScratch Time offers to player daily opportunities to win cash, and its completely risk free. \r\n\r\nScratch Time is free to download and install and play with no in-app purchases or any types of deposits. \r\n\r\n\r\nFace book login required to  play the game.\r\n\r\nScratch Time Features:-\r\n\r\nWIN:\r\n \r\nMatch 3 winning symbols on our instant win scratch cards to win.\r\n\r\nEARN REWARDS :\r\n\r\nEarn tokens as you perform in play!\r\n\r\nNEW FREE SCRATCH CARDS EVERY DAY:\r\n\r\nNew scratch cards released every day.\r\nFor more details and winning opportunities Like and Follow us on Social Media, to see our winner’s gallery and all the latest updates from the team.\r\nPlay daily to increase your chance to win.\r\nThis app does not endorse or promote gambling. \r\nScratch Time does not require any details from its players other than paytm number to make payments to users. \r\n\r\nScratch cards of scratch time are for entertainment purposes only.\r\n\r\nScratch Time is a free mobile app that allows users to win with no purchase.\r\n\r\nThis game is designed and operated by MetalogSoft , registered in India. \r\n\r\nGoogle is not a sponsor of Scratch Time, nor it is involved in any prizes, scratchcards or rewards of Scratch Time.",
  "summary": "Enjoy Free Scratch cards Everyday!",
  "installs": "10,000+",
  "score": 3.73,
  "ratings": 136,
  "reviews": 77,
  "price": 0,
  "developer": "CodeWebTech",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Dec 20, 2019",
  "updated": 1584357647000,
  "version": "2.0",
  "appId": "com.metascratch.scratchlog",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Infinity Scratch - Win Prizes & Redeem Rewards",
  "description": "Do you like to play scratch cards? Here! You can just scratch it off and win a Big Prize!\r\n\r\nWith daily opportunities to win prizes instantly - you could be next!\r\n\r\nScratch is an addictive game! An experience of playing real scratch cards!!!\r\n\r\nWe have a variety of scratch cards in different themes and rules.\r\n- Mahjong Theme\r\n- Dice Theme\r\n- Basketball Theme\r\n- Roulette  Theme\r\n- Slots Theme\r\n- Vegas Theme\r\n\r\nTest your luck in Scratch today!\r\n \r\n* This game is not affiliated by any other companies.\r\n*This game does not need real money in.\r\n* Playing this game does not imply future success at \"real money gambling\".\r\n* \"Infinity Scratch - Win Prizes\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Win Prizes by Playing Lucky Lottery Games.",
  "installs": "1,000,000+",
  "score": 4.5842786,
  "ratings": 12410,
  "reviews": 4248,
  "price": 0,
  "developer": "SCRATCH LAB",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 27, 2017",
  "updated": 1547020593000,
  "version": "1.5.6",
  "appId": "com.glottery.whale",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Lottery",
  "description": "Is there still playing winning scratch it? \r\n\r\nThe new design, you can choose your favorite number of scratch cards \r\nEnsure that no cheating, all the awards and transparent, \r\nAll Guawan will first prize. \r\n\r\nA variety of styles, come try their luck.",
  "summary": "you can choose your favorite number of scratch cards,<br>Try your luck.",
  "installs": "100,000+",
  "score": 4.335463,
  "ratings": 6290,
  "reviews": 1042,
  "price": 0,
  "developer": "E.V",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 27, 2014",
  "updated": 1588688101000,
  "version": "3.9",
  "recentChanges": "Fix Ads issue.",
  "appId": "com.ev.scratcher",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Gold - Have a Lucky Day",
  "description": "🎉Lucky Gold offers FREE daily lotto, fun scratch cards and virtual spin games.\r\n\r\n🔔Lucky Gold is 100% FREE for you to 📲download and play with no sweepstakes or in-app purchases. 🍭New games are available every day and 🏆winners are selected randomly. Start your 🏄adventure in Lucky Gold now for a chance to win bonus and big prizes. You will be the next lucky winner!\r\n\r\n👏We wish you good luck on daily lottery, lucky scratcher and spinning wheel games, which cost you nothing, just enjoy playing 😃. You can also play with 👫 👭 👬friends and compete on the leaderboard. \r\n\r\nFeatures on the Lucky Gold app include:\r\n\r\n💡Win Big Surprise💡\r\n- Be the next Daily Lotto Jackpot winner.\r\n- Get big prizes by match 3 winning symbols on scratchers.\r\n- Be the today's highest token player to get unexpected bonus.\r\n\r\n💡Earn Great Rewards💡\r\n- Get instant gift cards from top brands.\r\n- Save up tokens to redeem big rewards.\r\n- Chance to obtain real gold by playing fun games.\r\n\r\n💡Enjoy Games Everyday💡\r\n- Play lotto daily and reveal results at 7 pm PT.\r\n- Refresh new scratch cards at 12 am PT daily.\r\n- Discover existing games and play with friends for fun.\r\n\r\n😍Love Lucky Gold? Leave us a 5-star review and all your feedback will be appreciated.\r\n📧For feature requests or further feedback, please send us an email to luckygoldapp@gmail.com.\r\n\r\n👉These sweepstakes are devised as **non-gambling** promotions and are intended for adult audiences with the purpose of entertainment only.\r\n👉Lucky Gold is a free mobile app that allows users to play games with no purchase necessary.\r\n👉Google Inc. does not sponsor, nor in any way affiliated with Lucky Gold and/or the sweepstakes prizes.\r\n👉The brands represented are not sponsors of the rewards or affiliated with the companies.",
  "summary": "100% FREE app to play cool lotto, scratcher &amp; spin games every day!",
  "installs": "1,000,000+",
  "score": 4.0728154,
  "ratings": 12549,
  "reviews": 5880,
  "price": 0,
  "developer": "Luckygold Team",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 15, 2019",
  "updated": 1588910289000,
  "version": "2.0.2",
  "recentChanges": "Lucky Gold is a 100% free game. It costs nothing to win.<br>- Fix bugs.<br>- Optimize user experience.",
  "appId": "scratch.lotto.raffle.luckygold",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch On!",
  "description": "A whole new world of scratch games is just here: fans around the globe ScratchOn! \r\n\r\nA classic and beloved game becomes even more interesting. Explore different modes in this amazing version: Fruit salad, Summer Fun, Space Travel, 7Lucky, Animal Kingdom, Merlin's Magic, Olympus Gods, Jurassic Scratch, The night of the winning Dead, all-in-one deluxe Scratch game! \r\nDifferent and themed graphics in each mode will take your experience in another level. Huge winnings may come across your road to the top so keep your eyes and your pocket open! Exciting mini games can trigger your mind and keep you busy. The Grabber, 5Chances, Bonus Wheel, BombTrap, Twiins, Pinball Parlour and mini Scratch Card are really going to be sought after. \r\nSo get your hands on and keep on Scratching!",
  "summary": "Various Scratching Cards with different themes and earnings! Scratch On!",
  "installs": "10,000+",
  "score": 4.17,
  "ratings": 144,
  "reviews": 37,
  "price": 0,
  "IAPRange": "£1.69 - £75.58 per item",
  "developer": "LazyLand SA",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 25, 2016",
  "updated": 1569572813000,
  "version": "1.12.12",
  "recentChanges": "Stability improvements",
  "appId": "air.com.lazyland.scratch",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch 2 Win: Lottery Tickets",
  "description": "Can you turn a measly $50 into $1,000,000? Find out in Scratch 2 Win: Lottery Tickets!\r\n\r\nYou are given $50 which you can use to buy scratch tickets and cards. Can you turn that $50 into $1,000,000? How about $1,000,000,000? Find out in Scratch 2 Win and get that lotto jackpot!\r\n\r\nScratch 2 Win brings the excitement of winning the scratch lottery like in Las Vegas! The more you scratch the cards, the more lottery cards that you can buy and win!\r\n\r\nScratch 2 Win has a variety of cards that you can play, including match 3, lucky number and a whole lot more! Try to collect more cards and scratch your way to lotto victory! \r\n\r\nTry and make your fortune by playing more scratch cards lottery! The more you play the more you win! Scratch those tickets for huge bucks! \r\n\r\nIf you know how to play and like scratch lottery cards, you’ll definitely love Scratch 2 Win! \r\n\r\nBe the high roller Las Vegas big shot that you dreamed of! \r\n\r\nHope you enjoy playing our little game as much as we've enjoyed creating it!\r\n\r\nFeatures: \r\n- Simulate real-life scratch off lottery tickets Las Vegas scratch style!\r\n- A variety of colorful scratch lotto ticket games\r\n- Feel the thrill of winning a scratch off lottery ticket game! \r\n\r\nDeveloped by Popsicle Games!",
  "summary": "Can you turn $50 into $1,000,000? Scratch your way to success &amp; find out!",
  "installs": "50,000+",
  "score": 3.66,
  "ratings": 196,
  "reviews": 91,
  "price": 0,
  "IAPRange": "£0.80 - £13.49 per item",
  "developer": "Popsicle Games",
  "genre": "Casual",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 25, 2016",
  "updated": 1511254589000,
  "version": "1.2.4",
  "recentChanges": "- Minor bug fixes! Good luck and scratch your way 2 millions!",
  "appId": "com.popsicle.scratch",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch and Win 2020",
  "description": "Scratch To Win Cash\r\n\r\nScratch To Cash win rewards allows you to earn daily pocket money with Scratch Coupons.\r\n\r\nYou will get Daily 10 to 13 Scratch Card So you will Scratch Every 10 Coupons and get Chance to win Cash and best Rewards.\r\n\r\nScratch To Cash - Earn money Now Try Your Luck and Open Your Gift.\r\n\r\nIn Scratch To Cash - Earn money Application You Have Daily Chance to Redeem best Rewards.\r\nScratch To Win Cash app is best app free available on play store so download this app and lets enjoy. Luck by scratch is easy an application through with you can play at the same time earn some money. Now you can earn rewarded scratch card.\r\n\r\nThis app only user-friendly has been developed, there is no real form of giving or receiving any payment to anyone. This app is designed for the user’s entertainment Purpose. So, best of luck and let’s enjoy\r\n\r\nDeclaration :-\r\nWe doesn’t Collect Any user Personal Information In Our Application.\r\nWe doesn’t Associated with any Company and Brand etc.",
  "summary": "Scratch and Win win 2020 allows to earn daily pocket money with Scratch Coupons.",
  "installs": "10,000+",
  "score": 3.6168225,
  "ratings": 107,
  "reviews": 88,
  "price": 0,
  "developer": "Utility Center",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 13, 2020",
  "updated": 1584105936000,
  "version": "1.1",
  "recentChanges": "*New Release",
  "appId": "com.scratch.scratchtowin",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Money - Feel Great & Make it Rain",
  "description": "Collect Coins and Tokens, take dream prizes. \r\nTap, scratch, collect, take rewards home. Simple, fun and easy. \r\n\r\n \r\nTake some spare time, join us and be one of the winners! Download Lucky Money to collect your fortune every day. The more you play, the more rewards you can win! What are you waiting for? Get your first Lucky Money!\r\n\r\n\r\nLucky Money is a new, fun and rewarding lifestyle experience on your phone. We offer free scratchers and real winning experience to users. Free lotto brings you happiness. Daily raffle tests your fortune power. Lucky spin fulfills your winning expectations. Cracking eggs makes your day!\r\n\r\nWe believe that if one considers himself lucky then he will eventually be lucky in real life. So we delicately chose these gorgeous cards with pleasant colors and wonderful rewards to enhance your lucky feelings. You have every reason to feel rewarded and gather all the joy in our app. We wish you have a lucky day.\r\n\r\nDownload Lucky Money to try your luck every day. Besides the more you scratch, the more rewards you can win! What are you waiting for? Get your first Lucky Money!\r\n\r\n*This game does not cost any real money. \r\n*Playing this game does not imply future success in “Real Money Gambling”. \r\n*Google Inc. does not sponsor, nor in any way affiliated with Lucky Money and/or the sweepstakes prizes.",
  "summary": "Lucky Money is a 100%free sweepstakes game. No money needed, no in-app purchase.",
  "installs": "5,000,000+",
  "score": 4.417901,
  "ratings": 288780,
  "reviews": 116620,
  "price": 0,
  "developer": "Shape Keeper Ltd",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 19, 2019",
  "updated": 1588241705000,
  "version": "1.5.6",
  "recentChanges": "Fixed bugs.",
  "appId": "scratch.lucky.money.free.real.big.win",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Time - Win Rewards Every Day",
  "description": "Unlimited scratch cards & slots games and Lotto games, free to download and play. \r\n\r\nLucky Time offers FREE scratches games and slots and lotto games where you can win every day. \r\n\r\nCollect coins and raffle tokens take dream prize. The more you play games, the more rewards you can win! Take some square time, join us and be one of the winners! Get your first lucky rewards in Lucky Time.\r\n\r\nToday is your lucky day, 100% free game to play! There are no in-app purchase products in our app. Lucky Time is an awesome raffle game that let you earn rewards easily. \r\n\r\nThere are multipule ways to win real rewards. Features on Lucky Time app include:: \r\n√ Play unlimited scratch card every day \r\n√ Spin Lucky Wheel every day for fun and gifts.\r\n√ Play 3 times lotto raffle every day \r\n√ Win coins or tokens for each task \r\n√ Invite friend to get more game tokens rapidly\r\n√ Kill boring time。Play each mini games whenever you want. \r\n\r\nEnjoy playing daily:\r\n√ Bonus scratch cards daily at every day\r\n√ Daily claim to earn coins and other rewards every day\r\n√ Enter daily lottery and reveal the results.\r\n√ Play Lucky Time for 10 minutes a day to test your luck\r\n\r\nDownload the app now and win your prize. Wish you Good Luck and have a Lucky day! \r\n\r\nOur dream is to get people relax and funny by playing games and get prize with the time they spend. We are making a great effort to help people have a happy life. We believe that if you consider yourself lucky then you will eventually be lucky in real life. We wish you have a lucky day, and now you are the lucktastic! \r\n\r\nNothing in app cost real money. No purchases are necessary. It’s real 100% free to play games. Our game is fun to play. Lucky Time is the best way to try yourluck and collect rewards by playing scratch and lottery.\r\n\r\n\r\n\r\nLotto drawing time: 03:00 (UTC).\r\nYou can check the winners with the Recent Winner feature in our app.\r\n\r\nFollow us and get the latest winning news! \r\nFacebook: @luckylucky \r\nInstagram: @luckytimepp \r\nTwitter:@luckytimeapp \r\n\r\nFor feature request and feedback, please send us an email to: xunancom2019@gmail.com \r\n\r\n*Google Inc. does not sponsor, nor is any way affiliated with Lucky Time and/or the sweepstakes prizes. \r\n*Lucky Time is a free mobile cool & free game app , no purchase is necessary.\r\n\r\nLucky Time Website: https://www.luckytime.vip/index.html\r\nLucky Time Privacy Policy: https://www.luckytime.vip/privacy_policy.html\r\nLucky Time Terms of Use: https://www.luckytime.vip/term_of_service.html\r\n\r\nContact Us via xunancom2019@gmail.com",
  "summary": "💸Rewards with Scratch, funny Lotto, lucky slots&amp;fun games, Be your lucky today.",
  "installs": "10,000,000+",
  "score": 4.3842077,
  "ratings": 164885,
  "reviews": 76915,
  "price": 0,
  "developer": "Lucky Lucky Team",
  "genre": "Casual",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 30, 2019",
  "updated": 1588345814000,
  "version": "3.1.54",
  "recentChanges": "Fixes crash bugs and other improvements.",
  "appId": "com.luckyapp.winner",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Candy Scratch - Win Prizes.Earn & Redeem Rewards",
  "description": "It’s time to treat yourself with some candies! Candy Scratch is here to offer you a brand-new joy of gaming! This scratch game is designed with adorable and delicate sweeties themes. With our daily free tickets, you can scratch cards and easily win big surprises without spending money!\r\n\r\nGet the first-hand information on what we offer:\r\n- What’s the lucky candy? Scratch out all your sweet candies, and match to the lucky one!\r\n- How many of your candies match the winning one? Unlock your own sweet candy saga!\r\n- You are in the candy town! Find the right candies and win tons of coins!\r\n\r\nCan’t wait for this sweet gaming adventure? Join us now!!!\r\n\r\n* This game is not affiliated by any other companies.\r\n* This game does not need real money in.\r\n* Playing this game does not imply future success at “’Real Money Gambling”.\r\n* \"Candy Scratch - Win Prizes\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "You are so close to the great prize! Play Candy Scratch and be the big winner!",
  "installs": "100,000+",
  "score": 4.518116,
  "ratings": 2767,
  "reviews": 803,
  "price": 0,
  "developer": "SCRATCH LAB",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 28, 2017",
  "updated": 1547100738000,
  "version": "1.3.5",
  "appId": "com.glottery.ray",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch and Win Cash",
  "description": "\"Scratch and Win Cash\" App Is Designed For User's Entertainment Purpose. Users Can Get Some Some Virtual Cash In This App Only By Scratching Some Cards.\r\n\r\nScratch Cards Are Depends On The User's Luck. Cash In Cards Opens Randomly. In Scratch and Win Real Cash App You Will Get Unlimited Scratch Cards In Whole Days But We Can Be Set Limit Of Scratch Cards in Future.\r\n\r\nScratch and Win Real Cash Is Available In Play Store Free Of Cost So Anyone Can Download It From Play Store And Use It According To You.\r\n\r\n\"We Don't Collect Any Information Of Our User But The Ads- Network Which Are Commonly Use In Our Scratch and Win Cash App To Monetize May Fetch Your Information.\"\r\n\r\nScratch and Win Real Cash App Is Developed As User-Friendly. In This App You Will Get Virtual Cash And You Will Redeem Your Cash But We Did Not Take Any Guarantee Of Giving And Receiving Payment To Anyone. This App Is Totally Made For User's Entertainment. We Have Two Partner And We Both Are Not Capable To Provide Payments To Any User. So Best Of Luck And Enjoy Scratching.\r\n\r\nThanks For Understanding Our Situation and Don't Forget To Check  Our Privacy and Policy Frequently Since It Is Subjected To Change And Your Continued Use Of The Site Is Conditional To Your Acceptance Of Any Modifications Here. You Agreed To Our Terms and Conditions of This Privacy Policy. We Have Rights To Change Our Terms and Conditions At Any Time.\r\n\r\nWe Used:-\r\n\r\nFirebase For Getting Your Mobile Number, Your Points And Your Email For Contact You If We Facing Any Problem In Redeem.\r\nOne Signal For Giving You Notification Related With Our App Features And Offers.\r\nNetwork For Detect Your Internet Connection And Simple Components. \r\n\r\nWe Declared:-\r\n\r\nWe Does Not Collect Any User's Personal Information In Our Scratch and Win Cash App.We Does Not Associated With Any Company And Brand Etc.If You Have Any Problem With Our App Then Feel Free To Contact Us Here h.p.comp.ltd@gmail.com.",
  "summary": "Scratch and Win Cash Is a best entertainment App",
  "installs": "1,000+",
  "score": 4.38,
  "ratings": 255,
  "reviews": 136,
  "price": 0,
  "developer": "H&P Digital Solutions",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 19, 2020",
  "updated": 1588235328000,
  "version": "11.0",
  "recentChanges": "Add More Withdrawal Options <br>Added New App Icon<br>Improve Performance <br>Fixed Some Major Bugs",
  "appId": "com.handpdigitalsolutions.scratchforcash",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch (Luck By Scratch 2020)",
  "description": "Now you can earn rewarded scratch card and then withdraw coins.\r\n\r\nScratch the card and win some best Gift card.\r\n\r\nDaily you get 20 Scratch card and reward more and more point.\r\n\r\nScratch Day\r\n-You can make your day lucky with scratch this Daily Card.\r\n\r\nApp Features:\r\n-Daily earn money\r\n-Scratch to Cash\r\n-earn cash by playing games\r\n-Scratch to win\r\n-gift card generator\r\n-Scratch Card\r\n\r\n:- our App must develop with target above the age of 18+\r\n\r\nContact us: yarmisavaliya026@gmail.com",
  "summary": "Scratch Card &amp; win some GiftBox.",
  "installs": "50,000+",
  "score": 3.49,
  "ratings": 798,
  "reviews": 513,
  "price": 0,
  "developer": "Vidio Down",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Jan 8, 2020",
  "updated": 1587360990000,
  "version": "1.2",
  "appId": "adjj.etlkdhefe.pmontjee",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch to Win 2020",
  "description": "Play and enjoy Spin and Scratch.\r\n\r\nLuck by Spin\r\n-You can win daily lucky spin by play it.\r\n\r\nScratch Card\r\n-Scratch Card and win point.\r\n\r\nDaily win extra point.\r\n\r\nUse:\r\n-Daily Spin\r\n-scratch card\r\n-Withdraw earn spin point.\r\n\r\n\r\nWe are trying to make best App By our Developer team.\r\n\r\nContact:\r\nalexmac481@gmail.com",
  "summary": "Just play Scratch and win Daily point.",
  "installs": "50,000+",
  "score": 4.06,
  "ratings": 881,
  "reviews": 628,
  "price": 0,
  "developer": "Alex Developing",
  "genre": "Entertainment",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Sexual Innuendo",
  "released": "Mar 4, 2020",
  "updated": 1584792979000,
  "version": "1.2",
  "recentChanges": "Set New editor.",
  "appId": "frame.lovephoto.photoframewithlove",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lottery Scratch Off EVO",
  "description": "Lottery Scratch Off EVO is the best scratchers games.\r\n\r\nThere are several popular casino style lottery tickets like Poker, Slots, Blackjack, Roulette, 777…and more.\r\n\r\nLots of scratch-offs you can scratching for free.\r\n\r\nHit the JACKPOT and become a Lottery Scratch-Off game WINNER!\r\n\r\nTry your luck today!!\r\n\r\nOnly for entertainment purpose and could not win real money from this game.\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "No.1 lottery scratch off game!<br>Like playing real scratch offs!",
  "installs": "100,000+",
  "score": 4.52,
  "ratings": 4277,
  "reviews": 839,
  "price": 0,
  "developer": "YouSee Design",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Sexual Innuendo",
  "released": "Dec 5, 2014",
  "updated": 1580790136000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.yousee.scratchfun_xmas",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Golden Time—Win Rewards & Make Your Golden Time",
  "description": "Golden Time is a 100% Free Sweepstakes App!\r\n\r\nCollect Coins from free scratch cards, lotto, lucky wheel and lucky prize to take your dream prize！\r\nEasy to play, easy to win! \r\n\r\nThe more you play, the more rewards you can win! Golden Time offers many free scratch cards and lotto for you in your spare time. You can win every day and every where. It's Time to Test your Luck. Start your adventure in Golden Time now for a chance to win the Big Prizes and Jackpot. You will be the next Lucky Dog! Don't hesitate and download Golden Time to be the next Winner!\r\n\r\nGolden Time is real, fun, easy reward and awesome lucky app. We have thousands of winner every day and give every average person an average chance to win. Free scratch cards scraping away your troubles. Daily Lotto gives your fortune time. Lucky Wheel meets your expectation for the big prize. Lucky Prize makes you real winner!\r\n\r\nOur app's mission and target is to give everyone a free chance to have a Golden Time because we believe you shouldn't have to risk losing for the chance to win! We wish you have a lucky day. And it's time to be Luck.\r\nGolden Time is 100% free to download and play with no in-app purchases or deposits.\r\nFeatures:\r\n√ Play unlimited scratch cards to get your luck every day\r\n√ Play free lotto to test your luck every day\r\n√ Win  more coins and tokens for each task\r\n√ Invite friend to get tokens rapidly and quickly\r\n√ Play Lucky Wheel every day and everywhere\r\n√ Play Lucky Prize every day and everywhere\r\n\r\nDownload Golden Time to try your luck every day. Besides the more you scratch, the more rewards you can win! What are you waiting for? Get your first Golden Time in your life!\r\nOur dream is to get people relax by playing games and get prize with the time they spend. We are making a great effort to help people have a happy life.\r\n\r\nFor feature request and feedback, please send us an email to: shuishangdonggua@gmail.com\r\n\r\n\r\nOfficial Rules: https://www.goldentime.vip/OfficeRules.html\r\nPrivacy Policy: https://www.goldentime.vip/PrivacyPolicy.html\r\nOur Website: https://www.goldentime.vip/index.html\r\n\r\n👉*These sweepstakes are devised as **non-gambling** promotions and are intended for adult audiences with the purpose of entertainment only.\r\n👉*Google Inc. does not sponsor, nor is any way affiliated with Golden Time and/or the sweepstakes prizes.\r\n👉*Golden Time is a free mobile cool & free game app , no purchase is necessary.",
  "summary": "Golden Time is 100% Free! Come to take your dream prize! Easy play and win!",
  "installs": "100,000+",
  "score": 4.289017,
  "ratings": 5274,
  "reviews": 1970,
  "price": 0,
  "developer": "Golden Time123",
  "genre": "Casual",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 13, 2019",
  "updated": 1585726526000,
  "version": "1.0.9",
  "recentChanges": "Bug fixes and improvements.",
  "appId": "com.scratch.goldentime",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lotto Scratch Off -Illustrator",
  "description": "This scratch card game is suitable for all ages.\r\n\r\nScratch tickets features:\r\n\r\n★ Gorgeous Scratch-its style\r\n★ Scratchcard can be move / zoom in / zoom out\r\n★ Various scratch-off winning modes \r\n★ Lots of scratching tools\r\n★ Various topic of Instant lottery(lotteries)\r\n★ Scratchies can be shared to friends\r\n★ Release new lotto scratch tickets frequently\r\n\r\nTry your luck today with Bunny Scratch!!",
  "summary": "Creative scratch cards from illustrators!<br>Free &amp; Best lotto scratchers to play.",
  "installs": "100,000+",
  "score": 4.3378,
  "ratings": 18020,
  "reviews": 2843,
  "price": 0,
  "developer": "SHOCKTECH",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 25, 2014",
  "updated": 1581057734000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.shocktech.guaguahappy",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch And Win Cash",
  "description": "This is really better way to play game and enjoy to try your luck and get coins as per your luck.\r\n\r\nScratch And Win Cash is free game available on play store, it contains scratch card, spin wheel and match machine games for daily entertainment.\r\n\r\nPlay all games, try your luck and get more and more coins daily. This game provides 15 scratch card, match machine spin and spin wheel each.\r\n\r\nWe are not collecting or store any type of personal information from our users but the ad-network we used in our application may fetch your information.\r\n\r\nScratch And Win Cash is user friendly game developed for fun and entertainment, there is no real type of giving or receiving payment to anyone, we are not paying so try your luck and collect virtual cash for fun, try your luck now with Scratch And Win Cash game.\r\n\r\n•\tLucky scratch card\r\n•\tLucky spin wheel\r\n•\tLucky match machine\r\n•\t15 activity available for each\r\n•\tEasy to use with best UI and Sound\r\n•\tSmall size game available free on play store\r\n\r\nThank you for understand, we advised you all to check our privacy policy too for our terms and conditions, by using our game you accepted and agreed to our terms and conditions.\r\n\r\nDisclaimer:\r\n\r\nWe are not storing or collecting any kind of user’s personal information though our Scratch And Win Cash game, we are not associated with any brand or any company, we are not giving and receiving any kind of payment, if you have any question or suggestion please contact us without any hesitation via our Gmail id “mira.vasani456@gmail.com”.",
  "summary": "Scratch And Win Cash Game For Best Fun",
  "installs": "5,000+",
  "score": 4.55,
  "ratings": 205,
  "reviews": 74,
  "price": 0,
  "developer": "XX Winzo",
  "genre": "Arcade",
  "contentRating": "PEGI 3",
  "released": "Mar 22, 2020",
  "updated": 1584891883000,
  "version": "1.0",
  "appId": "scratch.towin.xxwinzo",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Time - Win Your Lucky Day & Real Money",
  "description": "Lucky Time is a free lifestyle experience on your phone. We offer users free scratching cards to have real winning experience. \r\n\r\nFree daily lotto brings you happiness even more than winning real money.\r\n\r\nWe believe that if one considers himself lucky then he will eventually be real lucky. So we delicately chose these gorgeous cards with pleasant colors and wonderful rewards to enhance your lucky feelings. You have every reason to feel lucky and happy in our app. We wish you have a lucky day.\r\n\r\n\r\nDownload Lucky Time to try your luck everyday.\r\nThe more you scratch, the more rewards you can win!\r\n\r\n\r\n*This game does not cost any real money.\r\n*Playing this game does not imply future success in “Real Money Gambling”.\r\n*Google Inc. does not sponsor, nor is any way affiliated with Lucky Time and/or the sweepstakes prizes.",
  "summary": "100% free app to play cool lotto, scratcher &amp; spin games every day!",
  "installs": "500,000+",
  "score": 4.3768115,
  "ratings": 9045,
  "reviews": 3137,
  "price": 0,
  "developer": "Luckytime App Team",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 2, 2019",
  "updated": 1588347617000,
  "version": "1.3.46",
  "recentChanges": "Thanks for playing Lucky Time! To improve our app for you, we bring updates to Google Play regularly.<br>     1. Fix bugs.<br>     2.  Optimize the overall interface and improve the user experience",
  "appId": "playgame.realmoney.free.scratchers.win.luckytime",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Gift - Win Rewards Every Day",
  "description": "Lucky Gift offers well-designed raffle, virtual lotto, cool scratch cards and spin games to you with a chance to win big rewards every day. \r\n\r\nLucky Gift is absolutely FREE for you to download and play with no sweepstakes or any in-app purchases. New games are available every day. Install now and you could be the next winner. \r\n\r\nStart your winning story in Lucky Gift with friends, compete with each other on the leaderboard & enjoy playing! We wish you good luck on our risk-free daily lottery, lucky scratcher, raffle and spinning wheel games!\r\n\r\nLuck Gift Features:\r\n🍀 Win Big Prize 🍀\r\n⭐️ Get rewards by match 3 winning symbols on scratchers.\r\n⭐️ Enter your tickets in the raffle game to win rewards.\r\n⭐️ Play daily lotto and win the big prize.\r\n⭐️ Be the lucky one to get bonus among today’s players.\r\n\r\n🍀 Earn Great Rewards 🍀\r\n⭐️ Get instant gift cards from top brands.\r\n⭐️ Save up tokens to redeem big rewards.\r\n⭐️ Opportunity to obtain gifts by playing games for fun.\r\n\r\n🍀 Enjoy Games Every Day 🍀\r\n⭐️ Lotto results will be revealed at 7 pm PT daily.\r\n⭐️ New scratch cards will be unlocked at 12 am PT every day.\r\n⭐️ Enter your tickets on raffle games.\r\n⭐️ Discover exciting games and play with your friends for fun.\r\n\r\n😍Like Lucky Gift? Leave us a 5-star review and all your feedback will be appreciated.\r\n📧For new feature introduction or feedback request, please send us an email to luckygiftapp@gmail.com.\r\n\r\n* This game application does not cost any real money.\r\n* Google Inc. does not sponsor, nor is any way affiliated with Lucky Gift and/or the sweepstakes prizes.\r\n* The brands represented are not sponsors of the rewards or affiliated with the companies.",
  "summary": "FREE to play exciting scratcher, raffle, lotto &amp; spin games and WIN big rewards.",
  "installs": "50,000+",
  "score": 3.92,
  "ratings": 438,
  "reviews": 184,
  "price": 0,
  "developer": "Lucky Gift Team",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 13, 2019",
  "updated": 1585900397000,
  "version": "2.1.5",
  "recentChanges": "Lucky Gift is a free game. It costs nothing to win.<br>- Bug fix.",
  "appId": "scratch.lucky.gift.free.real.money.big.win.cash.day",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch to Win : Get Scratch Cards",
  "description": "You Will Get Unlimited Scratch Cards.\r\n\r\nScratch to Win : GetScratch Cards\r\n \r\nNow you can earn easily by using this app.\r\nThis app provides you many tasks for earn daily.\r\n\r\nApp Features:-\r\nRefer your friends and earn.\r\nInstall and Earn.\r\nWatch Video and Earn\r\n\r\nHappy earnings!!!",
  "summary": "Scratch to Win : Get Scratch Cards",
  "installs": "1,000+",
  "score": 3.3333333,
  "ratings": 6,
  "reviews": 4,
  "price": 0,
  "developer": "Rodnelio Capua",
  "genre": "Finance",
  "contentRating": "PEGI 3",
  "released": "Nov 19, 2019",
  "updated": 1574677248000,
  "version": "2.1",
  "recentChanges": "Refer System Updated.",
  "appId": "com.roncapua.spinandwin",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Cat - free rewards giveaway",
  "description": "100% free daily scratch card to win surprising rewards! \r\nWish you good luck every day! Enjoy your happy life everyday!\r\n\r\nKey features of Lucky cat:\r\n🐱Unlimited scratch cards everyday!\r\n🐱Invite friends to win more.\r\n🐱Lucky code for you to redeem more coins. \r\n🐱Smash lucky eggs to get the surprising gift!\r\n\r\nWe will appreciate that if you have any comments or suggestions.\r\nPlease contact us by email.\r\nLike our on the Facebook page to join more fun activities. \r\n\r\nNOTICE：\r\nGoogle, INC. (\"GOOGLE\") IS NOT A SPONSOR NOR IS INVOLVED IN ANY WAY WITH THIS APP, NOR DO THEY ENDORSE THIS SERVICE OR SPONSOR, ANY PRIZE REDEMPTIONS.",
  "summary": "daily scratch card lucky game! Come to redeem your free rewards and grand gifts!",
  "installs": "1,000,000+",
  "score": 4.397318,
  "ratings": 52403,
  "reviews": 13088,
  "price": 0,
  "developer": "Lucky Cat Team",
  "genre": "Casual",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 7, 2019",
  "updated": 1588935750000,
  "version": "3.0",
  "recentChanges": "bug fixed and feature optimization.",
  "appId": "com.lucky.cat.free.rewards.giveaway.scratchcard",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Now! - Feel Great & Make it Rain",
  "description": "LuckyNow! is a carefully designed entertainment game, free to participate in the experience of scratch cards,spin,lottery, raffle.You can get unlimited rewards.Happy every day\r\n\r\nIn Lucky Now! you will:\r\n-Happy scratch scratch, instant rewards.\r\n-Spin game,One simple turn, continuous surprises\r\n-Lotto numbers, You may be the lucky one.\r\n-Raffle tickets, Win the dream harvest\r\n-Kill boring time. Play whenever you want\r\n\r\nWe believe that if one considers himself lucky then he will eventually be lucky in real life. So we delicately chose these gorgeous cards with pleasant colors and wonderful rewards to enhance your lucky feelings. You have every reason to feel rewarded and gather all the joy in our app. We wish you have a lucky day.\r\n\r\nAll you have to do is pick up your phone! If you play Lucky Now at any time, you will have unlimited joy and reward.\r\n\r\n*Google Inc. does not sponsor, nor in any way affiliated with Lucky Now! and/or the sweepstakes prizes.\r\n*This game doesn't cost any real money.\r\n*playing the game does not mean future success in the \"real money game.\"",
  "summary": "Lucky Now offers free scratches and lotto games where you can win every day.",
  "installs": "1,000,000+",
  "score": 3.8338816,
  "ratings": 24603,
  "reviews": 10630,
  "price": 0,
  "developer": "Super Bit",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 20, 2019",
  "updated": 1580987326000,
  "version": "1.1.2.1004",
  "recentChanges": "Optimized UI performance.",
  "appId": "com.lucky.scratch.spin.us",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch And Win Cash - Earn Real Money",
  "description": "Scratch To Win Cash \r\n\r\nScratch Coupons and Open Up Your Luck and Chance to Win Cash. \r\n\r\nScratch To Cash win rewards licenses you to obtain step by step pocket money with Scratch Coupons. \r\n\r\nScratch Coupons and Open Up Your Luck and Chance to Win Cash.\r\n\r\nScratch To Cash win rewards allows you to earn daily pocket money with Scratch Coupons.\r\n\r\nYou will get Daily 10 to 13 Scratch Card So you will Scratch Every 10 Coupons and get Chance to win Cash and best Rewards.\r\n\r\nyou will Also Refer Your Friends to Earn Extra Rewards in Scratch To win cash\r\n\r\nScratch To Win Cashapp is best app free available on play store so download this app and lets enjoy. Luck by scratch is easy an application through with you can play at the same time earn some money. Now you can earn rewarded scratch card and rewarded coins.\r\n\r\nWe personally do not take any information of our user but the Ad-network which we commonly use in our apps to monetize may fetch your information.\r\n\r\nYou will get Daily 10 to 13 Scratch Card So you will Scratch Every 10 Coupons and get Chance to win Cash and best Rewards. \r\n\r\nScratch To Cash - Earn money Now Try Your Luck and Open Your Gift. \r\n\r\nIn Scratch To Cash - Earn money Application You Have Daily Chance to Redeem best Rewards. \r\n\r\nScratch To Cash - Earn money Now Try Your Luck and Open Your Gift.\r\n\r\nIn Scratch To Cash - Earn money Application You Have Daily Chance to Redeem best Rewards.\r\n\r\nyou will Also Refer Your Friends to Earn Extra Rewards in Scratch To win cash \r\n\r\nScratch To Win Cashapp is best application free available on play store so download this application and lets welcome it. Karma by scratch is straightforward an application through with you can play at the same time increase some money. By and by you can acquire repaid scratch card and compensated coins. \r\n\r\nWe before long don't take any information from our customer yet the Ad-orchestrate which we customarily use in our applications to adjust may get your information. \r\n\r\nThis application only straightforward has been made, there is no real kind of giving or getting any portion to anyone. This application is proposed for the customer's diversion Purpose. We are not skilled to offer a portion to any customer. Right now, karma and we should appreciate \r\n\r\nThankful to you for your cognizance. Try to check our security approach a significant part of the time, since it is presented to change, and you continue with use of the site is prohibitive to your affirmation of any alterations here. You agree to the terms and conditions of this security course of action.",
  "summary": "&quot;Win more and with scratch&quot;. scratch useful app for you",
  "installs": "10,000+",
  "score": 4.426415,
  "ratings": 9675,
  "reviews": 4538,
  "price": 0,
  "developer": "Scratch  Official Company",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 17, 2020",
  "updated": 1585981742000,
  "version": "21.0",
  "appId": "scratch.win.scratchtowincash",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Lotto Mania",
  "description": "You are welcome to play free scratch-off lottery game. It is actually the most addicting time killer with lots of glossy scratch cards and sharp mechanics.\r\n\r\nScratch Lotto Mania offers:\r\n\r\n- The variety of themes - from famous Slots, Casino and Dices to fun cartoonish settings as Sunny Farm and Klondike’s Gold Rush.\r\n- Colorful and fun scratch tickets with different mechanics.\r\n- Super easy and fun scratch mechanics without any glitches\r\n- No distractions - no pop up ads\r\n\r\nWe are constantly adding new tickets with new fascinating winning algorithms to test you luck and let you win BIG.\r\n\r\nScratch Lotto Mania game mechanics:\r\n\r\nThe levels are represented by unique scratch-off cards. Each card has it’s own rules and betting amount. You can access the rules right from the game screen by pressing little “i” button on the card.\r\n\r\nBetting amount is deducted from your Balance as a cost of the scratched card. You can add more coins by pressing “+” button and get coins by watching the video ad or purchase a coins package via in-app purchase system.\r\n\r\nYou can scratch the ticket manually or use the InstantScratch button to avoid bothering yourself with unnecessary movements and immediately see the playing numbers (or symbols).\r\n\r\nPlaying more cards will raise your experience and will lead to the level progress.\r\n\r\nBefore playing new level take a chance in betting on the Bonus Reel to win more coins.\r\n\r\nPlease note that this game is for entertainment purpose and you could not win real money from this game.",
  "summary": "Free scratch-off lottery game with glossy scratch cards and sharp mechanics",
  "installs": "10,000+",
  "score": 4.57,
  "ratings": 511,
  "reviews": 125,
  "price": 0,
  "developer": "IKIGAI GAMES",
  "genre": "Simulation",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 15, 2015",
  "updated": 1451231321000,
  "version": "1.0.3",
  "recentChanges": "- New Christmas Scratch Off Ticket<br>- Daily bonus increased to 100 coins<br>- Watching ads now gives you 50 coins",
  "appId": "com.pixipile.scratchlottomania",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky CASH Slots - Win Real Money & Prizes",
  "description": "Love winning REAL CASH?  Play Lucky Cash Slots and you may win real money in our free Slots Tournament Sweepstakes! \r\n\r\nDo you love spinning Vegas-style slot machines? Do you love winning real money? If so, you’ll love Lucky Cash Slots.  You’ll especially love our FREE to play real money Sweepstakes Tournaments. Simply spin, climb the leaderboard, and you may win real cash in the form of a real gift card.  It’s like winning real money and prizes in your favorite Las Vegas Casino.  When you finish spinning in our Cash Sweepstakes Tournaments, enjoy playing our free Vegas Style Slots games too. \r\n\r\nDownload Lucky Cash Slots now to play FUN slots games and enter our Sweepstakes Tournaments.\r\n\r\nEnjoy the FUN of the best Vegas-style slots games and the thrill of WINNING REAL MONEY!\r\n\r\nLucky Cash Slots Features:\r\n\r\nVEGAS-STYLE SLOTS\r\n• Huge 5,000,000 Welcome BONUS credits\r\n• Vegas-style slots games like 88 Riches, Legend of Zeus and more!\r\n• Games with beautiful graphics to relax and de-stress you\r\n\r\nWIN REAL MONEY\r\n• Easy to play Slot Tournament Sweepstakes with REAL CASH prizes\r\n• This is NOT gambling, it’s a sweepstakes*, and it’s free to enter and play\r\n• Cash prizes change from time to time. So, come back every week to see the newest giveaway\r\n\r\nPLAY WITH FRIENDS\r\n• Invite friends and you may get bonus Cash Sweepstakes Tournament spins\r\n• Send friends hearts to let them know you are thinking about them, and win free credits at the same time!\r\n\r\nSpin to Win on Lucky Cash Slots today!  Your payday awaits….\r\n\r\nFollow us:\r\nFacebook: https://facebook.com/luckycashslots\r\nSupport: please email us at: support@luckycashslots.com\r\n\r\nNotes:\r\nCamera, Gallery, and other App Permissions are utilized to upload pictures to your personal profile and personalize your experience.\r\n\r\n*All games are for entertainment only and do not offer any opportunity to wager real money or gamble in any way; this game is intended for adult audiences. The gameplay does not imply any future success at real money gambling.\r\n\r\n*These sweepstakes are non-gambling promotions and are intended solely for entertainment purposes. No purchase can impact the outcome of sweepstakes. Official Rules can be found at Luckycashslots.com/rules.\r\n\r\n*Google Inc. does not sponsor, nor is any way affiliated with Lucky Cash Slots or its parent company and/or any sweepstakes.\r\n\r\nLike our games?\r\n► Leave us a 5-star review. Your feedback is appreciated.",
  "summary": "Sweepstakes app with Real Cash, Prizes &amp; WALMART Gift Cards! Play Free to Win!",
  "installs": "500,000+",
  "score": 3.8424437,
  "ratings": 6519,
  "reviews": 2827,
  "price": 0,
  "IAPRange": "£1.79 - £90.99 per item",
  "developer": "Lucky Scratch & Other Apps by Fort Mason Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Oct 24, 2017",
  "updated": 1559236203000,
  "version": "46.0.0",
  "recentChanges": "Play Tournaments for a chance to win Gift Cards!",
  "appId": "com.fortmasongames.confetti",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch2Cash - Scratch Cards, Slots & Casino Games",
  "description": "Download Scratch2Cash app and start scratching and winning on the move, no matter where you are\r\n\r\nDon’t forget to increase your bankroll with our fantastic welcome offer of up to 100% match up bonus + 20 scratch cards on your first deposit!\r\n\r\nPlay our exciting range of instant games :\r\n\r\n► VIP Black\r\n► Bejeweled\r\n► The 7th Heaven\r\n►Lucky Charms\r\n► Horoscope \r\nAnd much more!\r\n\r\nWinning is easy because our games are so simple and fun to play – just scratch and match, every 3rd ticket is a sure win!🏆\r\n\r\nEnjoy exclusive special offers and promotions at Scratch2Cash and boost your winnings to the max!\r\n\r\nTOP FEATURES INCLUDE: \r\n\r\n• All the top online scratch cards and slots from industry leading providers Netent, NeoGames, Microgaming and Play’nGo, all optimised for mobile and tablet play.\r\n• Quick to load and easy to register, deposit and find your favorite games. \r\n• Dedicated support team ready to assist you with any issue  – 7 days a week! \r\n• Play for real money, or get some practice in with the no pressure demo feature.\r\n• Fast and secure cash-outs and a wide selection of payment options.\r\n•Great winning chances – 1 in every 3 scratch cards is a winner!\r\n\r\nSince 2005 Scratch2Cash has proven to be the number one choice for scratch card players on the web. Our years of experience combined with our passion to bring you the fairest, secure and entertaining instant games make Scratch2Cash the ideal place to play. \r\nAt Scratch2Cash you’re sure to find hours of pure fun with the highest level of entertaining games on the web in a safe and secure environment. \r\n  \r\n\r\nCONNECT WITH US:\r\nWebsite: https://www.scratch2cash.com/\r\n\r\nGeneral T&Cs apply:  \r\nhttps://www.scratch2cash.com/bonus-policy/\r\n\r\nNote that:\r\nBets on different games contribute differently to the wagering requirements and that other terms apply: \r\n\r\n\r\nT&Cs Welcome bonus:\r\nhttps://www.scratch2cash.com/promotions/welcome-package/\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at (0808 8020 133) or visit https://www.begambleaware.org.",
  "summary": "Filling Lucky? Join Today &amp; Get The Chance To Win. Big Jackpot Prizes 💰💰💰",
  "installs": "10,000+",
  "score": 5,
  "ratings": 717,
  "reviews": 11,
  "price": 0,
  "developer": "Aspire Global plc",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Nov 19, 2017",
  "updated": 1582814842000,
  "version": "1.0.14",
  "recentChanges": "Bug fix",
  "appId": "com.scratch2cash.app",
  "searchTerms": "scratch cards"
 },
 {
  "title": "BIG SCRATCH CARD PRO-SCRATCH TO EARN",
  "description": "Introducing New Scratch To Earn App. \r\nIn This App You Have To Scratch  The Canvas To Earn Money .\r\nThere Is One More Option To Earn Money By Sharing This App.\r\nYou Can Easily Earn Lots Of Money By Using This App.",
  "summary": "Introducing New Scratch To Earn App. <br>In This App You Have To Scratch &amp; Share.",
  "installs": "1,000+",
  "score": 3.75,
  "ratings": 40,
  "reviews": 36,
  "price": 0,
  "developer": "ComboX",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 28, 2020",
  "updated": 1587544654000,
  "version": "5",
  "appId": "com.bigscratchmoney.combox",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Win Reward",
  "description": "Scratch To Cash win rewards licenses you to obtain step by step pocket money with Scratch Coupons.\r\n\r\nScratch Coupons and Open Up Your Luck and Chance to Win Cash.\r\n\r\nScratch To Cash win rewards allows you to earn daily pocket money with Scratch Coupons.\r\n\r\nYou will get Daily 10 to 13 Scratch Card So you will Scratch Every 10 Coupons and get Chance to win Cash and best Rewards.\r\n\r\nyou will Also Refer Your Friends to Earn Extra Rewards in Scratch To win cash\r\n\r\nIn Scratch To Cash - Earn money Application You Have Daily Chance to Redeem best Rewards.\r\n\r\nScratch Cards Are Depends On The User's Luck. Cash In Cards Opens Randomly. In Scratch Me for Real win App You Will Get limited Scratch Cards In Whole Day.\r\n\r\nScratch ME app fo Win & play Cash Is Available In Play Store Free Of Cost So Anyone Can Download It From Play Store And Use It According To You.\r\n\r\n\"We Don't Collect Any Information Of Our User But The Ads- Network Which Are Commonly Use In Our Scratch Me App To Monetize May Fetch Your Information.\"\r\n\r\nScratch To Win Cashapp is best app free available on play store so download this app and lets enjoy. Luck by scratch is easy an application through with you can play at the same time earn some money. Now you can earn rewarded scratch card and rewarded coins.\r\n\r\nyou will Also Refer Your Friends to Earn Extra Rewards in Scratch To win cash\r\n\r\nScratch To Win Cashapp is best application free available on play store so download this application and lets welcome it. Karma by scratch is straightforward an application through with you can play at the same time increase some money. By and by you can acquire repaid scratch card and compensated coins.\r\n\r\nWe before long don't take any information from our customer yet the Ad-orchestrate which we customarily use in our applications to adjust may get your information.\r\n\r\nThis application only straightforward has been made, there is no real kind of giving or getting any portion to anyone. This application is proposed for the customer's diversion Purpose. We are not skilled to offer a portion to any customer. Right now, karma and we should appreciate\r\n\r\nThankful to you for your cognizance. Try to check our security approach a significant part of the time, since it is presented to change, and you continue with use of the site is prohibitive to your affirmation of any alterations here. You agree to the terms and conditions of this security course of action.\r\n\r\nWe personally do not take any information of our user but the Ad-network which we commonly use in our apps to monetize may fetch your information.\r\n\r\nYou will get Daily 10 to 13 Scratch Card So you will Scratch Every 10 Coupons and get Chance to win Cash and best Rewards.\r\n\r\nScratch To Cash - Earn money Now Try Your Luck and Open Your Gift.\r\n\r\nIn Scratch To Cash - Earn money Application You Have Daily Chance to Redeem best Rewards.\r\n\r\nScratch To Cash - Earn money Now Try Your Luck and Open Your Gift.\r\n\r\nScratch and Win Real Cash App Is Developed As User-Friendly. In This App You Will Get Virtual Cash And You Will Redeem Your Cash But We Did Not Take Any Guarantee Of Giving And Receiving Payment To Anyone. This App Is Totally Made For User's Entertainment.\r\nThis app only user-friendly has been developed, there is no real form of giving or receiving any payment to anyone. This app is designed for the user's entertainment Purpose. We are not capable to give payment to any user. So, best of luck and let’s enjoy\r\n\r\nThanks For Understanding Our Situation and Don't Forget To Check Our Privacy and Policy Frequently Since It Is Subjected To Change And Your Continued Use Of The Site Is Conditional To Your Acceptance Of Any Modifications Here. You Agreed To Our Terms and Conditions of This Privacy Policy. We Have Rights To Change Our Terms and Conditions At Any Time.",
  "summary": "scratch Coupons and Open Up Your Luck and Chance to Win Cash.",
  "installs": "1,000+",
  "score": 4.58,
  "ratings": 252,
  "reviews": 131,
  "price": 0,
  "developer": "GrvYdv",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Apr 13, 2020",
  "updated": 1586790642000,
  "version": "21.0",
  "appId": "scratchwin.scratchandwin.scratchcashwinscratch",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch And Win",
  "description": "In this journey, you will meet amazing characters and fun challenges.\r\n* All tickets of our lottery absolutely unique.\r\n* XP collecting system\r\n* New tickets unlocks with Level Ups\r\n* We prepare clever game mechanics in all scratch offs\r\n* Manage you balance wisely, choose your bet amount\r\n* This is pure fun and gambling, don't worry about real money, it's all virtual\r\n* You can easily request more coins by watching ads\r\n* Plenty of tickets to play\r\n\r\nNote: you operate only with virtual coins, you can't withdraw them into real money.",
  "summary": "Check your luck with the instant lottery.",
  "installs": "10,000+",
  "score": 4.02,
  "ratings": 584,
  "reviews": 214,
  "price": 0,
  "developer": "CODNES GAMES",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 23, 2016",
  "updated": 1461407815000,
  "version": "1.0.3",
  "appId": "com.codnes.saw",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Easy Scratch Game",
  "description": "It is a simple and easy money making app game. Easy Scratch Game is easy an application through with you can play at the same time earn some money  Daily earn money  Daily get 100 scratch. \r\n\r\nWe recommend before using this app please read our Privacy Policy and Terms and conditions link are given below,\r\n\r\nPrivacy Policy:- https://easyscratchgamehelp.blogspot.com/p/privacy-policy.html\r\n\r\nTerms and conditions:- https://easyscratchgamehelp.blogspot.com/p/terms-and-conditions.html\r\n\r\nif you have any question please contact us:- easyscratchgame@gmail.com\r\n\r\n\r\nApp Features:\r\n\r\n✦ Scratch\r\n✦ Scratch Cash\r\n✦ Scratch to win\r\n✦ Lucky Scratch\r\n✦ win real money\r\n✦ cash free app\r\n✦ money earning apps\r\n✦ free cash\r\n✦ Earn money , real cash\r\n✦ play and win cash\r\n✦ Daily Games Cash\r\n✦ daily cash\r\n✦ daily win money\r\nDaily earn money\r\nDaily get scratch\r\nRanking of high score users\r\nFind Reply from administrator for you.\r\nNow you can earn rewarded scratch card and rewarded coins.\r\n\r\nNEW FREE SCRATCH CARDS EVERY DAY 100\r\n\r\n\r\n\r\nNote: \r\nApp must target individuals above the age of 13+    \r\nHappy earnings!!!",
  "summary": "Easy Scratch Game app is amazing app free available on play store to download.",
  "installs": "500+",
  "score": 3.857143,
  "ratings": 7,
  "reviews": 7,
  "price": 0,
  "developer": "Support RPM",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Jul 25, 2019",
  "updated": 1585244839000,
  "version": "9.0",
  "appId": "com.support.easyscratchgame",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch-a-Lotto Scratch Card Lottery PAID",
  "description": "Scratch-a-Lotto the NEW and BEST Scratch Card Lotto game from Mobile Amusements!\r\n\r\nWith a HUGE SELECTION of Scratch Card games, UNLIMITED FREE COINS and Mega prize payouts, try to win as much cash as possible by also playing bonus prize gambling features such as Roulette, Higher or Lower Cards and Lucky Dice to accumulate virtual credit prizes.\r\n\r\nAs you progress to the locked higher priced Scratch Cards, you'll be able to win and unlock even more fantastic higher prize payouts.\r\n\r\nFeeling lucky? Welcome to Scratch-a-Lotto and attempt to win BIG!\r\n\r\nGood Luck!\r\n\r\nFeatures:\r\n\r\n* Exciting collection of new themed Scratch Cards.\r\n* Enjoy the Scratch Card experience without losing real money.\r\n* Gamble winning payouts to gain even more cash.\r\n* Win MEGA BIG!\r\n* Easy to pick up and play scratch lotto fun.",
  "summary": "Scratch-a-Lotto the NEW and BEST Scratch Card Lotto game from Mobile Amusements!",
  "installs": "1,000+",
  "score": 4.142857,
  "ratings": 7,
  "reviews": 3,
  "price": 1.19,
  "developer": "Mobile Amusements",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 20, 2017",
  "updated": 1560330680000,
  "version": "12.0",
  "recentChanges": "Latest version + 64bit Bundle.",
  "appId": "com.mobileamusements.ScratchaLottoFREE",
  "searchTerms": "scratch cards"
 },
 {
  "title": "scratch lottery-online lottery-scratch lotto-lotto",
  "description": "【Real Excited Scratchers Experience】 \r\nLots of free slot games and Scratch lottery games. Authentic vegas casino feel. lots of free lottery game coins and exciting lottery bonus. \r\nWelcome to the exciting and free scratch lottery tickerts! have ever wish you won the lottery jacket? Well it's the time! \r\nfeel the excitement as playing real scratchers. \r\nDownload and sign in scratch lottery app,free lottery game coins to collect.\r\n\r\n【Scratchers】\r\n● Caribbeankitty,classic casino slot game.\r\n● Lucky draw,free slot game to collect lottery game coins,once per chance.\r\n● Treasure Chest.interesting scratch lottery game.guess which Chest has a prize.\r\n● Jackpot 777,real casino slot game,very fascinating.\r\n● Cash,easy scratch lottery game.\r\n● Millionaire，classic casino slot game.\r\n● Christmas 777,Christmas version of slot machine,very interesting.\r\n● Lucky 5，interesting scratch lottery game.each game has 20 chances to win.\r\n● Magic Stone，surrounded by dazzling gems, looking for bonuses in gems.\r\n\r\n【Other features】\r\n● Easy to win big!\r\n● Real scratch off tickets experience! \r\n● If you win, you could BET to get DOUBLE prize! \r\n● Get reward $10 when invite friends play.\r\n● Paly more,return more.\r\nDOWNLOAD AND SPIN RIGHT NOW! DON’T MISS YOUR HUGE WINS!!!\r\nTHE BEST SLOTS & CASINO GAMES\r\nVegas at your fingertips! With incredible graphics and some of the coolest twists, our slots offer a unique experience! From nostalgic classics to modern originals, our slot games are guaranteed to provide you with loads of fun! It’s not just slots we offer, either! Check out other card games for even more chances to become a Billionaire!\r\nThis vegas casino slot games and scratch lottery app is intended for adult use - by those 18 or older – and for amusement purposes only.\r\n\r\nScratch lottery game is just for fun,alse bring you some lucky surprise.\r\nOur games are for entertainment only. All points in the game stay in the game and all game points have no cash value. Although in-game currency can be purchased for real money or won during gameplay, none of the items in the game have any cash value. Our games are intended for adult audiences only.\r\nIf you have any scratches games problem,contact us:shuangmianshen@gmail.com\r\nour app is scratch lottery tickets and scratch lottery ticket scanner games.if you like scratch lotto tickets or scratch lotto mania app.our lotto  machine give you scratch lottery tickets win real money feeling.like scratch logo quiz game,our app with scratch lotto australia .",
  "summary": "free Scratch Lottery and online scratch lottery and Scratch Lottery tickets",
  "installs": "10,000+",
  "score": 4.67,
  "ratings": 178,
  "reviews": 76,
  "price": 0,
  "IAPRange": "£4.69 - £299.99 per item",
  "developer": "Lucky Game Company",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 8, 2019",
  "updated": 1583838817000,
  "version": "4.0.0.4",
  "recentChanges": "scratch lottery: repair login bug.",
  "appId": "chance.program.liumin.scratchlottery",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Time!!",
  "description": "Lucky Time!! is a carefully designed entertainment game, free to participate in the experience of scratch cards,spin,lottery, raffle.You can get unlimited rewards.Happy every day\r\n\r\nIn Lucky Time!! you will:\r\n-Happy scratch scratch, instant rewards.\r\n-Spin game,One simple turn, continuous surprises\r\n-Raffle tickets, Win the dream harvest\r\n-Kill boring time. Play whenever you want\r\n\r\nWe believe that if one considers himself lucky then he will eventually be lucky in real life. So we delicately chose these gorgeous cards with pleasant colors and wonderful rewards to enhance your lucky feelings. You have every reason to feel rewarded and gather all the joy in our app. We wish you have a lucky day.\r\n\r\nAll you have to do is pick up your phone! If you play Lucky Now at any time, you will have unlimited joy and reward.\r\n\r\n*Google Inc. does not sponsor, nor in any way affiliated with Lucky Time!! and/or the sweepstakes prizes.\r\n*This game doesn't cost any real money.\r\n*playing the game does not mean future success in the \"real money game.\"",
  "summary": "Scratch, Spin, enjoy your lucky time!",
  "installs": "500,000+",
  "score": 4.0715632,
  "ratings": 5400,
  "reviews": 2489,
  "price": 0,
  "developer": "Lucky Now Studio",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 5, 2020",
  "updated": 1583414948000,
  "version": "1.0.5.1009",
  "recentChanges": "Optimized UI performance.",
  "appId": "com.lucky.scratch.spin.vegas",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Card Prediction",
  "description": "Scratch Card Prediction is a magic app that allows you to scratch your smartphone screen to reveal your prediction matching the spectator chosen card. A simple, powerful magic trick that anyone can learn using a smartphone or a tablet to freak out friends and family members!\r\n\r\n!!! Pro version can display any of the fifty-two playing cards.\r\n\r\nMagic trick created by Mikael Montier.\r\n/// www.magicapps.co\r\n\r\n• TV performance rights are not included with purchase.\r\n• All TV rights are reserved and available from Mikael Montier.\r\n• Please contact us at contact@magicapps.co for details.\r\n\r\n---\r\n\r\nOur magic apps have been downloaded by more than 800K users and are featured in the most famous TV shows, newspapers, magic magazines, high-tech blogs...\r\n\r\nAs seen on « Got Talent » TV Show.\r\n\r\nThe New York Times - Kit Eaton\r\n« Simple, great-looking design and adorably funny! »\r\n\r\nYahoo Tech - David Pogue\r\n« I love, love, love this trick. »\r\n« Exceptionally clever, convincing secret! »\r\n« FANTASTIC for a beginner! »\r\n« Extremely easy, wildly creative trick. »\r\n\r\nMUM Magazine (The Society of American Magicians) - Bruce Kalver\r\n« Mikael Montier churns out some real winning apps. Bravo! »\r\n\r\nGordon Ramsay - Chef, restaurateur, writer and television personality\r\n« That's crazy! »",
  "summary": "Scratch your smartphone screen to reveal the prediction!!!",
  "installs": "5,000+",
  "score": 4.31,
  "ratings": 273,
  "reviews": 93,
  "price": 5.49,
  "IAPRange": "£4.39 per item",
  "developer": "Mikael Montier",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Dec 14, 2013",
  "updated": 1562332241000,
  "version": "1.0.1",
  "appId": "com.magictrick.app",
  "searchTerms": "scratch cards"
 },
 {
  "title": "tombola arcade – Slots & Instant Win Online Games",
  "description": "Download tombola arcade now and play unique instant win games from 5p to £1\r\n\r\nDo you like instant win games, with real money prizes? Do you want to play slot machines, scratch cards and emoji games to win cash? Are you bored of traditional gambling apps? Come join us at tombola arcade and discover a new breed of casino games on your phone with stakes from as little as 5p!\r\n\r\nWe have a collection of exciting online games where you can win cash prizes and as a new player you’re eligible for our special welcome offer - Get £50 BONUS, deposit £25 & play with £75. We have no wagering requirements so any money you win is your cash to withdraw!\r\n\r\nHere at tombola arcade we wanted to change up the traditional take on casino games and instant win games by taking the traditional slot games and scratch cards and really making them our own – this is where bubble, glow, spin, scratch, flip, pick and emoji were born!\r\n\r\nCome check them out all you need is an internet connection to play the online games and be in with the chance of winning real money. Games might start at just 5p but you can win Top Prize Jackpots of up to £500.\r\n\r\nDon’t forget when you place your first deposit you’ll receive your bonus reward: If you deposit £10 we’ll give you an extra £20 bonus; or deposit £25, we’ll give you £50 bonus for free. Now you’ve got no excuse not to play online slots!\r\n\r\nWhat games are included in tombola arcade?\r\n\r\n🐉  Go 🐉\r\nVenture to the orient in go, our tantalising tiled game. You can win spot prizes, be transported to the bonus round and win Top Prizes up to £500, what are you waiting for 3-2-1 GO!\r\n\r\n🔮 Bubble: Pop bubbles to win cash prizes of up to £500 per game. \r\n\r\n🌺 Glow: Our match to win game where you can reveal cash rewards in an incredible enchanted forest or take a dive with the jellyfish. \r\n\r\n🎰 Spin: Check out our classic Las Vegas casino slot machine or go wild in our Sacred Stone theme where you can spin to win real money prizes. \r\n\r\n👌 Scratch: Play our scratch card game with Top Prize Jackpots of up to £500 in our jungle, space and treasure themes!\r\n \r\n🃏 Pick: All of the symbols are there all you need to do is choose the right ones and with a little bit of luck you’ll be on your way to winning cash prizes!\r\n \r\n😝 Emoji: Match emojis and win up to £500 per game. It’s the most exciting instant win game around and what’s better if you don’t match any we’ll give you a real money prize too! \r\n\r\nSo choose your favourite slot, scratch or instant win game and come join our community of players and chat moderators who will make your experience here at tombola arcade like no other online casino you’ve been to before. You can take full advantage of our responsible gambling features to make sure that you’re in control of your money. \r\n\r\nGet in touch with us and play responsibly\r\n\r\nThis is a real money gambling app.\r\n\r\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware 0808 8020 133 or visit https://www.begambleaware.org/\r\n\r\nN.B. tombola arcade is for adults only (18+) as it is a gambling app which uses real money to play.",
  "summary": "Download tombola arcade for free! Play the best online slots and win real money",
  "installs": "100,000+",
  "score": 4.5216837,
  "ratings": 7855,
  "reviews": 3187,
  "price": 0,
  "developer": "tombola Ltd",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Aug 1, 2017",
  "updated": 1582209756000,
  "version": "1.5.25",
  "recentChanges": "Optimisations and improvements..",
  "appId": "air.com.tombola.arcade.playstore",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch N Win",
  "description": "Playing for Gold has never been so much fun! Scratch and Win Today with Free Install\r\n\r\n***Are you ready to have the Scratch N Win time of your Life?****\r\nTake advantage of the only interactive Live Casino style scratch game of its kind here in Google Play.....Bets of all this highly addictive game is absolutely Free!!\r\nWe bring Las Vegas...Atlantic City and some of the other top casino destinations right in the palm of your phone.\r\nDon't just take our word on this!  Listen to what some of our users who have installed this free Scratch N Win Android application had to say about this\r\n\r\nThis very popular Lotto scratch-off game is catching fire..So install right away to take advantage of the many cool features and scratch cards you can win with today.\r\nScratch your way to acquiring and accumulating as many 3 pair matches as possible.  Gather those points and unlock new scratch N Win theme lotto games.  The live motion themed lottery game will have you dancing in the street.\r\n\r\nYour friends and family will simply be amazed by all of the cool features this Lotto game has to follow.\r\nOnline gambling is a dangerous habit.  We have created a safe and fin environment to scratch and win your way to hours of fun.\r\nWe only ask that after you play this super fun Scratch N Play game that you leave a positive review and pass the good word to your friends and family.\r\nThanks and enjoy!\r\n\r\nThis app is contains Advertisements",
  "summary": "Loto Scratch, Scratch and win, Loto Scratchers",
  "installs": "50,000+",
  "score": 3.58,
  "ratings": 388,
  "reviews": 103,
  "price": 0,
  "IAPRange": "£0.50 - £14.87 per item",
  "developer": "AppsEntertain",
  "genre": "Card",
  "contentRating": "PEGI 3",
  "released": "Sep 28, 2013",
  "updated": 1581402550000,
  "version": "9",
  "recentChanges": "Fix bugs and improved performance",
  "appId": "com.appsentertain.scratchnwin",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Scratch - Win Reward",
  "description": "Do you like to play scratch cards? Lucky Scratch! is an awesome free scratch card game.\r\nEach scratch card has its own price, lucky, rewards and rewards probability distribution: search the bests scratch cards to earn more coins!\r\n\r\nYou will have REAL lottery scratch card experience and tons of lucky scratch you can scratching.",
  "summary": "Do you like to play scratch cards? Lucky Scratch! is an awesome scratch card.",
  "installs": "10,000+",
  "score": 3.03,
  "ratings": 398,
  "reviews": 289,
  "price": 0,
  "developer": "Kaneria Infotech",
  "genre": "Casual",
  "contentRating": "PEGI 3",
  "released": "May 6, 2019",
  "updated": 1557486168000,
  "version": "1.1",
  "recentChanges": "Bug Fixes",
  "appId": "com.luckyscratch.winluckyreward",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch To Win Real Money : Earn Free Cash",
  "description": "XXVI Scratch To Win Cash\r\n\r\nXXVI Scratch To Win Cash game is combination of multiple activity like scratch card, spin wheel and match machine.\r\n\r\nGet ultimate fun and entertainment with XXVI Scratch To Win Cash game.\r\n\r\nTry your luck and win virtual cash as fun and entertainment, we are not collecting any personal information from any user, this game is for fun, there is no real form of receiving and giving any real payment to anyone, so enjoy it.\r\n\r\nFeature:\r\n\r\n15 Scratch Card\r\n15 Spin Wheel\r\n15 Match Machine\r\nBest UI with Sound\r\nSmall Size Game\r\nFree To Use\r\nEasy To Play\r\n\r\nThis game is user-friendly, thank you for understanding, we advised you to check our privacy policy on time to time as it is subject to change periodically.\r\n\r\nDisclaimer:\r\nWe don’t associated with any brand or company, we are not collecting any personal information in our game and not giving or receiving any kind of real payment, for any query or question please contact us via Email “mira.vashvi89@gmail.com”.",
  "summary": "XXVI Scratch to win cash game for more fun and entertainment",
  "installs": "10,000+",
  "score": 4.1,
  "ratings": 218,
  "reviews": 86,
  "price": 0,
  "developer": "XXVI Apps",
  "genre": "Arcade",
  "contentRating": "PEGI 3",
  "released": "Mar 5, 2020",
  "updated": 1589180337000,
  "version": "1.4",
  "recentChanges": "Scratch To Win Real Money : Earn Free Cash",
  "appId": "scratch.andwin.xxvi",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Luck By Win",
  "description": "Scratch Luck By Win : Simply scratch and win Points.\r\n\r\nyou will Also Refer Your Friends to Earn Extra Rewards in Scratch To win cash\r\n\r\nPlay all your favourite scratch offers without having to lose your money!\r\nScratch Luck By Win is easy to use and spin and scratch card.\r\nSpin More, Refer to friend more, Win more, Get More..\r\n\r\nWe personally do not take any information of our user but the Ad-network which we commonly use in our apps to monetize may fetch your information.\r\n\r\nNotes :-\r\nThis app only user-friendly has been developed, there is no real form of giving or receiving any payment to anyone. This app is designed for the user's entertainment Purpose. We are not capable to give payment to any user. So, best of luck and let’s enjoy\r\nWe doesn't Collect Any user Personal Information In Our Application.\r\nWe doesn't Associated with any Company and Brand etc\r\n\r\nDownload & Play",
  "summary": "Scratch Luck By Win to play and earn.",
  "installs": "50,000+",
  "score": 4.380342,
  "ratings": 2469,
  "reviews": 1719,
  "price": 0,
  "developer": "Viral Downloader",
  "genre": "Photography",
  "contentRating": "PEGI 3",
  "released": "Mar 18, 2020",
  "updated": 1584552586000,
  "version": "1.0",
  "appId": "vijaybhav.khelega.scratchluckbywin",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Daily Scratch - Win Reward for Free",
  "description": "Take some spare time, try your luck:\r\n\r\n1- 100% Reward Daily Free Scratch Card\r\n2- Lucky wheel fulfills your winning expectations\r\n3- Guess which cards can win big rewards.\r\n4- Accumulate your Tonken as much as possible\r\n\r\nPlay games and win rewards here. download now! enjoy your winning moment.",
  "summary": "Daily Scratch,win money for FREE! you can play anytime, anywhere",
  "installs": "100,000+",
  "score": 4.490835,
  "ratings": 6110,
  "reviews": 2664,
  "price": 0,
  "developer": "Black Geranium Studios",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Apr 3, 2020",
  "updated": 1588951953000,
  "version": "Varies with device",
  "recentChanges": "Fixed some bugs",
  "appId": "com.daily.scratch.game",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Sir Scratch A Lot",
  "description": "Sir Scratch A Lot\r\n\r\nPlay FREE scratch cards every day\r\n\r\n** WIN **\r\nMatch 3 winning symbols on our instant win scratch cards to win big.\r\n\r\nLike and Follow us on Social Media for even more exciting winning opportunities and the latest updates from the team:\r\n\r\n👍 Facebook: https://www.facebook.com/SirScratchalotgame/\r\n\r\nWe love to hear from you! Drop us an email. \r\n\r\nSir Scratch A Lot does not endorse or promote gambling. Scratch Day scratch cards are intended solely for entertainment purposes. \r\n\r\n\r\nSir Scratch A Lot does not require any details from its players.",
  "summary": "Sir Scratch A Lot<br><br>Play FREE scratch cards every day",
  "installs": "500+",
  "score": 4.4,
  "ratings": 5,
  "reviews": 2,
  "price": 0,
  "IAPRange": "£0.99 - £5.99 per item",
  "developer": "Sellsoft Games",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Apr 26, 2019",
  "updated": 1556317949000,
  "version": "1.0",
  "recentChanges": "Scratch cards",
  "appId": "com.sellsoftgames.sirscratchalot",
  "searchTerms": "scratch cards"
 },
 {
  "title": "The National Lottery - Lotto, EuroMillions & more",
  "description": "The Official National Lottery app is where you can play: \r\n\r\nLotto\r\n•\tThe one. The only. The original National Lottery game.\r\n•\tIt’s the nation’s game, with thousands winning prizes in every draw.\r\n•\tLotto tickets cost £2 per play, with draws every Wednesday and Saturday.\r\n\r\nEuroMillions\r\n•\tThere’s big and then there’s EuroMillions big!\r\n•\tThis is the game with out of this world jackpots, creating new millionaires every week.\r\n•\tEuroMillions tickets cost £2.50 per play, with draws every Tuesday and Friday.\r\n\r\nSet For Life\r\n•\tDig out your bucket list! You could win £10,000 every month for 30 years* with Set For Life.\r\n•\tPay just £1.50 per line and play up to 4 weeks in advance.\r\n•\tDraw days every Monday and Thursday.\r\n\r\nThunderball \r\n•\t£1 might make your night. Win £500,000* for just £1!\r\n•\tDraws every Tuesday, Wednesday, Friday and Saturday.\r\n\r\nOr play an Instant Win Game\r\n•\tIn just a few taps, you could win anything from a few pounds to a life-changing million.\r\n•\tWith prizes that never run out, there’s an Instant Win Game for everyone!\r\n•\tGames cost from £1 to £5 to play.\r\n\r\nLotto HotPicks & EuroMillions HotPicks\r\n•\tBigger prizes for fewer numbers\r\n•\tPick and match winning balls from the main draws or choose a Lucky Dip® for randomly selected numbers. \r\n\r\nAnd don't forget, every time you play a National Lottery game you help support Good Causes all over the UK. In fact, £30M is raised on average each week**.\r\n\r\nBesides playing, managing how you do so has never been easier:\r\n\r\n•\tEnable Fingerprint Recognition and sign-in to your account instantly.\r\n•\tSave your lucky numbers and enter draws at the tap of a button.\r\n•\tIn a rush? Scan your paper tickets in seconds to see if you’re a winner.\r\n•\tLink your bank account details to add and withdraw funds at any time.\r\n•\tSet limits to manage fund levels and how many games you can play per day.\r\n\r\nDownload now and play The National Lottery from the palm of your hand.\r\n\r\nTo improve the app experience, we collect anonymous information about browsing behaviour. More information is available in our Privacy Policy at https://www.national-lottery.co.uk/privacy-policy\r\n \r\nIf you have a suggestion, a bug to report or a new feature for us to consider, we want to know! Email app@camelotgroup.co.uk.\r\n\r\nPlease note whilst available for download for tablet, the app is best used on mobile devices.\r\n \r\nPlayers must be 18 or over to download this app. App Ts&Cs apply.\r\n \r\n*Prizes are fixed, subject to capping.\r\n**Around £30 million raised weekly is an average based on April 2018 - October 2019.\r\n \r\n \r\nIf you're worried about yourself, or someone you know, speak in confidence to the people at GamCare on 0808 8020 133 or visit www.gamcare.org.uk. You can find out more about our approach to responsible play on the Responsible Play page, found in the app menu.",
  "summary": "Feeling lucky? Play your favourite games and check the latest lottery results",
  "installs": "1,000,000+",
  "score": 3.8320754,
  "ratings": 10660,
  "reviews": 4836,
  "price": 0,
  "developer": "Camelot UK Lotteries Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests",
  "released": "Oct 12, 2017",
  "updated": 1587043748000,
  "version": "7.3.0",
  "recentChanges": "- Play the games you love with The National Lottery app! 🤞<br>- To improve your National Lottery experience, we have given our Transaction History in My Account a refresh.<br>- There are now exclusive games that are only available on our app. Come and give them a try! <br>- We have integrated with GAMSTOP. If you&#39;ve registered for the national gambling self-exclusion scheme, you will no longer be able to play Instant Win Games on the app.",
  "appId": "uk.co.theofficialnationallotteryapp.android.play",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Card",
  "description": "Guess the correct answer from 12 letters and 1 picture which is under scratched area.\r\nDo not forget, the less you scratch the picture, the more points you get.\r\nIf you guess the correct answer without scratch, you earn 30 points and 1 starcoin.\r\nYou can use your starcoins and points for hint.",
  "summary": "1 Pic &amp; 12 Letters. Unique puzzle game. Scratch, Guess and Win.",
  "installs": "1,000+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "IAPRange": "£0.89 - £13.99 per item",
  "developer": "RandomAction",
  "genre": "Puzzle",
  "familyGenre": "Brain Games",
  "familyGenreId": "FAMILY_BRAINGAMES",
  "contentRating": "PEGI 3",
  "released": "Jul 27, 2016",
  "updated": 1560292097000,
  "version": "1.1.1",
  "appId": "com.randomaction.scratchwin",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Spin Day - Win Real Money",
  "description": "Play FREE spins everyday - Spin Day is a 100% risk-free App! \r\n\r\nSpin Day offers free slots for a chance to win real money prizes! Daily opportunities of winning jackpots up to $500 in cash! \r\n\r\nSpin Day is a free to play experience on your mobile devices.\r\n\r\nJust Spin for the chance to Win!\r\n\r\nSpin Day is 100% free to download and play with no purchases or deposits necessary.\r\n\r\nDownload Spin Day and try your luck today!\r\n\r\nSpin Day Features:\r\n\r\n★ WIN REAL MONEY ★\r\n\r\n- Chance to win BIG jackpot prizes of up to $500 by spinning everyday! \r\n- Match 3 Jackpot symbols to win!\r\n\r\n★ EARN REWARDS ★\r\n\r\n- Earn Tokens as you play!\r\n- Exchange your tokens and cash out for money!\r\n\r\n★ PLAY AND SPIN DAILY ★\r\n\r\n- Maximise your chances of winning by playing everyday!\r\n- Hundreds of spins available everyday!\r\n- Get new spins 3 times a day!\r\n- New spins daily at 8 am GMT, 2 pm GMT and 8 pm GMT\r\n\r\n★ Don't forget to follow us on social media for more chances to win with Spin Day! ★\r\n\r\nFacebook\r\n\r\nhttps://www.facebook.com/Spin-Day-431473780935839/\r\n\r\nInstagram\r\n\r\nhttps://www.instagram.com/spindayapp/\r\n\r\n\r\nSpin Day does not endorse or promote gambling. Spin Day slots are intended solely for entertainment purposes.\r\n\r\n\r\nSpin Day does not require any details from its players to play.\r\n\r\n\r\n*Google is not a sponsor nor is it involved in any way with this app, nor do they endorse this service or sponsor us.\r\n\r\n\r\n*Spin Day is a free mobile app that allows users to win with no purchase necessary.\r\n\r\n\r\nSpin Day is operated by Viker Limited, registered at: 200 Union St, London, SE1 0LX, a company incorporated under English law (company number: 06290437) whose registered office is at 200 Union Street, London, United Kingdom, SE1 0LX (hereafter “Viker”).\r\n\r\n\r\nSee our website at www.viker.co.uk for further information about us.\r\n\r\n\r\n© Viker Limited. All rights reserved.",
  "summary": "Win real money by spinning your free slots everyday on Spin Day!",
  "installs": "1,000,000+",
  "score": 4.1814504,
  "ratings": 74840,
  "reviews": 26904,
  "price": 0,
  "developer": "Viker",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 21, 2019",
  "updated": 1588688118000,
  "version": "2.12.0",
  "recentChanges": "Easter is here! Update now to join our Easter bunnies on an egg hunt!",
  "appId": "com.viker.spinday",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch for Cash",
  "description": "SCRATCH FOR CASH AND WIN REWARDS YOU GET DAILY BASES SCRATCH CARDS AND DAILY REWARDS. FIRST YOU COLLECT THE POINTS AND REDEEM IT AND REWARDS\r\nTHIS APP ONLY WORK IN ONLINE AND WORK HERE AND ENJOY. IT IS A SIMPLE TO USE ANYONE CAN USE EASILY.",
  "summary": "SCRATCH AND WIN REWARD AND MORE.DAILY GET SCRATCH CARDS.",
  "installs": "1,000+",
  "score": 3.7894738,
  "ratings": 19,
  "reviews": 15,
  "price": 0,
  "developer": "Facechat.in",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Oct 26, 2019",
  "updated": 1572150535000,
  "version": "1.0",
  "recentChanges": "best scratch card app for rewards.",
  "appId": "com.scretch.scratchcas",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Money Map -- Free Scratch Games & Huge Prizes!",
  "description": "Play free games to win real prizes daily -- gift cards, cash and more!\r\n\r\nTypes of games:\r\n\r\nScratch and Win\r\nSpin to Win\r\nBingo\r\nSweepstakes\r\nTrivia\r\n& more...\r\n\r\nPlease refer to the Terms of Service (http://thechickendinnerapp.com/terms-of-service) and Privacy Policy (http://thechickendinnerapp.com/privacy) for details on the rules and regulations of each game.",
  "summary": "Play free games to win real prizes!",
  "installs": "5,000+",
  "score": 4.2941175,
  "ratings": 34,
  "reviews": 29,
  "price": 0,
  "developer": "Money Map Industries",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 10, 2019",
  "updated": 1570143409000,
  "version": "1.2.2",
  "recentChanges": "New games and ways to make money.  Critical bug fix. Thanks for using the app. Enjoy!",
  "appId": "com.moneymap.app",
  "searchTerms": "scratch cards"
 },
 {
  "title": "SCRATCH plus -Win Prizes-",
  "description": "Attentions! You are given an exclusive opportunity to enjoy the special    Scratch In this app, we offer you new & fancy scratch cards games with brand-new interfaces. \r\n\r\nSCRATCHplus is especially amazing, because it doesn’t need real money to play! You can have daily free tickets to play all scratch cards. By playing scratch cards, you can earn coins for big prizes!\r\n\r\nWhat’s the game?\r\n\r\n- Rush for as much gold as you can, and be a millionaire! \r\n\r\nAnd more for you...\r\n\r\nAll cards are carefully designed with playful themes, download and check it out NOW! \r\n\r\n* This game is not affiliated by any other companies.\r\n* This game does not need real money in.\r\n* Playing this game does not imply future success at “Real Money Gambling”.\r\n* \" SCRATCHplus - Win Prizes\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Win Prizes &amp; Redeem Rewards",
  "installs": "10,000+",
  "score": 3.9545455,
  "ratings": 22,
  "reviews": 10,
  "price": 0,
  "developer": "maasama",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Mar 4, 2018",
  "updated": 1539520129000,
  "version": "1.01",
  "recentChanges": "fix",
  "appId": "com.maasama.scrachtate",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch And Win",
  "description": "Scratch and win Real Cash Payouts\r\n\r\n*Professional Theme\r\n*Scratch Card\r\n*Win and redeem balance in your account\r\n*Free To use\r\n*50 Scratch Card Per Day\r\n*Easy to use",
  "summary": "Scratch Cards And Win Cash Prizes",
  "installs": "500+",
  "score": 4.6,
  "ratings": 20,
  "reviews": 14,
  "price": 0,
  "developer": "GAURAV SAINI",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Apr 13, 2020",
  "updated": 1588147478000,
  "version": "1.5",
  "recentChanges": "new",
  "appId": "com.scratch.gaurav",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch",
  "description": "The official Scratch app for Chrome and Android tablets!\r\n\r\nScratch is used by millions of kids around the world both in and outside of school. With Scratch, you can code your own interactive stories, games, and animations, then share with your friends, classroom, or a global community of creators. \r\n\r\nCreate anything with Scratch! \r\nChoose from a library of characters and backdrops or create your own\r\nChoose from a library of sounds or record your own\r\nConnect to and code physical devices in the world like micro:bit, Makey Makey, LEGO MINDSTORMS, your computer’s webcam, and more\r\n\r\nWORK OFFLINE\r\nCreate and save projects without an internet connection \r\n\r\nSHARE\r\nEasily export and share projects with friends and family\r\nCreate an account and share to the global Scratch Community of creators\r\n\r\nTUTORIALS\r\nhttp://scratch.mit.edu/ideas \r\nGet started or go further with new tutorials. \r\n\r\nEDUCATOR RESOURCES:\r\nhttp://scratch.mit.edu/educators \r\nGet started with Scratch in your classroom with dozens of free resources for educators\r\n\r\nFAQ\r\nhttps://scratch.mit.edu/download",
  "summary": "Code stories, games, and animations – share with others around the world.",
  "installs": "50,000+",
  "score": 3.99,
  "ratings": 586,
  "reviews": 355,
  "price": 0,
  "developer": "Scratch Foundation",
  "genre": "Education",
  "familyGenre": "Creativity",
  "familyGenreId": "FAMILY_CREATE",
  "contentRating": "PEGI 3",
  "released": "Nov 12, 2019",
  "updated": 1588677930000,
  "version": "3.0.46",
  "recentChanges": "Minor bug fixes and performance improvements",
  "appId": "org.scratch",
  "searchTerms": "scratch cards"
 },
 {
  "title": "scratch Card & Win money",
  "description": "Scratch Win gift App free available on play store you download this application and lets enjoy.this application very simple for use.\r\n\r\nwe do not take any information of user but the ad network which we commonly use in application to monetize may fetch your information\r\n\r\nThis app only user-friendly has been developed, there is no real form of giving or receiving any payment to anyone. This app is designed for the user's entertainment Purpose. We are not capable to give payment to any user. So, best of luck and let’s enjoy\r\n\r\n\r\n\r\nScratch To Cash - Earn money Now Try Your Luck and Open Your Gift.\r\n\r\nNOTE: in this game you cannot win real money!",
  "summary": "Useing this app get real cash in this application use your best luck",
  "installs": "1,000+",
  "score": 3.35,
  "ratings": 20,
  "reviews": 9,
  "price": 0,
  "developer": "Ruchit Nathani",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Feb 23, 2020",
  "updated": 1582868062000,
  "version": "1.2",
  "appId": "com.earnscratchcardapp.scratchcardtoearnmoney",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Play To Win: Win Real Money in Cash Sweepstakes",
  "description": "Play To Win offers fun, free sweepstakes – and so much more! Enter sweepstakes from Play To Win for your chance to win real cash prizes daily, no purchase required.\r\n\r\nWith the launch of Play To Win, we are offering a HUGE bonus… 100% FREE cash sweepstakes for real money prizes! All Sweepstakes are free to enter and chosen at random.\r\n\r\nNEW: Casino Game Clubs\r\nBonus rewards for top players! Play casino games to become a member of our High Limit Club and High Roller Club to unlock even BIGGER bonuses!  Become a VIP Club member to automatically MULTIPLY your daily, hourly and level-up bonuses!\r\n\r\nNEW: Piggy Bank Coin Bonuses\r\nSpin slot machine reels to fill up your piggy bank.  Earn HUGE coin bonuses when your piggy bank is full!\r\n\r\nLucky sweepstakes winners can win real cash in Daily, Holiday and Gigantic Giveaway drawings! Sweepstakes for money are free to enter and open to all!\r\n\r\nPlay To Win also has fun games you can enjoy! Free casino games include 30 slot machines to play for fun, with more to come. Plus: bonus mini-games! More games are on the way, so you can come back to play video poker, bingo and more!\r\n\r\nDecorate your virtual dream house with Play To Win’s Design Home! Room design game lovers can enjoy customizing and decorating rooms with fun themes and furniture. Your virtual house will look amazing when you’re done decorating, plus you can earn free coins from your decorations!\r\n\r\nDownload Play To Win today and find all the great ways to win!\r\n\r\nPLAY TO WIN FEATURES\r\n\r\nCASH SWEEPSTAKES\r\n- Win real money in our giveaways\r\n- Sweepstakes are free to enter\r\n- Get lucky and earn real cash!\r\n\r\n--\r\n\r\nDECORATION GAMES\r\n- Dream home design – decorate rooms to your heart’s content\r\n- Room design games with virtual furniture\r\n- Decorate your virtual room\r\n- Earn coins from all the decorations you display!\r\n\r\n--\r\n\r\nFREE CASINO GAMES\r\n- Free slot machine games\r\n- 30+ slot machines for you to enjoy\r\n- Casino games with a fun, Las Vegas feel\r\n- Win cool bonus prizes\r\n\r\n--\r\n\r\nGet Play To Win and enjoy tons of great sweepstakes today!\r\n\r\n--\r\n\r\nSuccess within this game does not imply future success with real money gambling\r\n\r\nThis game does not offer real money gambling or any opportunities to win real money or prizes from gambling activities\r\n\r\nThese sweepstakes are devised as non-gambling promotions and are intended solely for entertainment purposes.\r\n\r\nGoogle Inc. does not sponsor, nor is any way affiliated with Play To Win and/or the sweepstakes prizes.\r\n\r\nPlay To Win is a free mobile gaming app that allows users to win money and prizes, no purchase is necessary.\r\n\r\nThis game is intended for an adult audience",
  "summary": "Play Casino Games, Fun Slot Machines &amp; Much More! New Mini Games Added Often!",
  "installs": "100,000+",
  "score": 4.3450704,
  "ratings": 2925,
  "reviews": 963,
  "price": 0,
  "IAPRange": "£2.89 - £95.99 per item",
  "developer": "Play To Win Games",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Dec 9, 2019",
  "updated": 1589216738000,
  "version": "1.2.3",
  "recentChanges": "Play To Win Casino offers fun, free sweepstakes – and more! Enter sweepstakes from Play To Win for your chance to win real cash prizes daily. No purchase required, and winners are chosen at random.<br><br>Lucky sweepstakes winners can win real cash in our $50 Daily, $500 Holiday, and $10,000 GIANT GIVEAWAYS! Sweepstakes for money are free to enter and open to all!<br><br>Play To Win also has fun games you can enjoy! Free casino games include 30 slot machines to play for fun, with more to come.",
  "appId": "net.playtowingames.casino",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Airtime Loadup - Airtime loader & scanner",
  "description": "An airtime loader app(scratch card scanner) to scan airtime voucher(scratch card), share airtime  & recharge  your mobile credit using the phones camera.\r\n\r\nThis scratch card scanner app makes things easy you don't have to type anything. \r\n\r\nairtime loadup makes it easy to save your airtime pin codes for future use no need to keep airtime voucher (scratch cards) in your wallet.\r\n\r\nSave your favorite USSD(codes eg *131#) and run them with just a click saving you feature typing.\r\n\r\nshare airtime  with friends made easy. via social media, message,email etc and the shared pin code automatically loads when clicked no need to dial.  \r\n \r\nairtime loadup features thousands of free HD images that you can set as wallpapers in a single click. feel free to download the images for your desired use.",
  "summary": "Airtime loading app for all countries &amp; networks using a phone&#39;s camera",
  "installs": "1,000,000+",
  "score": 4.4991736,
  "ratings": 6181,
  "reviews": 3375,
  "price": 0,
  "developer": "IwatSolutions",
  "genre": "Productivity",
  "contentRating": "PEGI 3",
  "released": "Apr 23, 2017",
  "updated": 1521691523000,
  "version": "2.0.0",
  "recentChanges": "Now supports receipts and all scratch cards.<br>Now supports your network.<br>Fixed bugs (settings crashing).<br>Full screen scanning is back...<br>Added default codes  for most networks.",
  "appId": "com.iwatsolutions.loadup",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Spin To Win Real Money - Earn Free Cash",
  "description": "Spin wheel, scratch card and match machine games combination will gives you more and more pleasure when you tired and want to try your luck to collect coins as per your luck.\r\nYou will get 10 spins on spin wheel, 10 spins on match machine and 10 scratch coupon on scratch card.\r\n\r\nWe personally not collecting any information from our visitors and users but it may used by third party Ads-network provider.\r\n\r\nThis game is user friendly and made for fun only, there is no real form of receiving or giving any kind of payment to anyone, this game provide you real fun daily.\r\n\r\nDisclaimer:\r\n\r\nWe do not collect or store any personal information from our users, we are not associated with any brand and company, we are not supporting any kind of payment, if you have any issue or problem please contact us without hesitation.",
  "summary": "Try Your Luck With Spin To Win Cash Game",
  "installs": "10,000+",
  "score": 3.942857,
  "ratings": 35,
  "reviews": 14,
  "price": 0,
  "developer": "HighTech UniverseApp",
  "genre": "Arcade",
  "contentRating": "PEGI 3",
  "released": "Feb 13, 2020",
  "updated": 1583518897000,
  "version": "1.4",
  "recentChanges": "Bug Fixed.",
  "appId": "spin.towin.coin",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Card Scan -Best apps",
  "description": "Card Scan application supports load scratch card and checking account quickly with the camera phone on android phones, Card scanning is considered the best apps for android with card recognition feature code from the image from scratch cards offering complete submission syntax extremely convenient when you need to load the card. Normally when you have to execute the command submission * 199 * or * 100 * card code # and press the call key new load, so also take some time for the implementation of critical load and can tag you press the wrong but scan using your card completely resolve it, when you need to submit card scanning application will perform less than 2 seconds and fully paid, the accuracy, the app has a special algorithm to scan 100% accurate when absolute. In addition the app supports checking account is extremely convenient, you just swipe from left to right is currently checking account framework prepaid and postpaid ease, in addition also has the function scan card after paying then check the account screen will automatically switch to the user and check just one tap. Not only that charges for prepaid postpaid subscribers still pay and checking accounts as prepaid installed by going to edit and manipulate the command syntax.\r\n Card not only helps users scan fast, but also pay for the elderly supporter filed easy, you just download the app and only one time that they can fully recharge yourself ....\r\n Advantage:\r\n- Load Quick scratch card\r\n- Support for elderly easily pay for not reading the card code by eye\r\n- Check account quickly\r\n- Share code card to others\r\n- Load and checking accounts prepaid, postpaid, payment networks are the latest in the world by changing the payment operations in the settings.\r\nDisadvantages:\r\n- Government must scratched silver grade side code for all otherwise the algorithm will not recognize\r\nCurrently supported scanners card scan the code card from 12 to 19 card code number, the default when you install the default application to read 12 13 14 number (over 14 cards to choose numbers if this does not appear shall be), if the card code length of more than 14, you need to install the enhanced increase accuracy when scanning and select the appropriate card code length: 14 card 14 you select, you choose the card 16 16 finished logged. For the network card viettel 13-digit code, if you only use the sim viettel should choose 13 numbers mode in the settings, the accuracy will increase to 100%. Currently applications are considered loaded scratch card or the latest applications for android 2016.\r\nP / S recommends: To scan standard and the most accurate you must install the \"increase scanning accuracy just how many of scratch card?\" On the scratch card viettel 13, you select 13, for scratch card vinaphone 14 then you should choose 14 numbers and other similar networks. If the scratch card blurry, fuzzy numbers, small dots in the lack of light, it will be difficult to scan algorithm, so you should check it to scan the card with the camera is the fastest scratch. Card Scan not only supports network load Vietnam but also all over the world network settings by going to edit manipulate recharge ...\r\nAlso you can increase scan speed by choosing advanced intelligent character recognition: You select the \"i\" will show the number \"1\", \"u\" to \"0\", the reading speed will increase so good including but must also be aware that if this recognition enabled applications quickly scratch card recharge card scan can have little flaws confusion.\r\nCard Scan If you feel as cavalier or free android then rated 5 * + share offline.",
  "summary": "Best app - Bringing up the camera scanned scratch cards, pay phones fast",
  "installs": "100,000+",
  "score": 3.9377594,
  "ratings": 2426,
  "reviews": 1101,
  "price": 0,
  "developer": "TRUSTCOM",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Aug 6, 2016",
  "updated": 1507861020000,
  "version": "4.4",
  "recentChanges": "- Fixed bugs",
  "appId": "com.microblink.ocr",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Zillionaire - Become  a rich Billionaire !",
  "description": "The most awesome free scratch card game.\r\n\r\n🍀Bring your Lucky🍀\r\nWant to know how lucky you are?\r\nYou can play game to gain free scratch cards,It's easy to win $50 just move your finger.Accumulate enough token to win $1,000,000!\r\n\r\n👯Become zillionaire👯\r\nMillionaire or Billionaire？No!you will become zillionaire.\r\n*Gifs cards and surprise rewards.\r\n*Free daily scratch cards!\r\n*kinds of slot games.\r\n\r\nTips:\r\n*This game is only for adult to recreation.\r\n* Lucky  Zillionaire does not need real money in.\r\n*Be a winner at casino gambling won't guarantee success at real money gambling and reward real prizes.",
  "summary": "Lucky Zillionaire",
  "installs": "1,000+",
  "score": 4.2941175,
  "ratings": 34,
  "reviews": 14,
  "price": 0,
  "developer": "The Oasis",
  "genre": "Simulation",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 15, 2019",
  "updated": 1548574086000,
  "version": "1.08",
  "recentChanges": "- Fixed facebook login bug.",
  "appId": "happy.day.time.winnner.money.luckyzillionaire",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch to win cash : Gift",
  "description": "Scratch To Win Cash\r\nScratch Coupons and Open Up Your Luck and Chance to Win Cash.\r\nScratch To Cash win rewards allows you to earn daily pocket money with Scratch Coupons.\r\nYou will get Daily 10 to 13 Scratch Card So you will Scratch Every 10 Coupons and get Chance to win Cash and best Rewards.\r\nScratch To Cash - Earn money Now Try Your Luck and Open Your Gift.\r\nIn Scratch To Cash - Earn money Application You Have Daily Chance to Redeem best Rewards.\r\n\r\nyou will Also Refer Your Friends to Earn Extra Rewards in Scratch To win cash\r\n\r\nScratch To Win Cashapp is best app free available on play store so download this app and lets enjoy. Luck by scratch is easy an application through with you can play at the same time earn some money. Now you can earn rewarded scratch card and rewarded coins.\r\n\r\nWe personally do not take any information of our user but the Ad-network which we commonly use in our apps to monetize may fetch your information.\r\n\r\nThis app only user-friendly has been developed, there is no real form of giving or receiving any payment to anyone. This app is designed for the user's entertainment Purpose. We are not capable to give payment to any user. So, best of luck and let’s enjoy\r\n\r\nWe Used:-\r\n\r\nFirebase For Getting Your Mobile Number, Your Points And Your Email For Contact You If We Facing Any Problem In Redeem.\r\nOne Signal For Giving You Notification Related With Our App Features And Offers.\r\nNetwork For Detect Your Internet Connection And Simple Components.\r\n\r\nDeclaration :-\r\nWe doesn't Collect Any user Personal Information In Our Application.\r\nWe doesn't Associated with any Company and Brand etc.\r\nIf you have any issues and problems please contact us on marutiappsolution@gmail.com",
  "summary": "&quot;Win more and more money &amp; Gifts with scratch&quot;. scratch useful app for you.",
  "installs": "1,000+",
  "score": 3.6666667,
  "ratings": 9,
  "reviews": 6,
  "price": 0,
  "developer": "Maruti App Solution",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 19, 2020",
  "updated": 1584632851000,
  "version": "1.0",
  "appId": "com.marutiappsolution.scaratchtowingift",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Candy Money - Feel Sweet & Win Big Prize",
  "description": "It’s time to treat yourself with some candies! \r\nCandy Money is here to offer you a wonderful joy of scratch gaming!\r\nYou can scratch cards and easily win big prize without any cost!\r\nCandy Money is designed with delicate sweeties themes, free to participate in the experience of scratch cards,spin and raffle.You can get unlimited happiness and win big prize everyday.\r\n\r\nWhat We Offer:\r\n- What’s the Candy Money? Scratch out all your sweet candies, and match to the lucky one!\r\n- Invite friend to get more free tokens as reward.\r\n- You are in the sweet candy city! Find the right candies and win tons of rewards!\r\n\r\nCan’t wait for this sweet adventure? \r\nJust Download and Join Us Now!\r\n\r\nNOTICE：\r\n** This game does not need real money in.\r\n** Playing this game does not imply future success in “Real Money Gambling”.\r\n** Google Inc. does not sponsor, nor in any way affiliated with Candy Money and/or the sweepstakes prizes.",
  "summary": "Honey, Let&#39;s scratch cards to find candy out!",
  "installs": "100,000+",
  "score": 3.8989425,
  "ratings": 8524,
  "reviews": 2593,
  "price": 0,
  "developer": "Candy Money Team",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 27, 2020",
  "updated": 1587517659000,
  "version": "2.0",
  "recentChanges": "Thank you for playing Candy Money, let&#39;s scratch cards to find candy out!<br>- Optimize Experience<br>- Bug Fixed<br>-My Bounty function",
  "appId": "com.candymoneyteam.candymoney",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Daily",
  "description": "Lucky Daily offers FREE scratcher, lotto, and raffle games with daily opportunities to win. Simply by scratching, entering raffles or picking up your lucky number, you have daily opportunities to earn rewards and have a lot of fun! Be Lucky~\r\n\r\nLucky Daily Features: \r\n\r\nSCRATCHER\r\n✔ Win by matching 3 winning symbols on the instant win scratch cards!\r\n✔ New scratch cards are available every two hours\r\n✔ Bonus scratch cards are available after you run out daily ones\r\n\r\n\r\nLOTTO\r\n✔ Enter 6 numbers daily and win lotto rewards with any number match\r\n✔ Win the jackpot prize with all numbers match!\r\n✔ Enter the daily lotto and reveal the results at 7 pm PT for your chance to win! \r\n\r\nRAFFLE\r\n✔ Enter cool raffle giveaways to win HUGE prizes! \r\n✔ Hourly raffle, daily raffle, weekly raffle, monthly raffle offered\r\n✔ Play Lucky Daily for 5 minutes a day to test your luck and get lucky. \r\n\r\n\r\nCOMING SOON \r\n✔ Free spin, free class slot is coming soon\r\n\r\nLucky Daily is becoming a lifestyle on mobile devices. We have 10,000 new winners every month and more & more players are joining us \r\nDownload Lucky Daily and double your good luck now!\r\n\r\n* This game does not cost any real money, 100% free to play and win.\r\n* Playing this game does not imply future success in “Real Money Gambling”.\r\n* Google Inc. does not sponsor, nor in any way affiliated with Lucky Daily and/or the sweepstakes prizes.\r\n\r\nIf you have any questions, complaints, requests or comments, please contact us at: zq13012959@gmail.com",
  "summary": "Lucky Daily offers FREE scratcher, lotto, and raffle with daily oppor  to win.",
  "installs": "10,000+",
  "score": 4.36,
  "ratings": 292,
  "reviews": 87,
  "price": 0,
  "developer": "Lucky Daily Team",
  "genre": "Casual",
  "contentRating": "PEGI 3",
  "released": "Mar 12, 2020",
  "updated": 1584849333000,
  "version": "1.0.2",
  "recentChanges": "SCRATCHER<br> Win by matching 3 winning symbols on the instant win scratch cards!<br> New scratch cards are available every two hours<br> Bonus scratch cards are available after you run out daily ones<br>LOTTO<br> Enter 6 numbers daily and win lotto rewards with any number match<br> Win the jackpot prize with all numbers match!<br>RAFFLE<br> Enter cool raffle giveaways to win HUGE prizes! <br> Hourly raffle, daily raffle, weekly raffle, monthly raffle offered",
  "appId": "com.free.money.lucky.win",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch With Kiran",
  "description": "Scratch and Win Real Cash\" App Is Designed For User's Entertainment Purpose. Users Can Get Some Some Virtual Cash In This App Only By Scratching Some Cards.\r\n\r\nScratch Cards Are Depends On The User's Luck. Cash In Cards Opens Randomly. In Scratch and Win Real Cash App You Will Get Unlimited Scratch Cards In Whole Days But We Can Be Set Limit Of Scratch Cards in Future. Users Can Be Get More Points As A Gift If User Will Refer Your Friend or Someone.\r\n\r\nScratch and Win Real Cash Is Available In Play Store Free Of Cost So Anyone Can Download It From Play Store And Use It According To You.\r\n\r\n\"We Don't Collect Any Information Of Our User But The Ads- Network Which Are Commonly Use In Our Scratch and Win Real Cash App To Monetize May Fetch Your Information.\"\r\n\r\nScratch and Win Real Cash App Is Developed As User-Friendly. In This App You Will Get Virtual Cash And You Will Redeem Your Cash But We Did Not Take Any Guarantee Of Giving And Receiving Payment To Anyone. This App Is Totally Made For User's Entertainment. We Have Two Partner And We Both Are Not Capable To Provide Payments To Any User. So Best Of Luck And Enjoy Scratching.\r\n\r\nThanks For Understanding Our Situation and Don't Forget To Check Our Privacy and Policy Frequently Since It Is Subjected To Change And Your Continued Use Of The Site Is Conditional To Your Acceptance Of Any Modifications Here. You Agreed To Our Terms and Conditions of This Privacy Policy. We Have Rights To Change Our Terms and Conditions At Any Time.\r\n\r\nWe Used:-\r\n\r\nFirebase For Getting Your Mobile Number, Your Points And Your Email For Contact You If We Facing Any Problem In Redeem.\r\nOne Signal For Giving You Notification Related With Our App Features And Offers.\r\nNetwork For Detect Your Internet Connection And Simple Components.\r\n\r\nWe Declared:-\r\n\r\nWe Does Not Collect Any User's Personal Information In Our Scratch and Win Real Cash App.We Does Not Associated With Any Company And Brand Etc.If You Have Any Problem With Our App Then Feel",
  "summary": "Scratch With Kiran And Scratch The Cards Win",
  "installs": "1,000+",
  "score": 4.06,
  "ratings": 124,
  "reviews": 50,
  "price": 0,
  "developer": "priya  team",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 13, 2020",
  "updated": 1584092597000,
  "version": "1.0",
  "appId": "com.scratchwithkiran",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch to Win",
  "description": "Scratch to win app get more fun and entertainment\r\n\r\nUsing this application get real cash in this application use your best luck. \r\n\r\nScratch To Win \r\nScratch Coupons and Open Up Your Luck and Chance to Win Cash.\r\nScratch To win rewards allows you to earn daily pocket money with Scratch Coupons.\r\nYou will get Daily 10 to 13 Scratch Card So you will Scratch Every 10 Coupons and get Chance to win Cash and best Rewards.\r\nScratch To Win - Earn money Now Try Your Luck and Open Your Gift.\r\nIn Scratch To Win - Earn money Application You Have Daily Chance to Redeem best Rewards.\r\n\r\nYou will Also Refer Your Friends to Earn Extra Rewards in Scratch To win. \r\n\r\nScratch To Win app is best app free available on play store so download this app and lets enjoy. Luck by scratch is easy an application through with you can play at the same time earn some money. Now you can earn rewarded scratch card and rewarded coins.\r\n\r\nWe personally do not take any information of our user but the Ad-network which we commonly use in our apps to monetize may fetch your information.\r\n\r\nThis app only user-friendly has been developed, there is no real form of giving or receiving any payment to anyone. This app is designed for the user's entertainment Purpose. We are not capable to give payment to any user.  So, best of luck and let’s enjoy\r\n\r\nThank you for your understanding.  Make sure to check our privacy policy frequently, since it is subjected to change, and your continued use of the site is conditional to your acceptance of any modifications here.  You agree to the terms and conditions of this privacy policy.\r\n\r\nDeclaration :-\r\nWe doesn't Collect Any user Personal Information In Our Application.\r\nWe doesn't Associated with any Company and Brand etc.\r\nIf you have any issues and problems please contact us on webkingdevelopers@gmail.com",
  "summary": "Scratch to win app get more fun and entertainment.",
  "installs": "1,000+",
  "score": 4.54,
  "ratings": 641,
  "reviews": 304,
  "price": 0,
  "developer": "Webking Developers",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 25, 2020",
  "updated": 1586270394000,
  "version": "1.1",
  "recentChanges": "Bug fixes and improvements.",
  "appId": "io.kodular.webkingdevelopers.scratch",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Casino of Scratch Cards",
  "description": "Play the best casino games! \r\nSimple rules, colorful graphics and sound effects will guarantee you a great fun!\r\nWe provide fast play, big wins and unforgettable emotions.\r\nTo play, you do not need real money - betting at the casino is good fun and adrenaline rush without risk.\r\nCash on start and a chance for big winnings await you in our casino.\r\n\r\nIn the application you will find:\r\nRoulette - choose color. Black, red or green?\r\nWheel of Fortune - fortune is fickle. Try your luck today.\r\nVegetables catcher - machine full of vegetables and money. Catch them.\r\nFruits machine - popular slots in which you will find your favorite fruits and big cash.\r\nSlots 777 - three identical symbols are enough! Will you win with the machine?\r\nPoker - beat the dealer in a popular casino game.\r\nBlackjack - count, predict and beat the casino.\r\nBingo - colorful balls. Do you draw lucky numbers?\r\n\r\nBut it is not everything! New scratch cards will appear soon.\r\nIf you have a scratchcard idea then write in the comment.\r\n\r\nFeel the power of Las Vegas!\r\nPlay now and become a millionaire!\r\n\r\n\r\nGame does not offer real money gambling or an opportunity to win real money or prizes.\r\nPractice or success in a game does not imply success at real money gambling.",
  "summary": "Combination of scratch cards and the most popular casino games.",
  "installs": "50,000+",
  "score": 4.3,
  "ratings": 853,
  "reviews": 381,
  "price": 0,
  "IAPRange": "£0.99 - £2.79 per item",
  "developer": "Ready Square",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 6, 2017",
  "updated": 1512747669000,
  "version": "1.1.3",
  "recentChanges": "Become a millioner!",
  "appId": "air.com.readysquare.casinosc",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch and spin win",
  "description": "Play the next level scratch and spin app by neroxytech.\r\n\r\nIn this busy lifestyle everyone wants relax and fun when he/she was get free time that's why we are bring scratch and spin win app where users can easy to play with attractive UI and fun while play.\r\n\r\nWe are providing many features in our app like:\r\n☞ Get daily bonus everyday\r\n☞ Scratch it anytime anywhere\r\n☞ Daily spin the wheel\r\n☞ Choose your lucky number and spin the wheel\r\n☞ Invite your friends\r\n\r\nEarn points while play in scratch and spin win.\r\n\r\n\r\nScratch and spin win does not endorse or promote gambling. Scratch and spin win scratchcards and spins are intended solely for entertainment purposes.\r\n\r\nScratch and spin win app does not require any personal details from its players just register using email to get started. An email address may be requested for customer support.\r\n\r\n*We are not allow any in app purchase or deposit cash in our app.\r\n\r\n*Google is not a sponsor of Scratch and spin win, nor it is involved in any prizes, or rewards.\r\n\r\n© designed and operated by Neroxytech.",
  "summary": "Play the next level <strong>scratch and spin</strong> app by neroxytech.",
  "installs": "10,000+",
  "score": 4.42,
  "ratings": 599,
  "reviews": 372,
  "price": 0,
  "developer": "Neroxytech",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Feb 23, 2020",
  "updated": 1584553673000,
  "version": "1.2",
  "recentChanges": "Fix minor issues and notification functionality implemented.",
  "appId": "com.neroxytech.scratchandspinwin",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Pyramid Scratch - Win Prizes.Earn & Redeem Rewards",
  "description": ">>>>> Scratch Game Online to Get Rewards <<<<\r\n\r\nJoin millions players who have described our game as \"brilliant works of scratch game\", \"very enjoyable and relaxing\", and even as their \"favorite game\". You might have played scratch games, but Pyramid Scratch - Ancient Egypt is an adventure to be relished.\r\n\r\n\r\n= Find the real ancient Egyptian treasures and get rich.\r\n= Help me! Escape from pyramid in limited time.\r\n= What's the Pharaoh's secret? Waiting for you to reveal!\r\n\r\nTest your luck in Pyramid Scratch today!\r\n\r\n* This game is not affiliated by any other companies.\r\n* This game does not need real money in.\r\n* Playing this game does not imply future success at \"real money gambling\".\r\n* \"Pyramid Scratch - Win Prizes\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Play daily games for a chance to win prizes when you earn and redeem rewards!",
  "installs": "500,000+",
  "score": 4.6114206,
  "ratings": 7225,
  "reviews": 2407,
  "price": 0,
  "developer": "SCRATCH LAB",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 10, 2017",
  "updated": 1547032805000,
  "version": "1.4.8",
  "appId": "com.glottery.wolf",
  "searchTerms": "scratch cards"
 },
 {
  "title": "LUCKY SCRATCHCARDS",
  "description": "LUCKY SCRATCHCARDS offers free scratcher, lotto, and raffle games for a chance to earn  rewards. \r\nLUCKY SCRATCHCARDS is a free lifestyle experience on your mobile device. We  offer hundreds of games for our players to scratch and have a chance to win.\r\nPlay free daily lotto and scratch cards for a chance to win  prizes. New scratch cards are available daily for your chance to win tokens. You can also enter sweepstakes contests, raffle giveaways, and the daily lotto. \r\nLUCKY SCRATCHCARDS is 100% free to download and play with no in-app purchases or deposits.",
  "summary": "LUCKY SCRATCHCARDS is a 100% free sweepstakes App!",
  "installs": "500+",
  "score": 2.3333333,
  "ratings": 9,
  "reviews": 3,
  "price": 0,
  "developer": "Poseidon Technologies co.",
  "genre": "Casual",
  "contentRating": "PEGI 3",
  "released": "Aug 5, 2019",
  "updated": 1564988675000,
  "version": "1.0",
  "appId": "org.cocos2d.qmggl",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch and Win Real Cash",
  "description": "\"Scratch and Win Real Cash\" App Is Designed For User's Entertainment Purpose. Users Can Get Some Virtual Points In This App Only By Scratching Some Cards.\r\n\r\nScratch Cards Are Depends On The User's Luck. Points In Cards Opens Randomly. In Scratch and Win Real Cash App You Will Get Unlimited Scratch Cards In Whole Days But We Can Be Set Limit Of Scratch Cards in Future. Users Can Be Get More Points As A Gift If User Will Refer Your Friend and Families.\r\n\r\nUsers Must Know:-\r\n\r\n\"We Don't Collect Any Information Of Our User But The Ads- Network Which Are Commonly Use In Our Scratch and Win Real Cash App To Monetize May Fetch Your Information.\"\r\n\r\nApp Functionality:-\r\n\r\nScratch and Win Real Cash App Is Developed As User-Friendly. When You Open This App You Will See Let's Earn Button You Will Click To Enter Into App When You Will Enter Then You Will Have Unlimited Scratch Cards You Can Scratch Them And Get Points After Reaching 10,000 points You Will Be Able For Add Your Name Into Lucky Draw List. At 7,14,21,28 Dates Of Every Month Lucky Draw Will Be Organized After Getting 20 Lucky Users We Will Send of Congratulation by Email.  In This App You Will Get Virtual Points And You Will Redeem Your Points But We Did Not Take Any Guarantee Of Giving And Receiving Payment To Anyone. This App Is Totally Made For User's Entertainment. We Have Two Partner And We Both Are Not Capable To Provide Payments To Any User.\r\n\r\nThanks For Understanding Our Situation and Don't Forget To Check  Our Privacy and Policy Frequently Since It Is Subjected To Change And Your Continued Use Of The Site Is Conditional To Your Acceptance Of Any Modifications Here. You Agreed To Our Terms and Conditions of This Privacy Policy. We Have Rights To Change Our Terms and Conditions At Any Time.\r\n\r\nWe Used:-\r\n\r\nFirebase For Getting Your Mobile Number, Your Points And Your Email For Contact You If We Facing Any Problem In Redeem.\r\nOne Signal For Giving You Notification Related With Our App Features And Offers.\r\nNetwork For Detect Your Internet Connection And Simple Components.\r\n\r\nWe Declared:-\r\n\r\nWe Does Not Collect Any User's Personal Information In Our Scratch and Win Real Cash App.We Does Not Associated With Any Company And Brand Etc.If You Have Any Problem With Our App Then Feel Free To Contact Us Here h.p.comp.ltd@gmail.com.",
  "summary": "Scratch and Win Real Cash App Is an Entertainment App For The Users.",
  "installs": "100,000+",
  "score": 4.2194743,
  "ratings": 6679,
  "reviews": 3090,
  "price": 0,
  "developer": "H&P Digital Solutions",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Feb 12, 2020",
  "updated": 1588858232000,
  "version": "23.0",
  "recentChanges": "Thanks For Using Scratch and Win Real Cash We Are Regularly Working For Providing You Smooth Experience<br><br>We Added Some New Features:-<br><br>1-Due to Too Much Withdrawal Requests We Have Been Added Lucky Draw System At Every Month Of 7,14,21,28 We Organized It.<br>2-Removed Some Bugs.<br>3-Enhanced The App.",
  "appId": "com.scratchandwin.handpdigital",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Ultra Scratch Card Pro-Scratch to Earn",
  "description": "You can earn money from home without any investment.\r\n* You have to do some rules follow\r\n\r\n*Firstly you have to register and login in the app\r\n*And you have got daily 15 Scratch Card which you have to Scratch and Earn money \r\n*If you want to earn more money  then you have to Share the app with your friends and earn per app install Rs2.\r\n\r\n#Then what are you waiting for Download the app Now!",
  "summary": "Only Scratch and earn easily money from Home without any Investment",
  "installs": "100,000+",
  "score": 3.73,
  "ratings": 675,
  "reviews": 453,
  "price": 0,
  "developer": "MDNM",
  "genre": "Business",
  "contentRating": "PEGI 3",
  "released": "Oct 6, 2019",
  "updated": 1570349499000,
  "version": "1",
  "recentChanges": "Earn money for free without any investment.<br>Only you have to do hard word in this app and you have to earn money easily",
  "appId": "io.kodular.parihartrick.Ultra_Scratch_Cards",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lottery and Lotto Games by Lottoland",
  "description": "Bet on lottery and win real cash with Lottoland, the lotto betting app featuring the best lottery jackpots including US Powerball, Irish Lotto and Thunderball. Bet on EuroJackpot and MegaMillions for your chance to become a millionaire! Check the latest lotto draw results every week and find out if you’ve hit the lucky lotto numbers! \r\n\r\nOur new lotto widget allows you to bet on international lottery draws such as Keno and SuperEnalotto at your fingertips. Bet quicker than ever using the pre-set QuickPick buttons. Get fast and accurate raffle results and be the first to know if your lotto lines hit the jackpot! \r\n\r\nPrizes await! Play scratchcards and win real money. Our great variety of games includes the best Blackjack, Slots, Texas Hold’em online poker, French roulette games and more! \r\n\r\nDownload the Lottoland lotto betting app today!",
  "summary": "Real Cash Lottery Draws &amp; Results – Irish Lotto, EuroJackpot &amp; more",
  "installs": "100,000+",
  "score": 4.33,
  "ratings": 922,
  "reviews": 411,
  "price": 0,
  "developer": "EU Lotto Ltd",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Aug 2, 2017",
  "updated": 1587370689000,
  "version": "Varies with device",
  "recentChanges": "We regularly update our app to make your Lottoland experience better, faster and more fun. If you have any suggestions about our latest update, please do get in touch via email at support@lottoland.co.uk",
  "appId": "co.uk.lottoland.app",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Lucky Three - Earn Instant Rewards",
  "description": "Lucky Three offers daily free scratchers to win real money and earn rewards instantly. All scratchers are well-designed to ensure that you have a great time.\r\n\r\nLucky Three is a free mobile app that gives out real rewards to players. No in-app purchases or deposits are required. The more you scratch, the more rewards you can win. It is easy to play on the go at any time. \r\n\r\nDownload our free app now and make today your lucky day!\r\n\r\nLucky Three Features:\r\n\r\nFREE LUCKY SCRATCH EVERYDAY\r\nPlay new scratchers every day\r\nScratch and match 3 identical winning symbols to win!\r\nDouble your winning tokens after every scratch\r\n\r\nMULTIPLE WAYS TO WIN\r\nInvite friends and get 10,000 tokens for each friend that joins\r\nPlay Lucky Spin to win every day\r\nClaim hourly, daily, weekly, and monthly raffle tickets to win \r\nPick your lucky numbers in the Lotto for a chance to win every day\r\n\r\nDAILY PRIZES\r\nDaily prize for the player with the highest earned token balance\r\n\r\nLike and Follow Lucky Three on social media for all the latest news and exclusive winning opportunities!\r\n\r\nFacebook: facebook.com/Lucky-Three-101057241384789\r\n\r\nIt is your lucky day! Download Lucky Three now and win real money! \r\n*This game does not cost any real money.\r\n*Playing this game does not imply future success in “Real Money Gambling”.\r\n*Google Inc. does not sponsor, nor in any way affiliated with Lucky Three and/or the sweepstakes prizes.",
  "summary": "Lucky Three is a free app that gives out real rewards to players!",
  "installs": "10,000+",
  "score": 4.51,
  "ratings": 391,
  "reviews": 121,
  "price": 0,
  "developer": "Sticker Maker Lab",
  "genre": "Puzzle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 4, 2019",
  "updated": 1578894118000,
  "version": "1.0.9",
  "recentChanges": "fixed bug",
  "appId": "lucky.three.scratch.win.real.money.rewards",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Gold Win - Mega Rewards",
  "description": "Play Scratch card and win lots of coins and gifts! Huge of coins, bounty! mission! collection! and tasks! You cannot miss it!\r\n\r\nShare the hottest tiny game with your friends! Be happy and play Golden Garden. The best classic arcade game is at your fingerprint.\r\n\r\nScratch card\r\nmatch three symbols and win big prizes.\r\n\r\n\r\nSmash the eggs and you can greatly release your pressure.\r\n\r\nKnife throw\r\nHit the rotating log and don’t miss your target. Watch it! The game is harder than you think.\r\n\r\nClaw machine\r\nYou can find a better gift box in the next claw.\r\n\r\nFeatures:\r\nBeautiful graphic UI and sound effect\r\nHandy game, simple to play\r\nShare your pleasure with friends\r\nUploading tiny games.\r\n\r\nYour good user experience is our priority. If you have any suggestions and comments, please contact us. We will greatly appreciate your valuable ideas.\r\n\r\n*Google Inc. does not sponsor, nor is any way affiliated with Gold Win.",
  "summary": "Try the new joyful games. Win surprising box and get mega rewards!  Try now!",
  "installs": "1,000,000+",
  "score": 4.539295,
  "ratings": 14929,
  "reviews": 3950,
  "price": 0,
  "developer": "Golden garden Official",
  "genre": "Casual",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 8, 2020",
  "updated": 1588939864000,
  "version": "Varies with device",
  "recentChanges": "Fixed bugs. Improved user experiences.",
  "appId": "clover.golden.redeem.rewards.match.tb",
  "searchTerms": "scratch cards"
 },
 {
  "title": "SpinToWin Sweepstakes",
  "description": "SpinToWin is the #1 100% free sweepstakes app!\r\n \r\nEnter sweepstakes just by being a part of our community for a free chance to change your life. Join the many winners who won money with SpinToWin Sweepstakes!\r\n\r\n100% FREE cash sweepstakes for real money prizes! All sweepstakes are free to enter and chosen at random.\r\n\r\nLucky sweepstakes winners can win real cash in Instant, Daily, Weekly, Holiday and Special Sweeps drawings! Sweepstakes for money are free to enter and open to everyone!  No purchase or consideration to enter sweepstakes. Enter as many sweepstakes as you want with a simple click of a button!\r\n\r\nGet started NOW to be a part of our next FREE sweepstakes giveaway!\r\n\r\nSpinToWin Features:\r\n\r\nSWEEPSTAKES GIVEAWAY\r\n\r\nCASH SWEEPSTAKES\r\n• Win real money in our giveaways\r\n• Sweepstakes are free to enter\r\n• Get lucky and earn real cash!\r\n• Free daily, weekly, holiday and special sweepstakes!\r\n\r\nINSTANT SWEEPS\r\n• Enter sweepstakes to instantly win amazing prizes\r\n• Sweepstakes are free to enter\r\n• Free sweepstakes entries offered all the time\r\n\r\nSpinToWin offers free sweepstakes every day, every week, every month and every year! Get free sweepstakes entries for a chance to win real cash today!\r\n\r\nSuccess within this game does not imply future success with real money gambling\r\nThis game does not offer real money gambling or any opportunities to win real money or prizes from gambling activities\r\nThe sweepstakes are devised as non-gambling promotions and are intended solely for entertainment purposes.\r\nGoogle Inc. does not sponsor, nor is any way affiliated with SpinToWin and/or the sweepstakes prizes.\r\nSpinToWin is a free mobile app that allows users to win money and prizes in sweepstakes, no purchase is necessary.\r\nThis game is intended for an adult audience.",
  "summary": "Win prizes in our free instant sweepstakes! Enter giveaways for cash prizes!",
  "installs": "100,000+",
  "score": 4.4403667,
  "ratings": 2240,
  "reviews": 972,
  "price": 0,
  "IAPRange": "£0.89 - £91.99 per item",
  "developer": "Chartbuster Games",
  "genre": "Casual",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 6, 2019",
  "updated": 1589239070000,
  "version": "3.12.00-590",
  "recentChanges": "User tutorial, fix for facebook sign in issue, fix for crashes",
  "appId": "net.spintowinslots.androidnew",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Cheery Ruby - Easy Gift",
  "description": "Expect to play cool arcade games like scratch card, knife throwing, lucky cards, and claw machine? All you can get in the Cheery Ruby. Play games and win rewards here. Try it now!\r\n\r\nMini games of Cheery Ruby:\r\n 🎁Scratch cards\r\nScratch and match three same symbols, you can win coins in the game. \r\n 🎁Knife throwing\r\nThe exciting and popular game right now! hit and stab all the rotating targets then you succeed.\r\n 🎁Lucky cards\r\nYou don’t know which cards you can win big rewards. Choose one and turn the card over! \r\n 🎁Claw machine \r\nPlay the awesome surprising claw simulation game and get your gifts now!\r\n\r\nFeatures of Cheery Ruby:\r\n⛄ Multiple games to play\r\n⛄ Unlimited fun and you can play with your friends\r\n⛄ Continue to optimize our game and provide a better user experience \r\n\r\nPlease contact us for more information if needed: CheeryRuby@outlook.com\r\nThank you for all\r\n\r\n*Google Inc. does not sponsor, nor is any way affiliated with Cheery Ruby and/or the sweepstakes prizes.",
  "summary": "Match to win! Try more tiny games inside! Download now!",
  "installs": "1,000,000+",
  "score": 4.1520567,
  "ratings": 24396,
  "reviews": 8558,
  "price": 0,
  "developer": "Cheery Ruby Studio",
  "genre": "Puzzle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 27, 2019",
  "updated": 1589030818000,
  "version": "1.1",
  "recentChanges": "Fix some bugs.",
  "appId": "com.cheery.ruby.day.free.daily",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Scratch Win Gift",
  "description": "This is the concentration game is created for those people who are interested to increase their concentration power.\r\n\r\nScratch To Win Cashapp is best app free available on play store so download this app and lets enjoy. Luck by scratch is easy an application through with you can play at the same time earn some money. Now you can earn rewarded scratch card and rewarded coins.\r\n\r\nYou can spend your virtual money buying scratch cards, buying lucky boxes to increment your lucky, or buying bigger coins to scratch faster.\r\n\r\nmake sure you read privacy policy carefully since it is subjected to change and continued use of the site is conditional to your acceptance of any modification here. you agree of the term and condition of the privacy policy.\r\n\r\nNOTE: in this game you cannot win real money!",
  "summary": "Scratch Win Gift give to coupon you scratch coupon and chance to get real cash",
  "installs": "1,000+",
  "score": 4.0338984,
  "ratings": 59,
  "reviews": 24,
  "price": 0,
  "developer": "LYRICAL Video Status Apps",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Feb 21, 2020",
  "updated": 1582349059000,
  "version": "1.0",
  "appId": "com.wintoscratchcard.scratchcardtowincoin",
  "searchTerms": "scratch cards"
 },
 {
  "title": "scratch cash and win",
  "description": "Scratch To Win\r\n# Scratch Coupons and Open Up Your Luck and Chance to Win.\r\n# Scratch To Cash win rewards allows you to earn daily coupons and reel money.\r\n# You will get Daily 10 to 13 Scratch Card So you will Scratch Every 10 Coupons and get Chance to win best Rewards.\r\n# Scratch To Cash - Earn Reel money Now Try Your Luck and Open Your Gift.\r\n\r\n\r\n#Declaration :-\r\n#We doesn't Collect Any user Personal Information In Our Application.\r\n#We doesn't Associated with any Company and Brand etc.\r\n#all information and rewards which are shown in application is only for entertainment,we don't suggest any kind of real money to give the users.",
  "summary": "scratch cash and win",
  "installs": "1,000+",
  "score": 3.5,
  "ratings": 16,
  "reviews": 6,
  "price": 0,
  "developer": "VIEWSTAR",
  "genre": "Entertainment",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Sexual Innuendo",
  "released": "Nov 14, 2019",
  "updated": 1573881283000,
  "version": "2.0",
  "appId": "scratchcash.scratchtowin.scratchandwin",
  "searchTerms": "scratch cards"
 },
 {
  "title": "Animal Scratch for Kids 🐶🐱🐭",
  "description": "Animal Scratch for Kids contains images of over 40 different animals and teaches children to recognize them in a kid-friendly way. Your child will love playing Animal Scratch for Kids, and you'll be able to relax, knowing your child is learning while having great fun.\r\n\r\nAnimal Scratch for Kids works like a scratch card and kids just love it. By scratching with their finger over the silhouette they can discover different animals.\r\n\r\nAfter intensive research, observations and experiments we created with care and attention to detail this amazing educational game that will fill your child's days with joy and fun.\r\n\r\nYou are a loving and caring parent who loves their child and doing everything possible to have a childhood filled with love, tenderness and memorable moments of happy games. We believe that together with you can provide your child these moments of happiness with entertaining and educational games that will leave long lasting memories of joy and develop intellectual abilities from early childhood.\r\n\r\nThis children's game is suitable for all ages.",
  "summary": "Nice game with images of over 40 animals which teaches kids to recognize them",
  "installs": "1,000+",
  "score": 4,
  "ratings": 14,
  "reviews": 8,
  "price": 0,
  "developer": "MC Skins Party for Minecraft",
  "genre": "Educational",
  "contentRating": "PEGI 3",
  "released": "Nov 17, 2014",
  "updated": 1548164878000,
  "version": "2.7.3",
  "recentChanges": "🎉 Android 9.0<br>🚀 Bug fixes and performance optimizations",
  "appId": "com.klimbo.animalscratch",
  "searchTerms": "scratch cards"
 }
]