[
 {
  "title": "William Hill - Sports Betting on Football & Racing",
  "description": "Bet on all of your favourite sports whenever and wherever you want with the William Hill Sports Betting app. From boosting your bet to advanced in-play scoreboards, simply log in using your phone or tablet and be a part of the sports betting action today!\r\n\r\nGet live odds and stay close to the heart of the action with live streaming and advanced in-play scoreboards. With live odds on football matches, boxing, Virtual or E-sports and more, bet, watch, and cash in today. \r\n\r\n Why you’ll love betting with William Hill Sports: \r\n\r\n•\tBet Boost: Whether you want football, rugby or even a Grand Slam, boost your accas of three or more selections.\r\n•\tRacing Bet Boost: From Aintree to York. From Ballinrobe to Wexford. We give you three Bet Boosts on horse racing every day. T&C's below.\r\n•\t#YourOdds: Present us with an offer by tweeting @WilliamHill with #YourOdds and we’ll try to give you a price on it happening.\r\n•\tCash In: You can win money even if your bet doesn't with Cash In, your opportunity to accept an early pay out offer while the action is ongoing\r\n•\tPartial Cash In: Want the best of both worlds? Get something back on your bet early while waiting for the rest to play out\r\n•\tFlash Odds: Get the best enhancement ahead of the big game. From 6pm, Flash Odds goes live, so whether it’s the man of the moment to score or hit the target, these aren’t to be missed.\r\n•\tIn-play: Bet on in-play markets with up to date scoreboards so you know exactly what's happening\r\n•\tResponsible Gambling: We're here to help if ever you stop finding betting enjoyable\r\n•\tCustomer Service: Phone, email, live chat, social media – whatever suits you, we're at your service\r\n\r\nThere's no better feeling than seeing your bet win and getting a little extra money in your pocket. We stream heaps of football games, horse racing, rugby, cricket, boxing, Virtual or E-sports and more on our app - download William Hill Sports to get involved in the thrilling sports betting action today.\r\n\r\nOFFERS & KEY TERMS\r\n\r\n•\tBet £10 get £30 in free bets\r\nNew Customers using Promo Code P30 Only, min £10/€10 stake, min odds 1/2, free bets paid as 2 x £15/€15 (30 days expiry), free bet/payment method/player/country restrictions apply.\r\nLink to full T&C's: https://wh.bet/3azbROd\r\n\r\n•\tBet £10, Get £40 in free bets\r\n\r\n\r\nNew Customers using Promo Code W40. Min £10/€10 stake, win only, min odds 1/2, free bets paid as 4 x £10/€10, 30 day expiry, free bet/payment method, player/country restrictions apply.\r\nLink to full T&C's:  https://wh.bet/2TrjDnz\r\n\r\n\r\n•\tBet £5 & get £10 in free bets\r\nNew Customers using Promo Code S5. Min £5/€5 stake, win only, min odds 1/2, free bets paid as 2 x £5/€5, 30 day expiry, free bet/payment method, player/country restrictions apply.\r\nLink to full T&C's: https://wh.bet/2vIjWBi\r\n\r\n• Racing Bet Boost: 3 x Bet Boosts on horse racing singles per customer, per day. Max stake £20 win or £20 EW. On EW bets, only “win” part boosted. Online only. Excluded on Grand National day. Player restrictions & terms apply.\r\nLink to full T&C's: https://wh.bet/39SyrAQ\r\n\r\nYourOdds: Betting rules and terms apply.\r\n\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 (UK) or 1800 753 753 (IRE). Alternatively, visit https://www.begambleaware.org (UK) or http://www.gambleaware.ie/ (IRE).\r\n\r\nWilliam Hill is operated by WHG (International) Limited a company registered in Gibraltar. William Hill is licensed by the Gambling Commission (Number: 000-039225 R-319373-009) for customers in Great Britain, and licensed by the Gibraltar Government and regulated by the Gibraltar Gambling Commissioner (RGL no. 034 & 042) for all other customers. \r\n\r\nThe app requires you to be over 18 to participate in any gambling activity. Full details can be found on www.williamhill.com",
  "summary": "Bet on football, boxing, horse racing, rugby &amp; other sports with our live odds",
  "installs": "500,000+",
  "score": 4.445474,
  "ratings": 14047,
  "reviews": 4590,
  "price": 0,
  "developer": "William Hill",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Aug 1, 2017",
  "updated": 1585219879000,
  "version": "2.14.1_GP",
  "recentChanges": "General bug fixes and performance improvements",
  "appId": "com.williamhill.sports.android",
  "searchTerms": "sports betting"
 },
 {
  "title": "Paddy Power Sports Betting - Bet on Football",
  "description": "€/£10 Risk Free First Bet | Paddy’s Rewards Club Offer €/£10 Every Week | T&C's Apply – details below.\r\n\r\nOur amazing new app is packed full of great features to give you a fun betting experience. Find the best football & horse racing betting odds and tips!\r\n\r\nSAME GAME MULTI\r\nWe’ve all been there. You really fancy a team to win, the main man up front looks nailed on to score first and there’s a particular centre back who was born yellow carded. Well, with our new Same Game Multi, you can now place this along with a whole host of different markets as a single bet to win bigger. To get cracking, just go to the Same Game Multi tab in all the top matches and create whatever bet you like.\r\n\r\nLIGHTNING FAST\r\nOur app is quicker than ever. Incredibly fast load and navigation. You’ll never miss a bet again\r\n\r\nSIMPLE NAVIGATION\r\nIt’s now even easier to find your selections. Our menus and tabs make it a quick and easy experience\r\n \r\nIMPROVED DESIGN\r\nThe Paddy Power Sports Betting - Bet on Football app is optimised to look perfect on the latest Android devices\r\n\r\nHORSE RACING\r\nMissed the race start? No hassle. You can now watch a race and bet live in-play on all horse races.\r\nFollow the wide selection of Racing Post tips available at the bottom of every race card!\r\n\r\nIN-PLAY EXPERIENCE\r\nOur in-play home page makes it even easier to find and get a bet on\r\nWe have live streaming for over 100,000 sporting events each year\r\nOur live stats and visualisations offer you the latest information on all the critical match moments\r\n\r\n#WhatOddsPaddy\r\nRequest odds for any sporting outcome via our twitter page. We’ll price it up and put it live on site so you can get involved in the action.\r\n\r\nQUICK LOGIN\r\nNeed to get a bet on fast!? Get into your account quickly and securely with a 4-digit Pin or fingerprint\r\n\r\n£/€10 Risk Free First Bet T&Cs:\r\nNew customers only, UK & IE\r\nOpen a new account using promo code YSKA00\r\nDeposit a minimum of £/€10 using a Debit/Credit Card or PayPal\r\nPlace a Sportsbook bet. Your first bet will be your qualifying bet.\r\nIf your qualifying bet is settled as a loser we will refund you stake in CASH\r\nMaximum refund is £/€10\r\nRefund will be processed within 1 hour after the qualifying bet has been settled as a loser.\r\nSign up offers are limited to one per person, family, household address, email address, and shared computer. We reserve the right to withdraw the availability of free bet offers to any customers.\r\nDeposits made with e-wallets including Skrill, Paysafe and Neteller will not count. Only Debit/Credit Cards and Paypal are eligible.\r\nCustomers registering through this offer are not eligible for any other sign up promo.\r\nFull T&C’s of Paddypower.com apply.\r\n\r\nPADDY’S REWARDS CLUB T&Cs:\r\nApplies to online, mobile, phone and text bets only. \r\nQualify 1 of 3 ways each week:\r\n•\tPlace 1 x £/€5 bet to receive a Power Up. \r\n•\tPlace 5 x £/€5 bets to receive a £/€5 free bet & a Power Up. \r\n•\tPlace 5 x £/€10 bets to receive a £/€10 free bet & a Power Up. \r\nYour qualifying bets can be placed on any sport and will qualify if the odds, or combined odds, are 1/2 (1.5) or greater.\r\nCashed out bets do not qualify.\r\nMax free bet is £/€10 per week.\r\nMax Power is 1 per week.\r\nPP betting rules apply.\r\nFull T&C’s: https://promotions.paddypower.com/paddysrewardsclub\r\n\r\n\r\nPaddy Power football rules & full T&C’s of also apply.\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 (UK)/ 1800 753 753 (IE) or visit https://www.begambleaware.org/ for UK/ http://www.gambleaware.ie/ for IE.",
  "summary": "In-Play Betting &amp; Odds - Bet on Football, Horse Racing, Rugby, Cricket &amp; Golf",
  "installs": "500,000+",
  "score": 4.4160137,
  "ratings": 11514,
  "reviews": 4486,
  "price": 0,
  "developer": "PaddyPower PLC",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1580737950000,
  "version": "6.0.4",
  "recentChanges": "We&#39;ve improved the stability and performance of the app to improve your Paddy Power betting experience.",
  "appId": "com.paddypower.sportsbook.u.inhouse",
  "searchTerms": "sports betting"
 },
 {
  "title": "Virgin Bet: Sports Betting on Football & Racing",
  "description": "Virgin Bet is the sports betting app made for you. Whether you’re building accumulators or placing a quick single before kick-off, Virgin Bet has the markets and the in-play odds for the bets you want.\r\n\r\nPLUS, Bet £10 to get £20 in free bets - see Welcome Offer Rules below.*\r\n\r\nVIRGIN BET PRICE BOOSTS\r\nWhether it’s the next hotly anticipated horse race, tennis match, the latest Premier League or Champions League clash, we’ll have a Virgin Bet price boost you won’t want to miss.\r\n\r\nLIVE STREAMING\r\nWatch live football, tennis, basketball and more to see all the action during your in-play bets.\r\nPlus, you can also watch live UK, Irish and international horse racing. You’ll just need to place a bet of a minimum £1 single unit stake or 50p E/W bet on the race you want to stream.\r\n\r\nFAST IN-PLAY BETTING\r\nBet in-play across a range of sports including football, tennis and basketball and follow the action on detailed Virgin Bet scoreboards.\r\n\r\nBEST ODDS GUARANTEED\r\nIf the starting price is bigger than your original price, we’ll give you the bigger odds. That’s on all win/each-way bets on UK/Irish horse race days. Start time/Rules/exclusions: virginbet.com/promo/terms/best-odds Max enhancement £50k/day.\r\n\r\nFULL RACECARDS\r\nWith Racing Post Spotlights and form, check the latest in all horse races with Virgin Bet’s card view. Or, you can tap the “Next off” button from the home page to go straight to upcoming races.\r\n\r\nMATCH STATS\r\nFor all the big football leagues including Premier League, Bundesliga and Serie A, check out the results for each team’s last five matches, as well as the head-to-head history before placing your bets. Use the new bet builder feature to create accumulators within a single match.\r\n\r\nTOP SPORTS AND MARKETS\r\nFrom global football leagues to ATP tennis tours, or football corners & cards to tennis sets & double faults, there’s markets for everyone at Virgin Bet. \r\n\r\nLIVE ROULETTE, CASINO & SLOTS\r\nStep into our live casino and try your luck at the roulette and blackjack tables with live casino dealers. Spin the reels of your favourite casino slot games including Rainbow Riches and Deal or No Deal: What’s in Your Box slot.\r\n\r\nSlide out our in-play blackjack game from the tab on your screen and play blackjack between your sport bets.\r\n\r\nVIRTUAL SPORT\r\nCasino not your thing? Try your luck on virtual football betting and horse racing.\r\n\r\n\r\nBet £10 to get £20 in free bets - see Rules below.*\r\n\r\n\r\n*WELCOME OFFER RULES\r\n1. Offer for new Members who: (a) have not self-excluded; (b) make a first deposit of £10+; and (c) within 14 days place a cash bet of £10+ that: (i) settles in same period; (ii) is at min odds of 1/2; and (iii) if a multiple or acca bet, has odds greater than 1/100 for each leg (“Qualifying Bet”). Only win part of E/W bets qualify.\r\n2. £20 in free bets as two £10 Free Bet Token (“Tokens”)-: must accept via pop-up within 7 days and must use withing 7 days from acceptance.\r\n3. No Tokens in respect of any voided or cashed out Qualifying Bet.\r\n4. Tokens’ rules apply, including that they: (a) may only be used one at a time for a bet of the same value, at odds of 1/100 or greater; (b) cannot be used as multiples or E/W bets; (c) cannot be withdrawn as cash; (d) will not be returned as a stake on a winning bet.\r\n5. You can only take part once. No multiple accounts. Cannot combine with other offers for new Members or for the same event.\r\n6. Deposit balance and winnings (if any) are withdrawable at any time during this promotion, subject to section 5.6 of terms and conditions: https://web.virginbet.com/en/vb-terms-and-conditions/ Account restrictions do not affect Tokens once Qualifying Bet placed.\r\n7. Full rules: help.virginbet.com/hc/en-gb/articles/360023786933-Welcome-offer-promotion\r\n\r\n18+. Virgin Bet is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.\r\n\r\nT&Cs: web.virginbet.com/en/vb-terms-and-conditions/\r\n\r\nPlease Bet Responsibly. BeGambleAware.org. 0808 8020 133",
  "summary": "The only app you need for all your football, horse racing, sports &amp; casino bets.",
  "installs": "50,000+",
  "score": 4.13,
  "ratings": 173,
  "reviews": 88,
  "price": 0,
  "developer": "Virgin Bet Ltd",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "May 28, 2019",
  "updated": 1588861799000,
  "version": "1.7.521",
  "recentChanges": "Placing multiple bets on the same match? Try our new bet builder feature before kick-off on selected matches from top football leagues to create your own accumulators.",
  "appId": "com.virginbet.virginbetuk",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betway Sports - Live & Online Sports Betting",
  "description": "Bet on ALL your favourite sports with Betway. We’ve got the best odds for the Premier League, Champions League and Euro 2020, right here. Plus, you can bet on Six Nations rugby, legendary horse racing events like Cheltenham Festival and so much more. Ready to heed your hunch?\r\n\r\nSports betting on the go is easy: choose your game, get live odds and place a bet! View tips, stats and match results straight from your phone.\r\n\r\nNew to Sports Betting?\r\nGet £/€30 in FREE BETS to split however you like when you sign up to Betway for the first time!\r\n\r\nHORSE RACING\r\nHorse racing, the home of the bookie; in a world of bets, each way and outrights, Betway Sports gives you the chance to take a punt on your horse, armed with as much information and horse racing tips as possible. \r\n\r\nFOOTBALL BETTING\r\nPremier League, Champions League and more - find all your favourite football betting leagues and tournaments here. We’ll bring you thousands of live odds, all constantly monitored by our expert team of traders so you can enjoy football betting with confidence.\r\n\r\nRUGBY - SIX NATIONS BETTING\r\nSix Nations - the only international tournament that matters (as far as Europe is concerned). When it comes to rugby betting coverage, we’re the best in the business. Our Six Nations odds are available 24/7, whether you’re betting pre-match or in-play.\r\n\r\nBOXING BETTING\r\nLive odds on the biggest fights and the greatest knockouts. Our sports betting odds are regularly checked against the industry's other leading bookmakers, and you can access them pre-fight or in-play. Know the Fight Winner? Go on, heed your hunch.\r\n\r\nESPORTS\r\nSports betting is embracing Esports tournaments like never before, and you can count on us to deliver the best odds and thrilling gaming experience; from CS:GO to Overwatch, League of Legends and more.\r\n\r\nLIVE ODDS - WHENEVER, WHEREVER\r\nPre-game or in-play betting, it’s up to you. We offer the most competitive, live odds for you to access any time, any place.\r\n\r\nDownload Betway Sports for the best odds, access to 15,000 live sports markets and the thrilling experience of Sports betting, available at your fingertips.\r\n\r\n\r\nTERMS AND CONDITIONS\r\n\r\n*Welcome offer - £30 in Free bets, key Terms:\r\n- New Customers Only.\r\n- Min Deposit: £/€10. 1 x wagering at odds of 1.75+ to unlock Free Bet.\r\n- Debit Card & PayPal deposits only.\r\n- Additional Terms Apply: https://sports.betway.com/en/sports/dyn/SportsWelcomeBonus\r\nFull Ts & Cs Apply\r\n\r\nThis is a real money gambling app. Please gamble responsibly & only bet what you can afford.\r\nFor gambling addiction help and support, please contact:\r\nUK: https://www.begambleaware.org/ and 0808 8020 133\r\nIreland: http://www.gambleaware.ie/ and 1800 753 753",
  "summary": "Bet your favourite sports: football, horse racing, rugby &amp; more! Get best odds.",
  "installs": "100,000+",
  "score": 4.394834,
  "ratings": 2717,
  "reviews": 1174,
  "price": 0,
  "developer": "© Betway Group",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1587043984000,
  "version": "2.13.0",
  "recentChanges": "Bug fix: users can select files from their devices during the player verification process.<br>Bug fix: tapping the mute button in live streams no longer pauses the stream.",
  "appId": "com.betway.sports",
  "searchTerms": "sports betting"
 },
 {
  "title": "kwiff - Sports Betting & Games",
  "description": "kwiff is the only app where your odds could epically improve when you place your bet. \r\n\r\nWe call this ‘getting kwiffed’.\r\n\r\nYou could get kwiffed on any bet you make (regardless of the sport, odds or stake) but you can’t control when it happens. When it does, it happens to you and no one else. Lucky you.\r\n\r\n2/1 odds could become 4/1, or 404/1. That means the return on a £2 bet could go from £6 to £10 or £810.\r\n\r\nYou can also supercharge your weekend with every bet. Every £5 minimum sports or casino bet placed gives you the chance to win an unforgettable weekend in Lisbon, Vegas, New York, Madrid... The list goes on. 4 supercharged weekends to win every month. 1 winner picked every Monday.\r\n\r\nReady to play? \r\n\r\nJoin the 300,000+ players on kwiff by downloading the app today.\r\n\r\nWhat else can you do on kwiff?\r\n\r\nEasily find the sports bet you want to place (whether it’s football, boxing, tennis, rugby, darts, snooker, MMA, American Football or ice hockey). \r\n\r\nSwipe to place a bet or bet in-play. \r\n\r\nQuickly withdraw from your account whenever you want.\r\n\r\nPlay a range of casino games including live casino (watch and interact with real life dealers), slots, and table games.\r\n\r\nSee your favourite markets and sports, and place accumulators (accas), all through kwiff’s personalised mobile app. No annoying offers or confusing promotions.\r\n\r\nAt kwiff we want to build a new and superior betting experience. One that’s bigger, better and more entertaining. Want to try it?\r\n\r\nDownload kwiff today!\r\n\r\nkwiff is licensed and regulated by the UK Gambling Commission (Number: 000-044448-R-323408). kwiff is a trademark operated by Spryme Ltd.\r\n\r\nkwiff is a real money gambling app and not intended for an audience under 18 years of age. Please gamble responsibly and only bet what you can afford. If you feel that you may have a problem controlling your gambling we strongly recommend that you contact GamCare by phone (0845 6000 133) or by visiting www.GamCare.org.uk.\r\n\r\nMore information is available at http://kwiff.com/responsible. Supercharge your weekend T&Cs: http://bit.ly/scyweekend.",
  "summary": "Supercharge your betting! Your odds on any sports bet could epically improve.",
  "installs": "100,000+",
  "score": 3.4280155,
  "ratings": 2582,
  "reviews": 1301,
  "price": 0,
  "developer": "Kwiff Limited",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests",
  "released": "Aug 18, 2017",
  "updated": 1588256575000,
  "version": "4.7.0",
  "recentChanges": "It’s here: the world premiere of supercharged Cash Out.<br>Cash Out doesn’t have to be boring. Swipe on your offer and your payout may just massively improve #doublekwiff <br><br>Can&#39;t get your hands on a live stream? We&#39;ve added real-time sports visualisations for in-play matches and supercharged match previews &amp; statistics for upcoming events.<br><br>Your favourite casino games are also now easier to access than ever before; check out the new and improved sports home page for our most popular picks.",
  "appId": "gaming.eatongate.com.kwiffapp",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports Betting™ the Sportsbook Freeplay App",
  "description": "Open your account with the original Sport Betting™ App and get $2,000 in FREE BETS today! Bet Nationwide on all your favorite games including Live In-Play Betting on all major sporting events.  Bet safe & secure with no deposits or fees required to play!\r\n \r\nExperience the thrill of Sport Betting™ on ALL MAJOR SPORTS including Football, Baseball, Basketball, Hockey, UFC, Soccer, Tennis, Golf, Boxing, Racing and more. The original Sports Betting™ App Sportsbook brings you real time Las Vegas Odds, reduced juice (low vig), multiple betting options (Parlays, Straight, Teasers and Props) and even Live Betting (All Game Long).\r\n \r\nThe Sport Betting™ App was the first mobile sportsbook App online and offers unique mobile technology and a user friendly betting experience right at your fingertips. Join millions of Sports Fans and betting enthusiasts alike in a sporting experience that puts your knowledge of sports and the game right on the line!\r\n \r\n \r\nLIVE BETTING (All Game Long)\r\n \r\nBet games live play-by-play as the action unfolds. Both full game odds and game props are updated in real time for Football, College Football, Basketball, College Basketball, Hockey, Baseball, MMA, Boxing, Tennis and more. Bet on spreads, totals and props while watching the game live on your screen. Bets are graded within seconds and your account is always credited instantly.\r\n\r\nVIRTUAL SPORTS (Live Steam 24/7)\r\n\r\nThe action never stops with our exclusive Virtual Sports simulations of major Football, Basketball, Hockey, Baseball and Soccer leagues. Bet your favorite team at any time including off-season and watch it live on your screen anywhere without restrictions. \r\n \r\n \r\nSTREAK CONTEST\r\n \r\nPlay the Streak Contest to build your longest streak of correct picks from a daily list of professional and college sports matchups for your chance to win multiple prizes including a grand prize. \r\n \r\n \r\nDownload The Sport Betting™ App Today For FREE.\r\n \r\nThe Sports Betting™ mobile application for smartphones, tablets, Android Wear smartwatches and other mobile devices is for entertainment purposes only, and is it not a gambling operator. Your device must have an active internet connection to access the application.\r\n \r\nAdditional terms and conditions may apply.  If you or someone you know has a gambling problem and wants help, please call 1-800-GAMBLER.\r\n \r\nComplete Terms and Conditions: http://www.sportsbetting.lv/terms/\r\nPrivacy Policy: http://www.sportsbetting.lv/privacy/\r\n \r\nSports Betting™ is not affiliated or endorsed by professional sports leagues, professional sports teams, athletic organizations, non-profit athletic organizations, sports federations or sports governing bodies.",
  "summary": "Bet nationwide safe &amp; secure with no deposits or fees required to play!",
  "installs": "50,000+",
  "score": 3.5,
  "ratings": 147,
  "reviews": 79,
  "price": 0,
  "developer": "Meritum Interactive Limited",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 16, 2015",
  "updated": 1585838830000,
  "version": "Varies with device",
  "recentChanges": "The Sports Are Back with our new VIRTUAL SPORTS offering including Live Stream 24/7! Enjoy the thrill of Live Sports with our exclusive Virtual Sports simulation of NBA, NFL, NHL and UEFA Champions League.<br><br>With real-time betting odds, Live Games 24/7 and free Live Streaming directly to your screen you don&#39;t need to wait any longer to get back into the game!",
  "appId": "com.deportes",
  "searchTerms": "sports betting"
 },
 {
  "title": "BettingPros: Sports Betting",
  "description": "Make winning bets with advice and picks from top sports betting experts.\r\n\r\nThe BettingPros app puts consensus and expert-driven sports betting advice at your fingertips to help you pinpoint the best odds and make winning bets.\r\n\r\nDownload the BettingPros app to:\r\n\r\n• Browse consensus betting odds for point spreads, totals, moneyline, and futures across the NFL, NBA, MLB, NCAA, XFL and more.\r\n\r\n• Target the best odds and lines aggregated from all of the top sportsbooks, including FanDuel Sportsbook and DraftKings Sportsbook.\r\n\r\n• Find winning bets with expert consensus picks from the most accurate experts. Over 150 of the top football betting experts were tracked during the NFL season.\r\n\r\n• Watch your favorite NFL matchups with instant game updates and scoring plays, and easily see live totals and line covers for every game.\r\n\r\n• Review final scores and covers for NFL, College Football (NCAAF), College Basketball (NCAAB), NBA, and MLB games.\r\n\r\n• Learn simple and advanced sports betting tips with our comprehensive Sports Betting Guide for beginners and sharps alike.\r\n\r\n• Read daily articles and analysis, ranging from recommended picks to tips on how to become a more profitable sports bettor, across a multitude of sports: NFL, NCAAF, NBA, MLB, NCAAB, Golf, Tennis, UFC, and Boxing.\r\n\r\n• Listen to weekly episodes of the BettingPros Football betting podcast.\r\n\r\nBettingPros is a sports betting advice network created by FantasyPros, the #1 source for fantasy sports advice.\r\n\r\nBettingPros content is intended to be used for entertainment purposes only.\r\nPlease be aware of and respect the laws regarding sports betting for your jurisdiction.\r\n\r\nBettingPros is not affiliated with or endorsed by Apple, the NFL, MLB, NBA, NHL, PGA, or NCAA. BettingPros is not a gambling site and does not accept wagers.",
  "summary": "Make winning bets with advice and picks from top sports betting experts.",
  "installs": "10,000+",
  "score": 3.8,
  "ratings": 20,
  "reviews": 15,
  "price": 0,
  "developer": "FantasyPros",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Sep 23, 2019",
  "updated": 1583419254000,
  "version": "1.2",
  "recentChanges": "Thanks for using the BettingPros app. This update includes:<br><br>- Games and Odds for XFL and NCAA basketball - just in time for March Madness<br>- User registration and login<br>- Betting Guide articles",
  "appId": "com.bettingpros.bettingpros",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports Betting Game - BETUP",
  "description": "Bet on your favorite sports and esports around the world using live in-play odds from a major sportsbook(1xBet). Now you can enjoy the fun and thrill of sports betting with absolutely no risk! With all the features of a great bookmaker with huge emphasis on the social, fun aspect of sports wagering, BETUP offers you an entirely new way to experience betting on sports!\r\nYou must be tired of all those Guru betting tips apps that only make you lose money, but now you can finally track the most profitable bettors and simply just copy their bets and strategies!\r\n\r\nVIRTUAL CURRENCY. REAL SPORTS. REAL EMOTIONS\r\nWhen you open an account with BETUP using Facebook, Google+ or Email, you’ll receive 1000 BETCOINS to bet with. We’ll take you on a virtual intro tour and help you place your first bet and find your way around to make your first experience a pleasure.\r\n\r\nFind over 25 real sports and thousands of leagues to bet on, including Soccer(Superclasico Boca Juniors vs River Plate ), NFL(Super Bowl betting live), NBA, NHL, NCAA, MLS, MLB, UFC and esports such as Dota, Counter Strike, WoW. BETUP allows you to place & track bets much more interesting by wagering virtual money on the outcome using live in-play bookmaker odds! \r\nDifferent types of bets: singles bets, accumulators, parlay betting and much more!\r\n\r\nSPORTS BETTING MADE SOCIAL!\r\nThe aim is to win as much Betcoins as you can by betting on sports to rank higher in our daily, weekly and monthly top sports bettors charts. There are daily competitions and challenges for you to enter and put your sports knowledge and betting skills against other players for huge virtual in-app prizes and jackpots to boost your virtual game wallet!\r\n\r\nFootball/Soccer betting at your fingertips. Bet on basketball, ice hockey, tennis, american football and much more! Hit up the fans section for each match where you can comment, like and engage with other users from the app. \r\nBet all 365 days per year, hundreds of matches daily!\r\nNow you can feel the real Vegas experience with vegas odds & vegas lines, never miss a scored point or goal.\r\n\r\nLIVE SCORES, RESULTS & STATS\r\nBETUP’s live scores section can be personalized with your favorite teams, leagues and sports so you can bet quickly and easily depending on which sports you love. Bet on upcoming and live games and receive push notifications so you know when a match starts or a goal is scored to track bets. Football betting at it's best!\r\n\r\nIf you love betting based on statistics, you can take a look at detailed stats for the last 5 matches for each term, view head to head statistics and check live match stats including possession, shots, yellow cards, penalties, fouls, squads and lineups. \r\n\r\nBETUP – HIGHLIGHTS \r\n⦁ Enjoy over 25 sports including betting on NFL, NBA, NHL, NCAA, MLS, MLB, UFC and much more(Super Bowl live betting )\r\n⦁ Bet on esports such as Dota, Counter Strike, WoW, WoT and more\r\n⦁ Real-time, live odds from major sportsbooks \r\n⦁ No risk betting using virtual, free currency - Betcoins\r\n⦁ View detailed statistics, form, lineups and history for each team\r\n⦁ Bet all 365 days & 24 hours a day\r\n⦁ Soccer betting, football betting included!\r\n⦁ Live match statistics including possession, fouls, shots and more\r\n⦁Much more than just betting tips, track the best gamblers in real time\r\n⦁ Compete against other sports bettors in competitions and win huge prizes & jackpots\r\n⦁ Climb the BETUP daily, weekly and monthly ranks and become the best sports bettor \r\n\r\nBET ON REAL SPORTS WITH VIRTUAL MONEY. JOIN IN THE FUN FOR FREE TODAY!\r\nResponsible gaming disclaimer:\r\n- The game is intended only for a mature audience\r\n- The game does not offer real money gambling or an opportunity to win real money or real prizes\r\n- You can't exchange your wins or balance to real money or real rewards\r\n- Practice or success at social sports betting does not imply future success at real money gambling\r\n\r\nOdds provided by 1xBet company. All rights reserved",
  "summary": "The first Sports &amp; eSports Betting Game with real live in-play odds and no risk!",
  "installs": "1,000,000+",
  "score": 4.0396624,
  "ratings": 27354,
  "reviews": 10466,
  "price": 0,
  "IAPRange": "£0.89 - £45.99 per item",
  "developer": "UPAPP",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 10, 2018",
  "updated": 1587242009000,
  "version": "1.61",
  "recentChanges": "Fixed the bonus system<br>Added mini games<br>More betting types<br>Improved stability",
  "appId": "org.betup",
  "searchTerms": "sports betting"
 },
 {
  "title": "Bet UK - Sports Betting, Live Casino & Slots",
  "description": "Bet UK presents our mobile gaming app for sports betting, roulette, blackjack and slots all in one handy place. Our all new betting app gives you access to exclusive offers, fantastic gaming experiences and real-time in-play betting on some of the world's biggest sporting events. Download the Bet UK mobile app today to bet on upcoming sporting fixtures and for hundreds of slots and live casino games.\r\n\r\nBet UK App Top Features Include: \r\n\r\n- Over 350 Slot, Casino & Live-Casino Games\r\n- Fast and Simple Sign-Up Process\r\n- Quick To Load And Easy To Navigate\r\n\r\nSlots \r\n\r\nDo you prefer online slots? Bet UK has a huge range of different slots to choose from. You can spin the reels on any classic slots like Rainbow Riches and Cleopatra, but as always Bet UK offers much more than just the classics, with new titles and ways to play added on a weekly basis. \r\n\r\nLive Casino \r\n\r\nBet UK has partnered with the world’s best gaming providers, which means we can deliver some of the biggest and most entertaining live casino games on the market. These live casino games include roulette, blackjack and baccarat as well as a selection of different variants like Immersive Roulette and Live Blackjack Party.\r\n\r\nSafety First \r\n\r\nAt Bet UK it's important to us that every player feels protected. Bet UK is owned and operated by LeoVegas Gaming PLC, who are licensed and regulated by the UK Gambling Commission (https://secure.gamblingcommission.gov.uk/PublicRegister/Search/Detail/39198). \r\n\r\nSafer Gambling \r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. \r\n\r\nFor gambling addiction help and support, please contact BeGambleAware at 0808 8020 133 or visit https://www.BeGambleAware.org. 18+ \r\n\r\nSafer gambling - https://www.betuk.com/safergambling\r\n\r\nPrivacy policy - https://www.betuk.com/privacypolicy\r\n\r\nPromotional terms - https://www.betuk.com/promotional-terms\r\n\r\nGeneral terms - https://www.betuk.com/termsandconditions\r\n\r\nBet UK is owned and operated by LeoVegas Gaming PLC\r\n\r\nPlease note that all app images / previews shown here are for illustrative purposes only. Live promotions, offers and odds on Bet UK may differ from those shown above. Please see https://www.betuk.com for full details.",
  "summary": "Hit The Target with the Bet UK app",
  "installs": "1,000+",
  "score": 4.1,
  "ratings": 40,
  "reviews": 18,
  "price": 0,
  "developer": "© LeoVegas Gaming PLC",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Jun 14, 2019",
  "updated": 1588324045000,
  "version": "3.0.31",
  "recentChanges": "Thanks for using Bet UK. In this version, we&#39;ve fixed some bugs, improved performance and added a few improvements. We would love to hear any feedback you have so don&#39;t forget to rate the app.",
  "appId": "com.betuk",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betfair Sports Betting - Bet on Football",
  "description": "GET UP TO £/€ 100 IN FREE BETS! T&Cs Apply!\r\n\r\nBetfair Sportsbook lets you place bets on football (including Champions League, Premier League and La Liga), horse racing, tennis, greyhound racing, political races and elections, cricket, golf, boxing, rugby and almost all sports. Find the latest football odds and try out our new feature Same Game Multi to place bets on multiple markets in one single place.\r\n\r\nBest Odds on the Premier League\r\nGet the Best Odds on the Premier League with Betfair. Statement based on Betfair Sportsbook offering the lowest average match overrounds since 1/1/17 on Premier league games. Betfair Sportsbook prices compared against leading UK bookmakers. Data provided by TX Odds & Betradar. Full terms at promos.betfair.com\r\n\r\nSAME GAME MULTI: \r\nEver fancied a team to win, their striker to score first and the game to have lots of corners? Well, with our new Same Game Multi, you can now place this along with a whole host of different markets as a single bet to win bigger. To find this, just go to the Same Game Multi tab in all the top matches and create whatever bet you like.\r\n\r\nEACH WAY EDGE\r\n-\tAdd places for a better chance of winning or remove them to win bigger.\r\nRACING NOTIFICATIONS \r\n-\tWe’ll send you a reminder before the race starts and the result right after it finishes.\r\nIN-PLAY BETTING\r\n-\tBet In-Play across a huge range of sports. Follow the action with 3D match view. \r\nLIVE STREAMING\r\n-\tWatch over 100,00 live events each year.\t\r\nNOTIFICATIONS\r\n-\tNever miss an update with live push notifications straight to your phone.\r\nRACING BETS IN TWO TAPS\r\n-\tPlace your racing bets in just two taps\r\n\r\nTerms & Conditions:\r\n£/€ 100 IN FREE BETS T&C's\r\n\r\n1.\tWho can take part?\r\nNew customers only.  Available to residents of UK or Republic of Ireland using promo code ZBBC01.\r\n \r\n2.\tWhat do I need to do?\r\nPlace 5 x £/€10 (or more) single bets on the Sportsbook each at min odds 1/2 (1.5).\r\nBets placed on the same selection or market do not qualify for this promotion.\r\n \r\n3.\tWhat can I win?\r\nAfter your 5 qualifying bets have been settled, you will receive a £/€20 free bet.\r\nThe process can be repeated up to 5 times. The max bonus available is €100 (5 x £/€20 free bets)\r\n \r\n4.\tWhen will I get my prize?\r\nFree bets will be awarded within 24 hours of you completing the qualifying requirement.\r\n \r\n5.\tWhat else do I need to know?\r\nYou can stake more than €10 but it will only count as one qualifying bet.\r\nBets placed and settled within the first 30 days of account opening qualify.\r\nExcludes 'same market' bets placed on the Exchange.\r\nCashed Out and Voided bets do not qualify.\r\nBets placed using free bets as the stake (in full or in part) will not qualify.\r\nOffer excludes customers who deposit using Moneybookers or Neteller.\r\nOnly one bet per event qualifies.\r\nMultiple bets are excluded and any single bets in multiple bets are also excluded (e.g Lucky 15).\r\nFree bets are valid for 30 days.\r\n \r\n6.\tOther essential stuff:\r\nBetfair Sportsbook promotional terms apply, see here https://promotions.betfair.com/term-standard-sbk\r\n\r\nT&Cs: Betfair Sportsbook offered the lowest overrounds on average on Premier League pre-match match odds markets since 1/1/17. T&Cs Apply. \r\n \r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 (UK)/ 1800 753 753 (IE)  or visit https://www.begambleaware.org/ for UK/ http://www.gambleaware.ie/ for IE.",
  "summary": "Bet Online and Experience the Thrill of Sports Betting",
  "installs": "100,000+",
  "score": 4.147929,
  "ratings": 5084,
  "reviews": 1928,
  "price": 0,
  "developer": "Betfair LTD",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1580737263000,
  "version": "3.0.4",
  "recentChanges": "We’ve introduced a range of performance improvements so the app is even quicker and easier to use.",
  "appId": "com.betfair.sportsbook",
  "searchTerms": "sports betting"
 },
 {
  "title": "Ladbrokes Sports Betting",
  "description": "Where the Nation Plays.\r\n\r\nBoom Boom Boom! Whether you’re betting on the big game on the sofa or out and about, you’ll score with an unbeatable range of markets on your mobile with the Ladbrokes Sports Betting app – get in! Boost your own odds instantly, use Cash Out control, win £100 with 1-2-Free, Best Odds Guaranteed and much more – what a screamer!. \r\n\r\nThe fun carries on after full-time, with hundreds of great Sports Betting Games and Slots just a tap away! Find them on the navigation bar at the bottom of our app. Be on the ball and download now. \r\n\r\n\r\nHere’s a few features to get you started...\r\n\r\n•\tNew Customer Offer - Get £20 in Free Bets (4 x £5) when you sign-up with code ‘20FREE’ and stake £5 on sports. \r\n\r\n•\tEnjoy Loads of Acca Features - (https://sports.ladbrokes.com/en-gb/promotions/) Want to make the most of your Acca? Then you’re in the right place. With more Acca features we're your best bet!\r\n\r\n•\tBest Odds Guaranteed on all UK and Irish races.Take the price - including early prices, board prices, singles and multiples - and if the SP returns greater we'll pay you out at the bigger price.\r\n\r\n•\t#GetAPrice (http://www.ladbrokes.com/tc/getaprice/) – You pick it. We price it. Request your own bet from a range of player and team markets. #GetAPrice on a wide range of markets including Europe’s major football leagues including the FA Premier League and La Liga\r\n\r\n•\tOdds Boost (http://www.ladbrokes.com/tc/oddsboost/) – Hit the Boost button in your betslip to increase your odds. You’ll instantly see the boosted price and returns. \r\n\r\nNew Customer offer\r\n18+ New UK+IRE customers. PayPal and certain deposit types and bet types excluded. Min £5 bet within 14 days of account reg at min odds 1/2 = 4 x £5 free bets. Free bets valid for 7 days on sports, stake not returned, restrictions apply. T&Cs apply. https://sports.ladbrokes.com/en-gb/promotions/bet-%C2%A35-get-%C2%A320-register-now/\r\n\r\nEnjoy Loads of Acca Features\r\n18+. Acca Insurance: Min selection odds 1/10. Min Acca odds 3/1. Min. Pre-match straight line Accas only. 1 free bet up to £/€10 per customer/day, credited within 24 hrs, valid for 7 days, stake not returned. Odds Boost: select on account. Up to £50 at boosted odds. Min 1 boost per day. Comparison accurate as of 4/4/2018. T&Cs apply \r\n\r\n1-2-Free\r\n18+.UK&IRE only. In App only. Predictions required before first KO of selected matches. 90 mins result.Prize credited within 24 hours to verified customers. Free bet valid for 7 days. Stake not returned. Payment method restrictions and T&Cs apply.\r\n\r\nBest Odds Guaranteed\r\n18+. Bet type restrictions apply. Offer cap £/€50k per customer per day. Bets placed after the off don't qualify. If Rule 4 applies we pay bigger odds after Rule 4 deduction applies. T&Cs apply. \r\n\r\nhttps://sports.ladbrokes.com/en-gb/promotions/\r\n\r\n\r\nWe’re confident you’ll love the Ladbrokes Sports Betting app, but if you find something that you think we can improve, send your feedback to reviewladbrokes@ladbrokes.com \r\n\r\n18+, this is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please see below contact details for Gamble Aware in both UK and Ireland.\r\n\r\nUK: https://www.begambleaware.org and 0808 8020 133\r\n\r\nIreland: https://www.problemgambling.ie and 1800 753 753\r\n\r\nLadbrokes is operated by LC International Limited (Suite 6, Atlantic Suites, Gibraltar) and licensed (ref 54743) and regulated by the British Gambling Commission for persons gambling in Great Britain. For persons gambling outside Great Britain, Ladbrokes is licensed (ref 010, 012) by the Government of Gibraltar and regulated by the Gibraltar Gambling Commissioner.\r\n\r\nCopyright © 2018 Ladbrokes\r\n\r\nThis App is not endorsed or sponsored by Google for any of its contests or sweepstakes within this app and is solely the responsibility of LC International Limited. © 2018 Ladbrokes",
  "summary": "Bag Yourself the Best Acca - With more acca features we&#39;re your best bet.",
  "installs": "500,000+",
  "score": 3.010101,
  "ratings": 11096,
  "reviews": 4980,
  "price": 0,
  "developer": "Ladbrokes Mobile Development",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Aug 1, 2017",
  "updated": 1586276843000,
  "version": "6.3.0",
  "recentChanges": "Every time we release a version to the Google Play store we look to improve the performance and stability of the app. <br><br>Thank you for choosing Ladbrokes Sports",
  "appId": "com.mobenga.ladbrokes",
  "searchTerms": "sports betting"
 },
 {
  "title": "888sport: live sports betting on football & tennis",
  "description": "Choose from thousands of 888 sport betting markets across hundreds of events every day from around the globe, including all the big events in, football, tennis, golf, horseracing, snooker, darts, cricket and much more!\r\n\r\nGet top odds and choose from thousands of pre-match and live betting markets with 888sport!\r\n\r\nBet £10 Get £30 In Free Bets:\r\nTERMS & CONDITIONS:\r\nNew customers only (+18) · Minimum deposit of £10 · A qualifying bet is a ‘real money’ stake of at least £10 placed on any market · Minimum odds of 1/2 (1.5) · Free bets credited upon qualifying bet settlement and expire after 7 days · Free bet stakes not included in returns · Deposit method, withdrawal restrictions & full T&C apply: https://www.888sport.com/terms/offerTerms.htm\r\nUsers must be aged 18+: https://www.888sport.com/responsible-betting.htm.\r\n\r\n\r\nBet with 888 sport both pre-match and live on competitions including the Premier League, Champions League, World Cup Qualifiers, La Liga, Bundesliga, ATP World Tour, Glorious Goodwood, the King George V at Ascot, Premier League Darts and more!\r\nGet best 888 sport odds guaranteed on every single UK horse race and stream all the action to your mobile device!\r\nAnd find betting markets on political events, general elections, Brexit, President Trump and also TV shows like X Factor, The Voice, Love Island and more!\r\nTake your live betting destiny into your own hands with our Cash Out feature, and make sure to get price boosts and earn Free Bets on the action!\r\nAnd don't forget to check out the tables and ever-increasing video slots in the award-winning 888sport casino!\r\nDownload the app now and bet with 888sport on your mobile device or tablet, wherever, whenever you are.\r\nWith simple navigation and an easy-to-use platform, the app is where it’s at when it comes to quick and easy betting with 888sport.\r\n\r\nApp Features:\r\n⚽ Touch ID\r\nUpdate the new version of our mobile app to login with your fingerprint. Just allow the app to use Touch ID and get logging in faster than ever!\r\n🎾 Live heat map\r\nPlacing live bets? Then check out our heat map and in-play stats to give you that extra edge!\r\n🐎 Coupon navigation\r\n\r\nCheck out the tab on top our coupons in order to more easily place accas on the same markets, such as BTTS, total goals etc.\r\n\r\nUsers must be aged 18+ and gamble responsibly!\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. \r\nFor gambling addiction help and support, please contact Gamble Aware at:\r\nUK: \r\nCall: 0808 8020 133 or visit https://www.begambleaware.org/\r\nIreland: \r\nCall: 1800 753 753 or visit https: http://www.gambleaware.ie/\r\nWhen The Fun Stops Stop!",
  "summary": "Bet live &amp; get top odds on football, tennis, golf, racing &amp; more with 888 Sport!",
  "installs": "50,000+",
  "score": 1.62,
  "ratings": 321,
  "reviews": 238,
  "price": 0,
  "developer": "888 UK",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 27, 2017",
  "updated": 1569492364000,
  "version": "2.6",
  "recentChanges": "Bug fix",
  "appId": "com.rl888sport.rl",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports Betting Tips (Premium)",
  "description": "The 'Sports Betting Tips' app provides its users with daily sports betting tips with a high winning rate. Our expert staff analyzes the matches in detail and carefully prepares daily bets. You can find the betting tips with the highest chance of winning in awesomely designed 'Betting Tips' mobile application. Our experts analyze the matches by carefully following all the leagues. After the analyses, the selected matches are evaluated once again. Thus, we provide you betting tips with the highest chance of winning.\r\n\r\n'Sports Betting Tips' app strives to provide matches with high-rates to its subscribers. If you want to win, you can find the best betting tips in our application.\r\n\r\n'Sports Betting' app is an international mobile application. It presents the most successful betting tips to its subscribers all over the world.\r\n\r\nWe offer both free and VIP betting tips to our users. You can earn more with VIP bets. \r\n\r\nBy using 'Sports Betting Tips' mobile application;\r\nYou can get daily football tips.\r\nYou can get daily basketball tips.\r\nYou can get daily Champions League and Europa League tips.\r\nYou can chat with other users.\r\nYou can win with the world's best sports betting tips mobile app.\r\nYou can earn more than ever with VIP subscription.\r\n\r\nOur predictions team, give you the best sports bets by analyzing the odds on the best websites (sky bet, william hill, bet365, paddy power, oddset, oddsshark, tipico, unibet, betclick, netbet, betbull, betfair, betway and bwin) in the world.\r\n \r\nWe are constantly following these leagues; England Premier League (EPL), Germany Bundesliga (Bundesliga), Spain La Liga (La Liga), Brazil Serie A, Russia Premier League (RPL), Portugal Premier (Liga NOS), Belgium Premier (Jupiler Pro League), Argentina Superliga, China Super League (CSL), Japan J1 League ( J1 League), Major Soccer League (MLS), France Football Ligue (Ligue 1), Italy Serie A (Serie A), Turkey Super League (TSL), Holland Eredivisie (Eredivisie), UEFA Champions League (UCL), UEFA Europa League (UEL), Turkish Airlines EuroLeague (Euroleague), National Basketball Association (NBA)...\r\n\r\nWe are constantly following these teams; Manchester City, Manchester United, Chelsea, Liverpool, Tottenham, Arsenal, Paris Saint-Germain (PSG), Olympique Lyonnais (Lyon), Monaco, Olympique de Marseille, Bayern Münich, Borussia Dortmund, Leipzig, Bayer Leverkusen, Schalke 04, Salzburg, LASK, Rapid Wien, Qarabag, Club Brugge, Anderlecht, Flamengo, Palmeiras, Santos, Slavia Praha, Sparta Praha, FC Copenhagen, Midtjylland, Ajax, PSV Eindhoven, Real Madrid, Barcelona, Athletico Madrid, Sevilla, Valencia, Young Boys, Basel, Inter, Juventus, Lazio, Milan, Roma, Benfica, Porto, Sporting FC, Zenit, Krasnodar, CSKA Moskva, Shakhtar Donetsk, Dynamo Kyiv, Olympiakos, Fenerbahce, Besiktas, Galatasaray...\r\n\r\nWe are constantly following the performances of these players; Ronaldo, Messi, Neymar, Suarez, Griezmann, Pique, Sergio Ramos, Marcelo, Modric, Hazard, Bale, Benzema, Buffon, Dybala, Ibrahimovic, Salah, Harry Kane, Lewandowski, Muller, Gotze, Reus...\r\n\r\nTurn winning into a habit with our expert staff. Sports betting predictions are highly accurate.\r\n\r\nNote: The application only provides predictions for matches. It does not contain anything illegal.",
  "summary": "You can win with the world&#39;s best sports betting tips app. 90% success rate.",
  "installs": "100,000+",
  "score": 4.4166665,
  "ratings": 5485,
  "reviews": 2535,
  "price": 0,
  "IAPRange": "£15.00 - £199.99 per item",
  "developer": "Sports Betting Expert",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jun 22, 2019",
  "updated": 1575942295000,
  "version": "3.9.0.1.28",
  "appId": "com.akilliuygulamalar.expertbettingtips",
  "searchTerms": "sports betting"
 },
 {
  "title": "Unibet – Sports Betting App: Bet Football & more",
  "description": "Bet online with the best sports betting app on all upcoming 2018 events including Premier League bets, live football of European leagues and more: The F1 Grand Prix and bets on Horse Racing, Cricket and bet on Tennis with our best U.S. Open 2018 bets.\r\n\r\nThe Unibet online sport betting app covers all your favourite sports: football, rugby, golf, tennis, cricket, darts, F1, horse racing bets, greyhound racing and more. Never miss out on our best odds, live score updates, match stats and live streaming to your device on over 40,000 sporting events. We offer both pre-match and real-time in-play betting: in play bets brings more excitement – place a bet on live football, horse racing and other major events with live cash out in-play in our sportsbook!\r\n\r\nMultiply your winnings with our enhanced accas and special promos with profit boosts on cricket and the best free bets available on football bet specials, place your football bet acca now!\r\n\r\nAn exciting calendar of big events awaits in our sportsbook: \r\n\r\n• Your best bet: Football live betting on the 2018/19 Premier League, Champions League, Championship seasons and more. Top odds on international football bets and watch live football matches Including LaLiga\r\n• Bet live on Horses Racing: Place your horse bet online at the home of the most exciting horse racing from Ascot, Cheltenham and beyond! \r\n• Free Bets on Cricket: International tests and county cricket – we’re the official team sponsors of Warwickshire CCC!\r\n• Tips on Darts: Our collaboration with the PDC brings you the Unibet Premier League of Darts, Masters, Champions League, World Grand Prix…\r\n• Acca Bets on Rugby Union & Rugby League. You’ll find our best odds on England Rugby bets\r\n• Boost Bets on Boxing, F1 racing, golf betting and more: The best Vegas events, Monaco and beyond are all on Unibet\r\n\r\nOur sportsbook app stands out among the best betting apps: quick and easy to use so you can keep updated and bet in-play with live stream football and other events such as golf, tennis, basketball and horse racing. Want to be a bet victor in your favourite sports? Our app offers:\r\n\r\n• 24/7 bet, 365 days a year betting online on worldwide sports with our best odds\r\n• Receive football live score card updates and news with your favourite mobile sportsbook app\r\n• Enjoy single and combination punts and detailed bet history\r\n• Secure deposits and withdrawal options\r\n\r\nFormer Stan James customer? Stan James is now Unibet! First time on Unibet? Please use your email address or your Stan James username. Love casino games? Try our Unibet Casino app!\r\n\r\nThe app requires you to be over 18 and to have a valid Unibet account to play. We’re a member of the European Gaming & Betting Association (EGBA) and the Remote Gambling Association (RGA) and we’re proud to be a strong advocate of responsible gambling.\r\n\r\nUnibet Alderney Ltd is licensed by the UK Gambling Commission. Information about the Licence can be found under: https://secure.gamblingcommission.gov.uk/gccustomweb/PublicRegister/PRAccountDetails.aspx?accountNo=38906\r\n\r\nhttps://www.unibet.co.uk/betting\r\nhttps://www.facebook.com/UnibetUK/?brand_redir=105198596191711\r\nhttps://www.youtube.com/user/OfficialUnibet\r\n\r\n* £40 Money Back as Bonus on your First Bet + £10 Casino Bonus. 18+ www.begambleaware.org Min. odds 2/5, Sports Wagering x3, casino bonus credited next working day after 1st Deposit. Full terms and Conditions apply - https://www.unibet.co.uk/promotions/welcome-to-betting\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at:\r\n\r\nUK: https://www.begambleaware.org or 0808 8020 133\r\nIreland: http://www.gambleaware.ie or 1800 753 753\r\n\r\nUnibet\r\nBy Players, for Players.",
  "summary": "Best Betting App: Bet Online on Football, Horse Betting, Darts…",
  "installs": "50,000+",
  "score": 2.45,
  "ratings": 218,
  "reviews": 142,
  "price": 0,
  "developer": "Kindred Group",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Aug 3, 2017",
  "updated": 1588842251000,
  "version": "1.9.9.4",
  "recentChanges": "Thanks for using our app. Enable auto-updates to ensure you don’t miss the latest app enhancements.",
  "appId": "com.unibet.unibetpro",
  "searchTerms": "sports betting"
 },
 {
  "title": "BoyleSports Betting: Horse Racing, Football & More",
  "description": "Download the FREE Betting App & receive generous offers for new & existing customers.\r\n\r\n\r\nDOUBLE YOUR WINNINGS\r\n\r\n• All Premier League & selected football matches if a penalty is scored. T&Cs apply.\r\n\r\n\r\nFREE BETS\r\n\r\n• Offers on horse racing, rugby, tennis, golf, darts, snooker, cricket & more.\r\n• Best odds guaranteed on UK & Irish horse racing & greyhound races.\r\n\r\n\r\nGET PAID OUT ON EXTRA PLACES\r\n\r\n• Extra places paid out on major golf tournaments.\r\n• Cover more of the field at horse racing meetings including Cheltenham 2020 & the Grand National\r\n\r\n\r\nCOMBINED ODDS & BETBUILDER\r\n\r\n• Use BoyleSports’ new combined odds feature to choose up to three selections & turn them into one great price!\r\n• Build the bet you want with BoyleSports BetBuilder. Excellent for NFL & Super Bowl fans.\r\n• BetBuilder is available for major sports including NFL, NHL, NBA, rugby & football.\r\n\r\n\r\nALL SPORT ACCA LOYALTY & ACCA INSURANCE\r\n\r\n• Get a free £/€5 accumulator for every 5 x £/€5 accumulators you place. T&Cs apply.\r\n• If one leg of your 5+ Acca lets you down, we’ll give you a free bet up to £/€20. T&Cs apply.\r\n\r\n\r\nGOOGLEPAY\r\n\r\n• The BoyleSports app allows you to deposit safely & securely using GooglePay on your device.\r\n\r\n\r\nExcellent football odds & double winnings available on all major football betting tournaments, including Premier League, Euro 2020, FA Cup, Champions League & Europa League football. \r\n\r\nBecome part of the action & bet on your favourite boxing & UFC sports stars. Odds on Conor McGregor, Tyson Fury, Anthony Joshua as well as betting on all other major combat sports.\r\n\r\nBoyleSports prides itself in its horse racing product with daily free bet & extra place offers for major race meetings such as:\r\n\r\n• BoyleSports Irish Grand National\r\n• Royal Ascot\r\n• Dublin Racing Festival at Leopardstown\r\n• Cheltenham Festival\r\n• Punchestown Festival \r\n• Leopardstown Festival\r\n\r\nSponsoring the BoyleSports Irish Grand National for many years has helped BoyleSports become a horse racing authority on the Irish racing scene.\r\n\r\nIn 2019 BoyleSports became the proud principal sponsors of Birmingham City Football Club & also became sponsors of the BoyleSports World Grand Prix Darts & the BoyleSports Grand Slam of Darts.\r\n\r\n\r\nKey Terms:\r\n\r\n\r\nDouble Winnings\r\n\r\n18+. Opt in. UK/IRE customers only. Max Stake £/€20. Max free bet £/€500. 1st pre live single on selected markets. 90 mins only. Free/cashed out/combined Odds bets won't qualify. Free bet expires after 7 days. T&Cs apply.\r\n\r\n\r\nBest Odds Guaranteed\r\n\r\nBest Odds Guaranteed on all UK/Irish horse racing. Applies to UK/Irish races. Applies to UK/IRE customers. T&Cs apply.\r\n\r\n\r\nGet Paid out on Extra Places\r\n\r\nWe pay 1/5 odds 4 Places on selected meetings each day.\r\n12 or more must run.\r\n\r\n\r\nAcca Loyalty\r\n\r\n18+. Opt in. Min stake £/€5. Min combined odds of 3/1. Min 5+ settled legs. One qualifying acca per day. IRE/UK customers only. Free bet expires after 7 days. Cashed out/free/void bets do not qualify. T&Cs apply.\r\n\r\n\r\nAcca Insurance\r\n\r\n18+. Opt-In. Min stake £/€5. Max refund £/€20. Min odds 1/2. Bet must be placed & settled same day. 1 free bet per day & expires in 7 days. Free/void/cashed out bets won't qualify. UK/IRE customers. T&C's apply.\r\n\r\n\r\nFull Terms & Conditions on all offers: www.boylesports.com/promotions.\r\n\r\nThis is a real money gambling app. Please gamble responsibly & only bet what you can afford. If you believe you may have a problem with gambling, please seek help by contacting the following confidential organisations: BeGambleAware at 0808 8020 133 (UK) . Alternatively, visit https://www.begambleaware.org (UK) or https://gamblingcare.ie (IRE).\r\n\r\nBoyleSports is operated by BoyleSports (Gibraltar) Limited, a company registered in Gibraltar. BoyleSports is licensed & regulated by the Gambling Commission (Licence No: 000-039469-R319383-00 1) for customers in Great Britain & licensed by the Government of Gibraltar & regulated by the Gibraltar Gambling Commissioner (RGL 083 & 084) for all other customers",
  "summary": "Great odds on football betting &amp; horse racing. Free bet offers on all sports",
  "installs": "50,000+",
  "score": 4.35,
  "ratings": 623,
  "reviews": 407,
  "price": 0,
  "developer": "Boyle Sports",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Sep 11, 2017",
  "updated": 1586849575000,
  "version": "4.1.6",
  "recentChanges": "Thank you for using BoyleSports We make regular updates to improve your experience while using our app.<br><br>-Introducing GooglePay, BoyleSports app now allows you to deposit safely and securely using Google Pay on your device<br><br>-Combined Odds now available.Combine up to 3 selections into one great price<br><br>-Try BoyleSports new Bet Builder function which cover all live UK matches, Rugby Union &amp; NFL<br><br>-Multiples Made Easy<br><br>-Building your acca is now faster and easier with our intuitive coupon navigation",
  "appId": "com.cgsi.boylesportsnew",
  "searchTerms": "sports betting"
 },
 {
  "title": "138.com: Live Casino Games & Sports Betting App",
  "description": "Be a winner with the new 138.com app and grab your welcome bonus today!\r\n\r\nEnter the new 138.com Sportsbook and Casino app to discover the best instant wins and the best live sports betting markets. Play on the go 24/7, anytime, anywhere. Download and enjoy slots, Roulette, Poker, Baccarat and Blackjack, with live streaming TV dealers, and start winning real cash today. \r\n\r\nGet great odds on sports betting and enjoy our range of Casino games and promotions, all direct to your mobile, so you can play what you like, when you like. \r\nDownload 138.com now and try your luck at Casino jackpots and get instant cashback on huge real money wins. Plus, new customers can benefit from free spins and welcome promotions, so step this way for as much betting fun as you can handle. \r\n\r\nSportsbook\r\nEnjoy comprehensive coverage of all the top sports and events with a huge range of betting options and great odds on Football, Golf, Boxing, Tennis, Cricket, Horse Racing & Grey Hounds. Bet in-play on live games or wager you luck on an accumulator.\r\nBet on Premier League, Champions League, Europa League & FA Cup football matches as well as the Ryder Cup, PGA Tour & European Tour Golf. \r\nPlace your bets on all the major horse racing events, including the Cheltenham Gold Cup, The Grand National, Ascot & Epsom.\r\n\r\nCasino\r\nExperience all the action in our online Casino, with a great selection of the best Slots including; Mega Moolah, Rainbow Jackpots, Game of Thrones, Temple of Gold, Jurassic Park, Football Star, Mega Money Multiplier and 777 Burning Wins. \r\nAs well as slot machines, play classic table games in our Casino like Roulette, American Roulette, European Roulette Gold, Blackjack, Atlantic City Blackjack Gold, Double Joker Poker. With promotions that offer incredible bonuses, 138.com offers the best Casino action on your mobile.\r\n\r\nLive Casino\r\nSimply select your favourite game and start playing with real-money stakes at our live casino. Our online dealers will welcome you to play all of the Casino classics, including Roulette, Blackjack, Baccarat and Poker. Whether you’re on the go or at home, 138.com delivers the best real-life Casino betting experience direct to your mobile device! \r\nPlay Blackjack, Baccarat, Roulette and Texas Hold ‘Em Poker. Step inside our Casino with live streaming TV dealers. Simply log in, hit the tables and play all your favourite games 24/7.\r\nDownload the 138.com app now and enter the thrilling world of online Casino games. Play for real-money stakes & be a winner today.\r\nAbout 138\r\n138 is a market leader in online gaming in Asia, 138 have brought together over a decade’s worth of experience in online gaming to offer a unique Asian experience to our European customers.\r\n\r\nWe are Licensed in the United Kingdom, it is illegal for anyone under the age of 18 to gamble on our website and we do not permit anyone under the age of 18 to register. We have verification systems in place to assist us in preventing any such registration. No winnings will be paid to anyone who is found to have abused this and we reserve the right to report any such person to the authorities.\r\n\r\nWe may as part of our normal sign up checks, ask to see your identity documents in order to verify your age. Until we receive your documents you will be unable to use our site. Customers established to be under 18 will have all deposits refunded and any winnings will be forfeited.\r\nCustomer service is available 24/7 365 days a year by Email or Live Chat.\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. \r\n\r\nFor gambling addiction help and support, please contact Gamble Aware at (0808 8020 133) or visit https://www.begambleaware.org/\r\nOur Website: https://138.co.uk/",
  "summary": "Sportsbook &amp; Live Casino. Play Real Money Slots, Roulette, Baccarat &amp; Blackjack",
  "installs": "10,000+",
  "score": 4.25,
  "ratings": 12,
  "reviews": 6,
  "price": 0,
  "developer": "Fesuge Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jun 20, 2018",
  "updated": 1544725684000,
  "version": "1.0.1",
  "recentChanges": "New performance upgrade",
  "appId": "co.uk138.app",
  "searchTerms": "sports betting"
 },
 {
  "title": "bet365",
  "description": "bet365, the world’s favourite online sports betting company.\r\nWe offer an extensive range of pre-match and In-Play markets, together with top sporting action streamed live to your device.\r\nOur app offers an unrivalled user experience;\r\n\r\nBet In-Play with the fastest, most extensive service on the market\r\nTake control of your bets with our Cash Out, Auto Cash Out and Partial Cash Out features\r\nKeep up-to-date with the action using a range of tailored Match Live Alerts\r\nTrack the action across a wide range of sports with our Match Live service\r\n\r\nLIVE STREAMING\r\nWatch industry-leading Live Streaming including Soccer, Tennis and Basketball\r\nWatch Live Streaming of UK & Irish Horse Racing\r\n\r\nAPP FEATURES\r\nUse dedicated team pages to make your Soccer selections\r\nAccess top events from the homepage with quick links\r\nFull A-Z Sports menu and Offers menu available for quicker navigation\r\nAccess Casino, Games, Poker and Vegas products \r\n\r\nMANAGE YOUR ACCOUNT\r\nMake secure deposits and withdrawals\r\nChoose from a wide range of payment methods\r\nUse your existing bet365 account or sign up now\r\n\r\nThis is a real money gambling app. \r\nYou must be 18 or over to have a bet365 account.\r\nbet365 is committed to Responsible Gambling.  \r\nFor UK customers additional support and advice can be found at www.gambleaware.co.uk or by calling 0808 8020 133.\r\nFor Ireland customers additional support and advice can be found at GambleAware.ie or by calling 1800 753 753.\r\n\r\nPlease read the bet365 Privacy Policy (see link below) before installing this application. By installing and opening the application you are accepting this policy.",
  "summary": "bet365, the world’s favourite online sports betting company.",
  "installs": "1,000,000+",
  "score": 4.338346,
  "ratings": 2673,
  "reviews": 1393,
  "price": 0,
  "developer": "Hillside Technology Limited",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 29, 2017",
  "updated": 1586166335000,
  "version": "5.0.16.1",
  "recentChanges": "Thanks for using bet365. To make our app better for you, we make regular updates to improve performance and fix issues based on your feedback.",
  "appId": "com.bet365Wrapper.Bet365_Application",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports Betting Tips & Sports Picks by KingPin.pro",
  "description": "Do you want to win your sports picks? Get your betting tips from KingPin.pro We provide a listing of the top sports bettors in the world on our \"Top KingPins\" section. Here you can view the stats and betting history of each sports bettor.  This is one of the best sports betting apps on the google play store.  \r\n\r\nWe have the top NFL picks, NCAAF PICKS, College Football Picks, NBA Picks, NHL Picks, Soccer Picks, Tennis Picks, and much more! Follow the best sports bettors on www.KingPin.pro",
  "summary": "NFL picks, NCAA Picks, NHL Picks, and NBA Picks. Win at sports betting.",
  "installs": "10,000+",
  "score": 4.52,
  "ratings": 304,
  "reviews": 290,
  "price": 0,
  "IAPRange": "£8.99 - £95.99 per item",
  "developer": "www.KingPin.pro LLC",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 18, 2019",
  "updated": 1582412711000,
  "version": "2.0",
  "recentChanges": "Enhanced Security and bug fixes.  We also increased the performance of the app.",
  "appId": "com.kingpin",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sky Bet: Sports Betting on Football & Horse Racing",
  "description": "Sky Bet, sponsors of the Football League, bring you the most advanced sports betting app, so you can check your accumulators, singles and the latest in-play odds anywhere.\r\n\r\nAs a Sky Bet Customer you can enjoy some fantastic features on the app:\r\n• Sky Bet Club: £5 Free Bet from Sky Bet Club every week you place £25 of single or accumulator bets on any sport\r\n• Get the Best Odds Guaranteed: If the starting price is bigger than the price you’ve taken on horse or greyhound racing in the UK or Ireland, we’ll match it\r\n• Bet & Watch: Simply bet the qualifying value with Sky Bet on any UK or Ireland horse race and get to watch it live for free\r\n• My Bets: track all your bets and get bet status, match stats and easily place, track and cash out all your bets all in one place\r\n• In Play Every day, we give you a huge choice of exciting In-Play markets, across almost every sport\r\n• In Play – Stats: After kick off, keep up-to-date with our detailed In-Play match stats fed direct from Sky Sports\r\n• RequestABet™: Launch the app, hit RequestABet™ and combine all your hunches on a match into one perfect bet\r\n• Cash Out: Every second counts. Cash Out quickly and easily in a click on more sports and markets than ever\r\n• The UK’s favourite app: Our quick and easy-to-use sports betting app is the UK’s favourite according App Store Ratings\r\n• Touch ID: Get straight into the action quickly and securely with Touch ID\r\n• Soccer Saturday Price Boost: packs three of the day’s big games into one bet with supercharged odds\r\n• Free Bets: Each month, we give away £5m of free bets – don’t miss your share of £60m every year\r\n• Price Boosts: Boosted odds, bigger returns - Win extra with boosted odds on over 250 markets every week – just look for the Price Boost symbol\r\n• Responsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling\r\n• Customer Service: We’re here to help and support 24/7 by phone, chat, email or social media – whatever suits you\r\n\r\nWhen the fun stops–stop!\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. Sky Betting and Gaming are committed to responsible gambling. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/.\r\n\r\nCustomers in the United Kingdom: Sky Bet is licensed and regulated by the Gambling Commission (licence number 38718). All other customers: Sky Bet is licensed and regulated by Alderney Gambling Control Commission\r\n\r\nThe Sky Bet app is brought to you by Bonne Terre Limited, an Alderney registered company wholly owned by The Stars Group Inc. and licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Bet is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group. The Sky trademarks used in the app are owned by the Sky UK Limited and its affiliated companies and are used under license. To place a bet with Sky Bet you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Bet. Customers located outside of the UK or Ireland will be prohibited from using this app.\r\n\r\nPlease Note: Google is in no way linked or associated with this or any other competition / content run in this app.",
  "summary": "Sky Bet is available on your Android device",
  "installs": "1,000,000+",
  "score": 4.5708547,
  "ratings": 17456,
  "reviews": 7142,
  "price": 0,
  "developer": "Sky Betting and Gaming Apps",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1584954267000,
  "version": "2.7.1",
  "recentChanges": "In the latest release we are complying with new credit card restrictions on Google Pay. Please note, you must now use a debit card to deposit funds into your account. General Bug fixes.",
  "appId": "com.skybet.app.skybet",
  "searchTerms": "sports betting"
 },
 {
  "title": "NetBet Sport UK - sports betting, live betting",
  "description": "JOIN NOW AND GET UP TO A £50 REFUND ON YOUR FIRST DEPOSIT*.\r\n\r\nWelcome to the new and improved NetBet app, giving you the ultimate online betting experience. Place live and pre-live sports bets quickly and easily on your Android device!\r\n\r\nDownload the app for free and enjoy the following features:\r\n\r\nWith an extensive range of bets on offer (OVER 1,000 UNIQUE BET TYPES ON OVER 45 DIFFERENT SPORTS) you can live the NetBet experience whenever, and wherever, you want. Become a master of the game and bet on over 25,000 PRE-LIVE EVENTS PER WEEK and on more than 60,000 LIVE EVENTS EVERY MONTH! \r\n\r\nWhether you’re a pro or a beginner, the app has something for everyone. With its intuitive interface, it’s easy to use, simple and fast. After just a few minutes we’re pretty sure you won’t be able to put your phone down! \r\n\r\nAs a NetBet member, you can take advantage of several features on the app. For example, you can: \r\n\r\n- PLACE YOUR ACCUMULATORS EASILY with our excellently designed betting slip .\r\n- TAKE CONTROL of your bets on your all favourite sports with our CASH OUT feature.\r\n- Discover and enjoy our EXCLUSIVE RANGE OF OFFERS.\r\n- DEPOSIT AND WITHDRAW SAFELY at any time.\r\n - Keep updated in real time and enjoy tailored rewards thanks to PUSH NOTIFICATIONS .\r\n- Check your betting and transaction history.\r\n- Experience UNIQUE MINUTE MARKETS BETTING (Fast Market feature).\r\n- WIN UP TO £20,000 A WEEK with our GOLDEN GOAL PREDICTION GAME\r\n- Bet on 24/7 LIVE ACTION with our exciting and MARKET-LEADING VIRTUAL SPORTS  \r\n\r\nWe are already in the process of working on new features, and hope to be able to share them with you very soon. \r\n\r\nAt NetBet we also value your opinion, so don’t hesitate to contact us to tell us your thoughts. To do so, write to us at support@netbet.com.\r\n\r\nYou must be 18 or over and registered with NetBet to participate in any betting activity.  Full details can be found on our website: www.netbet.co.uk. \r\n\r\nPlease remember to Bet Responsibly. For the facts see: https://www.begambleaware.org/ and  0808 8020 133\r\n\r\nNetBet is fully licensed by the UK Gambling Commission under license number: 000-039170-R-319343-007\r\n\r\n*New Customers Only/ Playthrough required/ T&Cs apply – find out more at m.netbet.co.uk/welcome-offer/  (desktop link: www.sport.netbet.co.uk/welcome-offer)",
  "summary": "Our free online live football &amp; sports gambling app.",
  "installs": "10,000+",
  "score": 3.392857,
  "ratings": 56,
  "reviews": 33,
  "price": 0,
  "developer": "NetBet Apps",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Aug 7, 2017",
  "updated": 1504184131000,
  "version": "1.0.3",
  "appId": "netbet.sport.uk",
  "searchTerms": "sports betting"
 },
 {
  "title": "Marathonbet Sports Betting",
  "description": "The Marathonbet Mobile App\r\n\r\nInstalling the Marathonbet mobile App provides the best tool for sportsbook lovers to get extraordinary prices on a huge variety of pre-match and Live events and markets.  \r\n\r\nGet amongst the action and download the app to your mobile device today!\r\n\r\nA MASSIVE RANGE OF MATCHES AND MARKETS\r\nThe Marathonbet App is the latest tool for sports fans to get the latest markets on a huge variety of sports like Football, Horse Racing, Tennis, Basketball and more. \r\nAt Marathonbet we have competitive prices and one of the widest range of markets you will find. Bigger odds mean higher returns. With simple navigation, the App is perfect for betting on the move when you’re out and about meaning you can get closer to the action wherever you are.\r\n\r\nA LEADER IN LIVE BETTING\r\nIf in-play betting is your interest, you will find it difficult to match the sheer volume and choice that we offer. Whatever your sport, you’ll find great odds with statistics and animations to help follow your events.   \r\n\r\nWIDE RANGE OF PAYMENTS & FAST WITHDRAWALS\r\nThe super-quick Marathonbet App allows players to deposit and withdraw funds quickly. Place bets and bank your winnings using a selection of payment methods including Bank Transfer, Credit and Debit Cards, Skrill, Neteller, Paysafecard and more.\r\n\r\nTHE BEST CUSTOMER SUPPORT\r\nUse the App to contact our dedicated customer support team 24 hours a day, seven days a week via chat, email, telephone and Facebook. We’re on hand to resolve your issues promptly, giving you more time to do what you enjoy best.\r\n\r\nLet us know your feedback about the App. Rate it today!\r\n_________________________________________________________________\r\nThis is a real money gambling app. You must be aged 18 years or over to have a Marathonbet account. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/\r\n\r\nmarathonbet.co.uk is a trading name of Marathon Alderney Ltd, a company registered in Alderney (reg no 1686) with registered offices at 2 Victoria Street, Alderney, GY9 3UF. Marathon Alderney Ltd is regulated by the Alderney Gambling Control Commission (AGCC) and by the UK Gambling Commission in relation to custom from within the UK.\r\n \r\n*Marathonbet is top-ranked for number of live events (Source: Online Gambling Quarterly, February 2018).\r\nhttps://view.publitas.com/mecn/online-gambling-quarterly/page/45",
  "summary": "Marathonbet mobile App provides the best tool for sportsbook lovers",
  "installs": "5,000+",
  "score": 3.1363637,
  "ratings": 44,
  "reviews": 24,
  "price": 0,
  "developer": "Marathon Alderney Ltd",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests",
  "released": "Sep 10, 2018",
  "updated": 1580800835000,
  "version": "3.4.0",
  "recentChanges": "- live bets now show more information;<br>- the user interface of the mobile app has been improved;<br>- minor errors have been rectified and the app has been optimised.",
  "appId": "com.marathonbet.mobile",
  "searchTerms": "sports betting"
 },
 {
  "title": "Coral Sports & Casino",
  "description": "It’s the thrill of seeing your horse come home first. It’s seeing the net bulge and knowing that you called it right. It’s betting on the sports you love, with great features and boundary-pushing offers. It’s the best games, from people who understand why you play. The Coral Sports Betting & Casino app brings you all this and much more.\r\n\r\n\r\nFeatures include:\r\n\r\n● Correct4. Our weekly free-to-play game. Correctly predict four match stats and win £50 cash.\r\n\r\n● Fail to Finish. If your horse fails to finish a race, get your money back as a Free Bet up to £10. Available on selected meetings.\r\n\r\n● AccaPlus – The Best Acca Bonus. When your acca comes in, get 10% extra as a Free Bet, up to £100.\r\n\r\n● Build Your Bet. Choose from hundreds of football betting markets, create your own unique bets and see the odds instantly. \r\n\r\n● Best Odds Guaranteed on greyhound racing and UK and Irish horse racing.\r\n\r\n● Live streaming for ALL UK Horse Racing, selected Greyhound meetings, football including La Liga and Serie A. Plus, Tennis, Rugby, Darts and more!\r\n\r\n● Cash Out your bet before an event has finished on Football, Tennis, Darts and Snooker markets including partial Cash Out.\r\n\r\n● Live Casino lets you play with real casino dealers on Roulette, Blackjack and Live Baccarat any time.\r\n\r\n● Over 240+ exciting games including all your favourite table games and slots including Rainbow Riches, Starburst, Big Banker, Fishin’ Frenzy and more.\r\n\r\n\r\n\r\n\r\n●New Customer Offer Sports:\r\n18+ Eligible UK+IRE players. Paypal & some deposit & bet types excl. Min first £5 bet within 14 days of account reg at min odds 1/2 = 4x £5 free bets. Free bets valid for 7 days, stake not returned. No cashout, restrictions + T&Cs apply\r\n\r\n●New Customer Offer Casino:\r\n18+. New customers only. Min spend £10 on qualifying games. Certain deposit types excluded. £50 Bonus subject to 40x wager req. Must accept within 24hrs, valid for 48 hours. Player restrictions and T&Cs apply.\r\n\r\n●Correct 4:\r\n18+. UK & IRE only. Online & Mobile. Max 1 entry per customer per game week. Any entries after kick off of selected match will not be eligible. 4 correct answers for £50 cash prize. 3 correct answers for £2 free bet. 2 correct answers for £1 Free bet. Valid for 7 days. T&C's Apply.\r\n\r\n●Fail to Finish:\r\n18+ Eligible online customers only. Applies to first real money single win/EW bet of £1+ from 6pm the day prior to race. Selected races only. £10 max free bet credited within 24 hrs, valid for 7 days on racing only. Free bet stake not returned in any winnings. T&Cs apply.\r\n\r\n●Acca Plus:\r\n18+. UK&IRE. Online & mobile. Min odds 6/4 per acca. Min £1 bet to qualify. Excludes cashout & specials. Boost paid within 24hrs as a free bet up to £100; valid 7 days. 1 Boost paid on first acca placed daily . T&Cs apply\r\n\r\n●Build Your Bet:\r\n18+. UK&IRE only. Prices may fluctuate. Selected markets only. T&Cs apply.\r\n\r\n\r\n\r\n\r\nWe’re confident you’ll love the Coral Sports Betting & Casino app, but if you find something that you think we can improve, send your feedback to reviewcoral@coral.co.uk\r\n\r\n18+, Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please see below contact details for Gamble Aware in both UK and Ireland.\r\n\r\nUK: https://www.begambleaware.org and 0808 8020 133\r\n\r\nIreland: https://www.problemgambling.ie and 1800 753 753\r\n\r\nCoral is operated by LC International Limited (Suite 6, Atlantic Suites, Gibraltar) and licensed (ref 54743) and regulated by the British Gambling Commission for persons gambling in Great Britain. For persons gambling outside Great Britain, Coral is licensed (ref 010, 012) by the Government of Gibraltar and regulated by the Gibraltar Gambling Commissioner.",
  "summary": "Join Coral today, place a bet of £5 and receive £20 in Free Bets!",
  "installs": "500,000+",
  "score": 3.27,
  "ratings": 3011,
  "reviews": 1850,
  "price": 0,
  "developer": "LC International Limited",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Aug 1, 2017",
  "updated": 1580163978000,
  "version": "6.3.1",
  "recentChanges": "Everytime we release an update to the Play Store we look to improve stability. We have been listening to your feedback and working hard behind the scenes to fix a number of bugs too.<br><br>To make it easier and faster to find what you want, when you want it, we&#39;ve improved the navigation and design across all of the Account and Banking pages within the app. We have also made a number of improvements to our betslip making it far easier to place a bet. <br><br>The smart money&#39;s on Coral",
  "appId": "com.galacoral.android",
  "searchTerms": "sports betting"
 },
 {
  "title": "BetQL - Sports Betting Data",
  "description": "BetQL is a sports betting app that will take your online sports betting to the next level! See the latest odds, lines, sharp picks, public betting percentages and more all in one place. BetQL allows you to create custom sports betting dashboards and save them for later. BetQL also features a bet tracker that you can track all your wins and losses on no matter which sportsbook you are betting with!\r\n \r\nCompatible Sportsbooks\r\n \r\nBetQL works closely with all sportsbooks to ensure that we are showing the most live updated lines, odds, and totals. Below are a few sportsbooks you can find info on with BetQL:\r\n \r\nDraftkings Sportsbook\r\nFanduel Sportsbook\r\nBetStars\r\nMGM\r\nPointsBet\r\nWilliam Hill\r\n\r\nPro Sports Available\r\n\r\nBetQL has you covered for all of the most popular professional sports. BetQL will help you find the best betting tips, football predictions, basketball lines, baseball odds, and hockey totals. No matter which sport you bet on most BetQL has the data to help you cash more tickets! \r\n \r\nCollege Sports Available\r\n \r\nBetQL can even provide insights and analytics on college games! Using BetQL you will have a clear advantage over the sportsbooks for your college sports betting. Find the most advantageous college football odds, college basketball lines, and use our value rating to find great underdog picks both for college football and college basketball\r\n\r\nFootball Season is upon us and BetQL is ready. If you are going to be betting college football or the NFL this season then BetQL is a must. BetQL has you covered when it comes to NFL live betting, odds, spreads, and best bets. For college football BetQL has best bets for every major college football conference including the Independents. \r\n\r\nBetting on sports and tracking your best is easier than ever with BetQL. Stop making bets based off your gut and start making bets based off data. Try BetQL and start cashing more tickets today!",
  "summary": "The app to outsmart the Vegas bookmakers. Powerful analytics for sports betting.",
  "installs": "50,000+",
  "score": 3.47,
  "ratings": 273,
  "reviews": 128,
  "price": 0,
  "IAPRange": "£4.49 - £239.99 per item",
  "developer": "RotoQL Inc",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Apr 11, 2018",
  "updated": 1582658206000,
  "version": "3.5.3",
  "recentChanges": "- XFL Schedule Fix<br>- NCAAF Small School Images<br>- Bug fixes and performance improvements",
  "appId": "com.rotoql.betql",
  "searchTerms": "sports betting"
 },
 {
  "title": "Spreadex Sports Betting",
  "description": "The Spreadex Sports Betting app is the only app that allows you to place both sports spread bets and sports fixed odds bets.\r\n\r\nDownload the app today to bet on thousands of sporting events from around the world.\r\n\r\nSee below for some of the Spreadex Sports Betting app’s features:\r\n\r\n• Bet quickly and securely using our PIN login\r\n• Build your own football bets with our Bet-Builder markets\r\n• Watch matches and events while you bet via our Live Streaming\r\n• Bet in-play with 3 cash out options; auto, one-click or partial\r\n• Tab between spread betting or fixed odds betting prices and view in decimal or fractional format\r\n• Analyse our pre-match football stats on all domestic, Champions League and Europa League matches\r\n• Monitor matches or events using our in-play match centres\r\n\r\nWe are sure that you will love our app, but if you see something that you would like improved email info@spreadex.com.\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. 18+ For gambling addiction help and support, please see below contact details for Gamble Aware in both UK and Ireland.\r\n\r\nUK: https://www.begambleaware.org and 0808 8020 133\r\nIreland: http://www.gambleaware.ie and 1800 753 753\r\n\r\nIn relation to spread betting, Spreadex Ltd is authorised and regulated by the Financial Conduct Authority. Spread betting carries a high level of risk to your capital and can result in losses larger than your initial stake/deposit. It may not be suitable for everyone so please ensure you fully understand the risks involved.\r\n\r\nIn relation to fixed odds and casino, Spreadex Ltd is licensed and regulated in Great Britain by the Gambling Commission under licence no 8835.\r\n\r\nIn relation to casino betting outside of Great Britain, Spreadex Ltd is operating under an Alderney Gambling Control Commission approved Business Association with AGCC Class II License Holder, Net Entertainment Alderney Ltd, License #084.",
  "summary": "Place both sports spread and fixed odds bets on thousands of sporting events.",
  "installs": "5,000+",
  "score": 4.1666665,
  "ratings": 6,
  "reviews": 2,
  "price": 0,
  "developer": "Spreadex Ltd",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Sep 13, 2017",
  "updated": 1582792978000,
  "version": "2.10.5",
  "recentChanges": "Added bio login.",
  "appId": "com.spreadex.sports.phone",
  "searchTerms": "sports betting"
 },
 {
  "title": "BetBull: Sports | Tips | Casino",
  "description": "Welcome to the BetBull sports betting and casino app. Featuring betting on all sports, top online slots games and a community of tipsters on your phone.\r\n\r\nJoin BetBull today and get up to £100 free bets & bet on the best UK Tipsters’ exclusive tips. T&Cs Apply\r\n\r\nGet excited, follow each tipster bet, celebrate the wins & claim your place at the top! BetBull is a betting app that lets you follow each bet that top tipsters make on football, Japanese horse racing, Australian horse racing &more.\r\n\r\nSee 100s of bets & bet on Accas from tipsters with a single tap, follow live highlights & chat with 1000s of players betting on the go.\r\n\r\nFEATURES\r\n• Get up to £100 Free Bets *T&Cs Apply\r\n• Prove yourself as a Football & Sports tipster & climb the BetBull Leaderboards\r\n• Follow tipsters with top bets & results\r\n• Prove yourself as a top slots player\r\n• Chat to fans during live acca bets\r\n• Take advantage of odds boosts & Cash Out\r\n\r\nJoin the BetBull community, bet with top tipsters & make your own bets\r\n\r\nWELCOME OFFER\r\nGet up to £100 in Free Bets when you deposit and bet up to £100 on sports. T&Cs Apply\r\n\r\nPOWER UP\r\nUnlock rewards when your bet wins! Free bets, odds boosts (up to 30%) & Acca insurance on our betting bonus wheel\r\n\r\nFOLLOW TIPSTERS\r\nFind & follow bets placed by our betting league of top tipsters: sort by popular bets, top yielders & top winners\r\n\r\nTOP BRANDED SLOTS\r\nPlay our top slots game wherever you are including: Who Wants to be a Millionaire™, Game of Thrones™, Immortal Romance, Tiki Mania and 9 Masks of Fire\r\n\r\nNEVER BET ALONE\r\nConnect with other players & chat on in-play bets; see winning bets, who they are betting on next & get alerts every time they place an Acca bet\r\n\r\nLEADERBOARDS\r\nSearch betting leaderboards, find top sports tipsters & challenge them! Back winning bets to climb the rankings & get bonuses.\r\n\r\nCASH OUT YOUR BET\r\nCash out puts YOU in control of your bet.\r\n\r\nBetbull.com is operated by Betbull Games Limited, a company registered in Malta with registration number C87520 and having its registered address at Elite Business Centre, Trejqa ta' Box Box, Msida MSD1840, Malta. Betbull Games Limited is licensed and regulated by the UK Gambling Commission (license reference number: 53933) for provision of services to the United Kingdom. Under 18s are strictly forbidden from gambling on this website. Underage gambling is an offence. © Betbull.com 2019 | Gambling can be addictive, please play responsibly.Responsible Gambling: This is a real money gambling app. Please gamble responsibly & only bet what you can afford. For gambling addiction help & support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org\r\n\r\nWelcome Offer T&Cs\r\n• New users registered after 06/04/2020 only. Deposit & bet £20-100 to get 4 free bets matched to deposit amount. Free bets unlocked when qualifying sports bets of £20-100 placed within qualifying period\r\n• Qualifying bet min odds 1/2 (1.5)\r\n• Qualifying period runs for 7 days from registration date\r\n• All promotions limited to 1 per customer per household\r\n\r\nFree Bet Rules\r\n• To use free bet, bet must have odds of 1/1 (2.0) or more. Must take odds given in the market\r\n• Accumulators or system bets with 3+ selections only\r\n• Expires 7 days after credit.\r\n• Can’t be combined with other promotions including Power Ups\r\n• Free Bets have no monetary value & can’t be exchanged for account balance\r\n• Stakes not included in any returns nor can be cashed out\r\n• Can’t be used on BetBull Casino\r\n• All winnings credited in cash & can be withdrawn\r\n• Betbull reserves the right acting reasonably to withhold, restrict or cancel this offer from individual account holders in breach of these terms and conditions or in breach of our general promotion terms. General Promotions Rules: https://m.betbull.com/docs/bonus-rules.html & T&C: https://m.betbull.com/docs/terms.html",
  "summary": "Sports Betting, Slots &amp; Games",
  "installs": "100,000+",
  "score": 3.9711287,
  "ratings": 3814,
  "reviews": 1680,
  "price": 0,
  "developer": "Betbull Limited",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests",
  "released": "Aug 21, 2017",
  "updated": 1588181637000,
  "version": "Varies with device",
  "recentChanges": "Thanks for downloading the BetBull app and becoming a part of our betting community. In this update we have made a few behind the scenes improvements to our app and applied some small bug fixes.",
  "appId": "com.betbull.betbull",
  "searchTerms": "sports betting"
 },
 {
  "title": "Virtual Sports Betting Prediction Game - Kuponstar",
  "description": "How confident are you in your betting skills?\r\nKuponstar is a mobile application that allows you to bet with virtual money completely free of charge and to win prizes while having fun and testing your sports prediction ability. Our application is by no means a gambling tool, you can not win or loss real money using that application.\r\n\r\nNo real money, Just virtual currency and lots of excitement\r\nWhen you download the application, a certain amount of virtual money is loaded into your account initially and you bet using this virtual money. You win prizes with the virtual money you earn as a result of your bets. In-game virtual money can in no way be bought or sold for real money.\r\n\r\nKeep track of your bet statistics, race with your friends\r\nYou can keep track of your bet statistics such as how many bets did you win and loss, what is your maximum winning odd or what is your maximum winning amount.\r\nYou can also race with your friends by checking your rank in leaderboard in a social environment. You can also see the bets of other players and get some ideas in a social environment.\r\n\r\nLots of sports and league options\r\nIn Kuponstar game, there are lots of sport types such as Football/Soccer, basketball and volleyball. In each update, new sport types will be available. There are hundreds of league options and you can find almost all popular leagues for this sport types such as Premier League, La Liga, Bundesliga, Serie A, Champions League, NBA and Euroleague.\r\n\r\nLegal Disclaimer\r\n- By playing this game, nobody can win or lose real money. \r\n- This game is only for mature users.",
  "summary": "Virtual sport betting prediction game. No real money, just lots of excitement.",
  "installs": "1,000+",
  "score": 4.9310346,
  "ratings": 29,
  "reviews": 21,
  "price": 0,
  "developer": "GoyGoy Yazılım",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Feb 12, 2020",
  "updated": 1588682763000,
  "version": "1.3.2",
  "recentChanges": "Esport matches (Counter-Strike GO, Dota 2, and League of Legends) added.",
  "appId": "com.goygoy.kuponstar",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports bet",
  "description": "Sports bets app is An Android app developed by a group of professionals In the field of sports aimed at providing daily Free but accurate betting tips to punters..We scrutenize daily sure Bet tips for maximum gains on the stakes,\r\nWe offer bet tips mostly soccer tips from all leagues accross the globe... download our app and live to testify your experience with us",
  "summary": "For daily Accurately analysed sports betting tips",
  "installs": "10,000+",
  "score": 3.72,
  "ratings": 187,
  "reviews": 98,
  "price": 0,
  "developer": "SOCCER PREDICT",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Nov 2, 2019",
  "updated": 1572703888000,
  "version": "9.6",
  "appId": "sports.bettips",
  "searchTerms": "sports betting"
 },
 {
  "title": "BetVictor - Bet on Football, Horse Racing & Sport",
  "description": "Sign up with BetVictor today and we’ll give you the choice of two fantastic welcome offers to use as soon as you get started.\r\n\r\nWelcome Offer 1:\r\n\r\n\r\nWhen you wager £10 within your first 7 days, we’ll give you £70 in Casino Bonuses. That’s a £20 Slots Bonus, a £20 Table Games Bonus, a £10 Blackjack Bonus, a £10 Roulette Bonus and a £10 Game Show Bonus. Click here for full T&Cs https://bit.ly/2Je8qAZ.\r\n\r\nNew customers only. Deposit via Debit Card only and wager £10 within 7 days of opening new account. Receive 1x £10 Free bet, 2 x £10 bonuses, 2 x £20 bonuses for selected games (for selected games, up to 60x wagering. Bonus 3 day expiry).\r\n \r\nWelcome Offer 2:\r\n\r\nIf sports are more your thing, when you place a £5 bet, we’ll give you £20 in Free Bets for any sports market, along with a £10 Casino Bonus. Click here for full T&Cs https://bit.ly/32v9YyF.\r\n\r\nNew Customers only. Deposit and place a £5 qualifying bet at odds of 2.00 or greater within 7 days of opening a new account; excludes cashed out bets. Receive 2x £10 Sports/Virtual Sports Free Bets, valid on set events only at odds 2.00 or greater, expires in 7 days, plus a £10 Casino Bonus, expires in 7 days. Wager the Casino Bonus 35x to withdraw winnings, game weighting applies. Payment Cards only. Geographical Restrictions and T&Cs Apply, See Below. Please Gamble Responsibly\r\n \r\nWith a whole host of new games and Live Casino titles arriving each week, along with an industry leading Sportsbook, there has never been a better time to join BetVictor.\r\n\r\nOur bespoke Live Casino places you in the heart of the action from the Casino floor, whilst your favourite slots, including the newest titles, are ready to play in the BetVictor Casino.\r\n\r\nBet on the latest football, horse racing and tennis fixtures straight from your app, whether it be prior to kick-off or during the action in play.\r\n\r\nCreate your own markets with our exclusive Bet Builder product. Here you can add in a variety of selections to make your own bet, specific to how you see the event playing out.\r\n\r\nThe latest upgrade to our Casino Lobby features a clearer, modernised display. Our Native Games Tab now features Roulette & Blackjack, all available to load with super-fast speed when you play within the App.\r\n\r\nThe BetVictor Sports Betting & Casino App offers you unparalleled speed and security with Touch ID. If you have any question regarding the app or security, feel free to reach out to us via our 24hour chat service.\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only what you can afford to. For gambling addiction help and support, please Contact Gamble Aware UK (call 0808 8020 133 or visit begambleaware.org) or Problem Gambling Ireland (call 089 241 5401 or visit problemgambling.ie )",
  "summary": "Sport Betting Online: UFC, Rugby &amp; Premier league: Liverpool, Chelsea, Arsenal",
  "installs": "100,000+",
  "score": 4.4076085,
  "ratings": 1851,
  "reviews": 1054,
  "price": 0,
  "developer": "BetVictor Ltd.",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Aug 4, 2017",
  "updated": 1589263920000,
  "version": "5.12.0.21255",
  "recentChanges": "We make regular updates and improvements to ensure you get the best betting experience with one of the fastest betting app on the market! If you like what we do, please take a moment to rate our app and let us know!",
  "appId": "com.betvictor.bettingapp.uk",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sportingbet UK Betting: Football, Tennis & Racing",
  "description": "WATCH live events, bet IN PLAY, TRACK your bet, EDIT your bet, BUILD a BET and CASH OUT on 30+ sports and THOUSANDS OF MARKETS wherever you are with the Sportingbet sports betting app.  Then, after the final furlong, enter our CASINO to play table games like blackjack and roulette, studio games like Dream Catcher and Deal or No Deal, or any of your favourite SLOTS like Book of Ra, Starburst and Buffalo Blitz.\r\n\r\n💰 Welcome offer 💰\r\nGet the best football betting experience on your phone with Sportingbet. Sign up today and win your first bet or get up to £10 back as a FreeBet.\r\n\r\nWhy choose Sportingbet?\r\n• More markets: Get access to MORE SPORTS than any other betting provider \r\n• More bets: Choose from up to 30,000 markets daily\r\n• More control: Check and edit your selections as much as you like before OR after confirming your bet, then CASH OUT anytime with a single click.\r\n• More insight: Get in-depth live football stats while streaming all the action to your device\r\n• More variety: Switch between sports betting and CASINO with ease to play your favourite slots or classic casino games like Blackjack and Roulette\r\n\r\nFeatures:\r\n1. TRACK your bets in real time\r\n2. AUTO CASH OUT – set your bet to cash out automatically at a certain price\r\n3. IN PLAY - bet in-play on hundreds of live events from around the world\r\n4. EDIT-MY-BET – add or remove picks AFTER you’ve placed your bet\r\n5. BUILD-A-BET – make multiple selections on the same game\r\n\r\n👉 Promotions: \r\n-\tTHE BEST HORSE RACING ODDS GUARANTEED – Get more for your money with the best odds guaranteed on all UK & Irish Horse Racing. If you back a horse and the SP return is bigger, we’ll pay you at that price. \r\n-\tENHANCED ACCAS – Get even bigger odds on the most popular accas selected by us.\r\n\r\n👉 Here are just some of the MOST POPULAR sports betting markets available within the Sportingbet sports betting app:\r\n\r\n-\tFootball – bet on ALL of the world’s top leagues, from the PREMIER LEAGUE, Championship, League One & League Two through to the Scottish Premier League, Bundesliga, La Liga, Serie A, CHAMPIONS LEAGUE and Europa League.\r\n\r\n-\tTennis – bet on Wimbledon, the French Open, U.S Open, Australian Open, ATP and WPT events, Davis Cup, ITF Tours and more…\r\n\r\n-\tHorse Racing - get all the latest and BEST ODDS from the UK, Ireland and around the world.\r\n\r\n-\tGolf – we've got all the majors covered plus the Ryder Cup, PGA Tour, European Tour and more…\r\n\r\nBut that’s not all. With the Sportingbet sports betting app, players can bet on Rugby, Cricket, NFL, Basketball, Formula One, Motorbikes, Boxing, Snooker, Darts, Handball, Ice Hockey, Baseball, Volleyball, Athletics, Aussie Rules, Badminton, Bandy, Biathlon, Rally, Rugby League, Table Tennis, the Olympics and politics.\r\n\r\n👉 Play Casino Games:\r\nPlay CLASSIC table games like roulette and blackjack from our world-class casino or choose SLOTS like Book of Ra, Rainbow Riches and Starburst or JACKPOT slots like Reel King Mega, Dragon’s Luck and Age of Gods.\r\n\r\n18+ | Min deposit £10 | Max stake £10 | Min Odds 1/1 (2.0) | Max FreeBet £10 | Excludes Horse Racing | New players only | T&Cs apply\r\n\r\nResponsible Gambling:\r\n18+. Please play responsibly. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org\r\n\r\nIreland: https://www.problemgambling.ie and 1800 753 753\r\n\r\nLicensing:\r\nSportingbet operates under licence and in accordance with applicable laws and regulations. For further licence information, please visit our website at www. sportingbet.com",
  "summary": "Bet on football, tennis or horse racing from anywhere, with our Sportingbet app",
  "installs": "5,000+",
  "score": 3.8695652,
  "ratings": 69,
  "reviews": 34,
  "price": 0,
  "developer": "ElectraWorks Limited",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Nov 22, 2017",
  "updated": 1548406705000,
  "version": "19.01.02",
  "recentChanges": "Make the most of bwin by updating to latest version. We make frequent improvements and bug fixes based on your feedback. So don’t forget to rate the app and leave us a review.",
  "appId": "com.sportingbet.sportsbook.uk",
  "searchTerms": "sports betting"
 },
 {
  "title": "BetConnect - Sports Betting",
  "description": "Betconnect is the world’s only social betting network that gives you access to the bets of professional gamblers. We send you personalised bets - each called a Bet Request - direct from the Pros for you to Match. \r\nYou decide what to do next. Do you Follow or Lay? Whatever sport you bet on, we’ve got Pro’s who want to bet on it – from football to rugby, from golf to horseracing, we’ve got you covered.\r\n\r\nWhat is betconnect?\r\n\r\nReal Pro Gamblers\r\n\r\nOur Pros are real professional gamblers who are restricted or closed by the bookies due to their success. Why else would they pay us a commission to get their bets placed and share their tips?\r\n\r\nIn It Together\r\n\r\nOur Pros are putting their money where their mouth is – every Bet Request is the ultimate tip. Each one is being backed by one of our Pros. You can trust that they want winners just as much as you.\r\n\r\nCrowd Betting\r\n\r\nEvery Bet Request you receive is just the “tip” of the iceberg - our pros are using staking much much more.   Our technology intelligently splits the stake and distributes, via the betconnect network, to Punters like you, so you can share in their success.   \r\n\r\nTime Is Money\r\n\r\nEvery Bet Request is so good you need to act fast to maximise value. Time is of the essence as you only have 15 minutes to Match and make your next decision…\r\n\r\nThe Benefits Are All Yours!\r\n\r\nWhen you Follow a Bet Request by placing it with other bookmakers you get to take advantage of their Free Bet, Money Back Special and Best Odds Guaranteed promotions. If you lay a Bet Request on betconnect and you beat the Pro you pay zero commission on your profits.\r\n\r\nHow Does It Work?\r\n\r\nStep 1:   Connect\r\n\r\nWe Connect you to a network of professional gamblers. Restricted and often closed by the bookies due to their success, they have bets they want to place. That’s where you come in! You’ll be notified when the betconnect algorithm allocates you a Bet Request that meets your betting preferences.  Whether you like football, rugby, horse racing, golf, tennis or something a little more niche, the pros on betconnect are betting on it!\r\n\r\nDon't want to wait?  Press the betconnect button to be next in the queue.\r\n\r\nStep 2:  Match\r\n\r\nUnlock the Bet Request to reveal details of the bet and get the ultimate tip! You now have 15 minutes to Match it on betconnect, safe in the knowledge that the same odds or better are available with the bookmakers… meanwhile you move on nicely to step 3.\r\n\r\nStep 3:  Follow\r\n\r\nHere's where it gets interesting....\r\n\r\nJust how good is this pro?\r\n\r\nLove the bet?  Then Follow....\r\n\r\nBelieve in the power of the Pro and Follow the same bet with your own money. Simply Match the Bet Request on betconnect and place the same stake plus your own stake with any bookie who is offering the same odds or better. Get Involved!\r\n\r\nDon't love it?  Then Lay...\r\n\r\nBe brave and bet against the Pro by becoming the bookie!  Simply Match the Bet Request and do nothing further.  Will bravery triumph over experience?\r\n\r\n\r\nSo, download betconnect today, join the world's first social betting network and get Bet Requests and tips on all your favourite sports.   Your best bets are on betconnect.\r\n\r\nSee how it works - https://betconnect.com/punter/demo\r\n\r\nThis is a real money gambling app. \r\nYou must be 18 or over to have a betconnect account.\r\nBetconnect is committed to Responsible Gambling. \r\nFor UK customers additional support and advice can be found at www.gambleaware.co.uk or by calling 0808 8020 133.",
  "summary": "Follow the professional money with betconnect, the social betting network.",
  "installs": "500+",
  "score": 3.3333333,
  "ratings": 6,
  "reviews": 4,
  "price": 0,
  "developer": "Betconnect Ltd",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests",
  "released": "Jan 15, 2019",
  "updated": 1583187342000,
  "version": "1.2",
  "recentChanges": "UI improvements and bug fixes",
  "appId": "com.betconnect.app",
  "searchTerms": "sports betting"
 },
 {
  "title": "PROBET: Football (soccer) betting tips",
  "description": "Over 400.000 pro betting clients trust our daily football (soccer) betting tips, betting predictions and football (soccer) fixtures. We provide professional football (soccer) tips with a high win rate. Each match simulation contains multiple betting tips such as total goals scored, correct score or home/away wins.\r\n\r\nAn essential betting app for all serious bettors who like to bet on football (soccer)!\r\n\r\n• DAILY BETTING TIPS\r\nOur offer contains hundreds of live football (soccer) betting tips. Each match contains multiple match odds and bet tips, giving you more options to choose from. If you are a player who likes to bet on goals or the correct match results we have that covered for you.\r\n\r\n• MATCH ALERTS\r\nGet your favorite football (soccer) betting tips via betting alerts that trigger 60 minutes before match kick-off. Whether you are a Chelsea, Liverpool, Arsenal, Tottenham, Barcelona, Real Madrid, Juventus or PSG fan, we’ve got your betting propositions covered.\r\n\r\n• MATCH HIGHLIGHTS\r\nWatch the latest English Premier League, La Liga, Serie A and Bundesliga goals and match highlights directly from inside the app. You can access the match videos directly from the tips list.\r\n\r\n• SPORTS FILTERS\r\nOffering more than 10 different filters that will help you filter the football (soccer) tips list as you desire. You can filter them by football (soccer) league, showing tips with the specific amount of upvotes and much more.\r\n\r\n• HOT ODDS\r\nEach day, we generate a list of the hottest football (soccer) odds in the world. These are match odds that have dropped the most during the day. With this betting feature, you can easily decide your next betting strategy.\r\n\r\n• TEAM STATS\r\nWe have included team stats that show how a specific team played in its  last 5 matches, or how many goals the team has scored/conceded during the season. This feature enables us to form more accurate bet predictions.\r\n\r\n• OTHER FEATURES\r\n- Push Notifications. Receive regular push notifications for our betting picks of the day, reminders to check the newly added betting tips, as well as the most important sports news of the day.\r\n- League Standings: Check out the standings table by clicking on the league header, which will help you form a better bet prediction.\r\n- Spotlight Search: Search for matches and the latest news directly from Spotlight.\r\n\r\nWe would love to hear your feedback at support@probet.tips.",
  "summary": "Football (soccer) app that brings you bet predictions, betting odds, and scores.",
  "installs": "500,000+",
  "score": 4.177914,
  "ratings": 3391,
  "reviews": 2048,
  "price": 0,
  "IAPRange": "£4.69 per item",
  "developer": "MOBCAST LIMITED",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jun 4, 2019",
  "updated": 1582995287000,
  "version": "1.7",
  "recentChanges": "- Bug Fixes<br>- Performance Improvements",
  "appId": "betting.tips.probet",
  "searchTerms": "sports betting"
 },
 {
  "title": "PokerStars Sports Betting– Bet Online on Football",
  "description": "Download the PokerStars Sports betting app for the best mobile betting experience and great odds on football and many other sports!\r\n\r\nOnline betting on sports has never been as easy as with the PokerStars Sports betting app. Bet on football, on tennis, on golf or any other of your favorite sports, with the best sports betting app available.\r\n\r\nALL THE BEST FEATURES AND PROMOTIONS\r\n\r\nCASH OUT\r\n\r\nGone are the days when you had to wait for an event to finish before you could start counting the winnings from your online bet. If your bet is coming in but you notice the momentum swinging in a match you can use Cash Out and lock in your profits.\r\n\r\nSPIN & BET\r\n\r\nSpin & Bet is the game-changing feature exclusive to PokerStars Sports where you can enhance your potential winnings by up to 10x. PokerStars Sports have just enhanced this feature to cover all Pre-Match football markets on all games.\r\n\r\nMORE SPORTS AND GAMES\r\nSPORTS -- Bet online on over 30 different sports available\r\n\r\nLEAGUES -- Great odds on leagues from around the world\r\n\r\nAMAZING CUSTOMER EXPERIENCE\r\nBETSLIP -- Quick and easy way to check on all your sports bets\r\n\r\nIN-PLAY BETTING -- Place your bet during the game and follow the action with scoreboards.\r\n\r\nMake sure you accept push notifications to ensure that you don’t miss out on any of our great promotions.\r\n\r\nThis is a real money online gambling app. You must be 18 years of age or of legal age of majority in your jurisdiction, whichever is greater, to create a Stars Account.\r\n\r\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.",
  "summary": "The sports betting app that gives you amazing odds on football and other sports",
  "installs": "10,000+",
  "score": 2.6,
  "ratings": 35,
  "reviews": 18,
  "price": 0,
  "developer": "Stars Mobile Limited",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests",
  "released": "Jun 5, 2018",
  "updated": 1582220449000,
  "version": "3.19.1",
  "recentChanges": "We never stop striving to provide the best sports betting experience on your phone or tablet. If you like our work please take a moment to rate our app and let us know!",
  "appId": "uk.betstars.betstars",
  "searchTerms": "sports betting"
 },
 {
  "title": "Best Bet: Arcade Sportsbook",
  "description": "Real sports, real scores, real odds, fake money. With Best Bet you can live the dream of winning huge at a Vegas sportsbook without ever having to risk a dime.\r\n\r\nBest Bet is designed to be as beautiful as it is intuitive, and optimized for a highly streamlined sports betting experience. So whether you’re a betting beginner looking to learn the ropes, or a seasoned sportsbook pro, Best Bet is the perfect app for you.\r\n\r\nWith Best Bet you can do it all. College football bets, professional football bets, soccer bets, baseball bets, basketball bets, and hockey bets. Bet the point spread, bet the moneyline, or bet the over/under.\r\n\r\nFEATURES\r\n• Support for 5 sports leagues, including NFL Football, MLB Baseball, NCAA Men's Football, NHL Hockey, and English Premier League Soccer.\r\n• Place bets for point spread, moneyline, and over under\r\n• Live game score updates\r\n• Pre and post game push notifications\r\n• Real leagues, real teams, real scores, and real Vegas odds!\r\n• No money required!",
  "summary": "Real Games, Fantasy Bets?",
  "installs": "1,000+",
  "score": 4.6842103,
  "ratings": 19,
  "reviews": 13,
  "price": 0,
  "IAPRange": "£1.89 - £46.99 per item",
  "developer": "Real Fake Bets LLC",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Oct 6, 2019",
  "updated": 1584536359000,
  "version": "1.11.0",
  "recentChanges": "There isn&#39;t much to show this release due to many sports being cancelled. We are working to figure out what is in the best interest of our users and experience. Please stay tuned to get the latest from Best Bet.",
  "appId": "com.realfakebets.bestbet",
  "searchTerms": "sports betting"
 },
 {
  "title": "Paretobet - Combination Sports Betting",
  "description": "Paretobet optimizes your combined sport bets (football) :\r\n\r\n🏆 Create your predictions on all major competitions\r\n🎯 Use Paretobet filters reduction system and keep the most probable grids\r\n📊 Follow the odds evolution in real time and place your bets at the best time\r\n🍺 Share your predictions with friends\r\n🔥 Compare the bookmakers, and find the best deal!\r\n\r\nParetobet is the best reducer system, combined bet, multibet, get real odds !\r\n\r\nWarning\r\n🔞 Gambling is prohibited for minors under 18 years of age.",
  "summary": "Betting predictions, combined bets and odds comparison !",
  "installs": "1,000+",
  "score": 4.25,
  "ratings": 20,
  "reviews": 18,
  "price": 0,
  "developer": "Paretobet",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Oct 24, 2019",
  "updated": 1588868934000,
  "version": "1.1.6",
  "recentChanges": "Special alert for canceled games",
  "appId": "com.mnd.paretobet",
  "searchTerms": "sports betting"
 },
 {
  "title": "BetsWall Free Football Betting Tips & Predictions",
  "description": "BetsWall is the world's first and best football & basketball betting tips engine with win rate of over 84%. Predictions are made by the artificial intelligence software we have developed in years. We share predictions of BetsWall Engine a few hours before the matches start. \r\n\r\nBetsWall's sports betting tips and it's all content is COMPLETELY FREE !\r\n\r\nIn addition to reaching the sports betting tips of the world's most successful betting software BetsWall for free, you can also create your virtual betting coupons without risking your money and share your predictions with the whole world.\r\n\r\nBetsWall is a totally free football & basketball betting support application that offers several tools to help you increase your success rate and teach you how to bet!\r\n\r\nBetsWall is the first social betting platform of the World ! Over 1 Million user shared their betting tips on the BetsWall until today.\r\n\r\nWhen you sign up you will receive 1000 bwCoins with which you can create virtual bets , both to test your gaming strategies and to challenge other tipsters and climb the rankings of the best tipsters of last 14 days.\r\nbwCoin is a virtual currency of the application and can be used to place virtual bets.\r\nYour virtual bet coupons are updated live and processed with the completion of the matches.\r\n\r\nWhen your virtual betting coupon that you create on BetsWall wins,  you don't win any cash prizes, these are virtual bets ( and not real money ) with the aim of testing your gaming strategies and having fun at the same time.\r\n\r\nUsing BetsWall you could see free football, basketball (Champions League, World Cup, Premier League, La Liga, Bundesliga, Serie A, League 1, NBA, Euro League, EuroCup and all major football and basketball organizations.) betting tips of best tipsters from all around the world before matches started. \r\n\r\n----- BetsWall Engine -----\r\n\r\n• Daily football and basketball betting tips from world’s most successful betting tips engine BetsWall for completely free.\r\n• Daily notifications, when betting tips of BetsWall shared.\r\n• Betting tips with high win rate \r\n• %100 analyst\r\n• Easy user interface\r\n• Home / Draw / Away betting tips\r\n• Under / Over betting tips ( 1.5 , 2.5 , 3.5 , 4.5 , 5.5 , 6.5 )\r\n• GG / BTTS ( Both time to score ) YES / NO betting tips\r\n• Betting tips history\r\n\r\n----- BetsWall Social Betting ----- \r\n\r\n• World ranking for finding best tipsters of the world easily\r\n• Ready coupons from expert users\r\n• All members' betting coupons and statistics are public so you can see which players you can trust.\r\n• Select your favorite tipsters and get notification when them share coupons instantly.\r\n• Create betting coupons and bet for free as well as like, comment and share coupons of tipsters from all around the world.\r\n• You can follow your competitors and track your and their coupons easily on your wall. \r\n• You can follow up live soccer scores, match statistics, match lineups, standing tables, team forms. \r\n• Set your favorite matches and BetsWall will notify you all match events; start time, goals, red cards, half time, end time etc.\r\n• Most played coupons\r\n• Most played bets\r\n• Possible winner coupons\r\n• Won bomb coupons\r\n\r\nDisclaimer: This is an unofficial app. All country and soccer team logo images included in the app and app screenshots are copyright and trademark of their respective corporations. \r\nDisclaimer 2:\r\n- BetsWall is intended for an adult audience.",
  "summary": "Daily sports betting tips with win rate 84% are available on BetsWall for FREE!",
  "installs": "500,000+",
  "score": 4.4100556,
  "ratings": 8977,
  "reviews": 4941,
  "price": 0,
  "developer": "BetsWall",
  "genre": "Sports",
  "contentRating": "Parental guidance",
  "contentRatingDescription": "Parental Guidance Recommended",
  "released": "Aug 27, 2016",
  "updated": 1589269192000,
  "version": "1.59",
  "recentChanges": "Performance improvement with bug fixes",
  "appId": "com.company.betswall",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Tips",
  "description": "PredictoR Betting Tips is a mixed sports predictions app for football, basketball, tennis, ice hockey, baseball, handball, volleyball, snooker and other sports. Betting Tips is dedicated to all the sports fans who love football, tennis, basketball and other sports. Our goal is to deliver predictions based on statistical analysis. This will make the matches even more exciting and will add some extra emotions when you are watching the game.\r\n\r\n\r\nBetting Tips - App Description:\r\n\r\nWe offer daily betting tips with various predictions like 1x2, over / under, handicaps, BTTS, double chance. Depending on the available matches our betting tips will have small odds (sure matches), medium odds and big odds. To make it simple... We offer everything you need to be informed on the top football, tennis, basketball and all other matches.\r\nOur professional team is specialized in football, basketball, tennis, ice hockey... all  our betting tips are highly analysed and tested to provide the best experience possible.\r\n\r\n\r\nBetting Tips - App sections:\r\n\r\n• Daily Betting Tips - most common betting tips with various predictions\r\n\r\n• Extra Match - alternative betting tips for a single match, more then one betting tip\r\n\r\n• Mixed Combo - betting tips organised as accumulators with 2+ odds (usually we combine the top betting tips in all sports to get the best combination)\r\n\r\n• VIP Betting Tips - PRO betting tips from the top leagues, a part of them having alternative betting tips (more then a single prediction for one game). The VIP area is where you get top betting tips, the games we believe to have the best risk vs reward ratio.\r\n\r\n\r\nBetting Tips - App Features:\r\n\r\n• Football Betting Tips - betting tips from all Leagues including England Premier League, Germany Bundesliga, Italy Serie A, Spain LaLiga, France Ligue 1, Portugal Primeira Liga\r\n\r\n• Tennis Betting Tips - ATP & WTA, Challenger and ITF betting tips\r\n\r\n• Basketball Betting Tips - NBA + All Other Leagues betting tips\r\n\r\n• Ice Hockey Betting Tips - NHL + All Other Leagues betting tips\r\n\r\n• Other Sports Betting Tips – Volleyball, Handball, Baseball MLB, Snooker, Formula 1 betting tips\r\n\r\n• Betting tips history – past 15 days\r\n\r\n• Various predictions with big odds and sure matches, 1x2, over / under, handicaps, BTTS, double chance and much more\r\n\r\n• Betting Tips is very easy to use and has a cool design\r\n\r\n\r\n\r\nTerms of use:\r\n\r\nThis app is just an information source and should be used just for fun. The words \"Betting Tips\" in this description are used only for category ranking purposes, our app is not designed for betting. \r\nThis is not a betting app, it is by no means related to betting or gambling and we do not encourage betting and gambling at all.\r\nUse this app just for fun! Act responsibly!\r\n18+ Only. Not designed for children.",
  "summary": "Betting Tips - Top Betting Tips Football, Tennis, Basketball, Ice Hockey + More",
  "installs": "100,000+",
  "score": 4.6440177,
  "ratings": 6806,
  "reviews": 2697,
  "price": 0,
  "IAPRange": "£0.79 - £17.49 per item",
  "developer": "PredictoR",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Feb 15, 2018",
  "updated": 1588774391000,
  "version": "1.1.0",
  "recentChanges": "- New design<br>- We added 4 new sports (darts, esports, table tennis and badminton) <br>- We joined the Union sports community<br>- High quality standards",
  "appId": "com.predictor.app",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting TIPS VIP : DAILY PREDICTION",
  "description": "Betting TIPS VIP : DAILY PREDICTION is a professional Football Accumulator Betting sites that was set to help people like you make money from football. We have been making consistent profit from betting football for years ago and now we offering the chance to share our betting sport for free to everyone\r\n\r\nIn our daily updated betting you will find the most profitable free soccer betting bet. We make sure you will not miss any pick in the future and we will help you to increase your winnings to the maximum.\r\n\r\nWith our background in statistical analysis and expert betting knowledge, in Most european league with our expert tipsters we deliver impressive profits while maintaining a high strike rate. Our extensive analysis gives us the edge in football betting sites and allow our customers to make thousands long term.\r\n\r\n---- Expert Tipster Team ----\r\n\r\nOur expert team in sport betting analysis matches approximately 10 hours every day and work to provide you the best betting expert betting and VIP sport picks. We are analyzing technical team changes, latest status of teams, penalties, form state and injuries of football players, player’s private life, weather conditions of matches, betting news and provides statistical soccer betting adivce in many topics.\r\n\r\n---- Leagues Across The World ----\r\n\r\nWe are the best Analyzer in sport betting in all league champions from the world, England, Germany, France, Netherlands, Italy, Spain, USA, Switzerland, Sweden, Norway, Denmark, Finland, Portugal, Turkey. and more...\r\n\r\n---- high odds ----\r\n\r\nIf you want to win with very high odds you can join our family and win every day with us. Our Professional Football crew provides you betting tips which you will win every day. Our crew also have famous betting tipsters, expert former footballers and expert former technical managers.\r\n\r\n---- bookmakers ----\r\n\r\nYou can use one of the most trustful and safe bookies for online sports betting, one xbet and more betting bookmakers\r\nWhat you will benefit when you install our application !\r\n\r\n---- Featured ----\r\n\r\nChat & Messaging - Who doesn’t like talking sports? Check out our cool chat and messaging features, helping you connect with other fans around the games and content you love. Public Chat is available in every matchup page, while you can also set-up group messaging with friends and family or just chat 1-1 too through the 'Messaging' icon found in the top right of the screen.\r\n\r\n---- Update  ----\r\n\r\nBe updated on the top headlines in an instant from across all sports betting, everyday and every morning \r\n\r\n- High Win Rate up to 98% strike rate\r\n- Daily 2 combo ticket\r\n- Daily matches ( with best available odds in markets with )\r\n- Notification service to keep update when the betting tips are avaliable\r\n- All betting tips are completely FREE NO NEED TO PAY FOR NOTHING\r\n- Betting history up to 30 days\r\n- Easy to use clean and fast interface\r\n- Instant Access To Our Application\r\n- betting advice Picked From 30 Leagues Across The World\r\n- All betting tips update before 12AM - GMT Everyday\r\n- betting tips Selected Every Day Of The Year\r\n- Zero Betting Skills Or Football Knowledge Required\r\n- Simply Copy Our Winning Bets From The Application Each Morning\r\n- Daily combo ticket odds up to 5.00\r\n- Daily expert betting up 5 games\r\n- Over 2.5 - Under 2.5 Goals tips\r\n\r\nFollow Betting TIPS VIP : DAILY PREDICTION, analyse the statistics provided, with the best tipsters and create your own winning football bets for FREE!\r\nLet us help you to make some decent cash with our betting sites from some of the most successful sports bettors in the world.\r\nSo What Are You Waiting For Start Cashing In From World Now !!!\r\n\r\nNeed help? Email ibettingxx@gmail.com or via ‘Report a Bug’ in the Settings menu.\r\n--\r\nPrivacy Policy: http://bit.ly/privacy-x\r\nTerms of Use: http://bit.ly/Terms-OF-use",
  "summary": "Maximize Your Winnings in Sport Betting With Our Betting Site Advice - LETS GO !",
  "installs": "500,000+",
  "score": 4.4789877,
  "ratings": 45520,
  "reviews": 23760,
  "price": 0,
  "developer": "iBetting-Team",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jan 26, 2018",
  "updated": 1586705404000,
  "version": "9.9.10",
  "recentChanges": "1) <br>- New bug fixed<br>- Splash screen<br>- Update dependencies<br>- Optimizations live betting talk room  <br>- Update SDK and libraries <br>- Refactoring of the code and optimizations <br><br>2) <br>- Update Privacy Policy - 12/04/2020<br>- GDPR compliant <br>- Update Terms and Conditions of use <br>- Update Legal Disclaimer",
  "appId": "com.bettingtips.daily",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports Betting Tips",
  "description": "Sports betting tips for soccer and basketball, we do a daily analysis to identify the best guesses taking into consideration Risk x Profit.\r\n\r\n- The app contains betting history, with information on correctness and profit obtained.\r\n- Premium users have access to an area of ​​highlights with top sports tips only.\r\n- With the notifications, you'll never forget to check out the tips of the day.\r\n- Several leagues from various championships around the world.\r\n\r\nMost common types of bets:\r\n- Final Result\r\n- Asian Handicap\r\n- Over 2.5\r\n- Under 2.5\r\n- Double Chance\r\n- Both teams to score\r\n\r\nAlways have BEST TIPS on your cell phone to check the tips before placing your bet, we are always working to help you profit =)",
  "summary": "Best Tips - The best choice in sports betting tips",
  "installs": "5,000+",
  "score": 3.75,
  "ratings": 40,
  "reviews": 27,
  "price": 0,
  "IAPRange": "£2.19 - £16.49 per item",
  "developer": "Rich 'n Fun",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jun 7, 2019",
  "updated": 1582075427000,
  "version": "5.5.0",
  "recentChanges": "Bug fixes",
  "appId": "richnfun.apptips",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betfred Sports Betting App",
  "description": "Welcome to Betfred Sports, where new customers can claim our exclusive NEW CUSTOMER OFFER to use on the football season and other sporting events. Grab yourself £30 in FREE bets when you stake £10 on any sports market (T&C’s apply).\r\n\r\nThe football season is finally here and underway, so join in with all the excitement of in-play and pre-match betting, in our very own sports betting app. Boasting a wide choice of markets and market leading offers, with one of the largest selections of events available on the Play Store. Whether it’s your weekend football-flutter or a hunch on the horses, make Betfred your home for sports betting. \r\n\r\nOur app includes all the classic features such as Goals Galore, Double Delight & Hat-Trick Heaven and our very own Acca Insurance! Also, some new Betfred exclusives like the #PickYourPunt builder, plus our most recent additions; including the Betfred Betfinder and Racing Post data.\r\n\r\n#PICKYOURPUNT Builder\r\n\r\nThe power is in your hands with the Betfred PickYourPunt builder, allowing you to create your own unique bets! Simply select the markets you want, the bets you want to combine and get your odds right away. You’ll get your price instantly, so if you fancy your team to win, both teams to score, 10 or more corners and the big lad up front to bag a header, then PickYourPunt with Betfred. \r\n\r\nYou can also tweet @Betfred your unique bet who can reply and create your bespoke #PickYourPunt bet for you!\r\n\r\nRACING POST DATA\r\n\r\nBe in the know with Racing Post at Betfred, where there's an additional 13 sports covering over 4,000 different events each year.\r\nDelve into our Racing Post Data, covering all UK and Irish horse racing and greyhound events; with insightful stats and tips to help give you the upper hand before placing your bets!\r\n\r\nBET FINDER\r\n\r\nWhether it’s the course and distance winner, highest rating or a jockey in form, we all have our reasons why we back a certain horse. With our Betfinder, you can decide how many of these key pieces of information are needed to make the call! Leave the gut feelings and superstitions at home and bet the smart way - the choice is yours with the Betfred Betfinder! \r\n\r\nDOUBLE DELIGHT & HAT-TRICK HEAVEN \r\n\r\nKick off your Premier League season and get enhanced odds on your first goalscorer bets using the Betfred app! \r\nOur famous Double Delight & Hat-Trick Heaven promotion means that if your chosen goalscorer scores first and then bags another, we will double your original odds – and triple them if they get a hat-trick. \r\n\r\nWe paid out millions on this promotion last football season. Will you be joining the long list of winners this year?\r\n\r\nGOALS GALORE\r\n\r\nIf both teams score, it’s Goals Galore with Betfred! With great odds on up to 12 selections, pick from our wide range of coupons including the Bonus List, 1st Half, 2nd Half and No Draw. Goals Galore, for when both sides hit the back of the net. \r\n\r\n\r\nWATCH LIVE\r\n\r\nNever miss a second with our fantastic Watch Live feature. We stream all UK and Irish horse racing, plus basketball, tennis, greyhounds and many more events, every single day across the nation.\r\n\r\nTERMS\r\n\r\nNew UK & NI customers only. 18+. Deposit & place first sports bet at a minimum of £10 in one bet transaction at evens (2.0) +.£30 paid in free bets within 10 hours of bet settlement, expires 7-days after issue. Offer not available to those registering on 06/04/2019. E-Wallet & Prepaid Card restrictions apply. Your first bet must be settled within 60 days of bet placement. SMS validation may be required. Full T&C's apply.\r\n\r\nVisit Betfred.com for full terms.\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at:\r\n\r\nUK: https://www.begambleaware.org/ or contact 0808 8020 133\r\n\r\nIreland: http://www.gambleaware.ie/ or contact 1800 753 753",
  "summary": "Bet on Premier League Football, Horse Racing &amp; more!",
  "installs": "100,000+",
  "score": 4.29,
  "ratings": 695,
  "reviews": 502,
  "price": 0,
  "developer": "Betfred Play Store",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Aug 7, 2017",
  "updated": 1588149568000,
  "version": "Varies with device",
  "recentChanges": "Check out the new Betfred Sportsbook android app; for your home of sports betting! We&#39;ve made some minor technical tweaks, to improve your experience!",
  "appId": "com.betfred.mobilecontainer",
  "searchTerms": "sports betting"
 },
 {
  "title": "32Red Sport: Bet on Football, Horse Racing & more",
  "description": "Install the 32Red Sport app today for the very best sports betting experience straight from the palm of your hand. Offering the best odds across multiple sports, daily specials & extensive markets – the 32Red Sport app has it all. Bet pre-event or immerse yourself in the live in-play action across a whole sporting calendar, simply install the app today & enjoy all that 32Red Sport has to offer. \r\n\r\nJOIN TODAY TO CLAIM A 100% PROFIT BOOST ON YOUR FIRST IN-PLAY BET!\r\n\r\nBetting should be simple and fuss-free, that’s why the easy to navigate app has been designed with usability in mind – bet across hundreds of markets on the go, with a variety of popular & lucrative sports to cover all your needs. 32Red Sport also offers fantastic betting value, with daily offers & price enhancements making it your one stop shop for the very best sports betting experience!\r\n\r\nWhat does 32Red Sport offer?\r\n\r\nThe Best Betting Experience – Enjoy a premium sports betting service from an award-winning company. With a vast range of betting markets available on every sport imaginable – it’s all covered at 32Red Sport.\r\n\r\nFootball, Horse Racing & More – Nothing says excitement quite like betting on your favourite sports; from football to horse racing, tennis to boxing – we don’t miss a trick. \r\n\r\nLive & In-Play Betting – Bet live on thousands of events straight from your fingertips. Our exclusive offer also gives you a 100% profit boost on your first in-play bet too!  \r\n\r\nLive Streaming – Never miss a second of the action with our fantastic live streaming – available for your viewing across all major sports! \r\n\r\nDaily Racing Price Boosts – Every day we boost the price of selected horses across a range of races. This means that while other bookmakers are sharing the same standard show prices you’ll find enhanced odds at 32Red Sport.\r\n\r\nCash In With Cash Out – Fear not, our brilliant Cash-out feature allows you to settle your bet before the final result is known, make sure you don't get caught out! \r\n\r\nFancy the Casino? – Our award-winning Casino has all the latest blockbuster slots & a live casino experience not to be missed! \r\n\r\n\r\n32Red Sport bonuses: \r\n\r\nFrom welcome offers, daily promotions, enhanced prices… It’s all covered for both new and existing players!\r\n\r\n\r\n32Red feature casino game titles:  \r\n\r\nHighlander • Avalon • Avalon II • Thunderstruck • Thunderstruck II • Immortal Romance • Mega Moolah • Lucky Leprechaun • Jurassic World • Lost Vegas • Castle Builder II • Tomb Raider • Deco Diamonds • Cool Buck • Hitman • Major Millions • Who Wants to Be a Millionaire • The Great Albini • Bonanza • Showdown Saloon \r\n\r\n\r\nInstall the 32Red Sport app today to enjoy a premium sports betting experience straight from your mobile and access to an award winning Casino!\r\n\r\n \r\n**** 100% Profit Boost on First In-Play Bet ****\r\nMin Odds of Evs. Max £10 bet. The max additional profit that will be credited is £100. Full terms apply. \r\n\r\n18+ only. This is a real money gambling app. Please gamble at 32Red responsibly – begambleaware.org.",
  "summary": "Great Odds, Live Streaming &amp; In-Play Betting on the 32Red Sport App. Join today!",
  "installs": "1,000+",
  "score": 2.8,
  "ratings": 5,
  "reviews": 2,
  "price": 0,
  "developer": "32Red PLC",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Mar 7, 2019",
  "updated": 1551956502000,
  "version": "2.2.0",
  "recentChanges": "Get the very best sports betting experience on the 32Red Sport app. <br><br>- Offering great odds across multiple sports, daily specials &amp; extensive markets!<br><br>- Bet pre-event or immerse yourself in the live in-play action across a whole sporting calendar! <br><br>- Never miss a second of the action with live streaming – available for your viewing across all major sports! <br><br>&amp; much more...",
  "appId": "com.ttrsport.dev",
  "searchTerms": "sports betting"
 },
 {
  "title": "partypoker Sports Betting",
  "description": "Experience more drama, excitement and emotion than anywhere else with our easy-to-use app. You can jump into the heart of the action with an unrivalled world of gaming at your fingertips. Wherever you are, whatever you bet, experience every spine-tingling moment, every match point and every last-minute winner, plus much, much more. \r\n\r\n• More markets: Get access to more markets than any other betting provider.\r\n\r\n• More bets: Get up to 30,000 bets daily with betting action in almost 100 sports. \r\n\r\n• More control: Check and edit your selections as much as you like before confirming your bet, and Cash Out anytime with a single click.\r\n\r\n• More insight: Get in-depth live football stats to keep tabs on how teams are performing, and live stream matches and other events. \r\n\r\n• More variety: Easily switch between sports betting and casino to play a range of classic casino games including Roulette and Blackjack. \r\n\r\nOur top five features\r\n1. Build a bet\r\nOur slick interface makes it easy to place single, multi and system bets and build the bet that’s right for you. You can also check your placed bets and see a detailed view of your bets. \r\n2. In-play\r\nUse the odds change feature to quickly and easily make in-play bets on hundreds of live events.\r\n3. Live streaming\r\nWatch thousands of live events in full screen so you don’t miss a moment of the action.\r\n4. FreeBet\r\nNo need to wait around. Get real-time notification of your FreeBet and use our simple interface to bet quickly and easily.\r\n5. Enhanced Odds\r\nWe boost odds every day on everything from Football to Tennis to Basketball and much more!\r\n\r\nParticipation in the partypoker gaming line-up is only permitted for persons aged 18 and older. In order to prevent any abuse, please keep your access data (user ID, password, question-answer combination) in a safe place.\r\n\r\n*T&Cs\r\nEligible Players\r\n1.\tBy taking part in this Promotion, you agree to these Specific Promotional Terms and Conditions and our Standard Promotional Terms and Condition\r\n2.\tPlayer must be 18 years or older and have a registered partypoker account to take part in this promotion\r\n3.\tPlayers must be have their account set to receive correspondence\r\n\r\nAn Eligible Bet \r\n4.\tThis offer applies to your first qualifying stake within the partypoker sports app only\r\n5.\tOnly one qualifying bet per customer, household, IP address\r\n6.\tPartypoker will match your first qualifying stake up to £25 as a free bet\r\n7.\tA real money cash bet must be placed in order to qualify for the promotion\r\n8.\tThe minimum qualifying stake will be £10\r\n9.\tThe maximum qualifying stake will be £25\r\n10.\tBets placed must be at the odds of 4/6 (0.66) to qualify for the free bet\r\n11.\tBoth single and multiple bets count towards the promotion but must meet the minimum odds of 4\\6 (0.66) or greater\r\n12.\tFree bets will be credited to your account within 24 hours of your first bet has being settled \r\n13.\tThe Tournament ticket is to the value of $11 and can be used on a tournament of your choice\r\n\r\nFree Bet Poker Ticket Terms and Conditions\r\n14.\tIn order to claim the FreeBet, customers must log in into their account.\r\n15.\tThe Tournament ticket is to the value of $11 and can be used on a tournament of your choice\r\n16.\tThe FreeBet will be found above the bet slip.\r\n17.\tThe FreeBet can only be used for sports bets on the partypoker app only\r\n18.\tAny winnings from the free bet will be paid minus the stake\r\n19.\tThis promotion cannot be used in conjunction with any other promotion\r\n20.\tFree bets and tournament tickets will expire after seven (7) days once credited if unused\r\nPartypoker reserves the right to remove or amend the promotion or free bet from a customer’s account at any time should they feel that the spirit of the promotion is being abused.\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org",
  "summary": "We will match your first stake with a free bet up to £25 T&amp;Cs*<br><br>18+. T&amp;Cs Apply*",
  "installs": "1,000+",
  "score": 3.5454545,
  "ratings": 11,
  "reviews": 3,
  "price": 0,
  "developer": "ElectraWorks Limited",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Nov 13, 2018",
  "updated": 1546946755000,
  "version": "18.12.03",
  "recentChanges": "Sports betting just got easier, and better, with the all new party poker sports app!",
  "appId": "com.partypoker.sportsbook",
  "searchTerms": "sports betting"
 },
 {
  "title": "Bet On Sports the Sportsbook Betting Freeplay App",
  "description": "You came to win and this is what the Bet On Sports App is here for. Download the Bet On Sports App and you have in your hand a real time full blown mobile sportsbook at your fingertips. \r\n\r\nThis is the real deal and now you can get action on all the sports and events that you love. You want to win bets in a real sportsbook environment and now you can do just that. This is as close to Vegas and real online gambling as you can get. When you start your account you will receive $5000 in free money to play with. You can grow your bankroll every day as you play. Where do you stand as a professional handicapper and gambler? The only way to find out is to play and see if you can Bet On Sports at the next level.\r\n\r\nThe Bet On Sports App is better than the rest. Get betting markets on all major sports including: NFL, NCAA Football, NBA, NCAA Basketball, MLB, NHL, MMA, Boxing, PGA, and every other sport on the planet. The Bet on Sports App also boasts a full LIVE In-Game betting software for you to bet on your favorite teams or events throughout the entire game. That's right, you can bet minute by minute on events that are happening now as they unfold.\r\n\r\n\r\nDownload The Bet On Sports App Today For FREE.\r\n \r\nThe Bet On Sports App mobile application for smartphones, tablets, Android Wear smartwatches and other mobile devices is for entertainment purposes only, and is it not a gambling operator. Your device must have an active internet connection to access the application.\r\n \r\nAdditional terms and conditions may apply.  If you or someone you know has a gambling problem and wants help, please call 1-800-GAMBLER.\r\n \r\nComplete Terms and Conditions: https://www.betonsports.eu/terms/\r\nPrivacy Policy: https://www.betonsports.eu/privacy/\r\n \r\nBet On Sports is not affiliated or endorsed by professional sports leagues, professional sports teams, athletic organizations, non-profit athletic organizations, sports federations or sports governing bodies.",
  "summary": "Bet On Sports...Who doesn&#39;t! Get $5,000 in FREE BETS without a deposit!",
  "installs": "5,000+",
  "score": 3.0666666,
  "ratings": 15,
  "reviews": 6,
  "price": 0,
  "developer": "Meritum Interactive Limited",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 19, 2019",
  "updated": 1583482546000,
  "version": "Varies with device",
  "recentChanges": "Bet On Sports on your Watch with complete Sportsbook offering including real-time betting odds and sports notifications. Offering now Live Betting (In-Play) for the College Basketball Tournament including all major NCAAB games.",
  "appId": "com.sportsbookbetonsports",
  "searchTerms": "sports betting"
 },
 {
  "title": "Smarkets - Betting Exchange",
  "description": "€/£10 Welcome Bonus For New Customers | T&C’s Apply - details below.\r\n\r\n\r\nThe Smarkets exchange is different from other betting apps. We pride ourselves on the best prices (2% standard commission) and technology, rather than relying on gimmicks.\r\n\r\nFeatures\r\n\r\n- Intuitive interface for betting and trading on sports, politics, and more\r\n- Quick log-in with fingerprint\r\n- Two-factor authentication for added account security\r\n- In-play match centre and rapid notifications for top-level football\r\n- Notifications on the status of your bets\r\n- Live charts and order book view for monitoring price movements and history\r\n- A wide range of events and markets across sport, politics, and more\r\n- Manage your position on the go with full exchange functionality and a quick trade-out option\r\n- Live chat with 24/7 customer support\r\n\r\nSmarkets is the world’s most advanced betting exchange, with the best odds on a wide range of sporting, political and current affairs events thanks to our standard industry-low flat 2% commission rate. The Smarkets betting exchange is the best place for betting, trading, matched betting, arbing and more.\r\n\r\n€/£10 Welcome Bonus For New Customers | T&C’s\r\n\r\n1. Once the bonus is credited to your account, losses will be refunded up to the bonus amount.\r\n2. You must deposit at least the qualifying deposit of £20 (or currency equivalent) in a single amount with your first deposit to be eligible for the rebate. \r\n3. To withdraw rebated funds, you must bet at least the qualifying deposit on any combination of markets within the promotional period; otherwise rebated funds will be forfeited. \r\n4. Unused bonuses expire after three months of being credited to a user account and will be removed after this period. \r\n5. Users making their first deposit by Skrill, Neteller, PayPal or a virtual/prepaid card will not qualify for this promotion. \r\n6. The sign up offer is strictly limited to one per individual, family, household address, email address, same payment account number, and shared computer. \r\n7. This promotion cannot be used in conjunction with any other sign-up promotion. \r\n8. Full T&C’s here: https://help.smarkets.com/hc/en-gb/articles/213469085-Smarkets-Terms-and-Conditions\r\n\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org",
  "summary": "Welcome to the brand new Smarkets app, with a fresh design &amp; improved stability",
  "installs": "10,000+",
  "score": 4.524272,
  "ratings": 1042,
  "reviews": 462,
  "price": 0,
  "developer": "Smarkets Limited",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests",
  "released": "Aug 11, 2017",
  "updated": 1588166957000,
  "version": "2.18.4",
  "recentChanges": "In this release 2.18.4:<br><br>- Feature: edit price when trading out<br>- Feature: you can set your desired return, rather than stake, when placing bets<br>- Improved basketball scores displaying more information<br>- New design for the orders tab in the charts screen<br>- New design for the orders modal in the event screen<br>- Bug fixes and performance improvements",
  "appId": "com.smarkets",
  "searchTerms": "sports betting"
 },
 {
  "title": "SharpSide - The Sports Betting Community",
  "description": "SharpSide is a one-of-a-kind, free sports betting community where you can easily add your favorite bets with just a single swipe, find or post helpful nuggets of advice, and track the best bettors.\r\n\r\nBet Swiping - Easily scroll through all games and available bets and quickly swipe left or right to add the bets you like!\r\n\r\nLeaderboards - Want to know who the best NFL money line bettor is? Or the top MLB player prop bettor? Or maybe you just want to check out who is the hottest overall bettor in the last week? Come check out our in-depth leaderboards with a wide variety of different filters for you to figure out who you should be following!\r\n\r\nAdvice - Read up on advice given by other members of the community as you as you scroll through the day's bets.  Have some expertise to share? Post your own advice on your favorite bets for others to use to their advantage. \r\n\r\nBet Tracking - Monitor your open bets, and analyze your past performance by sport or bet type.",
  "summary": "SharpSide is a sports betting community that lets you track bets and find advice",
  "installs": "5,000+",
  "score": 2.7654321,
  "ratings": 81,
  "reviews": 65,
  "price": 0,
  "developer": "RotoGrinders",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Oct 31, 2018",
  "updated": 1582667454000,
  "version": "1.4.0",
  "recentChanges": "-bug fixes",
  "appId": "com.rotogrinders.SharpSide",
  "searchTerms": "sports betting"
 },
 {
  "title": "Bet Analytix",
  "description": "Bet-Analytix®, the best application to manage and analyze your sports bets as simply as possible.\r\n\r\nThanks to a multitude of features, you can optimize the management of your bankroll !\r\n\r\nTo succeed and make money in sports betting is above all to manage your capital perfectly like a company.\r\nManage, analyze and optimize your profits with Bet-Analytix®, the tool that will make you a true expert in sports betting.",
  "summary": "Manage your sports bets",
  "installs": "10,000+",
  "score": 4.191489,
  "ratings": 47,
  "reviews": 28,
  "price": 0,
  "IAPRange": "£10.49 - £27.99 per item",
  "developer": "Bet-Analytix",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Oct 12, 2019",
  "updated": 1589123328000,
  "version": "1.28.2",
  "recentChanges": "- Change the status of your bet directly in the betting list<br>- Organize your bankrolls in the order you want.<br><br>Bug fix",
  "appId": "com.betanalytix.app",
  "searchTerms": "sports betting"
 },
 {
  "title": "Covers Live – Sports Betting Manager App",
  "description": "Bring your sports bets to life with the Covers Live app. Just in time for football season, you can now quick cap your bets on the go with all the tools you need to get the full sports betting experience.\r\n\r\nDon't just place your bet, live it! Whether before, during or after the game, Covers Live gives you the most ways to manage your sports bets on the go;\r\n\r\nDRAW A LINE - Never again miss the line you want by setting custom lines on the matches that are important to you. Set your lines for spreads, moneylines, and totals.\r\n\r\nWE’LL KEEP YOU POSTED - Too busy to stay on top of your preferred lines? We’ll let you know when those lines move up or down with our Line History graphs.\r\n\r\nKNOW THE SCORE – Get the latest live sports scores and game results from NFL, NBA, MLB, NHL and more instantly at the tap of a finger.\r\n\r\nKEEP ORGANIZED – Add all the important football, basketball, baseball, hockey and other game matchups you want to monitor in one convenient place with My Matchups. \r\n\r\nWHERE TO BET – Ready to make your bet? We can help. We’ll connect you with the right sports book when it’s time to put your money down.\r\n\r\nSWEAT IT OUT - We’ll let you know the status of your bets when they’re down to the wire so you don’t miss any of last minute live action. \r\n\r\nTELL YOUR STORY - Share your big wins and heartbreaking loses with your friends in just a few taps.\r\n\r\nCovers is committed to delivering the best sports betting app in the industry. Release two, planned for late 2019, will feature more pre-game handicapping, predictive analysis for best bets, and more odds from more sportsbooks.\r\n\r\nCovers has been the leader in sports betting entertainment for 25 years so download Covers Live and take sports betting management to a whole new level!",
  "summary": "Bring your sports bets to life with our mobile sports betting manager",
  "installs": "5,000+",
  "score": 3.4117646,
  "ratings": 34,
  "reviews": 22,
  "price": 0,
  "developer": "Covers Media Group Ltd.",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Aug 7, 2019",
  "updated": 1582830390000,
  "version": "1.0.0.263",
  "recentChanges": "Fixing a bug related to the offline use of Covers app",
  "appId": "com.covers.liveapp",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports Bet Calculator",
  "description": "The Sports Bet Calculator is the premier free bet calculator app, supporting a wide range of bet types and settling options. Up to 20 selections per bet, configurable bonuses for Alphabet, Lucky 15, 31 & 63, Canadian, Heinz & Yankee bets, plus automatic conversion between Fraction, Decimal and American odds formats, are just some of the highlights.\r\n\r\nSupported Bets:-\r\n\r\n* Single, Double, Treble & Accumulator.\r\n* Trixie, Yankee, Canadian & Heinz.\r\n* Super Heinz, Goliath & Block (+ 'with Singles').\r\n* Patent, Yap, Lucky 15, Lucky 31 & Lucky 63.\r\n* Single Stakes About & Double Stakes About.\r\n* Round Robin, Flag, Super Flag & Heinz Flag.\r\n* Super Heinz Flag & Goliath Flag.\r\n* Fivespot, Pontoon & Magnificent 7.\r\n* Rounder, Roundabout & Bookies Nightmare.\r\n* Alphabet & Union Jack (all variants)\r\n\r\nMore Highlights:-\r\n\r\n* Perms available on most bet types (except certain Speciality bets).\r\n* Flexible input of stake & odds.\r\n* Calculate unit stake from a total stake limit.\r\n* Calculate understaked and overstaked bets, with 'Exact Total' stake setting.\r\n* Each Way (including equally divided).\r\n* Place Terms from 1/1 (all up to win) to 1/6.\r\n* Rule 4 deductions.\r\n* Dead Heat for win or place.\r\n* Settle winning unnamed Joint Favorites.\r\n* Apply bonus to Return or Winnings.\r\n* Light and Dark color schemes.\r\n* Inbuilt help for all bet types & options.\r\n\r\nYour latest bet details can be retained, and modified for use in more calculations, even if the app is shutdown and restarted.\r\n\r\nNote: The Sports Bet Calculator app has been thoroughly tested, but it is possible that unexpected problems may occur on certain devices. If you do encounter any problems, please contact the developer via the email link below, providing details of the model and Android version of the device, along with a description of the problem. Every effort will be made to fix reported problems, where possible.",
  "summary": "Calculate your sports bets with this powerful but easy to use bet calculator.",
  "installs": "100,000+",
  "score": 4.49,
  "ratings": 523,
  "reviews": 208,
  "price": 0,
  "developer": "Gary Smith",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Aug 28, 2012",
  "updated": 1588095572000,
  "version": "Varies with device",
  "recentChanges": "Various accessibility improvements, including:<br>* Redesigned selection status with increased text size and touch area.<br>* Increased page navigation height and text size, to more easily swipe and tap between pages.<br>* Increased size of Settings options text, to improve readability on small screens.",
  "appId": "com.sportsbetcalculator.betcalculatorfree",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports Betting Tips - VIP",
  "description": "Our Sports Betting Tips app gives you daily 2 to 5 free tips in Football, Cricket, Basketball, Ice Hockey & Baseball.\r\n\r\nVIP users will get more accurate betting tips with big odds daily. You will get notification when tips updated.\r\n\r\nWe also give In-Play Betting Tips for popular league matches.\r\n\r\nFeatures in Sports Betting Tips app :-\r\n\r\n- Daily 2 to 5 Free Football Betting Tips\r\n- Cricket Betting Tips will be added on match day.\r\n- Basketball Betting Tips, Ice Hockey Betting Tips, Baseball Betting tips will be added after GMT 15:00 if enough matches available.\r\n- Live Betting Tips will be added daily.\r\n- Instant tips update notification.\r\n- You can view last 10 days tips.\r\n- Very good user interface.",
  "summary": "Get Sports Betting Tips daily with above 90% success rate. In-Play Betting Tips",
  "installs": "10,000+",
  "score": 4.19,
  "ratings": 296,
  "reviews": 182,
  "price": 0,
  "IAPRange": "£3.29 - £98.99 per item",
  "developer": "Sports Tipster",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Apr 28, 2018",
  "updated": 1576163779000,
  "version": "2.9",
  "recentChanges": "* Signup Error fixed",
  "appId": "com.sportstipster.viptips",
  "searchTerms": "sports betting"
 },
 {
  "title": "Profi Tipster App - Sports Betting Tips",
  "description": "Do you like sports? Do you want to earn some money from your hobby too?\r\nWith this application you will be able to profit from betting in the long run.\r\nTake the first step to profitable sports betting and download the app.\r\n\r\nOur Sports Betting Tips app give you daily 5-10 free sports picks and game predictions in Football, Tennis, Basketball and Ice Hockey. By using our Profi Tipster app, you can get daily tips with a high success rate.\r\n\r\nFeatures our Sports Betting Tips app:\r\n\r\n- You can get daily 5 to 10 free expert betting tips, football predictions, tennis predictions, baskettball predictions, ice hockey predictions\r\n- High Odds Tips\r\n- High Betting Accuracy\r\n- Instant notifications\r\n- Betting tips are completely free of charge\r\n- Single bet, HT/FT tips, over/under 2.5 goals, handicaps (asian), \r\n- Positive ROI\r\n\r\nWe analyzing sports events in Brazil, Germany, England, France, Netherlands, Italy, Spain, USA, Korea, Czech Republic, Romania, Bulgaria, Greece, Switzerland, Sweden, Norway, Denmark, Finland, Portugal, Hungary, Tunisia, Philipinies, Taiwan, Turkey, Nigeria, Ghana, Kenya and other more.\r\n\r\nSo do not wait and download our amazing sport recommendations app and predict matches like a pro.",
  "summary": "Free Betting Tips sports prediction. Win at sport bettings. Soccer, Basketball.",
  "installs": "1,000+",
  "score": 4.6,
  "ratings": 263,
  "reviews": 253,
  "price": 0,
  "developer": "Lexecon",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Feb 5, 2020",
  "updated": 1582884930000,
  "version": "1.0.0",
  "recentChanges": "Sport betting tips and predictions update.",
  "appId": "hu.lexecon.tipster",
  "searchTerms": "sports betting"
 },
 {
  "title": "Win Win Betting Tips (No Ads)",
  "description": "Win Win Group Football Betting Tips\r\n\r\nWith our expert team and artificial intelligence supported algorithmic system we are constantly working to give you the best betting predictions.\r\n\r\nOur forecasts are made by creating algorithms based on constantly updated data such as the financial status of clubs, teams, technical team and football players' form graphs, injured or suspended players, past matches and local weather.\r\n\r\nWin Win Bet app offers you only football betting tips.\r\nThere are tips from many country leagues across the globe.\r\n\r\nAustralian A-League\r\nAzerbaijani Premyer Liqasi\r\nBelgian First Division A\r\nDutch Eredivisie\r\nEgyptian Pr. League\r\nEngland Premier League\r\nFrench Ligue 1\r\nGerman Bundesliga\r\nGerman Bundesliga 2\r\nGreek Superleague\r\nHungarian NB 2,\r\nIndian Super League\r\nIsraeli Premier League\r\nItalian Serie A\r\nItalian Serie B\r\nKenyan Premier League\r\nPortuguese Prim. Liga\r\nPort. Segunda Liga\r\nRomanian Liga 1\r\nS. African Pr. League\r\nSaudi Arabian Pro League\r\nScottish Premiership\r\nSpanish Liga Primera\r\nSpanish Liga Segunda\r\nSwiss Super League\r\nTurkish Super Lig\r\nTurkish Lig 1 etc.\r\n\r\n-Ad-free application\r\n-Daily notifications\r\n-Direct communication by email\r\n-Short response time\r\n-Simple Interface\r\n- 1X2 football betting tips and predictions.\r\n- HT/FT football betting tips and predictions.\r\n- BTTS GG football betting tips and predictions.\r\n- Over/Under 2.5 football betting tips and predictions.\r\n- Double chance football betting tips and predictions.\r\n- Half Time Full Time Bet Tips.\r\n- Both Teams to score Bet Tips.\r\n- Big ODDS and Small ODDS Bets\r\n\r\nFor your requests and suggestions, please contact us at winwinbettinggroup@gmail.com\r\n\r\nLet's win together!",
  "summary": "Join our Win Win Betting Tips family to earn more.",
  "installs": "50,000+",
  "score": 4.61,
  "ratings": 531,
  "reviews": 333,
  "price": 0,
  "IAPRange": "£60.99 - £164.99 per item",
  "developer": "Win Win Betting Group",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 6, 2019",
  "updated": 1565104721000,
  "version": "1.1",
  "recentChanges": "Fixed bugs.<br>We are offering betting tips .<br>Our analysis team preparing tips everyday.",
  "appId": "com.winwin.winwinbettingtips",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betdaq Sports Betting",
  "description": "Download BETDAQ Sportsbook for an unbeatable betting experience at your fingertips. Take advantage of our wide range of pre match and in play markets, and when it’s full time, try our Games and Slots all available within the same app!\r\n\r\nWe know you want a mobile app packed full of top quality features, to make betting on the move as slick and profitable as possible. Log-in quickly by finger authentication and access all of the sports markets and betting opportunities you could dream of, alongside a multitude of features including, Live Streaming, In Play Visualizations, Multiples, Soccer Stats, Games as well as Full and Partial Cash Out for when you want to lock in your position in a heartbeat.\r\n\r\nWhether you want to bet In-Play on a soccer match, take advantage of Starting Price or Cash Out, you can do it all in a few taps.\r\n \r\nGreat Features at your fingertips.\r\n\r\n•\tIn Play Betting with newly designed Visualizations giving you the best seat for all the action as it happens.\r\n•\tLive Streaming – Enjoy live streams of Horse Racing and Greyhounds\r\n•\tUtilize our Soccer Stats feature which shows current league form, recent head to head fixture results, winning/losing margin, team statistics and match by match performance throughout the season. \r\n•\tCash out your position fully or partially and lock in your profit. \r\n•\tCustomize your betting with our broad range of account setting.\r\n•\tCheck your bets, balance, cash out offers and much more on the app at any time. \r\n•\tOur push technology platform ensures prices are always up-to-the-second. \r\n•\tOne of the fastest, user friendly and most secure betting apps available. \r\n\r\nQuestions, Comments or Feedback?\r\nDon’t be a stranger – if you would like to speak to one of our team please call us on (UK) 0870 1781 021 (International) +353 1 556 6222 or email us at helpdesk@betdaq.com\r\n\r\n18+, this is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addition help and support, please see below contact details for Gamble Aware in both UK & Ireland. \r\n\r\nUK – http://www.begambleaware.org and 0808 8020 133\r\n\r\nIreland – http://www.gambleaware.ie and 1800 753 753\r\n\r\nBetdaq is owned and operated by LC International Limited, Suites 6-8, 5th Floor, Europort, Gibraltar, is licensed (RGL Nos. 010, 012) by the Government of Gibraltar and regulated by the Gibraltar Gambling Commissioner. All bets struck by customers with accounts registered in Great Britain are regulated by the British Gambling Commission pursuant to the licence held by Ladbrokes Betting & Gaming Ltd. (licence no. 1611)",
  "summary": "Best Odds Guaranteed and Starting Price , Cash Out, Multiples, In Play, Virtuals",
  "installs": "100+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "Ladbrokes Mobile Development",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Jul 25, 2019",
  "updated": 1564045532000,
  "version": "19.3.1.11",
  "recentChanges": "Push Notifications<br>Finger Print Log In<br>Quick Betslip function",
  "appId": "com.gbe.android.sportsbook",
  "searchTerms": "sports betting"
 },
 {
  "title": "Alternative Betting Tips",
  "description": "All Sports and All alternative predictions from all around the world you cannot miss\r\n\r\nAlternative Betting Tips is the simplest prediction app that every football bet player should have.\r\n\r\nYou download this app and you have almost daily predictions from all around the world leagues ready for you to bet on.\r\n\r\nEvery prediction in this app is a result of a statistical algorithmic analysis using a database with more than 150000 sports game matches results. This way our app can achieve a high success rate in predictions.\r\n\r\nStop searching around the internet for betting tips. Be the bet tipster for you and your friends with Alternative Betting Tips\r\n\r\nIf you search for big odds or small sure odds, football or other sports, 1x2, over /  under, handicaps cards tips,corner tips ,goal results,all alternative tip or any other betting tips, you are in the right place. Our team is specialised in football, basketball, tennis and volleyball betting tips with high win probability. \r\nThe main features this app provides are: •\tBetting Tips - Football Matches All Leagues \r\n\r\n•\tBetting Tips - Tennis Matches ATP & WTA\r\n\r\n•\tBetting Tips - Basketball Matches NBA + All Other Leagues\r\n\r\n•\t10 days history of betting tips\r\n\r\n•\tBetting TIPS with very high win rate\r\n\r\n•\tPredictions with big odds and sure matches\r\n\r\n•\tNo registration required..",
  "summary": "Daily soccer, basketball, tennis tips and predictions",
  "installs": "50,000+",
  "score": 4.47,
  "ratings": 943,
  "reviews": 672,
  "price": 0,
  "IAPRange": "£30.49 - £124.99 per item",
  "developer": "Alternative Team",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jan 6, 2019",
  "updated": 1566769170000,
  "version": "1.4",
  "recentChanges": "Yeni VIP seçenekleri eklendi",
  "appId": "com.alternativebettingtips",
  "searchTerms": "sports betting"
 },
 {
  "title": "BettingGods.com - Sports Betting Tips App",
  "description": "Betting Gods ( BettingGods.com ) is a leading provider of professional free and paid sports betting tips and picks.\r\n\r\nCovering Horse Racing, eSports, Football, Golf, Tennis, Cricket, NBA, NFL, NHL, Greyhounds - there is something for everyone is this top betting app.",
  "summary": "Access your favourite tipsters plus free betting tips from BettingGods.com",
  "installs": "10,000+",
  "score": 3.8229167,
  "ratings": 96,
  "reviews": 56,
  "price": 0,
  "developer": "Betting Gods Malta Ltd",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Dec 20, 2016",
  "updated": 1572442577000,
  "version": "1.5.2",
  "recentChanges": "Improved the writing comments feature",
  "appId": "com.bettinggods.app",
  "searchTerms": "sports betting"
 },
 {
  "title": "Bet Stack - Personal bets tracking and stats",
  "description": "Ever felt like you are losing track of all of the bets you place every day? \r\nBet Stack will help you concentrate on making profit! \r\n\r\nThanks to its simple UI, this personal betting assistant will remind you of your events and will help you manage all your placed bets, informing you about your profit and yield on each and every step.",
  "summary": "Stack your bets in a single application - Bet Stack",
  "installs": "10,000+",
  "score": 4.04,
  "ratings": 118,
  "reviews": 72,
  "price": 0,
  "developer": "BD Apps Team",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Oct 22, 2017",
  "updated": 1551446570000,
  "version": "1.70",
  "recentChanges": "Fractional stake - Stake can now be placed with fractional part for better precision.<br>UI Enhancements - Combo picks sections in bet creation wizard can now be collapsed better user experience.<br>Bug fixes.",
  "appId": "com.bdappsteam.betstack",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Tips",
  "description": "Let us help you to bet NOW on sports betting! Use our FREE help before you make sport match bets, including online bets. We compile the best bet news to guide you to bet online or with your bookie/ bookmaker. You can bet on it that we provide the best service on mobile apps because we do this job not to make money but to help you win!  Have you ever thought “which teams should I bet on with my bookie/ bookmaker?” You need reliable tips and guides so you can win when you place sport bets now! \r\n\r\nWe take great care to give you best online bets advice. We use lengthy analysis process including up to date bet news to give you the best guides. Our analysis team consists of 8 people under the leadership of Selim Tekin and Jennifer Glass. We bet on it that you can’t find another online bet tips service with such dedicated teams. However, please note that even the best guide cannot guarantee success 100% of the time. There’s always X factors that goes into it. To minimize the risk of losing, you can visit the \"Tactics\" page within the application. With our help, you can win most bets you place with my bookie/ bookmaker. \r\n\r\n\r\n=== Best Features of Sports Betting Tips for Online Bets: ===\r\n \r\n• Football Odds and Basketball Match Bets Tips. \r\nWe share Football odds, soccer bets, and basketball match bet tips in our application.\r\n\r\n• Minimalist & user friendly Interface\r\nWe design our app to give you the best user experience. \r\n\r\n• Paid and Free Services\r\nOur services are designed according to your preferences. If you prefer high-odds tips, you can earn more by purchasing any of our paid services.\r\n\r\n• High ODDS\r\nIf you need help on high odds bets.  you are in the right place. Our analysis team offers you the best possibility at the highest odds and bet on it now! \r\n\r\n• 100% Analysis\r\nAll paid / free tips we share are 100% analyzed by our team using bets news, up to date information, statistic, etc.\r\n\r\n• 24/7 Support\r\nOur support team is always at your service! You can request assistance by contacting our support team at any time.\r\n\r\n• Fast Communication\r\nIt's easy to contact our support team. You can contact our support team quickly by providing the necessary information from the \"Contact\" page within the application.\r\n\r\nCountries that we support: Nigeria, Kenya, Ghana, Finland, England, France, Germany, Spain, Italy, Chezch Republic, Romania, Bulgaria, Russia, Morocco, Phillipiness, Denmark, Sweden, Greece, Portugal, Tunisia, Azerbaijan Republic, USA, Netherlands, Norway, Taiwan, South Korea and Turkey and more.\r\n\r\nYou can find everything you want to know about Magical Tips on our website. Multi-language option is available on our website. Thank you for choosing us to help you place bet online! Share our app to our friends who also like to place sports bet online!",
  "summary": "Get FREE tips &amp; bet news for basketball, football, soccer bets, etc. Bet now!",
  "installs": "100,000+",
  "score": 4.4445257,
  "ratings": 13729,
  "reviews": 8139,
  "price": 0,
  "IAPRange": "£47.99 - £229.99 per item",
  "developer": "Magical Tips",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 11, 2018",
  "updated": 1577410911000,
  "version": "16.2.1",
  "recentChanges": "• Application design completely changed.<br>• Logo design completely changed.<br>• GOLD system was added to the application.<br>• Lucky Wheel has been added to the application.<br>• Subscription system was added to the application.<br>• Minor changes to the design.<br>• League info added to the app.<br>• Fixed bugs.",
  "appId": "com.magicaltips.freebettingtips",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports Bet",
  "description": "Sports Bets is a random parlay app where you pick up to 12 teams, \r\n6 parlay and give you better change of winning. \r\n\r\nLong Version \r\nWant to beat your bookie.\r\n Love doing parlays. Picks your teams and pick your points\r\n and lets the computer decide what your best odds and worst odds.\r\n This the only apps that has easy access where it help you pick out the \r\nbest odds and best action where you can win money. Great for football and \r\nbasketball games. Help you choose what teams you should pick and what teams\r\n that the point spread might be to high or to low. Sports bet is the best parlay\r\n betting app that help you win your parlays.",
  "summary": "Sports Bets is a random parlay app where you pick up to 12 teams",
  "installs": "10,000+",
  "score": 3.9,
  "ratings": 20,
  "reviews": 9,
  "price": 0,
  "developer": "Terry Joiner",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "May 23, 2019",
  "updated": 1558638546000,
  "version": "1.0",
  "appId": "com.sportsbet.sportsbet",
  "searchTerms": "sports betting"
 },
 {
  "title": "ODDSH@RK Mobile",
  "description": "Sempre con te la tua passione per lo sports.\r\n\r\nScommetti sui tuoi sport ed esports preferiti in tutto il mondo usando le quote live da un importante bookmaker (allibratore) e moneta virtuale. Ora puoi goderti il divertimento e il brivido delle scommesse sportive senza avere assolutamente alcun rischio! Con tutte le caratteristiche di un ottimo bookmaker, con una grande enfasi sull'aspetto sociale e divertente delle scommesse sportive, ODDSH@RK ti offre un modo del tutto nuovo di vivere i loro sport preferiti!\r\n\r\n---------- MONETA VIRTUALE. SPORT VERI ------------\r\nQuando si crea un conto su BETUP registrandosi con Facebook, Google+ o E-mail, riceverai 5000$ virtuali che li si può scommettere. Ti faremo una guida virtuale per aiutarti a piazzare la tua prima scommessa ed esplorare il nostro app, semplice da utilizzare.\r\n\r\nTrovi più di 25 veri sporti dove scommettere, tra cui NFL, NBA, Calcio, NHL, tennis ed esports come Dota Counter, Strike, WoW. Che tu sia una persona sportiva fisica od appassionato di sport, ODDSH@RK (oddsshark or oddshark) ti fa sentirne il piacere di qualsiasi evento sportivo, scommettendo con denaro virtuale sul risultato usando le quote del bookmaker live!\r\n\r\n-------SCOMMESSE SPORTIVE DIVENTATE SOCIAL! -------\r\nL'obiettivo è di vincere il più denaro virtuale possibile scommettendo sugli sport per raggiungere la cima delle classifiche dei migliori scommettitori ogni giorni, settimana e mese. Puoi entrare in gare e sfide giornalmente e metterci le tue conoscenze sportive e le tue abilità di scommessa contro altri giocatori per enormi premi e jackpot per poter aumentare il tuo portafoglio virtuale!\r\n\r\nPassa il livello ed acquisita esperienza mentre entri in altri competizioni e piazza altre scommesse sportive, guadagna titoli e vieni premiato con valuta virtuale per scommettere sui tuoi eventi sportivi preferiti. Visita la sezione dei fan per ogni partita dove puoi commentare, mette Mi piace ed interagire con altri utenti dall'app.\r\nScommesse 365 all’anno, centinaia di partite al giorno!\r\n\r\n------- PARTITE, RISULTATI E STATISTICHE LIVE------\r\nLa sezione delle partite live di BETUP si può personalizzare con le tue squadre, campionati e sport preferiti da poter essere in grado di scommettere facilmente e rapidamente a seconda dello sport. Scommettere nelle prossime partite, o live, e ricevi notifiche push così ne sarai a conoscenza quando inizierà, si segnerà un gol o finirà, dunque resti aggiornato sulle tue scommesse.\r\n\r\nSe ti piace scommettere basandosi sulle statistiche, puoi consultare delle statistiche dettagliate per le ultime 5 partite di ogni squadra, vedere i dati a confronto e controllare le statistiche di una partita in diretta, tra cui il possesso palla, tiri, cartellini gialli, rigori, falli, squadre e formazioni.\r\n\r\n\r\nGratis.",
  "summary": "Always with you your passion for sports",
  "installs": "1,000+",
  "score": 3.4166667,
  "ratings": 24,
  "reviews": 7,
  "price": 0,
  "developer": "Alvar Lambren",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Sep 5, 2019",
  "updated": 1569130680000,
  "version": "1.0",
  "appId": "com.wnapsal.w2mb1",
  "searchTerms": "sports betting"
 },
 {
  "title": "The Pools Sports Betting & Casino",
  "description": "Enjoy the excitement of pre-event and in-play betting along with the thrill of the Casino on your phone or tablet with our Sports betting & Casino app. Whether you're on the move or in the comfort of your own home, bet or play anytime.\r\n\r\nSports Betting\r\n\r\nBest Odds Guaranteed - if you take a price on a horse in a UK or Irish horse race and the starting price is bigger, we'll pay you the bigger price*\r\nDaily Sports Promotions – increase your winnings with odds boosts and promotions.\r\nBet In-Play - a huge choice of exciting in-play markets across every sport\r\nIn-Play Stats - stay close to the heart of the action with the latest match information\r\nPush Notifications - keep up to date with the action and latest offers\r\nVirtual Sports - available 24/7 on football, greyhounds, horses and motor racing\r\nTouch ID & Face ID - bet on your favourite sports quickly and securely (available on compatible devices)\r\nCasino Slots and Games\r\n\r\nA wide range of your favourite games including popular big name slots such as Bonanza, well-known branded games and exciting jackpot games like Mega Moolah.\r\n\r\nLive Casino\r\n\r\nAll the thrill of the casino floor, wherever and whenever you like. Play with real-life casino dealers on Roulette, Blackjack and live Baccarat anytime.\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. https://thepools.com offers a full range of support to promote sensible, socially-responsible gambling. Our Responsible Gambling Policy can be found at https://play.thepools.com/responsible-gaming/. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org\r\nthepools.com © is operated by The Football Pools Limited, a company registered in England and Wales (10573569). The Football Pools is licensed and regulated by the Gambling Commission (Number:  000-048272-R-326339-003).\r\nTerms and Conditions\r\nYou must be 18 or over and be in the UK to use this app.  Please see our website for full Terms and Conditions: www.thepools.com.\r\n*Best Odds Guaranteed offer valid between 11am and 9.30pm, Monday to Sunday",
  "summary": "Sports Betting &amp; Casino",
  "installs": "1,000+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "The Football Pools",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Nov 20, 2019",
  "updated": 1582542923000,
  "version": "1.0.3",
  "recentChanges": "Play the Pools, win it!",
  "appId": "com.thepools.fsb",
  "searchTerms": "sports betting"
 },
 {
  "title": "Mega Tips Bet",
  "description": "Mega Tips Bet  daily free and VIP predictions from all around the world.\r\n\r\nProfessional Tipster Team.\r\n\r\nHigh Success Rate and Basic Interface\r\n\r\n 7/24 Support team,Quick Response.\r\n\r\nFootball Betting Tips,Basketball Betting Tips,Tennis Betting Tips.\r\n\r\nCorrect Score Predictions,\r\nHalt Time Full Time Predictions,\r\nOver Under Tips,Goal-Goal Tips\r\n,Assian Handicap,\r\nSafe Predictions,Safe Picks,\r\nFootball 10+Odds,\r\nDaily Event Tips,\r\nFixed Matches,\r\nSpecial VIP,Elite Tips,Elite VIP.\r\nVIP Predictions.\r\n\r\n\r\nIf you have any problem please contact us via mail.",
  "summary": "Betting Tips",
  "installs": "100,000+",
  "score": 4.526863,
  "ratings": 5799,
  "reviews": 4524,
  "price": 0,
  "IAPRange": "£38.49 - £199.99 per item",
  "developer": "Mega Expert",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Mar 31, 2019",
  "updated": 1583869427000,
  "version": "2.0",
  "appId": "com.hiba.megatipsbet",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Tips Football",
  "description": "Betting Tips Football  –  by Tipstero INC is an informational app with instant access to daily betting tips with great odds, suggestions that can be helpful for every football lover.\r\n\r\nWe created Betting Tips Football because we are a team of passionate football experts. Our specialists like to analyse all opportunities, to get the best out of every match and to have a high win rate.\r\n\r\nEvery day we study many football matches and select the best betting tips with big odds and high win probability. We use all our resources to find strong football matches and we post various predictions like 1x2, double chance, over / under, HT FT, sure games, big odds games. Our strategy of finding the best football betting tips has been tested in the past and proved to be a viable long term strategy if used wisely, only as an information source.\r\n\r\n\r\nAPP FEATURES:\r\n\r\n• Football Betting Tips - daily betting tips with small, medium to big odds and very high win rate\r\n\r\n• History - for our past betting tips\r\n\r\n• All Prediction Types Included - 1x2, double chance, over / under, HT FT, sure games\r\n\r\n• Star Rating System & Win Rate Percentage - 2 trust level indicators that we use for all our betting tips, to rank them according to our trust level. The more stars a match gets the more confident we are about it. You can compare the confidence level vs the win rate probability and pick the best ratios.\r\n\r\n• 5 Different Sections - to provide the best betting tips -> Daily Betting Tips, Super Bonus Tips, Free VIP Sections, Top Match Analysis and Premium VIP called Gold Chest\r\n\r\n• Friendly and easy to use interface\r\n\r\n• Professional design\r\n\r\n• Push Notification when new betting tips are added (with on / off option)\r\n\r\n• Tipstero Betting Tips Football also has a couple of customisation options and customised time zone\r\n\r\n\r\nAPP SECTIONS:\r\n\r\n• Daily Tips - with the most common matches in well known leagues\r\n\r\n• Super Bonus Tip - dedicated to all \"big odds lovers\"\r\n\r\n• Free VIP - 3 different subsections Sure Games, Value Odds, Surprises (Games to Avoid)\r\n\r\n• Top Match Analysis - very detailed analysis with personal commentary, probable lineups, head to head history, attack strategies and much more\r\n\r\n• Premium VIP Gold Chest - It's all you need in terms of betting tips. This section is created by our expert team, specialists in delivering pro analysis and the best football tips. Want to feel like a king? Let us do the hard work and you can relax\r\n\r\n\r\nTerms and Conditions:\r\n\r\nThis application is only an informative tool and must be used just for fun. This is not a betting application, it is not related to betting or gambling in any way. We do not encourage and we do not support betting and gambling.\r\nEveryone who installs / uses the app is 100% responsible for his actions and for obeying the applicable laws in his country. Act responsibly!\r\n18+ Only. Not designed for children.",
  "summary": "Betting Tips Football - Expert Football Betting Tips With Very High Win Rate",
  "installs": "500,000+",
  "score": 4.5828195,
  "ratings": 71521,
  "reviews": 24059,
  "price": 0,
  "IAPRange": "£3.39 - £12.99 per item",
  "developer": "Tipstero INC",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Sep 27, 2017",
  "updated": 1589228910000,
  "version": "1.2.25",
  "recentChanges": "Added support for new sports <br>Bug fixes",
  "appId": "com.tipstero.tipspro",
  "searchTerms": "sports betting"
 },
 {
  "title": "Star Sports Tips - Betting Tips and Predictions",
  "description": "Can you afford NOT to use Soccer Predictions / Sports Tips by Star Sports Tips  when our accuracy is over 86%???  Put the odds in your favor. \r\n\r\nOur Silver soccer tips are offered completely free of charge whilst our Gold soccer predictions have incredibly high accuracy (currently over 86%) making us the most accurate soccer tipster.\r\n\r\nGet plenty of stats (and live soccer scores!) to help with your betting, such as \r\n\r\n✓ League table, \r\n✓ Home table, \r\n✓ Away table, \r\n✓ Last 5 table, \r\n✓ Last 5 home table, \r\n✓ Last 5 away table. \r\n\r\nUnlock the application to allow more betting tips:\r\n\r\n* Gold soccer predictions with accuracy over 86% \r\nOther Sports Picks such as \r\n\r\n* UK Horse Racing \r\n* Motor Racing (Formula 1)\r\n* NFL \r\n* Boxing / UFC \r\n* Cricket \r\n* Tennis \r\n* Basketball \r\n* Baseball\r\n* Golf \r\n* NHL \r\n* Rugby\r\n\r\nWe cover over 400 leagues and delivering our Betting Predictions / Sports Tips 24/7 so we can help with your sports spread betting.\r\n\r\nIf you would like the Soccer only app, you can find it here https://play.google.com/store/apps/details?id=com.bigedev.footballtips\r\n\r\nPlease gamble responsibly, now go smash the bookies!\r\n\r\nKeywords\r\nsports tips, spread bet, sport predictions, horse racing odds, Betting Predictions, Sports Tips, live scores, Formula One, football, rugby world cup",
  "summary": "Don&#39;t be a loser, Never miss a bet, <b>win</b> more with our Sports tips $$$",
  "installs": "50,000+",
  "score": 4,
  "ratings": 400,
  "reviews": 188,
  "price": 0,
  "IAPRange": "£1.79 per item",
  "developer": "Eleo Sports Tips",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jun 27, 2015",
  "updated": 1581804499000,
  "version": "10.20",
  "recentChanges": "Updated Translations",
  "appId": "com.bigedev.cgtipster",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sport Prediction",
  "description": "Sports Predictions the best sports tips / Parley for your bets and betting pool with a high success rate.\r\n\r\nWith Sports Tips, you can make your Parleys more effective thanks to our free application. \r\n\r\nFootball Predictions - Tennis Predictions - Baseball Predictions - Football Results - Football Stats. \r\n\r\nThe best betting Tips. \r\n\r\nParleys are based on years of statistical data, as well as the latest news and information about the different teams.\r\n\r\nThe main features of Sports Predictions are:\r\n\r\n\r\n✔ Percentage for win-home, win-visitor, win-tie. (1x2)\r\n✔ Goal average per game\r\n✔ More than 2.5 goals\r\n✔ Recommended Bet\r\n✔ Odds from the major bookies\r\n✔ Results of football / soccer matches\r\n✔ Classification\r\n✔ Football stats\r\n✔ Live scores\r\n✔ Notifications with results\r\n✔ Calendars, days and schedules\r\n✔ Translated into several languages\r\n✔ Parley\r\n✔ Help with the pool\r\n\r\n\r\nAnd many more features we invite you to see for yourself in our Sports Recommendations app.\r\n\r\nWith the new Recommended Bet method, we will suggest the 15 games with the highest percentages for you, making your bet more effective so you can win more money.\r\n\r\nWith Football Predictions, you will also have the Stats and Results of the football / soccer matches.\r\n\r\nIn Football Predictions, we recommend the best leagues in the world of football. We have more than 240 leagues worldwide, such as:\r\n\r\n\r\n→ Primera Division\r\n→ Segunda Division\r\n→ LeaguePortugal\r\n→ Premier League\r\n→ Serie A\r\n→ Bundesliga\r\n→ Mundial\r\n→ Concacaf\r\n→ Confederaciones\r\n→ Japon\r\n→ China\r\n→ Corea\r\n→ Copa del Rey\r\n→ Capital One\r\n→ Fa Cup\r\n→ Copa Italiana\r\n→ Copa DFB Pokal\r\n→ Copa de la liga\r\n→ Ligue 1\r\n→ League Holandesa\r\n→ League Belga\r\n→ Primera División Argentina\r\n→ League MX\r\n→ League Brasileña\r\n→ Clausura Colombia\r\n→ Eurocopa\r\n→ Champions\r\n→ Europa League\r\n→ Libertadores\r\n→ Etc..\r\n\r\n\r\nIn Sports Predictions, we also have predictions / recommendations for other sports, like:\r\n\r\n\r\n✔ Football\r\n✔ Tennis\r\n✔ Basketball\r\n✔ Baseball\r\n✔ Rugby\r\n✔ League of Leguends\r\n✔ Hockey\r\n✔ Darts\r\n✔ Boxing\r\n✔ Cricket\r\n✔ Beach volleyball \r\n✔ Bowling\r\n✔ Cycling\r\n✔ Field Hockey\r\n✔ etc ..\r\n\r\n\r\nWe have the best Tennis Tipsin the world, with all the championships. Plus,  Baseball Predictions for the best league in the world,  MLB.\r\n\r\n\r\nIn Football Predictions for bets / Parley, we have the following data:\r\n\r\n\r\n✔ Percentage for win-home, win-visitor, win-tie. (1x2)\r\n✔ Goal average per game\r\n✔ More than 2.5 goals\r\n✔ Recommended Bet\r\n✔ Odds from the major bookies\r\n✔ Results of football / soccer matches\r\n✔ Classification\r\n✔ Notifications with results\r\n✔ Calendars, days and schedules\r\n\r\nIn the remaining Parleys, Tennis Predictions, Basketball Predictions, Baseball Predictions, Rugby Predictions, Football Forecasts and American Football Predictions for bets, we have the following information:\r\n\r\n✔ Percent , win- win - Local visitor, win- draw. ( 1X2 )\r\n\r\nYou can access free advice and sports betting for several sporting events, including football. Discover the best bets on game day by reviewing our sports bets and sports betting tips.\r\n\r\n\r\nIn addition to all of this, we also have our official Sports Predictions website, where extra features and functionality are waiting for you. For the best possible user experience.\r\n\r\n\r\nhttps://sportprediction.net/\r\n\r\n\r\nIn Football Forecasts, we are constantly improving our application thanks to your suggestions and comments! Our goal is to have the ultimate Sports Predictions app for betting, and to help you even more with betting Tips.\r\n\r\n\r\nWe are open to further improvements. Contact us at contact@sportprediction.net",
  "summary": "Daily sports predictions for all sports with great success rate.",
  "installs": "500,000+",
  "score": 4.188588,
  "ratings": 10384,
  "reviews": 3776,
  "price": 0,
  "IAPRange": "£0.89 - £14.99 per item",
  "developer": "Rubén Manzaneque Díaz-Hellín",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Sep 25, 2015",
  "updated": 1561638433000,
  "version": "Varies with device",
  "recentChanges": "- Fixed languages to avoid conflicts with Play Store<br>- NEW DESIGN<br>- Details of live games<br>- Error correction",
  "appId": "com.micriptana.pronosticosdeportivos",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports Bets Predictions",
  "description": "Highly accurate football predictions for Kenya Sports and pesa! \r\nStop gambling, invest\r\nThis app has been created by a group of soccer experts who have predicted over 5000 games with a success rate of over 80% .\r\nThe algorithm of our application is based on a a model used to to predict results and analyze several important betting factors such as: points, goals, game scores, league position, struggles and players’ characteristics.\r\n\r\nAnalysis provided for the following:\r\n1. Half Time analysis\r\n2. Full Time analysis\r\n3. Multi Bet\r\n4. VIP section\r\n5. Strong Picks\r\n6. Mega Jackpot MJP\r\n7. Midweek Jackpots\r\n8. Pesa Games\r\n9. Jenga Bet\r\n\r\n\r\nThe following games will be analysed:\r\nPREMIER LEAGUE\r\nUEFA CHAMPIONS LEAGUE\r\nEUROPA LEAGUE\r\nLA LIGA\r\nITALY SERIE A\r\nBUNDESLIGA\r\nLIGUE 1",
  "summary": "This app will help you predict some football matches to increase your wins.",
  "installs": "100,000+",
  "score": 4.19774,
  "ratings": 1788,
  "reviews": 723,
  "price": 0,
  "developer": "Kaberia Apps",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Dec 6, 2016",
  "updated": 1586559855000,
  "version": "1.0",
  "recentChanges": "Stay safe background added.<br>User interface improved",
  "appId": "sportspesa.gamesprediction",
  "searchTerms": "sports betting"
 },
 {
  "title": "Karamba Sports Betting - Bet On Football & More",
  "description": "Join and Get a Welcome Bonus: Bet £10 Get £10\r\n\r\nOur amazing app is all-in-one gaming platform, to enjoy the BEST Sports Betting games and odds. \r\n\r\nKaramba is the best place online to enjoy live betting on all your favourite sporting events:\r\n\r\n⚽Football,\r\n🎾Tennis, \r\n🏉Rugby \r\n⛳Golf\r\n🐎Horse racing\r\n\r\n💰GRAB YOUR WELCOME OFFER! Get a £10 Risk Free Bet when you 1st bet £10!\r\n\r\n⚽BET ON ALL THE TOP LEAGUES \r\nThe Karamba App is the best place to enjoy live betting on all your favorite sporting events from football, tennis, rugby, basketball and more! We’ve got all the top local and international events for you to bet on, whatever sport kicks it for you…we’ve got it!\r\n\r\n0ver 20,000 in-play matches a month and more than 2,000 proprietary betting markets to bet on.\r\n\r\nENJOY A SMOOTH PLAYING EXPERIENCE\r\nCrafted for optimal play on iOS devices, the Karamba Casino & Sports Betting App is fast loading and ultra-easy to navigate! Cut straight to the action and maximize your playing time!\r\n\r\nGET SPORTS BETTING TIPS FROM OUR KARAMBOT!\r\nOur KaramBot is an exclusive bet recommendation engine designed to help you place smarter bets both before kick off, and live during the action. He won’t wash your dishes, but he may just help you to score more on your sports bets at Karamba! \r\n\r\n\r\nPOWER YOUR BETTING EXPERIENCE\r\nAt Karamba not only will you get to enjoy top betting odds on all your favourite sporting events 365 days a year, but you’ll also get to use our exclusive bet recommendation engine, the KaramBot! The smart AI bot works by constantly scanning and analysing the football betting market to provide bet suggestions which could help you to bet more accurately. All KaramBot recommendations are based on scenarios that have been sourced from backtesting of actual events and statistics. For the KaramBot, the sky is the limit for processing and analysing football data! \r\nKARAMBA’S DEDICATION TO FAIR BETTING\r\nWe are committed to providing a regulated and fair betting experience for all our players and bettors from the moment they join us. At Karamba, you can always review your betting activities by accessing your betting history and banking history logs. Karamba is regulated by the UK Gambling Commission and is dedicated to making sure that things stay fun. \r\n\r\nGet started today and enjoy betting on a wide range of sporting events including all the most popular ones here at Karamba Sports betting app.\r\n\r\n**TOP TIP: Turn on push notifications to make sure that you don’t miss out on our crazy Karamba promotions! \r\nThe Karamba customer support team is here to help 7 days a week. Got a question or need some advice? Just drop us a line! \r\nAs one of the most advanced betting apps available, Karamba is continually being updated in order to provide bettors with the most relevant and thrilling online betting experience. \r\nWebsite: https://www.karamba.com/sport/\r\nPlease gamble responsibly: https://www.begambleaware.org",
  "summary": "Join Today &amp; Bet on All Sports Events .Get a Welcome Bonus: Bet £10 Get £10.T&amp;C",
  "installs": "1,000+",
  "score": 3.402439,
  "ratings": 82,
  "reviews": 72,
  "price": 0,
  "developer": "Aspire Global plc",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Apr 26, 2018",
  "updated": 1531137364000,
  "version": "1.0.2",
  "recentChanges": "New notifications feature.<br>Bug Fix <br>More bonus",
  "appId": "com.karambasport.app",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Union  Soccer Predictions and Betting Tips",
  "description": "Welcome to Betting Union Sports\r\n\r\nSoccer Predictions & Betting Tips helping You to win Money. The Words famous expert Tipster predictions to help you placing the right Bets - Betting Union Sports is the right place for You.\r\n\r\n\r\nBetting Union app offers you only soccer betting tips. \r\nThere are tips from many country leagues across the world.\r\n\r\nWe offering the most profitable free soccer betting predictions, help you to increase your balance to the maximum.\r\nUse our FREE App before you start betting,\r\nWe compile the most effective bet news to guide you to bet on-line or along with your bookie/ bookmaker.\r\nBetting Union offer the most effective service on mobile apps as a result of long time experiences.\r\n\r\nWe examine the previous fame of teams, Players shape and injuries popularity, weather situations of the stadium,\r\nprevious results, desk points, previous suit performance, referees and lots of more (and some secret things we wont share to public).\r\n\r\nBetting Union Sports serving football predictions, soccer betting tips and in-depth analysis for the most common leagues worldwide - with super high Odds.\r\nOur Betting Tips system is automated, functioning entirely without human distortions. \r\nOur analysis team is analyzing big WWW data working with an unique prediction engine powered with machine learning algorithms.\r\nOur algorithms are unique and processing with our background in statistical prediction analysis competition and expert betting knowledge for highest Odds.\r\n\r\nBetting Union Sports is completely free, we offering common betting tips like over/under or correct score and much more.\r\n\r\nWe offering only betting tips - placing bets you have to do yourself externally.\r\n\r\n\r\nPlay regularly with a fixed amount of money (e.g. play continuously with 10% of your money) - as mentioned before : start with single betts\r\nYou will make money if you place single bets and play constantly.\r\n \r\nDon't forget : Regular betting with our tips is the best way to make money continuously and consistently.\r\n\r\nDaily fresh tips always at 10 AM\r\n\r\nWe offering daily tips for the most common leagues and also minor leagues with VIP prediction, Half Time / Full Time and also Correct Score Tips.\r\n\r\nBetting Union Soccer Prediction app offers you a perfect solution which allow you to make a good result in soccer betting.\r\n\r\nOur users will get each day free soccer predictions with the maximum profitable margin.\r\n\r\n\r\n\r\nGive Yourself a try, Install now Betting Union Sports and start winning big money.",
  "summary": "Betting Tips online Betting Predictions and Experttips FREE",
  "installs": "50,000+",
  "score": 4.3421054,
  "ratings": 5719,
  "reviews": 3857,
  "price": 0,
  "IAPRange": "£70.99 - £129.99 per item",
  "developer": "Betting Union Inc.",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jul 10, 2019",
  "updated": 1575324477000,
  "version": "1.1",
  "recentChanges": "- Life Ticker Support<br>- With new High Accurate Tips<br>- Updated SDK libraries<br>- Several Bugfixes<br>- New improvements have been done<br>- Shrink size of code<br>- Strong tips by Our Team<br>- Code fixes made<br>- With VIP, HTFT, PREMIUM and CORRECT SCORE Tips<br>- %100 FIXED Tips<br>- Update SDK and libraries",
  "appId": "com.bettingtips.bettingunionsport",
  "searchTerms": "sports betting"
 },
 {
  "title": "Football Tips - free betting predictions",
  "description": "Football Tips is a sports tipsters' application for Android. We are not a bookmaker, we are a free application that gives betting advice, known as \"picks\" or \"tips\". We provide a free \"tip\" every day.\r\n\r\nWhat we offer:\r\n- A free football prediction every day (when there are more reliable football matches, there are more free bets);\r\n- Odds over 2 are used most of the time, which is preferred by our users;\r\n- Full tips history with total profit and monthly/daily profit shown;\r\n- Unique prediction method using machine learning + human selection for each of the tip\r\n- Fast and reliable app using latest optimization algorithms, which will not drain your battery more than needed.\r\n- Friendly and easy to use interface\r\n- No registration or personal info required\r\n- Push Notification when new betting tips are added\r\n- The best success rate amongst the top free apps on the market (proven). Our highest success for one month is 36LSP. Total success rate up to now is 84LSP, which is also the highest among top apps.\r\n- A fresh Facebook page, so you could like and share our app and give us a feedback easily\r\n\r\nWho we are:\r\nWe are a team of passionate football betting experts. Our specialists like to analyze all opportunities, to get the best out of every match and to have a high win rate when placing a bet. We will not lie with our history as some other apps might do. This project started in 2012, and our happy users rely on our tips for more than 7 years.\r\nHistory can be used to track current progress and plan the prediction of future events. Some users could use the tips with gambling purposes also App has high win rate when placing a bet.\r\nOur strategy of finding football matches with big odds and provide the best betting tips has been tested successfully in the past and proved to be a winning long term betting strategy.",
  "summary": "Free and VIP Football and Sports Betting Predictions With Very High Win Rate",
  "installs": "50,000+",
  "score": 4.82,
  "ratings": 894,
  "reviews": 656,
  "price": 0,
  "IAPRange": "£0.79 - £31.99 per item",
  "developer": "jftdev",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Feb 24, 2017",
  "updated": 1588967216000,
  "version": "Varies with device",
  "recentChanges": "The best betting info on the market. Sure profit. Free tips. Full tips history. None of the other apps on Google Play provides such service! More tipsters joined our team. Bigger odds and more events added.",
  "appId": "com.babaceca.tips",
  "searchTerms": "sports betting"
 },
 {
  "title": "RAYS SURE BETS:Betting Tips Int",
  "description": "WELCOME TO RAYZ SURE BETS\r\n\r\nARE YOU LOOKING FOR A GOOD GENUINE AND DEDICATED SOURECE?,HERE'S YOUR CHANCE TO WIN AND MULTIPLY YOUR MONEY, RAYZ SUREBET BEING ONE OF THE WORLD'S NUMBER ONE BETTING APP/SITE IS INTENDED TO HELP YOU MAKE FAVOURABLE DECISIONS WHILE DOING SPORTS BETTING BY DELIVERING TO YOU THE MOST ACCURATE RESULTS OF THE GAMES  YOU BET ON.\r\n\r\n    OUR PREDICTIONS ARE MADE BY USING THE PREVIOUS MATCHES HISTORIES,INJURIES TO CALCULATE THE MOST PROBABLE OUTCOME OF THE NEXT MATCH.OUR PROFESSIONAL TEAM OF TIPSTARS   PROVIDE YOU WITH BETTING TIPS AND GUIDELINE S WHICH WILL INEVITABLY LEAD TO WINNING ON EVERY BET YOU PLACE ON.AS WE PROVIDE YOU WITH THE TIPS WE ALWAYS MAKE SURE THAT OUR TIPS ARE FOUND ON ALL BETTING SITES ACCROS THE WORLD.WE ARE ALWAYS TRYING TO BE THE BEST AND LEADING MATCH ANALYST IN:.\r\n\r\n                Nigeria, Ghana,Kenya, UK, S.A\r\n   England,Uganda,Tanzania,Zimbabwe  Germany,France,Italy,Spain,Korea,Czech Republic,Netherlands,,Romania, Spain, Usa,Sweden,Denmark,Estonia Bulgaria,Greece,Switzerland,Finland,Portugal,Turkey,Norway,Philippines AND MANY MORE.\r\n\r\nSAFETY IS ALWAYS OUR WATCHWORD, HONESTLY IS THE GREACE TO OUR ELBOWS ,COME ON WITH US AND BE SURE TO HAVE YOUR MAXIMUM REWARDS ON OUR BEST TIPS.IN CASE YOU EXPERIENCING CHALLENGES WHILE USING OUR APP FEEL FREE TO SEEK FOR HELP. \r\n\r\n         NOTE! \r\nWE ALL KNOW THAT GAMBLING IS VERY ADDICTIVE AND CAN LEAD TO A MESS IF NOT TAKEN SERIOUS.SO IF YOUR 18 YEARS AND ABOVE THIS PLATFORM IS FOR YOU BUT IF YOUR ARE LESS,PLEASE AVOID THIS APP/SITE. WE ALSO RECOMMEND YOU TO TAKE NOTE OF THE MONEY YOU BET WITH WE DON'T WANT YOU TO REGRET ESPECIALLY WHEN YOU LOOSE.SO DO NOT BET WITH YOUR SCHOOL FEES,HOUSE RENT,OR FAMILY SPECIAL FUNDS INTENDED FOR SPECIAL ACTIVITIES.KINDLY AVOID.WE ALWAYS APPLY CAUTION AND DIRECT OUR OUR CLIENTS ON METHODS  AND LEVELS OF OF STAKES WHICH WILL INEVITABLY GRANT THEM PROFITS BY THE END OF THE DAY.WE ALSO ENCOURAGE OUR ALL GAMBLERS TO REGISTER WITH BOOKIES THAT OFFER *CASH OUT* OPTION.THIS  WILL HELP YOU WITHDRAW/CASH OUT YOUR MONEY IN CASE YOU NOTICE 1 OR 2 GAMES ARE CASTING YOUR BET SLIP. BE SURE TO ENJOY OUR TIPS.ONCE AGAIN WE SAY WELCOME TO RAYZ SUREBET FAMILY!  \r\n\r\nFOR HELP OR INQUIRIES  CONTACT US THROUGH:Yesweareray@gmail.com‎",
  "summary": "BETTING TIPS WITH STEADY WINNING EVERYDAY",
  "installs": "5,000+",
  "score": 4.87,
  "ratings": 534,
  "reviews": 460,
  "price": 0,
  "developer": "SUREBET BETTING TIPS",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jan 17, 2020",
  "updated": 1579264487000,
  "version": "1.0",
  "recentChanges": "WE HAVE THE NEW UPDATES<br>         -Well analyzed predictions <br>         - All types of common picks available on the app<br>        -Tips provided on this app are found on all betting sites/bookies or shops<br>         -Proper guidelines on how to bet <br>         -Legal Disclaimer of the app available <br>        -Friendly Customer service interface available.<br>        -Privacy policy fixed",
  "appId": "com.winningsbets",
  "searchTerms": "sports betting"
 },
 {
  "title": "Gee Sports Bet",
  "description": "It helps a lot to generate more income profits by using our sports betting platform system to save more goodies in your pocket and you shall never regret having business with us",
  "summary": "This application serve as an easy way to eradicate poverty on earth",
  "installs": "500+",
  "score": 4.4545455,
  "ratings": 22,
  "reviews": 17,
  "price": 0,
  "developer": "geebets",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jan 15, 2020",
  "updated": 1579097628000,
  "version": "1.0",
  "recentChanges": "Enjoy winning sports betting with us",
  "appId": "com.gee.sports.bet",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betfair Exchange Betting – Bet on Football",
  "description": "New customer offer: Get Up To £/€20 Risk Free bet, T&Cs apply. Full T&Cs below.\r\nBet against someone like you, not the bookie, so that you could win bigger with the Betfair Exchange.\r\n\r\nThe Betfair Exchange gives you the contol to:\r\n- LAY. Bet against an outcome so that when it doesn't win, you do.\r\n- SET YOUR OWN ODDS. Ask for the price you want to get better value.\r\n- TRADE MARKETS. Hedge your bets to lock in profit whatever the result.\r\n- BET IN-PLAY. With the creators of in-play betting. \r\n\r\nSAFE AND SECURE:\r\nBetfair is a licensed gambling operator in the UK, Ireland, Australia, Malta, Italy, Gibraltar, Denmark, Bulgaria, Romania and Spain. The Betfair Exchange app is only available to customers over the age of 18. You must have a valid Betfair account in order to use this app. \r\n\r\nTERMS & CONDITIONS: Get Up To £/€20 Risk Free bet\r\n1.\tWho can take part?\r\nYou can only take part in this offer if you are not an existing or a previous Betfair account holder.\r\nThis offer is not available to accounts registered in any of the following countries - Armenia, Portugal, Bulgaria, India, Belarus, Chile, Croatia, Hungary, Latvia, Macedonia, Moldova, Romania, Russia, Serbia, Slovenia, Tunisia, Ukraine.\r\n2.\tHow and when can I qualify?\r\nThe first Exchange bet you place within 7 days of registering your new Betfair account can risk up to £20. Your bet must settle in this period too.\r\n\r\n3.\tWhat else do I need to know?\r\nOnly deposits made using credit/debits cards and Paypal will qualify for this promotion.\r\n\r\nUnmatched, unsettled or voided bets will not count towards this promotion.\r\n\r\nIn the event that two qualifying bets are placed at the same time, the first bet to settle will be your qualifying bet. In the event that your qualifying bet wins, there will be no credit to your account.\r\n\r\n4.\tWhen will I get my prize? \r\n\r\nWe'll aim to credit your account within 72 hours of your qualifying bet being settled\r\n\r\n5.\tOther boring but essential stuff\r\n\r\nBetfair reserves the right to disqualify you from the promotion and/or close your Betfair account if it considers there is sufficient evidence of abuse of the promotion, for example by using more than one username or opening more than a personal betting account to take part in the promotion. In such cases Betfair will not credit you.\r\n\r\n\r\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 (UK)/ 1800 753 753 (IE) or visit https://www.begambleaware.org/ for UK or http://www.gambleaware.ie/ for IE.",
  "summary": "Pick Your Odds - Back and Lay Bets Against Punters from all over the World",
  "installs": "100,000+",
  "score": 4.1626506,
  "ratings": 1669,
  "reviews": 597,
  "price": 0,
  "developer": "Betfair LTD",
  "genre": "Sports",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1582554768000,
  "version": "5.0.5",
  "recentChanges": "We’ve introduced a range of performance improvements so the app is even quicker and easier to use.",
  "appId": "com.betfair.exchange",
  "searchTerms": "sports betting"
 },
 {
  "title": "LeoVegas - Real Money Casino & Sports Betting",
  "description": "A welcome bonus of 20 Spins on one of our most popular slot games just for signing up, no cash deposit needed! 18+ New Customers only. Opt in required. 20 Free Spins on Book of Dead game only.  Must be claimed on ‘’My Offers’’ page within 14 days of sign-up. Free Spins have a £0.10 value each; expire 7 days from claim. 35x wagering requirement on eligible slots before winnings converted to cash. Eligibility requirements apply. Read T&C's below. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please visit https://www.begambleaware.org/ or contact 0808 8020 133.\r\n\r\nJoin millions of players on the virtual casino floor when you download the multi-award winning LeoVegas mobile gaming app. Spin for the jackpot on our slot machines, take a seat at any live dealer table from Blackjack to Roulette or even place a bet on your favourite sports with our online bookie. \r\nVegas-style fun at your fingertips.  Experience a real life casino while you play at our live casino lounge. Spin the Roulette wheel or deal you in to Blackjack, Baccarat and other live casino Games. Enjoy a huge selection of the best slots games and discover exclusive slots games to LeoVegas. \r\n\r\nLeoVegas\r\nLightning-fast loading, deposits and withdrawals\r\n24/7 Customer service with agents from the UK \r\nA VIP experience fit for a king\r\nLeoSafePlay to help you gamble responsibly\r\n\r\nAward Winning \r\n'Best Native App' EGR Marketing & Innovation Awards 2017\r\n\r\nCasino\r\nOver 1000 online slots, RNG and jackpot games\r\nPopular UK slot games including Book of Dead, Rainbow Riches, Extra Chilli and many more.\r\nProgressive Jackpot slot games & classic online slots to choose from\r\nFantastic RNG table games like Blackjack, roulette, baccarat and more.\r\n\r\nSport\r\nBet in-play on all the popular sporting events \r\nInstant betting markets \r\nBoosted live and pre-match odds\r\nBet and watch live\r\nClaim your winnings before the match ends\r\n+120k live events with the widest range of betting markets on the top leagues\r\n\r\nLive Casino\r\nReal casino play with first-rate dealers \r\nThe latest exclusive tables including roulette, baccarat and blackjack\r\nHD quality streaming from dedicated studios and luxurious locations around the world\r\nBespoke LeoVegas tables including roulette, baccarat and blackjack\r\nAn immersive experience with full-screen functionality \r\nAccess to seat availability, latest roulette numbers and gaming limits with dynamic data\r\n\r\nWhen you sign up at LeoVegas, choose from 3 different bonuses:\r\n- Casino - To get a taste of our online slot games\r\n- Sport - Boost your first bet\r\n- Live Casino - Extend your time at the blackjack or roulette table \r\n\r\nThe promotions page within the app is filled with the latest offers for existing customers.\r\n\r\nIf you have an account with LeoVegas, simply use this app to login and play from the same account as if you were on LeoVegas.com. \r\n\r\n20 Free Spins No Deposit needed T&Cs\r\n\r\nAll new casino players from the UK who are 18 years and over will be eligible for 20 Free Spins on selected slot games when they create an account at LeoVegas.com, subject to the terms and conditions below. 20 Free Spins Registration Bonus \r\n1. This offer is available to all new UK players registering at LeoVegas.com from the 8th April 2019. \r\n2. Any winnings from the Free Spins must be wagered 35 times before they can be withdrawn. 3. Free Spins are worth £0.10 each and are valid for 7 days upon activation unless otherwise stated. \r\n4. The game on which Free Spins are awarded is subject to change from time to time. \r\n5. Currently, Free Spins can be used on the following slot games: Book of Dead\r\n6. Free spins must be claimed on ‘’My Offers’’ page within 14 days of sign-up.\r\n7. General Terms and Conditions of the LeoVegas website apply (https://www.leovegas.com/en-gb/promotions/bonuses/c\r\n\r\nLicences\r\nLeoVegas Gaming Ltd is licensed and regulated by the MGA and holds a UK licence issued by the Gambling Commission - UK Licence Number: 000-039198-R-319450-002.",
  "summary": "Discover our award-winning LeoVegas App &amp; collect 20 spins when signing up.",
  "installs": "50,000+",
  "score": 4.42,
  "ratings": 577,
  "reviews": 272,
  "price": 0,
  "developer": "© LeoVegas Gaming PLC",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Aug 10, 2017",
  "updated": 1579251393000,
  "version": "3.4.8",
  "appId": "com.leovegas.leocasino",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Tips",
  "description": "SureTips Adviser offers free betting tips application with instant access to FREE and VIP Betting tips with great odds, tips that can be useful for every sports fan (especially football, basketball and tennis).\r\n\r\nThe team evaluates all opportunities to get the best out of every match in order to have a high win rate for all betting tips that we provide.\r\n\r\nThe application comes in a great design and offers interactive menu (options including ads removal, free and vip betting tips).\r\n\r\nBetting tips app features:\r\n• Free and VIP sports betting tips (many sports)\r\n• History (for the past 4 days)\r\n• Easy-to-use interface\r\n• Two different sections: Free betting tips and VIP betting tips\r\n• Free tips are absolutely free of charge (smaller odds than VIP football tips)\r\n• VIP tips service\r\n• Built-in possibility to contact developer & tipsters at suretips.adviser@gmail.com\r\n• Up to 5 free tips with smaller odds (odds starting from 1.30 up to 1.70 in free section)\r\n• Up to 10 VIP betting tips with higher odds (odds starting from 1.50 up to 2.50 in VIP section).\r\n\r\nThank you for using our service!\r\n\r\nKeywords: betting tips, tips, betting, football, odds, free",
  "summary": "Betting tips app with high winning rate. Best odds!",
  "installs": "100,000+",
  "score": 4.51585,
  "ratings": 3508,
  "reviews": 1556,
  "price": 0,
  "IAPRange": "£8.99 - £27.49 per item",
  "developer": "SureTips Adviser",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Apr 22, 2018",
  "updated": 1575550837000,
  "version": "1.012",
  "recentChanges": "Best Betting Tips app! Biggest VIP community!",
  "appId": "com.suretips.bettingtips",
  "searchTerms": "sports betting"
 },
 {
  "title": "India Bet Official",
  "description": "India Bet is a free, fun app where only virtual currencies are used. You can't deposit or withdraw money from India Bet.  All gaming and sporting activities on India Bet are just for fun and are not a form of gambling.\r\n\r\nAt India Bet we want our users to have fun, betting for free in a safe and legal environment. Players are given a virtual currency called India Bet Rupees (IBR) and with this they can earn India Bet Stars. India Bet Stars can then be traded for tickets into our prize draws.\r\n\r\nWe offer a number of sporting events including cricket that you can bet on as well as virtual and instant games. We also offer leaderboards with prizes for those who want to compete against other India Bet members for the top spot.\r\n\r\nIndia Bet Offers:\r\n\r\n- Prize Draws\r\n- Leaderboards\r\n- Competitions\r\n- Betting on sports including cricket, football and horse racing\r\n- Lots of Indian games such as Teen Patti, Jhandi Munda and Passa\r\n- Traditional games like Blackjack, Roulette and Slot Machines\r\n- Live chat with like minded people",
  "summary": "Betting for fun to win prizes. India Bet is free-to-play and no money involved!",
  "installs": "50,000+",
  "score": 4.13,
  "ratings": 349,
  "reviews": 145,
  "price": 0,
  "developer": "India Bet",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 21, 2017",
  "updated": 1564492354000,
  "version": "1.7.1",
  "recentChanges": "App now supports 64bit Android versions.  Removed Google Play login, too many incompatibilities.",
  "appId": "com.indiabet2.android.app",
  "searchTerms": "sports betting"
 },
 {
  "title": "iHorse Betting: Horse racing bet simulator game",
  "description": "Sick of playing slots? From the team that brought you the iHorse Racing Series games including iHorse Racing 2 (horse racing manager and trainer game) and iHorse GO (real-time player versus player horse racing game), iHorse Betting: Bet on horse races is the most realistic horse betting simulator game on the market! \r\n\r\nQuick paced just like slots, iHorse Betting: Bet on horse races is free to download and play. Featuring realistic 3D horse racing gameplays, watch intense races and bet against those odds with a Win, Place/Show, Quinella/Exacta, Quinella Place/Swinger/Duet, Trio/Trifecta and more! \r\n\r\nIn-game currencies can be purchased for real money. Internet connection required to play. This game is intended for use by those 21 or older for amusement purposes only. Practice or success in this game does not imply any success at real money gambling. iHorse Betting: Bet on horse races does not manipulate or otherwise interfere with tournament outcomes in any way. Results are based entirely on luck and the choices made by players in the tournaments.\r\n\r\n▶ Bet big and win big! Wager on horse races with multiple types of betting choices available: Win, Place/Show, Quinella/Exacta, Quinella Place/Swinger/Duet, Trio/Trifecta and more!\r\n▶ Fast, quick paced horse race betting so you don't have to wait!\r\n▶ Free coins to start plus plenty of hourly bonuses! \r\n▶ Hit the Jackpot every horse race season in the Live tournament!\r\n▶ Compete with the best horse racing punters globally!\r\n▶ Featuring legendary horses and star jockeys from United States, United Kingdom, Japan, France, Hong Kong and more.\r\n▶ The most realistic 3D tracks and horses model for horse racing simulator! Simulated track turns, weather effects and elevations from Hong Kong racecourses!\r\n\r\n===================================\r\n\r\nFind us on Facebook for the latest updates at:\r\nwww.facebook.com/iHorseBetting\r\nwww.facebook.com/iHorseGOENG\r\nwww.facebook.com/iHorseRacingENG\r\nCustomer Service email: cs@gamemiracle.com",
  "summary": "Horse race betting simulator game from the iHorse Racing series",
  "installs": "1,000,000+",
  "score": 4.046407,
  "ratings": 7477,
  "reviews": 1944,
  "price": 0,
  "IAPRange": "£0.64 - £92.99 per item",
  "developer": "Gamemiracle",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 8, 2011",
  "updated": 1576035720000,
  "version": "2.32",
  "recentChanges": "Bug fixed",
  "appId": "gamemiracle.iHorseBettingFree",
  "searchTerms": "sports betting"
 },
 {
  "title": "Champions Sports Betting Tips",
  "description": "Champions Sports Betting Prediction Tips app offers you winning football betting premium and VIP tips for free so you can gracefully make cash for real from sports betting!\r\n\r\nWith the help of our professional Sport Betting tipsters who come up with the safest betting tips from all Football competitions over the world \r\n\r\nOur Prediction Tips Features:\r\n- Daily Football Betting Tips (Soccer Betting Tips).\r\n- 1X2 Betting Tips.\r\n- Today Betting Tips.\r\n- Football Predictions (Soccer Predictions).\r\n- Football Estimates (Soccer Estimates).\r\n- Completely Free Betting tips (Free Bets).\r\n- Best available Bets prepared by our professional analyst team.\r\n- High Odds (Big Odds) and Sure Small odds.\r\n- Sure, Safe and Secure Bet Tips (Best Bets).\r\n- High-quality tips.\r\n\r\nWe Made Champions Betting Tips Application to provide:\r\n- 1X2 Home/Draw/Away Betting Tips (Soccer Full Time Betting Tips: FT:1, FT:2, FT:X).\r\n- Football 1X2 Predictions. \r\n- HT/FT Betting Tips (Soccer Half Time / Full Time): 1/1, X/1, 1/X, 2/2, X/2, 2/X, 1/2, 2/1.\r\n- Football HT/FT Predictions. \r\n- BTTS Yes/No Betting Tips (Soccer BTTS, BTS, GG, NG), Both Teams To Score Betting Tips.\r\n- Football BTTS Predictions. \r\n- Over/Under 2.5 Goals Betting Tips (Soccer O/U 2.5 Bets).\r\n- Football Over/Under2.5 Predictions.\r\n- Over 2.5 Goals Picks: Over0.5, Over1.5, Over2.5, Over3.5, Over4.5.\r\n- Under 2.5 Goals Picks: Under0.5, Under1.5, Under2.5, Under3.5, Under4.5.\r\n- Double Chance DC Betting Tips: 1X, 2X, X1, X2, 12.\r\n\r\nFrom Top Leagues All Over the world including:\r\n\r\nEnglish Premier League\r\nSpanish La Liga\r\nGerman Bundesliga\r\nItalian Serie A\r\nFrench Ligue 1\r\nDutch Eredivisie\r\nChinese Super League\r\nMajor League Soccer\r\nPortuguese Primeira Liga\r\n Brasileiro Serie A\r\nEgyptian Premier League, \r\nIndian Super League,\r\n Super League Greece, \r\nQatar Stars League, \r\nArabian Gulf League, \r\nAustralian A-League, \r\nPolish Ekstraklasa,\r\n Scottish Premier League,\r\nArgentinian Primera Division, \r\nJapanese J1 League,\r\nTurkish SuperLig,\r\nUkrainian Premier League\r\nRussian Premier League, \r\n Swiss Super League, \r\n Belgian Jupiler Pro and others.",
  "summary": "Sports Betting Tips, 1X2/, HT/FT, Prediction tips from experts, VIP and Premium",
  "installs": "100+",
  "score": 5,
  "ratings": 5,
  "reviews": 3,
  "price": 0,
  "developer": "PG007",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Feb 14, 2020",
  "updated": 1582096989000,
  "version": "1.3",
  "recentChanges": "Beautiful UI<br>Easy to Use",
  "appId": "com.mfpt.championsbettingtips",
  "searchTerms": "sports betting"
 },
 {
  "title": "One Game Betting Tips",
  "description": "Sports betting for us here at RVeasy Sports is a pleasurable experience. User are making money with our betting tips that are sure to deliver success day by day and this is not just a claim, its happening! A lot of apps out there claim offering 100% betting tips or free betting tips with actually no prove of what they promise. We do not promise to offer you fixed odds however our predictions are one of the best you can find in the betting prediction industry. \r\n\r\nWe provide premium betting predictions that will most definitely increase your bankroll exponentially. Other apps provide you with 3, 5, to 10 accumulated games with high odds of 10 to 100 odds and above which as you've experienced are not professional in managing your bankroll. Our approach is different. \r\n\r\nThis app (One Game Betting Tips) provides only One Game with an average odd of 1.90 on a daily basis to users. And because not every match can be predicted with certainty, a day (no reliable games) might be skipped in some weeks. The idea is that the probability of success is abated when more games are accumulated hence, we use all resources to find ONLY ONE GAME that must go right! \r\n\r\nOver the years we have habituated success by employing this method of prediction that we thought people like you with no betting experience could really make money with our sports betting expertise. Definitely, our background in statistical analysis and expert betting knowledge in International Soccer could deliver impressive profits while maintaining a high win rate. Our extensive analysis gives us the edge as football betting gurus and allow our associates to make enormousness profit with time.\r\n\r\nOur Clientele \r\nWe have associates all over the world from United States, Brazil, Nigeria, Ghana, Kenya, England, Germany, France, Netherlands, Italy, Spain, Indonesia, Russia, Korea, Czech Republic, Romania, Bulgaria, Greece, Switzerland, Sweden, Norway, Denmark, Finland, Portugal, Tunisia, Philippines, Taiwan, Turkey and so on.\r\n\r\nHow We Pick Games\r\nWe employ Machine Learning algorithms on football historical data and finalize our selection process with the endorsement by a crew of analyst. Our crew members includes famous betting tipsters, expert former footballers and expert former technical managers. As we see it Machine Learning has its limits, hence only picks accepted by the crew haven been filtered by a powerful statistical instrument are posted to users. You might think the process is laborious for just One Game. That is because we operate by the principle of \"bet on certainty\" otherwise NO \"reliable predictions\". Our most preferred market is the Win Draw Win or 1x2, although other options are predicted such as Home/Away/Draw no bet, Double Chance, Under/Over (Under-Over), HT/FT, GG/NG (Both teams to score or BTS) and others available on popular bookmakers.\r\n\r\nWe currently search for tips from over 180 leagues, although we are very fond of predicting leagues from NETHERLANDS, FRANCE, CZECH REPUBLIC, GREECE, ENGLAND, GEORGIA, ISRAEL, JORDAN, MALTA, SWEDEN, SAUDI ARABIA, UNITED ARAB EMIRATES, ITALY, PORTUGAL, RUSSIA, SPAIN, SCOTLAND, TURKEY, NORTHERN IRELAND,ARGENTINA, BAHRAIN, ROMANIA, BELGIUM,  GERMANY, DENMARK.\r\n\r\nWhat You Get With One Game\r\nIn detail, One Game offers;\r\n- A very simple design to maximize the user experience\r\n- One High Win Rate Tip\r\n- Daily Tips\r\n- All betting tips are completely FREE\r\n- Betting tips history\r\n- Instant Access To Our Application Betting TIPS Winning Everyday\r\n- Tips are Update On Time\r\n- No Betting Experience, Skills Or Football Knowledge Required\r\n- Simply Copy Our Winning Bets From The Application Each Morning\r\n\r\nOne Game Betting Tips does not have a VIP service, however, users wanting more can download other apps offered by RVeasy Sports, created by our expert team, specialists in delivering pro analysis and the best football tips. \r\nIt takes only a few seconds to download see the power tips of One Game yourself!",
  "summary": "The Best Soccer Prediction App With The Most Reliable Betting Tip You Can Bet On",
  "installs": "50,000+",
  "score": 4.3491125,
  "ratings": 5088,
  "reviews": 2394,
  "price": 0,
  "IAPRange": "£12.99 - £94.99 per item",
  "developer": "Rveasy Sports",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "May 5, 2018",
  "updated": 1581326014000,
  "version": "1.7",
  "recentChanges": "Tips are added on time<br>Improved UI<br>Scores are updated as match ends",
  "appId": "net.rveasy.justonegame",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Tips Winning Gang",
  "description": "WIN EVERYDAY WITH WINNING GANG SPORTS BETTING TIPS !\r\n\r\nSuccessor of Winning King, Winning Gang Betting Tips provides daily betting tips and really accurate accumulator betting predictions. Our professional expert betting team analyze each sports match from various leagues and tournaments to select best possible sure sports betting tips predictions and high odds football tips each day. Our daily bet tips are really safe and sure even suitable for secure punters and for beginner bettors. Our expert football betting prediction team spends a lot of time each day to find the best football tips of the day and we have a really high and stable win rate. We provide betting tip services for zero charge. We give our users accurate football betting tips, basketball, volleyball and tennis betting predictions.\r\n\r\nWe trust our secure betting tips and our only goal is guaranteed winning!\r\nA serious must have betting tip app for punters who like to bet on football!\r\n\r\nWinning Gang Football Betting Tips features:\r\n\r\n- Different kids of sports betting tips and predictions\r\n- Instant notification system\r\n- High success rate\r\n- Daily sure football betting tips\r\n- Premium betting tips for secure bettors\r\n- Mobile data friendly clean and simple user interface\r\n- High odds tips betting predictions section for high value football predictions\r\n- Daily doubles, trebles, over under 2.5 goals, corners, HT/FT tips\r\n\r\nOur betting predictions include all major football leagues including Premier League, Bundesliga, La Liga, League 1, Seria A, Primeira Liga, Eredivisie and all major tournaments including World Cup, European Football Championship, Champions League betting tips and Europa League betting predictions.\r\n\r\nPlease contact us for any type of suggestion:\r\ndvloopraslan@gmail.com",
  "summary": "Premium betting tips app from the betting experts. Betting Tips of Winning Gang.",
  "installs": "10,000+",
  "score": 4.2459016,
  "ratings": 1849,
  "reviews": 1273,
  "price": 0,
  "IAPRange": "£9.99 per item",
  "developer": "Aslan Developer",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Dec 20, 2019",
  "updated": 1587409459000,
  "version": "1.0.4",
  "recentChanges": "- Hot-fix bug for Android 4.4 users that causing crash at launch.<br>- Updated libraries for better performance.<br><br>* Thank you so much for all the support family.",
  "appId": "com.gangbettingtips.winninggangfootballbettingtips",
  "searchTerms": "sports betting"
 },
 {
  "title": "Soccer Predictions, Betting Tips and Live Scores",
  "description": "ScoreBing is professional football prediction app that helps people who love betting football to predict football matches based on varied statistics and odds. ScoreBing offers live scores, bet tips, statistics and latest results for all football matches around the world, covering 211 countries, 1492 football leagues and 22557 football teams. In United States, “Soccer” stands for “Football”.\r\n\r\nWith statistical analysis and sports betting experts, ScoreBing delivers the most profitable free soccer betting tips that allow our customers to win the picks. Following are what ScoreBing offers:\r\n\r\nFootball predictions\r\nLive football scores\r\nFootball results and fixtures\r\nFootball statistics\r\nFootball betting tips\r\nFootball odds\r\nFootball leagues\r\n\r\nWe cover all odds like 1X2, goals / corners over / under 1.5 / 2.5 / 3.5, handicap win / lose, half time / full time and in-play from the best bookmakers in the world.\r\n\r\nName a few football leagues we cover:\r\n\r\nGerman Bundesliga\r\nEnglish Premier League\r\nSpanish La Liga\r\nFrench Ligue 1\r\nItalian Serie A\r\nEuropa League\r\nChampions League\r\nWorld Cup 2018\r\nLiga MX\r\n\r\nWe are the best soccer predictor in USA, England, Nigeria, Netherlands, Italy, Ghana, Spain, Germany, France, Kenya, Bulgaria, Greece, Switzerland, Sweden, Norway, Philippines, Taiwan, Turkey, Denmark, Korea, Czech Republic, Romania, Brazil, Finland, Portugal, Tunisia and more...\r\n\r\nFacebook: facebook.com/scorebing\r\nTwitter: twitter.com/ScoreBing",
  "summary": "Football Statistics, Soccer Forecast,  League Standings &amp; Corner/ Goal Stats",
  "installs": "100,000+",
  "score": 4.2884617,
  "ratings": 1050,
  "reviews": 662,
  "price": 0,
  "IAPRange": "£0.84 - £144.99 per item",
  "developer": "Besget Technology",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jan 10, 2016",
  "updated": 1560411453000,
  "version": "3.9.5",
  "recentChanges": "Bug fixes and performance improvements.",
  "appId": "com.besget.soccerbing",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sim Betting Football",
  "description": "Do you love football? Are you tired of playing the usual simulation games as a manager? Do you want to try something new? Then install for free and play Sim Betting Football, the only football betting simulation game!\r\n\r\nSim Betting Football might look like a classic football management game at first. There are tens of leagues, hundreds of clubs and thousands of players, each of them with their own attributes and statistics.\r\nA whole virtual football universe is simulated on your device and you can explore it in detail from clubs formations to history of all their players.\r\nHowever in Sim Betting Football you are not playing as a manager running a club, but you are betting virtual coins on the simulated football matches and other events within the game.\r\n\r\nSim Betting Football lets you experience the fun and excitement of football betting without risking any money!\r\n\r\nMAIN FEATURES\r\n- realistic football simulation and match engine\r\n- 5 nations, 15 leagues, 300 clubs, 7,000 players\r\n- detailed statistics and data\r\n- 13 betting markets\r\n- 26 achievements to unlock\r\n- 3 online leaderboards\r\n- 3 languages: English, Italian, Spanish\r\n\r\nNEWS & UPDATES\r\n- Newsletter: http://www.simbettingfootball.com/newsletter/\r\n- Facebook: https://www.facebook.com/SimBettingFootball\r\n- Google+: https://plus.google.com/+SimBettingFootball\r\n- Instagram: https://instagram.com/simbettingfootball/\r\n- Twitter: https://twitter.com/simbetfootball\r\n\r\nNOTES\r\nThis game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at gaming does not imply future success at real money gambling.\r\n\r\nPrivacy Policy: http://www.vindictagames.com/privacy-policy/\r\nTerms of Service: http://www.vindictagames.com/terms-of-service/",
  "summary": "the only football (soccer) betting simulation game",
  "installs": "10,000+",
  "score": 3.96,
  "ratings": 207,
  "reviews": 90,
  "price": 0,
  "IAPRange": "£0.72 - £40.00 per item",
  "developer": "Vindicta Games",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 15, 2016",
  "updated": 1474015959000,
  "version": "0.9.85",
  "recentChanges": "This update introduces clubs inspired to the football season 2016/2017 (for new games).<br><br>It also bring several improvements and fixes.<br><br>For a detailed list of changes check out the News forum: http://www.simbettingfootball.com/forum/",
  "appId": "com.vindictagames.simbettingfootball",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Tips",
  "description": "We offer daily VIP and free soccer match predictions with our expert tipster who is registered to our system from anywhere in the world.\r\n\r\nThe best sports betting tips app on  Google Play.\r\n\r\n\r\nSafe Tips\r\nUnder & Over Tips\r\nGoal / Goal - Both Teams to Score Tips\r\nLive Betting Tips (7/24 Hours)\r\nVIP Combines\r\nVIP HT/FT Tips (Half Time / Full Time Big Odds)\r\nEditor's Combine (By Expert Team)\r\nBig Win Combine (High Odds Ex: 2,50 to 27,50)\r\nNight Combine (00:00 to 08:00 hours. Brazil, Peru, Colombia, USA, Argentina, Chile, Mexico etc...)\r\n\r\n\r\n\r\nPlease send mail to us for any questions : support@arena.tips",
  "summary": "Daily VIP Expert Football Betting Tips. Winning Predictions on your smartphone.",
  "installs": "100,000+",
  "score": 4.4851065,
  "ratings": 2358,
  "reviews": 1293,
  "price": 0,
  "IAPRange": "£0.99 - £229.99 per item",
  "developer": "Sportie Daily Betting Tips",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jun 30, 2018",
  "updated": 1583762020000,
  "version": "28.0",
  "appId": "tips.arena.betting",
  "searchTerms": "sports betting"
 },
 {
  "title": "Bet Analyser",
  "description": "BetAnalyser is the best free app for football. It covers more than 850 leagues from 90+ countries and major competitions.  \r\n\r\nNow you can easily study and predict the outcome of the upcoming matches in a unique way with a high probability using stats, teams attack strength, defence weakness and recent form analysis! \r\n\r\nIt has EVERYTHING YOU NEED about upcoming football matches in order to make better betting decisions, presented in a unique, clear, intuitive and interactive way.\r\n\r\nBetting Tips\r\n\r\nFor each match you can have a graph which shows percentages for Win-Draw-Loss (1-X-2) based on an advanced algorithm. It is produced after deep learning analysis on the match.\r\n\r\nFor each MATCH:\r\n\r\n- Betting Tip\r\n- Both team’s previous RESULTS in the league\r\n- HISTORY RECORD of the results between the two teams\r\n- Graphs for WIN-DRAW-LOSS (W-D-L)\r\n- Graphs for AVERAGE goals per team\r\n- Graphs for UNDER-OVER 1.5 goals\r\n- Graphs for UNDER-OVER 2.5 goals\r\n- Graphs for GOAL-NOGOAL\r\n- Radar Chart for form analysis\r\n- Live score",
  "summary": "Bet predictions, live scores, stats, results, odds news for over 850 leagues.",
  "installs": "500,000+",
  "score": 4.522388,
  "ratings": 7395,
  "reviews": 3697,
  "price": 0,
  "IAPRange": "£1.19 per item",
  "developer": "Krakenoid",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jan 1, 2018",
  "updated": 1571165866000,
  "version": "1.4.3",
  "recentChanges": "We update the app regularly so we can make it better for you. Get the latest version for all of the available features and improvements. Thanks for using Bet Analyser!",
  "appId": "com.krakenoid.betanalyser",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting United - Betting Tips (No Ads)",
  "description": "The success rate of Betting United is high. It gives you more than ever. We are very experienced and successful betting tips team. Our free application is proof of this. Our betting strategies are exclusive. When you start making money you will agree with us.\r\nThere is never advertising in Betting United. We will not show you never boring ads. Betting United never makes a holiday.\r\n\r\nWe offer you 365 day betting tips. The only thing you need to do to get betting tips is to download our app and start using it right away.\r\nWinning is so easy. \r\n\r\nBetting United app is also available at in-app purchases. We offer Free, Vip, Half Time / Full Time, Premium and Correct Score betting tips.\r\n\r\nBetting United app offers you only football betting tips. There are tips from many country leagues across the globe. Australian A-League, Azerbaijani Premyer Liqasi, Belgian First Division A, Belgian First Division B, Croatian 1. HNL, Cypriot Division 1, Dutch Eredivisie, Egyptian Pr. League, England Premier League, French Ligue 1, German Bundesliga, German Bundesliga 2, German 3. Liga, Greek Superleague, Hungarian NB 2, Indian Super League, Israeli Premier League, Italian Serie A, Italian Serie B, Kenyan Premier League, Portuguese Prim. Liga, Port. Segunda Liga, Romanian Liga 1, S. African Pr. League, Saudi Arabian Pro League, Scottish Premiership, Spanish Liga Primera, Spanish Liga Segunda, Swiss Super League, Turkish Super Lig, Turkish Lig 1 and many others share tips from the league. Betting United is enough for you to book football betting tips. You do not need any other applications.\r\n\r\n* In our Free app we offer at least 4-5 tips every day. Monthly success average is 88% or 92%. +32 odds betting tips per day.\r\n\r\n* 3-8 tips every day in our Vip apps. The average monthly success rate is 89% or 96. Daily +75 odds betting predictions.\r\n\r\n* 2-5 tips every day in our HT / FT application. The average monthly success rate is 94% or 99%. Daily +450 odds bettings tips.\r\n\r\n* 5-7 tips every day in our Premium app. The average monthly success rate is 92% or 96%. Daily +750 odds betting tips.\r\n\r\n* 3-5 tips every day in our Correct Score app. The average monthly success rate is 96% or 98%. Daily +500 odds bet tips.\r\n\r\nBETTING TIPS AND RATES MAY INCREASE OR DECREASE ACCORDING TO THE DAILY MATCH PROGRAM. THE FIGURES GIVEN ABOVE ARE AVERAGE FIGURES. The average monthly success in European league matches is 90%. In national and cup matches, our average success rate is 65%.\r\n\r\nFeel free to send us an e-mail. We will respond to you as soon as possible. Within the app, you can send mail easily from the communication section in the side menu.",
  "summary": "Daily Betting Free, Vip, HT/FT, Premium and Correct Score Betting Tips (No Ads)",
  "installs": "100,000+",
  "score": 4.6387663,
  "ratings": 2300,
  "reviews": 1948,
  "price": 0,
  "IAPRange": "£70.99 - £184.99 per item",
  "developer": "Betting United Team",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 16, 2018",
  "updated": 1588783228000,
  "version": "18",
  "recentChanges": "Some bugs fixed<br>Subscription prices will display on the buttons<br>Subscription cancellation has explained on each sections<br>Security functions improved",
  "appId": "com.bu.unitedteamfree",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Tips",
  "description": "Ultra Tips Bet\r\n\r\nProfessional tipster team giving everyday betting predictions all around the world.\r\n\r\n7/24 Support.\r\nBasic Interface.\r\nFree & VIP Section.\r\nSpecial Offers.\r\n\r\n\r\nFootball Betting Tips,Basketball Predictions,Tennis Combine,\r\n\r\nFree & VIP Predictions Everyday Without Any Break.",
  "summary": "A Sports prediction application with multiple betting tips sections.",
  "installs": "10,000+",
  "score": 4.7593584,
  "ratings": 2075,
  "reviews": 1632,
  "price": 0,
  "IAPRange": "£45.49 - £204.99 per item",
  "developer": "Ultra Expert",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Feb 18, 2020",
  "updated": 1583449218000,
  "version": "1.5",
  "appId": "com.hiba.ultratipsbet",
  "searchTerms": "sports betting"
 },
 {
  "title": "VIP BETTING TIPS:DAILY SURE PREDICTIONS APP",
  "description": "WELCOME TO 'VIP BETTING TIPS' INTERNATIONAL \r\n\r\nARE YOU A SERIOUS INVESTOR,GAMBLER or A PUNTER?Then this is the place to be.. VIP BETTING TIPS  being one of the world's top analyst in sports betting located in England,brings to you the best platform where you will easily select  well analyzed matches/predictions with high winning rate and enjoy your betting life anywhere any place you are!.Our Tips are worked on and brought to you by our Team of predictors who have been in the field of sports betting for more than 5 years .We work day and night just to bring to you the best or possible outcome of the matches that will finally end your day into winning.\r\n\r\n         VIP BETTING TIPS free app is about forecasting football predictions.The Tips are based on years of statistical data as well as the latest news and information on different teams.\r\n\r\n            OUR MAIN AIM\r\n-To help you with well analyzed tips with high winning rate.\r\n-To help you choose the best matches among the many leagues and countries.\r\n-To provide our clients with betting advice and guidance on matches to bet on.\r\n-To serve all our clients and users of this application equally regadless of where or which country they come from. \r\n\r\n          NOTICE TO ALL!!\r\n As we all know,gambling is highly addictive and can lead anyone into a serious mess if not taken care of.Following to that we discourage all members below the age of 18 years not to engage him/herself in betting or  download this app.To those above the stated age limit,We urge you to take note of the money you use to bet with.We advice you NOT TO BET with school fees,house rent or family special funds intended for special occasions.Its much better and safer to bet only with money you can afford to loose.We also encourage all users to register with bookies offering CASH OUT option.This will help you to cash out/withdraw your money in case some of the games are messing your Betslip.its very important.\r\n\r\n Everyday our TEAM OF TIPSTARS study all football matches available and select the best and most possible outcomes of the matches playing on that particular day.With the help of our team we provide various types of football tips E.g over 2.5/1.5,full time win, both teams to score, under 2.5,double chances and many more.In our daily updated betting system you will find the most frofitable free football predictions picks. We always make sure you don't miss out any tip in the days to come therefor we will help you to increase  your winnings to a higher level.\r\n\r\nWE ONCE AGAIN WELCOME YOU TO STAR BETTING TIPS INTERNATATIONAL.IN CASE OF INQUIRIES FEEL FREE TO CONTACT US THROUGH:,\r\n        EMAIL:Starbeteam@gmail.com",
  "summary": "DAILY FOOTBALL PREDICTIONS FOR ALL SERIOUS GAMBLERS READY TO INVEST IN BETTING",
  "installs": "5,000+",
  "score": 4.67,
  "ratings": 631,
  "reviews": 537,
  "price": 0,
  "developer": "SUREBET FOOTBALL BETTING TIPS VIP",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Nov 14, 2019",
  "updated": 1573738441000,
  "version": "1.0",
  "recentChanges": "       -Daily winning Tips with high odds are now available <br>       -Tips with High winning rate<br>         are provided <br>        -Our tips are always available in all betting bookies.<br>        -Usefull advice and guidanlines on how to bet.<br>         -Precautions and risks to avoid while betting <br>         -Friendly customer interface available",
  "appId": "com.vipbetting",
  "searchTerms": "sports betting"
 },
 {
  "title": "Soccer betting with BetMob",
  "description": "With over 10 million downloads for FotMob, we are proud to show our new app, BetMob! It is a virtual betting game where you can bet on actual football matches and see how you stack up against your friends. We cover all the Euro 2016 matches so start your betting!\r\n\r\nLIVE RANKINGS\r\nWeekly ranks are updated realtime so you can check up on your friends anytime\r\n\r\nREAL ODDS\r\nOdds are fetched updated frequently from one of the largest bookmakers in the world\r\n\r\nNOTIFICATIONS\r\nYou are notified once your bet is resolved\r\n\r\nNEW CREDITS EVERY WEEK\r\nYour credits are reset to 2000 each Monday so don't fear if you spent all your money on a bad bet, there is always a new chance to be the best better of the week. \r\n\r\nNEW FEATURES\r\nWe will be adding new features frequently so if you miss something then check back later or send us an email to support@norapps.no",
  "summary": "Bet on football matches with your friends and see who can be the best better!",
  "installs": "100,000+",
  "score": 4.0814815,
  "ratings": 2713,
  "reviews": 652,
  "price": 0,
  "IAPRange": "£1.32 per item",
  "developer": "NorApps AS",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 6, 2015",
  "updated": 1545032265000,
  "version": "4.168.20181214",
  "recentChanges": "BetMob is back in beta! Let us know if there are any issues!<br><br>Latest version should have a fix for missing notifications.",
  "appId": "com.norapps.betme",
  "searchTerms": "sports betting"
 },
 {
  "title": "101 Tips - Daily Free Betting Tips",
  "description": "This app is only available for bet predictions.\r\n\r\n101 Tips - Daily Betting Tips is a professional football betting tips that was set to help people like you make money from football. We offering the chance to share our betting tips for everyone. We will help you to increase your winnings to the maximum.\r\n\r\nOur extensive analysis gives us the edge in football betting tips and allow our customers to make thousands long term.\r\n\r\nOur expert team in every day work to provide you the best betting expert tips and VIP sport picks.\r\n\r\nWhat you will benefit when you install our application :\r\n\r\n*High win rate\r\n*Daily tips\r\n*Expert team\r\n*Easy to use interface",
  "summary": "Professional football betting tips that was set to help people make money.",
  "installs": "10,000+",
  "score": 4.34,
  "ratings": 261,
  "reviews": 159,
  "price": 0,
  "IAPRange": "£2.79 - £9.49 per item",
  "developer": "Uniquecom",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Apr 7, 2019",
  "updated": 1579301833000,
  "version": "3.9.0.2.9",
  "recentChanges": "Minor bug fixes and improvements",
  "appId": "com.mobiroller.mobi540076108992",
  "searchTerms": "sports betting"
 },
 {
  "title": "Tipsters Round-Up - Free Betting Tips",
  "description": "Are you looking for daily football betting tips and sports betting advice? Do you need betting info and prediction tips for racing bets, your bet horses quests, or freefootball betting advise? Well, Tipsters Round-Up is your best daily football betting tips and horse betting tips app! It includes additional sports betting tips as well, with more to be added soon.\r\n\r\n⚽️ Sports betting tips! 🐎 \r\n\r\n⭐️YOUR #1 BETTING INFO & TIPSTER APP\r\n\r\nAt Tipster Round Up – the #1 free tipsters app we have trawled the internet for all the best sites offering the best free betting tips and brought them all together in one place. From horse racing tips and bet horse tips, to free tips football (soccer betting tips) and other sports betting tips, you are sure to get daily betting advise that may be of great help when betting!\r\n\r\n⭐️COLLECTING THE BEST FREE SPORT TIPS\r\n\r\nAs a free tipsters app, Tipsters Round-Up brings you the best betting tips from pro tipsters from around the internet all in one place. This app is a golden nugget of betting info for every punter out there!\r\n\r\nEvery morning and throughout the day Tipsters Round-Up will be updated as and when the free tips become available. Make it your most reliable source for daily betting tips!\r\n\r\n⭐️WHY YOU’LL LOVE OUR FREE SPORT TIPS APP: \r\n\r\n- Everyday free football tips from pro tipsters will be added\r\n- Free Horse Racing Tips \r\n- Everyday free horse racing tips from several pro tipsters will be added\r\n- More tipsters will be added soon\r\n- Easy to use tipsters app interface\r\n- Simple to navigate menu\r\n- Sport betting tips for tennis and golf too\r\n\r\nSo what are you waiting for? Your betting game surely needs help – and when it comes from the best tipsters on a daily basis, you are sure to love it!\r\n\r\n📲 Get this sports betting tips tipster apps now for free!",
  "summary": "Free Football betting tips tipster app. Daily horse racing tips, free bet tips",
  "installs": "10,000+",
  "score": 4.1,
  "ratings": 30,
  "reviews": 26,
  "price": 0,
  "developer": "Tipsters Round-Up",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jan 22, 2019",
  "updated": 1548210139000,
  "version": "1.0.0",
  "recentChanges": "Tipsters Round-Up App is launched!",
  "appId": "com.tipstersroundup.app",
  "searchTerms": "sports betting"
 },
 {
  "title": "Bet Advisor VIP -Sport Betting",
  "description": "Bet Advisor- Sports Betting Tips Soccer Prediction gives daily soccer predictions, tips with matches containing high odds and low risks.\r\nThe football betting tips given will give you a betting experience you never had before. In charge we have a team that has a leader in Thomas Mills a senior Tipster with more than 8 years experience.\r\n\r\nWith build in features that will help you with the best football betting tips (predictions).\r\n\r\nIn order to give you the best football predictions (tips), Our algorithm will look daily at historical data of the football matches,\r\na small part of this is:\r\n\r\nWeather conditions at playtime of soccer match\r\nInjuries\r\nLast five soccer matches of both teams\r\nPrevious 5 soccer matches both teams have played against each other\r\nAnd the list goes on!\r\nEvery day we look at over 100 soccer matches of various competitions and give you football predictions, tips for:\r\n\r\n*English Premier League\r\n*Spanish La Liga Sportsbook\r\n*Germany Bundesliga \r\n*Italy Serie A\r\n*France Ligue 1\r\n*Turkish Super Lig \r\n*Dutch Eredivisie\r\n\r\nAnd Many More Football Betting predictions, tips!\r\nThe betting tips, predictions that our app delivers has become the reason for many success stories, be one of them now!\r\n\r\nAlongside the carefully tested algorithm which gives football predictions, tips with high odds we also got our confidence from some great responses from our customers from our football betting tips (predictions).\r\nOur football predictions, tips helped them to get a better insight on what to look for in a match, some of the tactics that we have in our algorithm are also used by many multi-millionaire bettors around the world.\r\nBut unfortunately, most “every day” bettors don't know how to research data of over 100 soccer matches daily to optimize their bettings. That's where this app will help you! By filtering only the best football predictions, tips for you!\r\n\r\nOur users are using Bet Advisor- Sports Betting Tips Soccer Prediction and use it every day now to keep on winning!\r\n\r\nSo wait no longer and make sure that your winning streak begins today with our winning soccer predictions, tips!\r\n\r\nBet Advisor- Sports Betting Tips Soccer Prediction doesn't support gambling of any type and is also not a tool to use for gambling. Installing the app means that you are aware of this.\r\n\r\nWe offer 3 different subscriptions: 1 Month, 6 Months and 1 Year subscription\r\n\r\n1 Month subscription has a 7 days FREE trial period and will provide:\r\n* At least 3 premium tips per day\r\n* Weekly updates\r\n* Clean content, no ads inside the application\r\n* Subscription length: 1 month\r\n* Price for the subscription after free trial: $29.99\r\n* Subscription type: auto-renewable\r\n\r\n6 Months subscription will provide:\r\n* At least 3 premium tips per day\r\n* Weekly updates\r\n* Clean content, no ads inside the application\r\n* Subscription length: 6 months\r\n* Price for the subscription after free trial: $149.99\r\n* Subscription type: auto-renewable\r\n\r\n1 Year subscription will provide:\r\n* At least 3 premium tips per day\r\n* Weekly updates\r\n* Clean content, no ads inside the application\r\n* Subscription length: 1 year\r\n* Price for the subscription after free trial: $249.99\r\n* Subscription type: auto-renewable\r\n\r\n\r\n* Payment will be charge to Google Play account at confirmation of purchase\r\n* Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period\r\n* Account will be charged for renewal within 24 hours prior to the end of the current period\r\n* Subscriptions may be managed by the user by going to the user's account settings after purchase\r\n* Terms of use and privacy: http://lupu.digitallabs.ro/BetAdvisor/",
  "summary": "Bet Advisor- Sports Betting Tips Soccer Prediction gives daily sport predictions",
  "installs": "5,000+",
  "score": 3.75,
  "ratings": 12,
  "reviews": 8,
  "price": 0,
  "IAPRange": "£30.49 - £244.99 per item",
  "developer": "Palm Mar Studios",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "May 20, 2017",
  "updated": 1495368694000,
  "version": "3.0",
  "recentChanges": "We work hard to improve the app.",
  "appId": "com.palmmarstudios.betadvisorvip",
  "searchTerms": "sports betting"
 },
 {
  "title": "Football AI: Bet Picks & Soccer Predictions",
  "description": "Football AI is an attempt by expert math guys to create a new soccer prediction system against the one the bookmakers use. The system uses a unique machine learning algorithm by analyzing form, past meetings, squad quality, injuries going back up to 7 years. \r\n\r\nThe system analyses over 1000 data points from previously played games, whether the match between the two teams is played on the home court or guests, injured players, what is the formation of the team, scored goals, rookies, current points in the table. \r\n\r\nBesides serving tips in the format of 1, X, 2 the app also give a full bet slip predictions.",
  "summary": "Predicting soccer impossible ? Get AI soccer picks =&gt; Beat the Bookies",
  "installs": "100,000+",
  "score": 4.3632183,
  "ratings": 4376,
  "reviews": 2494,
  "price": 0,
  "IAPRange": "£0.89 - £92.99 per item",
  "developer": "Cookie App Factory",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Feb 28, 2016",
  "updated": 1577230545000,
  "version": "2.5.48",
  "recentChanges": "- Improved to 90% Success Rate<br>- Forgot password <br>- Improved security",
  "appId": "com.footballscore.mobile",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Tips Expert",
  "description": "We want to introduce you our new team of expert tipsters, providing you VIP betting tips day by day! Your winning chances will increase if you follow these VIP betting tips and predictions each day!\r\n\r\nThe experienced betting tips team analyzes the matches and selects the best betting tips of the day. Statistics related to latest team performance, overall team value, latest head to head results as well as details related to weather conditions, injured players and other parameters are used for valuable betting tips predictions.\r\n\r\nThe betting tips team uses powerful tools and combined with team's internal strategy succeeds in delivering best odds from football/soccer, hockey, tennis and many other sports.\r\n\r\nBetting tips app features:\r\n• Free and VIP sports betting tips (many sports)\r\n• History (for the past 4 days)\r\n• Easy-to-use interface\r\n• Two different sections: Free betting tips and VIP betting tips\r\n• Free tips are absolutely free of charge (smaller odds than VIP football tips)\r\n• VIP tips service\r\n• Built-in possibility to contact developer & tipsters at suretips.adviser@gmail.com\r\n• Up to 5 free tips with smaller odds (odds starting from 1.30 up to 1.70 in free section)\r\n• Up to 10 VIP betting tips with higher odds (odds starting from 1.50 up to 2.50 in VIP section).\r\n\r\nThank you for using our service!\r\n\r\nKeywords: betting tips, tips, betting, football, odds, free",
  "summary": "Betting tips with great winning rate. Biggest odds! Daily tips and BIG winnings!",
  "installs": "10,000+",
  "score": 4.1,
  "ratings": 662,
  "reviews": 404,
  "price": 0,
  "IAPRange": "£8.99 - £27.49 per item",
  "developer": "SureTips Adviser",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Sep 3, 2018",
  "updated": 1575572558000,
  "version": "1.013",
  "recentChanges": "New tipsters team! Best Odds! HIGH RATE!",
  "appId": "com.suretips.bettingtipsnewteam",
  "searchTerms": "sports betting"
 },
 {
  "title": "Football Bet Analyser ⚽ Predictions, Tips and Odds",
  "description": "Welcome to bet analysis and odd predictor software, dear user.\r\nThis application is based on a machine-learning algorithms crafted by us (with deep inner love for football, sports betting, and working moneymaking methods, ofc).\r\nLatest APP update: 23.11.2017 - (stable version of betting prediction)\r\nLatest AI update: 16.11.2017 - (inner stable version of soccer analyzer)\r\n\r\nWhat are 3 main benefits of using our bet analyzer app for user?\r\n\r\n\r\n☑️ Fastest artificial intelligence engine works for you 24/7 to predict the highest probability of generating profit. It’s improved daily.\r\n☑️ Free access to gathered and updated information from all vip betting tips that are in paid  prediction apps. Instant sport prediction and odd picks updates for everybody is a must. \r\n☑️ You don’t need to have perfect betting skills and be an expert with monumental Football Knowledge. 99.2% Strike Rate (100% Verified) is a great success rate for predictions to start with. Do you agree?\r\n\r\nThere are tons of information about successful earnings and wins. If you consider to test all the projects - we expect that you’ve got a few years of free time. Lucky one! We are passionate about automation and time-saving for people like us.\r\n\r\nWant to save plenty of your time with no money spent on it? Read 3 moments that are not greatly announced in a sport-betting world, but are amazing and show valuable results. \r\n\r\nSome uncovered features of our betting-prediction 🤖 AI settings.\r\n\r\n1. Algorithm analyzes and train itself by 300 different streams of soccer betting stats and results. Most platforms, for ex., can deal only with 2-3% of the forecasts. Seems cool.\r\n2. Do you know other machine-learning sportsbet app that compares the mood of targeted football player with signals in social networks around his live profile? Not bad.\r\n3. The database of betting statistic is united with detailed analysis, forms and open-data (prediction) applications analytics by different clusters and arrays. It means that your prediction is charged with real data instead of random given number :) Sounds like a boss?\r\n\r\nIf your business has user’s success as a main target - it will evolve! Our football predictions tips helped more than 100k to collect their profits. Feel free to ask any of them. As a fact, first steps of our AI-algo was used by many real multi-millionaire bettors around the world. Work, upgrades and skilled deployment is a key to success. \r\nWe are proud to present our Football Bet Analyzer for You. Welcome! 🏆\r\n\r\nThese leagues are included right now, and we are working hardly to index and add new. We need some time. \r\n\r\n1. German Bundesliga 1\r\n2. German Bundesliga 2\r\n3. Belgium Jupiler League\r\n4. English Premier League\r\n5. English The Championship\r\n6. English League One\r\n7. English League Two\r\n8. English National League\r\n9. Spanish Primera Division\r\n10. French Ligue 1\r\n11. French Ligue 2\r\n12. Italian Serie A\r\n13. Italian Serie B\r\n14. Dutch Eredivisie\r\n15. Turkish Super League\r\n16. Portugal Primeira Liga\r\n17. Scottish Premiership\r\n18. Scottish Championship\r\n19. Scottish League One\r\n20. Scottish League Two\r\n21. English FA Cup\r\n22. Belgian Cup\r\n23. Turkish Cup\r\n24. Spanish Cup\r\n25. Coppa Italia\r\n26. Dutch Cup\r\n27. Belgian Cup\r\n28. Coupe De France\r\n29. EFL Cup\r\n30. Copa Del Rey\r\n31. DFB Pokal\r\n32. EFL Trophy\r\n33. Greek Football Cup\r\n34. UEFA Champions League\r\n35. UEFA Europa League\r\n\r\nDisclaimer: Please don't forget, betting can be very risky, even tips are analyzed by professional tipsters, other betting users and machines...you should only bet with money that are comfortably afforded to be lost. Be sure that football betting risks involved are fully understood, seek for advice if necessary if you doubt.\r\n\r\nIf NOT - install and enjoy. Don’t forget to share your success rates and tell a friend, if you are satisfied. Thanks in advance!",
  "summary": "Best free Football predictions and bet analyzer using AI. ⭐ Let&#39;s make you win!",
  "installs": "500,000+",
  "score": 4.284141,
  "ratings": 9116,
  "reviews": 3652,
  "price": 0,
  "developer": "TechClicka",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jan 7, 2017",
  "updated": 1511425876000,
  "version": "Varies with device",
  "recentChanges": "We fully updated user interface, added new leagues, teams and countries. <br>Improved user experience and added new features:<br>- Games&#39; times is being shown in local timezone<br>- Added full multi-language support<br>- Added livescores table<br>- Added favorite leagues table<br>- Improved prediction algorithm<br>- Added more games info<br>- Added user account section<br>- Removed irrelevant ads<br>- Fixed bugs",
  "appId": "tr.gksoftware.smartanalyser",
  "searchTerms": "sports betting"
 },
 {
  "title": "Kings Betting Tips - Football Prediction Tips",
  "description": "Kings Betting Tips : is a professional Football Betting app that provides daily High Odd stakes, that was set  to help people like you make huge money from football.\r\n\r\nToday's football betting predictionTips\r\nCorrect Score Predictions,\r\nHalt Time Full Time Predictions,\r\nOver Under Tips,Goal-Goal Tips\r\n,Assian Handicap,Big Odds,High Odds,\r\nSafe Predictions,Safe Picks,\r\nFootball 10+Odds,\r\nDaily Event Tips,\r\nFixed Matches,\r\nSpecial VIP,Elite Tips,Elite VIP.\r\nVIP Predictions.\r\n\r\nfootball bet prediction,\r\nEnglish premier league prediction,\r\nCorrect Score Predictions,\r\nBetting,\r\nSports Betting,\r\nBetting tips,\r\nbaba ijebu, \r\nbaba ijebu pay me my dough,\r\nbaba ijebu pay me,\r\nNigerian bettting sports tips,\r\nBet9ja,\r\nKingsbettingtips,\r\nKingsbet,\r\nChampions League prediction tips,\r\nEnglish Premier League tips,\r\nEuropa League table,\r\nEuropa League Fixtures,\r\nEuropa League Results,\r\n\r\nKeywords:kings betting Tips,Jackpot Tips,Predictor,Special Tips,Italy Fixed,Fixed Tips,Correct Score Tips,Half Time Full Time Tips,VIP Predictions,Rose Bet,Free VIP Tips,Daily Betting Tips,Alpha Tips,Super Tips,Professional Betting Tips,Bet Analysis,Big Odds,\r\nHigh Odds Prediction,Special Predctions,Wenger,Expert Betting Tips,Winner Expert Betting Tips,African Betting Tips.\r\n\r\nbetting tips sites\r\nbetting tips for today\r\nbetting tips finder\r\nbetting tipster\r\nbetting tips for tomorrow\r\nbetting tips app\r\nbetting tips apk\r\nbetting tips for world cup\r\nbetting tips uk\r\nbetting tips and predictions\r\nbetting tips application\r\nbetting tips and news\r\nbetting tips apk download\r\nbetting tips accumulator\r\nbetting tips and odds\r\nbetting tips australia\r\nthe betting tips and predictions for today\r\nbetting tips bet9ja\r\nbetting tips best\r\nbetting tips blog\r\nbetting tips correct score\r\nbetting tips draw\r\nbetting tips expert\r\nbetting tips europa league\r\nbetting tips england\r\nbetting tips epl\r\nbetting tips eleven\r\nuk betting tips forum\r\nuk betting tips gg's selections\r\nuk betting tips odds\r\nuk betting tips prediction\r\nuk betting tips tomorrow\r\nwww.safebettips.com",
  "summary": "Maximize your winnings in Sports Betting Tips,Football Tips",
  "installs": "50,000+",
  "score": 4.45,
  "ratings": 750,
  "reviews": 445,
  "price": 0,
  "developer": "PG007",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Jul 3, 2018",
  "updated": 1582197154000,
  "version": "13.0",
  "recentChanges": "Simple and Easy to use UI<br>Crash Free<br>Bugs fixed<br>Browser crashes fixed",
  "appId": "com.safebettips.kingsbettingtips",
  "searchTerms": "sports betting"
 },
 {
  "title": "BetMines Free Football Betting Tips & Predictions",
  "description": "Over 400,000 users rely on BetMines. Follow our daily betting tips for football, analyse team statistics, follow other tipsters bets, test your strategy by creating free virtual football bets, follow livescore and much more!\r\n\r\nBetMines is a totally free football betting support application that offers several tools to help you increase your success rate and teach you how to bet!\r\n\r\n---- DAILY TIPS ----\r\n\r\nWe are the best football predictions and football tips app. We provide FREE and accurate daily football betting predictions and tips for each match elaborated by an artificial intelligence algorithm constantly evolving.\r\nThe algorithm takes into account the history of the results of the teams, the state of recent form, head-2-head matches, home and away performances, statistical data of the reference league, any sidelined player, the fluctuation of odds (provided by an important bookmaker) and on the basis of these and other data elaborates the most likely outcome of each match.\r\n\r\nIn addition to the football tips of the algorithm, we also provide two bets of the day elaborated by our team of football betting experts: Doubling and Risk of the Day.\r\nAll the bet predictions are free!\r\n\r\n---- SOCIAL FOOTBALL BETTING ------\r\n\r\nFootball betting becomes social!\r\nYou can follow the best tipsters in the application, copy their bets and become yourself a reference point for the community .\r\n\r\nWhen you sign up you will receive 1000 virtual diamonds with which you can create virtual bets , both to test your gaming strategies and to challenge other tipsters and climb the rankings of the best tipsters of the day, week, month and ever.\r\n\r\nThe ranking is based on the profit generated by the tipster in the concerned period , so you can easily identify the best BetMines's tipster!\r\nThe best daily bets will be published on our social channels.\r\nNB: You don't win any cash prizes, these are virtual bets ( and not real money ) with the aim of testing your gaming strategies and having fun at the same time!\r\n\r\n\r\n---- TEAMS STATISTICS ------\r\n\r\nFor each team involved in the match we provide the results of the last 5 matches in general, the last 5 at home and the last 5 away games.\r\nFor the last 10 matches of each team we also provide:\r\n\r\n- the percentage of results 1.5+,2.5+ and 3.5+ goals, Both team to score, 3 Way Result\r\n- the mean of the corners\r\n- Total goals\r\n- Clean sheet matches\r\n\r\n---- LEAGUE STATISTICS ----\r\n\r\nFor each league we supply:\r\n\r\n- Standings\r\n- Percentages of 1.5+,2.5+, 3.5+ goals and both team to score outcomes\r\n- The minutes of the goals\r\n- Average goal per game\r\n- Average of yellow and red cards\r\n\r\n\r\n---- BETMINES MACHINE.\r\n\r\nIt is a tool that allows you to generate bets with a high probability of success taking into account the selected criteria.\r\nYou choose the leagues you want to bet on, the type of event (1X2, double chance, under/over , combo and both team to score), the desired odds range, the number of matches and BetMines will generate for you the most likely bet based on the criteria you have chosen.\r\n\r\n\r\n---- OTHER FEATURES ----\r\n\r\n- possibility to choose your favorite leagues\r\n- possibility to follow the results live thanks to a livescore service\r\n- possibility to access the best odds for each event\r\n- possibility to identify similar matches in terms of odds\r\n- possibility of receiving push notifications when our suggested bets are published, when a tipster you follow posts a bet or when the bet you placed is winning.\r\n\r\n\r\nYou can follow us on:\r\n\r\nInstagram: https://www.instagram.com/betmines_app/\r\nFacebook: https://www.facebook.com/betmines/\r\n\r\nFollow BetMines football predictions, analyse the statistics provided, follow the best tipsters and create your own winning football bets for FREE!\r\n\r\nOur Terms of Use:\r\nhttps://betmines.com/TermsOfUse.html",
  "summary": "Sports betting tips, football betting odds, tipsters predictions and livescores",
  "installs": "500,000+",
  "score": 4.5,
  "ratings": 12301,
  "reviews": 7867,
  "price": 0,
  "IAPRange": "£0.59 - £12.99 per item",
  "developer": "Sure Bet Expert",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 2, 2019",
  "updated": 1588351813000,
  "version": "2.0.1",
  "recentChanges": "- new layout<br>- added dark theme<br>- new stats and analysis for under/over 4.5<br>- chat messaging in each match<br>- notifications for live matches<br>- fixes and improvements",
  "appId": "com.betmines",
  "searchTerms": "sports betting"
 },
 {
  "title": "Winner Expert - Football Betting Tips",
  "description": "Betting has never been easier with our betting tips. We have thousands of users that trust our daily football betting tips and basketball predictions. We provide a selection of high win rate football tips each day provided by an expert betting prediction team.\r\n\r\nWe are doing a serious job with our daily picks and care for our users. So our betting app is suitable for everyone, for pro bettors who regularly bet on football & basketball, for users want to get better at betting and even for new bettors that want to learn how to bet on football and basketball.\r\n\r\n★ Daily Betting Tips\r\nWe provide very well analyzed football betting tips each day. Our expert betting tip prediction team analyzes daily football fixtures to give you punters the surest tips and predictions possible. These daily predictions are suitable for every user and commonly used in acca slips by our users. Simply choose 2 or 3 tips and use it on your acca slip without hesitation.\r\n\r\n★ Wide Coverage\r\nOur tips include all major football leagues and basketball tournaments including Champions League, Europa League, World Cup, and European Football Championship.\r\nWe are proud of our Champions League and Europe league betting tips and our odds and win rate is exceptional in these special tournaments. You will not only get the best football betting tips odds also get the best success rate with our app in these tournaments.\r\n\r\n★ Combo Tips - High Odds\r\nIf you are looking for daily hot football odds our betting app is suitable for you too. We are not only providing daily sure tips, we also have surprise high odds betting tips. Our expert bet prediction team provide 2+ odds surprise predictions daily. With these bet predictions, you can get better odds and win more with our serious betting strategy.\r\n\r\n★ Bet History\r\nWe trust our football betting predictions and basketball tips so we are fully open to you guys. You can check our old predictions and their results at any time in our mobile betting app in the old section.\r\n\r\n★ Instant Betting Tip Notifications\r\nYou won't miss any of our football matches with instant push notification alerts. We always notify you when we have new betting predictions and share the correct match results. This way you don't need to check constantly. \r\n\r\n★ Premium Tips\r\nWith our premium betting tips, you will get our exclusive tips with the best betting odds. These bet tips are analyzed and selected very carefully and for every bettor even for new bettors learning how to bet on football.\r\n\r\nIf you have any questions or feedbacks please feel free to contact us at winnerchoices@gmail.com.",
  "summary": "Daily football and basketball betting predictions. Very high success rated tips.",
  "installs": "100,000+",
  "score": 4.419643,
  "ratings": 6740,
  "reviews": 3190,
  "price": 0,
  "IAPRange": "£14.49 per item",
  "developer": "Winners Choices",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Apr 25, 2017",
  "updated": 1570390674000,
  "version": "1.13",
  "recentChanges": "* Fixed bugs, improved application stability.",
  "appId": "com.aslanmuzaffer.winnerexpertbettingtips",
  "searchTerms": "sports betting"
 },
 {
  "title": "Racenet – Horse Racing Tips, Betting & Form Guide",
  "description": "The Racenet app is the fastest mobile experience in our stable.\r\n\r\nWhether you're where you don’t want to be, or you’re at the pub, TAB or track, you can hold the fearlessly independent, and highly respected, Racenet in the palm of your hand.\r\n\r\nThe team at Racenet are always looking to make the app the best it can be. So make sure you always keep an eye out for exciting updates, with new features always in the pipeline and on the way. \r\n\r\nOnce you’ve download the app, join our racing family and be a part of the journey. We’ll keep you up-to-date with the latest features, and invite you to be a part of our valued team.\r\n\r\nThe app is the perfect place to keep up with all the important 2020 horse races; including the Melbourne Cup, Caulfield Cup, Cox Plate and all Group 1 races.\r\n\r\nCurrent features:\r\n- Australia’s favourite racing form guide\r\n- Racing information and analysis\r\n- Best-priced bookmaker odds integration\r\n- Comment on the latest Racing news as it breaks and trends \r\n- The latest horse racing results\r\n- Professional horse racing tips and commentary",
  "summary": "Australia&#39;s biggest Horse Racing site now has an Android app!",
  "installs": "50,000+",
  "score": 4.55,
  "ratings": 679,
  "reviews": 266,
  "price": 0,
  "developer": "Racing Internet Services Pty Ltd",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 27, 2017",
  "updated": 1589270848000,
  "version": "3.1.176a",
  "recentChanges": "Top Bets from The Experts - Reinforce your bet. Our expert tips are now in the form!<br>- Added search ! You can now search for horses, jockeys trainers and races!",
  "appId": "com.racenet.racenet",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Tips Tennis",
  "description": "Betting Tips Tennis  –  by Tipstero INC is an informational app with instant access to daily betting tips with great odds, suggestions that can be helpful for every tennis lover.\r\n\r\nWe created Betting Tips Tennis because we love this sport. Our specialists like to analyse all opportunities, to get the best out of every tennis match and to have a high win rate.\r\n\r\nThis app was specially created for tennis fans.\r\n\r\nEvery day we study all the tennis matches and select the best betting tips with big odds and high win probability. We use all our resources to find strong tennis matches and we post various betting tips, predictions like winner, correct score, handicap, number of games, sure tip, big odds. Our strategy of finding the best tennis betting tips has been tested in the past and proved to be a viable long term strategy if used wisely, only as an information source.\r\n\r\n\r\nAPP FEATURES:\r\n\r\n• Tennis Betting Tips - daily betting tips with small, medium to big odds and very high win rate\r\n\r\n• Free Tennis Betting Tips and Premium Tips for the true tennis lovers\r\n\r\n• History - for our past betting tips\r\n\r\n• All Prediction Types Included - winner, correct score, handicap, number of games, sure tips, big odds, value tips\r\n\r\n• Star Rating System - a trust level indicator that we use to rank the matches in the daily area according to our trust level. The more stars a match gets the more confident we are about it.\r\n\r\n• 3 Different Sections - to provide the best betting tips -> Daily Betting Tips, Free VIP Betting Tips and Premium Betting Tips\r\n\r\n• Friendly and easy to use interface\r\n\r\n• Great Visual Impact - Modern Design\r\n\r\n• Push Notification when new betting tips are added (with on / off option)\r\n\r\n• Tipstero Betting Tips Tennis also has a couple of customisation options and also customised time zone\r\n\r\n\r\nAPP SECTIONS:\r\n\r\n• Daily Tips - with the most common matches in well known leagues\r\n\r\n• Free VIP with 3 different subsections - Sure Games, Value Tips, Special Tips\r\n\r\n• Premium VIP - Top Tennis Betting Tips\r\n\r\n\r\nTerms and Conditions:\r\n\r\nThis application is only an informative tool and must be used just for fun. This is not a betting application, it is not related to betting or gambling in any way. We do not encourage and we do not support betting and gambling.\r\nEveryone who installs / uses the app is 100% responsible for his actions and for obeying the applicable laws in his country. Act responsibly!\r\n18+ Only. Not designed for children.",
  "summary": "Betting Tips Tennis - Daily Free Tennis Betting Tips With Very High Win Rate",
  "installs": "100,000+",
  "score": 4.6566334,
  "ratings": 9014,
  "reviews": 3076,
  "price": 0,
  "IAPRange": "£1.69 - £8.99 per item",
  "developer": "Tipstero INC",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Oct 17, 2017",
  "updated": 1588771877000,
  "version": "1.1.6",
  "recentChanges": "Added support for new sports <br>Bug fixes",
  "appId": "com.tipstero.tipsprotennis",
  "searchTerms": "sports betting"
 },
 {
  "title": "Super 6",
  "description": "Jeff claims he is flat broke but he has been forced by Super 6 to put a £1 million jackpot on the line! Predict 6 correct scores for the chance to win. Don't forget you can create a league to compete against friends and family. New for 18/19 season: add a pundit to your league and see how you and your mates fare against the experts.  \r\n\r\nThe Soccer Saturday Super 6 app is brought to you by Hestview Limited, a part of the Sky Betting and Gaming group. The Sky trademarks used in the app are owned by the Sky Plc group of companies and are used under license. To play the game you will have to register an account with Hestview Limited. You must be over 18 years of age to register an account.\r\n\r\nPlease note: Google is in no way linked or associated with this or any other competitions/contents run in this app.",
  "summary": "Play for free to win £1,000,000, just correctly predict the score of 6 matches!",
  "installs": "1,000,000+",
  "score": 4.809664,
  "ratings": 47705,
  "reviews": 16138,
  "price": 0,
  "developer": "Sky Betting and Gaming Apps",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 14, 2013",
  "updated": 1567585993000,
  "version": "Varies with device",
  "recentChanges": "Thanks for using Super 6!<br><br>We&#39;ve made some bug fixes and general improvements in this latest version.",
  "appId": "com.skybet.super6",
  "searchTerms": "sports betting"
 },
 {
  "title": "Total Bet Prediction 🤩⚽🏀🏈🏐🏉🏒💰",
  "description": "You're sick of spending your time looking for the best predictions without really having results.\r\nYou want the best predictions with the best odds falling from the sky, every day without asking anything !! 🤩\r\n\r\nSo download Total Bet Prediction !\r\n\r\nThis application offers you:\r\n\r\n- Detailed analysis of all the matches of the day:\r\n     - Statistics of the match\r\n     - Form of each team\r\n     - Ranking of the 2 teams\r\n     - Direct confrontation\r\n     - Match Predictions\r\n     - Betting tips\r\n\r\n- Each user will be able to give his match prediction on each game and see the trend of the match prediction according to the Internet users.\r\n\r\n- Match and Betting tips available\r\n    - On 6 sports (Football Prediction , Basketball Prediction , Rugby Prediction , Handball Prediction , VolleyBall Prediction  and Ice Hockey Prediction )\r\n⚽🏀🏈🏐🏉🏒\r\n\r\n- From more than 60 countries:\r\n\r\n- Analysis of the championships of 42 countries:\r\n- Australia Bet Tips\r\n- Austria Bet Tips\r\n- Belgium Bet Tips\r\n- Belarus Bet Tips\r\n- Brazil Bet Tips\r\n- Bulgaria Bet Tips\r\n- Chile Bet Tips\r\n- China Bet Tips\r\n- Colombia Bet Tips\r\n- Croatia Bet Tips\r\n- Czech Republic Bet Tips\r\n- Denmark Bet Tips\r\n- Estonia Bet Tips\r\n- Finland Bet Tips\r\n- France Bet Tips\r\n- Greece Bet Tips\r\n- Mexico Bet Tips\r\n- Montenegro Bet Tips\r\n- Netherlands Bet Tips\r\n- Norway Bet Tips\r\n- Poland Bet Tips\r\n- Portugal Bet Tips\r\n- Russian Bet Tips\r\n- Serbia Bet Tips\r\n- Slovakia Bet Tips\r\n- Slovenia Bet Tips\r\n- Spain Bet Tips\r\n- Sweden Bet Tips\r\n- Switzerland Bet Tips\r\n- Turkey Bet Tips\r\n- Ukraine Bet Tips\r\n- United States Bet Tips\r\n\r\n- More than 150 championships followed among which:\r\nPremier League, Serie A, Bundesliga, Liga, Ligue 1, Champions League, Europa League, NBA, NHL, Top14 ...\r\n\r\n\r\nIf you want to save time, have real betting tips and become a great tipster then you just have to download Total Bet Prediction 💪💪💪",
  "summary": "Daily betting tips and Bets Predictions on all the matchs 📈 💸",
  "installs": "50,000+",
  "score": 3.69,
  "ratings": 662,
  "reviews": 320,
  "price": 0,
  "developer": "Selbet Pronostics",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Aug 5, 2018",
  "updated": 1569051385000,
  "version": "4.5",
  "recentChanges": "Fixed small bugs",
  "appId": "com.totalPronos",
  "searchTerms": "sports betting"
 },
 {
  "title": "Betting Analyzer",
  "description": "In our betting analyzer application, there are only football betting analysis. We are analysis 40 leagues in the world and provide you tips. We are providing special high odds tips every day of year. We win a lot and we want you win too.\r\n\r\nBetting Analyzer\r\nJoin the Real Bet family and start winning\r\nDaily Min +6 Betting Analyzer\r\n+15 ODDS\r\n99% Success\r\n\r\n\r\nAbout Real Mobile Bet Company\r\nOur Tipster Real team is global. We have offices in Brasil, England, Spain, France , Kenya and Nigeria.  Our expert team in sport Betting Analyzer analysis matches approximately 10 hours every day and work to provide you the best betting expert tips and VIP sport picks. We are analyzing technical team changes, latest status of teams, penalties, form state and injuries of football players, player’s private life, weather conditions of matches, betting news and provides statistical soccer Betting Analyzer in many topics. \r\n\r\nIf you wish to have high odds, you can purchase one time our VIP Betting Analyzer application and use it life time. VIP Betting Analyzer application provides sure Betting Analyzer and wins always.\r\n\r\n• Special daily math updates \r\n• Daily sport Betting Analyzer \r\n• High odds Betting Analyzer\r\n• %100 analyst\r\n• Daily notifications\r\n• Easy user interface\r\n• Live Support\r\n• Special Match\r\n\r\n\r\n\r\nYou are no longer need football knowledge for betting analysis. Bet and win using our daily bettings tips! We are working for you10 hours every day to find best beting analysis.\r\n\r\nPlease do not hesitate to contact with us for your questions: \r\nrealmobilebet@gmail.com\r\ninfo@realmobilebet.com\r\nwww.realmobilebet.com\r\n\r\nView achievements in our social media account\r\ninstagram.com/realmobilebet\r\ntwitter.com/realmobilebet\r\n\r\n\r\nReal Betting Analyzer\r\nThe easiest way to make money !\r\nThe best Betting Analyzer application in your pocket",
  "summary": "NO ADS<br>Daily Min +20 Betting Analysis<br>+50 ODDS<br>90% Success",
  "installs": "10,000+",
  "score": 3.81,
  "ratings": 343,
  "reviews": 189,
  "price": 0,
  "developer": "Real Mobile Bet",
  "genre": "Sports",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 13, 2019",
  "updated": 1563745028000,
  "version": "1.1.1",
  "recentChanges": "-The betting system according to your position<br>-Easy Use<br>-Add Live Support<br>-Quick interface<br>-New notification system<br>-Surprise bets<br><br>The best analyzer application in pocket",
  "appId": "com.real.bettinganalyzer",
  "searchTerms": "sports betting"
 },
 {
  "title": "Bet Calculator",
  "description": "Calculate your winnings with the bet calculator for Singles, Doubles, Trebles, Accumulators, Lucky 15 / 31 / 63, Trixies, Patents, Round Robins, Goliaths and more.\r\n\r\nFree, easy to use and accurate, the betting odds calculator supports a wide variety of options including each ways, accumulator perms and bookmaker bonuses. Supports all major bet types, whether you need to work out an accumulator for the football or an each way lucky 15, way we've got you covered.\r\n\r\nSupports both mobiles and tablets\r\n\r\nWhilst every effort has been made to ensure the accuracy of this apps results, it is your responsibility to verify all aspects of your bet with the bookmaker before placing it.\r\n\r\nIf you have any feedback or requests please let us know at enquiry@aceodds.com\r\nVisit www.aceodds.com for the online version of this bet calculator handling the same wide variety of options. \r\n\r\nGood luck with your wagers!!",
  "summary": "Work out your sports bet returns with the AceOdds.com betting odds calculator.",
  "installs": "100,000+",
  "score": 4.636752,
  "ratings": 2358,
  "reviews": 772,
  "price": 0,
  "developer": "AceOdds.com",
  "genre": "Sports",
  "contentRating": "PEGI 3",
  "released": "Mar 15, 2013",
  "updated": 1478162063000,
  "version": "1.0.21",
  "recentChanges": "Improved performance of bet calculations.",
  "appId": "com.solidsoftwarelimited.betcalculator.android",
  "searchTerms": "sports betting"
 },
 {
  "title": "Sports Lines and Odds",
  "description": "Open Sports Lines and Odds and get the latest lines and odds, betting headlines, live scores, injury reports, gambling trends, and stats. \r\n\r\nBrowse by league for instant access to odds, scores, stats, betting trends, sports tweets, and league news.\r\n\r\nCompare the best money lines, point-spreads, and over/under totals from top on-line sports books.\r\n\r\nGet the latest sports betting headlines, rumors, and recaps for NBA, NFL, NHL, NCAAB, NCAAF, and MLB. Mobile friendly for easy reading on all devices.\r\n\r\nHandicap your picks with betting stats for NCAAB college basketball, NCAAF college football, NBA basketball, and NFL football teams.  \r\n\r\nMobile Viewing : Today's MLB baseball probable starters and player stats. Custom daily player injury reports for NBA basketball, NFL football, NHL hockey, and MLB baseball.\r\n\r\nThe Sports Channel Chat : login in with twitter to leave messages to friends.\r\n\r\nCustom Search and Explore Features : Search twitter for related tweets on odds, scores, sports news, streaming sports feeds, betting tips/trends, fantasy sports info, or injuries. \r\n\r\nTwitter Manager : Setup your own custom sports timelines or search terms for easy access on every page.\r\n \r\nLogin with twitter to tweet score updates or compose your own tweet and send it directly from the Sports Lines and Odds App! \r\n\r\nChoose whether or not to receive sports trending notifications that let you know about current betting trends, odds, and sports news.  \r\n\r\nFeatured Sports : Soccer, Football, Baseball, MMA-Boxing, Auto Racing, Hockey, and Basketball. \r\n\r\nGet a free a subscription trial to remove ads.",
  "summary": "Sports Lines and Odds, betting headlines, spreads, scores, stats, and trends.",
  "installs": "10,000+",
  "score": 4.019231,
  "ratings": 52,
  "reviews": 26,
  "price": 0,
  "IAPRange": "£1.89 per item",
  "developer": "Gilman Labs",
  "genre": "Sports",
  "contentRating": "Parental guidance",
  "contentRatingDescription": "Parental Guidance Recommended",
  "released": "Aug 15, 2016",
  "updated": 1583026244000,
  "version": "1.0",
  "recentChanges": "Database Channel Fix - Enhanced UI - Swipe Refresh - General Improvements",
  "appId": "com.gilmanlabs.sports.budsalley.sportslines",
  "searchTerms": "sports betting"
 }
]