[
 {
  "userName": "JammyStar79",
  "version": "6.4.0",
  "score": 1,
  "title": "Didn’t pay out",
  "text": "Weird one this as I’ve used this app for awhile and while it’s always been buggy it’s served a purpose, until now. I played an instant game that was in two parts, lost the first part won £1 on the second part. I got the congratulations message... only to head back to the home page to see it hadn’t paid the winnings out. Now I’m sure a lot of people may be thinking “disgruntled player” however I know what happened, and I regret not taking a screen shot of the “you’ve won £1” message, but why would/should I? It had never happened before.. or had it? There been a number of times the app has crashed mid game only to log back in to find my “result” which has always been a loss, not to mention taken the fun of why I purchased the game in the first place. Where was my proof it was a losing game?... because they said so that’s where. I’ve emailed them only to get the face palm of “it shows as a losing ticket” we will escalate this further for you. I’ve read the reviews as far back as I could be bothered and have only found 2 similar complaints so maybe it’s a rare glitch. But maybe also Camelot rely on customer complacency just like the PPI companies did all them years back. Given the lengths I’ve gone to try to recover such a small amount I’d be amazed if there isn’t more to this. Even I initially didn’t bother complaining. Would love to know if others have had the same issue. Anyway, 1 star for theft."
 },
 {
  "userName": "DandelionPi",
  "version": "4.6",
  "score": 1,
  "title": "Terrible",
  "text": "Wow, this is truly awful. Where to start? \nFirstly, logging in. Requires username/password every time. Even cheap & nasty apps requiring authentication have cottoned on to the use of the fingerprint, not this one. \nBuying a ticket with saved numbers, after logging in, requires funds in the account. Obviously can't just use a card, oh no, have to mess about adding a minimum of £10. Then, navigate the mess to be prompted with \"numbers saved in your account\" vs \"numbers saved in your app\". Why would I care? Either I saved them or I didn't. \nEventually, successfully bought a ticket. Draw takes place: did I win??? How the hell would I know? The system could email (I think it does on the odd occasion you do actually win), alert, at least provide SOME indication, rather than having to navigate through many screens after logging in AGAIN. Results checker is laughable. Who cares what numbers came up? The only question I want an answer to is \"can I abandon this wage slave life and embark on a voyage into my dreams?\" That'll be a deep dive into the appalling web-browser interface within the app then, dismissing the cookie warning on the way. Eventually you'll have your hopes dashed, then have to go back through the purchasing rigmarole for another chance. Awful."
 },
 {
  "userName": "Beccybons",
  "version": "7.0.1",
  "score": 5,
  "title": "Beccy Bons",
  "text": "The lottery is a bit of fun in a world that seems to be full of truly dreadful events perpetrated by people who are all equally dreadful. Money doesn’t make everything fine but it helps enormously to reduce the stress of day to day life. It helps you to help the people you love and also to give to causes that are close to your heart...mine is cancer UK, my daughter passed away from cancer and other associated conditions earlier this year.  I know the national lottery does fund ‘good causes’ including cancer and I will support it as long as I can. Good causes shouldn’t rely on charity but our government seems to be somewhat blinkered to the needs of the working or elderly or ill population, it seems to be more concerned with passifying people who would like to turn this country into a third world mess.  I realise this sounds like a rant but I do feel that institutions like the national lottery should have everyone’s support."
 },
 {
  "userName": "Gadgetgazz",
  "version": "6.0.0",
  "score": 4,
  "title": "Restrictions",
  "text": "Easy to use, although I like to purchase tickets(virtual verses physical thing), time sometimes doesn’t always allow me to get to an outlet, so the app gives me that opportunity to play without rushing around. The piece of mind the security provides as you have to re enter details also gives you controllability over the amount you can deposit, it shows a sense of responsibility by the game operator towards the player and their personal details, so big plus points there. The only thing I do have a little gripe with is the player restrictions outside the EU, i.e Turkey etc, when you head out on holidays lottery tickets are the last thing you think off, so having the ability to play using the app and the bank account registered in the UK/EU should be permitted to purchase tickets outside the UK/EU using the app,\njust a thought, there are a lot of expats out the UK/EU I would imagine would like the opportunity to play, like I said just a thought."
 },
 {
  "userName": "Magenta lips",
  "version": "7.0.1",
  "score": 5,
  "title": "Just won £30 yay!!",
  "text": "Every so often I have an urge to buy a lucky dip when I’m out however many times in the past I’ve left them in a handbag and simply forgotten to check them. About six months ago I found several tickets in a wallet and I could possibly have won a million but as the tickets were over 6 months old I’ll never know and it’s probably just as well!\n\nSince downloading this app it’s so easy to scan the tickets and I am delighted to have just discovered that I have won a whopping £30 which I am delighted with, especially as the most I’ve won before is another ‘lucky dip’ \n\nI prefer to purchase actual tickets whenever I am in the mood but I can also buy tickets on the app which is also very convenient. Super easy and convenient to use and was thrilled when it told me that I had won something, what a lovely surprise."
 },
 {
  "userName": "revrobla",
  "version": "7.1.0",
  "score": 3,
  "title": "Works ok until you need to changes details.",
  "text": "I use the app to purchase Lottery and Euromillions on a monthly basis and when it works it works well.  When I needed to change my card it too over a month to be able to do it.\nAs I had bought my Euromillions and had a current ticket it’s wouldn’t let me change it.  I had to write the numbers and go to a shop.  Then when my ticket had expired I went to change my card details.  You have a credit balance can’t change card with drew balance.  Tried again wouldn’t let me change kept timing out.  Rang the helpline.  Machine could not recognise my date of birth.  When I got through to a person (he was really helpful) was told do not put the Mr in the name box and do not put the start date.  Both these things are asked for on the app.    Now I have logged on to be told I can only play 1 game but no explanation as to why.  What if I had been going away?  I would have missed out.  Not happy."
 },
 {
  "userName": "clifftracey",
  "version": "6.0.0",
  "score": 5,
  "title": "Great way to play",
  "text": "Well unlike some people I think the app is really good. Of course you have got to have money in your lotto account to play, would you walk into a shop and expect them to give you a ticket without paying?\nYou can log into your account with your thumb print and to top it up is really quite simple. Then all the numbers I had saved on my online account switched directly to the app so didn’t have to enter them manually. A couple of screens later I have a ticket, what’s the alternative to get into my car drive to the local shops walk to t eh counter join the cue and have to remember my numbers each week to fill the paper slip out. If you win they email you to let you know and that’s it. Great job love it thanks lotto"
 },
 {
  "userName": "sloughsteve27",
  "version": "6.3.0",
  "score": 5,
  "title": "NOT A BAD APP!",
  "text": "This app has certainly come a long way compared to just a couple of years ago when it was a bit hit and miss. It’s a shame some users can’t update their original negative reviews nor understand what is app based and what is network based issues as it seems to work perfectly fine in iOS. I certainly have no complaints. \nHowever, I will just say that on some of the big draw days the process can be a bit slow but that is not the fault of the app as it too relies on the network into Camelot. \nNice to see even Face ID is now supported in the latest update. The only thing that I would like to see improved is the automatic change to numeric keypad when inputting the CVV. Would save a little bit of hassle."
 },
 {
  "userName": "Lady Walkley",
  "version": "7.0.0",
  "score": 5,
  "title": "No More Mislaid Lotto Tickets! 😊",
  "text": "The National Lottery App is an easy and convenient way to buy your Lotto/Euro Millions tickets. Using the App and your your credit/debit card details, you can purchase your tickets speedily from the comfort of your own sofa. The App can retain your card details for future purchases, if you wish. \n\nOne great benefit is that you don’t need to check your numbers, as you will automatically be notified if you win a prize. Of course, you are still advised to double-check in case of error, but this is far less likely to happen than you accidentally washing your Lotto ticket with your jeans! For someone like me who tends to mislay paper Lotto tickets only to find them after they have expired, this is an ideal solution!"
 },
 {
  "userName": "Kazzakirk",
  "version": "5.4.1",
  "score": 5,
  "title": "Great App - But please reduce minimum!",
  "text": "Hi I love this app - all works perfectly and is easy to check tickets, top up and play games etc. especially as I can’t leave my home. 1 MAJOR issue I have though is the minimum top-up being £10? Why when a weekly ticket is £2, an instant win from 25p etc.. I get money every two week and can’t afford to top up a months worth of lotto in one go and more importantly in a society where we are trying to discourage and support gambling addiction,  should we not be encouraging people to top-up more than necessary a week creating more chance that they’ll spend more than they can afford?? Am interested to know why this is please - anyone?? Can’t fault the app technology though so still 5*’s"
 },
 {
  "userName": "DABBOUSB",
  "version": "6.6.3",
  "score": 3,
  "title": "does what is says on the tin",
  "text": "It does what it says on the tin, several annoying things\n\n1) if. Win a lucky dip. Why on earth doesn’t it issue me one to my account (which I am logged in) rather in fact it asks me to take the ticket to a shop.! Not sure what’s the rationale behind that. It could be simpler... cancel the scanned ticket and issue a lucky dip .. how difficult is that.\n\n2) the app keeps on bombarding players with other games for no apparent logical reason changing the banner to other games. Try buying 10 luck dips on euro millions ... after you by the first set the app tries to con you to another game by offering a different banner link at the bottom of the screen so that you go and buy the rest of the lucky dips from another game... again directed to people who buy only one ticket and national lottery forgot about other customers"
 },
 {
  "userName": "MancTommo",
  "version": "6.3.0",
  "score": 5,
  "title": "Fantastic App",
  "text": "I’m not sure why people are giving this app a bad review. Personally I think it’s really great. \nI can login through Face ID (no need to constantly put in password etc) all you do is switch it on once in app... never had an issue playing the lottery. Always confirms tickets and wins by email... absolutely no problems with it. I prefer it to actual tickets as you could lose them, and also hears stories of people being told their winning tickets are not winners when checking at terminals... also had a mistake once where he binned a winning ticket by accident. \nThis way you never have to worry about checking your tickets as they tell you if you have won... now I just need a big win 🤞🏻"
 },
 {
  "userName": "MWPixie",
  "version": "4.8.0",
  "score": 4,
  "title": "Handy addition to desktop version",
  "text": "Not as easy to use as the desktop version, but very useful for those last minute ticket purchases on the move. \nWay better than queuing at a corner shop till. \nYou have a player and funds account which you have to load with real funds to be able to purchase a ticket which can slow you down but better than just piling on to a credit card bill.\nYou always get a notification that you have won even if it’s a small amount spit saving having to check the numbers yourself .. another time saver..\nBut app function could do with an upgrade to make it slicker... its looking a little long in the tooth now compared with most apps nowadays. But well worth having on your phone even so.."
 },
 {
  "userName": "daveR331992",
  "version": "7.2.2",
  "score": 1,
  "title": "Con",
  "text": "I’ve played this app for a while now and i have noticed it is all so fixed. The main game I played was the Monopoly Gold Classic for £2.50. I played the practice runs for free and I won’t lots of games and got lots of properties. Surprise surprise when I started playing for money I rarely won. Each game you play the dice is always the Same roll or close enough. Usually always an 8 or 9, if you get a double it doesn’t mean anything as you will just get a pointless square after meaning its worth nothing. After 3/4 goes you will win £3. Enough to keep you playing. And as the game ends you always conveniently only needed one more property to make each row. It’s a scam to draw you in I should have known better lol. I won a while back too and didn’t receive the money in my funds but it was £5 I never queried it. But avoid this app. I’ve sunk so much money into this app and picked up on its working ways. Games are all predicted against you winning"
 },
 {
  "userName": "Original G",
  "version": "7.2.2",
  "score": 1,
  "title": "Worse Re-design of any app!",
  "text": "[update April 17th 2020 - only shows 20 online games, only 1 new game out 5 new games that are on the desktop version] I’d just like to start with a positive. It’s great that the National Lottery obviously allowed a first year design student - in their first week - to revamp their app. Sadly this wasn’t the best idea. The simplicity goes beyond boring. The Instant win section is almost impossible to use and navigate. Gone is the option to choose how the games are displayed (i.e. Oldest / Newest /  Odds / Price). There’s no graphics to see what the games looks like before you play them. I have no idea who thought this shambles of a “stripped back” design was the best way to celebrate 25 years. Bring back the old app or at least some of the functions and design features. I dread to think how much money was wasted on this design. To actually end on a real positive, the normal lottery ticket areas are ok, as there are only a few to choose from."
 },
 {
  "userName": "Karen L 58",
  "version": "7.1.0",
  "score": 5,
  "title": "Lottery",
  "text": "Although I like playing the lottery, I much preferred it when it first started. Playing 1 day a week and for a decent jackpot prize. Like everything else the price has risen but the top prize fallen. There are also too many games that play , Euro millions , thunderball and such. Plus many other lotteries have now entered the field and offer a reasonable prize for the price We all that play dream of winning the “ big one”  I now feel that lottery should up the game and play once a week, with the top prize being won every week \nwith no rollover. To win  2  3  or even 4 million would be a dream come true for many . Others that order massive millions can always play the euro."
 },
 {
  "userName": "Gunner Nunner",
  "version": "6.7.0",
  "score": 5,
  "title": "Very easy to use",
  "text": "I’ve had this app for about 2 years and I can’t fault it myself. It’s easy to use and you can put as little as £10 on and play instantly if you want. You can also change the amount of times you play and limit the money you want to spend which is great. If you win then it goes straight into your bank account. Also there have been a number of times I’ve been sat at home and I’ve too tied to get my tickets from the shop so I get it with my app and that’s so much easier for me at times. I would recommend it 100% from me. Always easy access for maybe winning small or big. But you have to be in it to win it!!"
 },
 {
  "userName": "M I l l e r",
  "version": "4.7",
  "score": 5,
  "title": "Simple quick easy to use What's all the fuss about?",
  "text": "What is there to say? It's an app for playing the lottery which relatively easily allows you to play the lottery. Takes a few seconds to log in, whoa!!!! a few seconds fancy that, then if there's no money in your account you have to put money in which unfortunately takes another few seconds shock horror. lol seriously this app is quick easy to use does sometimes slow when large JPs are up for grabs but can be avoided with a little forward planning I should think. Email notifications are sent on the odd chance you may win, which leads me to my one major complaint ' I never win'"
 },
 {
  "userName": "st3phie",
  "version": "7.0.1",
  "score": 1,
  "title": "How is this app still be so bad?",
  "text": "I can’t figure out how there are good reviews for this dreadful app.\nFirstly, the all important winning numbers, though available in the home page, beneath that night’s game (be it Lotto, EuroMillions etc etc), for whatever reason don’t upload to reflect matches in ‘my games’ until much, much later. Secondly there’s no quick way of checking whether it’s now finally ready to tell me.\nThirdly, ‘my games’ aren’t ordered in draw date, navigating forward and back is frustratingly slow. Hours after the draw, the results are available, yet my game still says ‘check later’. WHY?? Oops - back to my first point.\nI use direct debit for regular games but now and again also do the odd ‘Set for Life’. I don’t know why ad hoc games can’t be DD’d (maybe they can but if so, it’s even more confusing!) This brings me to my fourth point; adding funds seems unnecessarily awkward as it doesn’t remember card details.\nLastly, my biggest criticism though is that the odds are not transparent. Okay so this isn’t unique to the app, it’s really difficult to find out from the main website too, and even then it’s mostly only the ‘jackpot’ odds.\nMaybe there’s a budding app developer out there who could use a lottery grant to build a decent app - now that would be a good cause!"
 },
 {
  "userName": "Pooks47",
  "version": "6.3.0",
  "score": 3,
  "title": "Really different adding funds",
  "text": "I tried this morning to add funds to my account and it has taken me 25 minutes of frustration! First I got the message that I had tried to login too many times when I had only tried once. Second, I was having an online chat with Chloe and she verified my details and asked me to try logging in again while we were chatting. I did this but could not find out how to get back to our chat?? Eventually, I tried to add funds but trying to use my CREDIT card which of course you don’t accept however that Wes not clear to me. I think I have now added the required funds and bought tickets for the next 4 Saturdays. I also won a ‘lucky dip’ a few weeks ago but I have no idea how to claim it using my phone - please tell me how. Thanks Keith"
 },
 {
  "userName": "jimmy.c.49",
  "version": "7.2.2",
  "score": 1,
  "title": "On line instant wins",
  "text": "Well what a absolute con talk about daylight robbery there all parasites praying on the most vulnerable people in society and when you do manage to win if that’s what you can call it you only ever get your money back an then you just get another card rather than the pound or two it’s very very rare for somebody to hit the jackpot and the games are so much of a con when you play on line you can honestly predict what is going to happen somebody needs to regulate these people properly and I know somebody’s got there fingers in the pies not pie , PIES , Richard Branson offered to give 100/  of profit to good causes but yet Camelot comes threw yet again what does that tell you alone  anyway stop buying especially on line games all instant so called wins are as bad but you can actually predict what’s going to happen next with the on line games shame on you Camelot you are now all cursed  3ca113dlj22c"
 },
 {
  "userName": "msjsiend",
  "version": "7.0.1",
  "score": 1,
  "title": "The app could be better",
  "text": "When you check your games, the date is the date you bought the ticket.. I play loads of different games so I spend time clicking on each of the dates.. I wish it was easier. If it gave a summary or when you click on “my tickets” it shows if you won or not, or shows you dates of when games are, I wouldn’t need to click into each ticket and then try and remember which ones I clicked on when I go back to the main menu so I can check the others! It’s just time consuming and not fun. \n\nPlease change this app, make it easier and fun to check tickets. Maybe even group them into games rather than listing the dates I bought the tickets. \n\nPlus the email saying you’ve won... honestly everytime time you think this is it! And then you go onto app and you’ve won £3 😂 May put you have won and the amount? Lol"
 },
 {
  "userName": "fedupbloke",
  "version": "7.1.0",
  "score": 1,
  "title": "Update.",
  "text": "I have purchased my lottery tickets online for years now and have never had any problems doing so. I could remember at the last minute and purchase a ticket from my phone wherever I was. I received an email some time ago saying that the website would be down while they make improvements to the service. Unfortunately they seem so have done the thing that is so popular at the moment in taking a system that works perfectly and replacing it with one that doesn’t  work at all.\nWhen I tried to purchase a ticket online on Friday, a thing that I have done on the old inferior website thousands of times without any problems, I was unable to, due to the website being busy. The old inferior website was never too busy to do only thing it has to.\nThanks for making things worse, and I hope you are proud of your efforts."
 },
 {
  "userName": "Dawidyogi",
  "version": "6.1.2",
  "score": 2,
  "title": "Shamelessly tries to take your money",
  "text": "Two stars as it works for Lotto or Euro millions, but you can’t even easily check if you won (notification would be nice, or at least something easily seen when checking the numbers and tickets).\nNow the rest - instant games. That’s where it gets disgusting and after playing a few, I deleted the app. \nMonopoly as an example - when the app is supposed to replicate the game - utter, manipulative rubbish which suddenly ends and in no way is remotely similar to a Monopoly game. Throw the dice a few times, move around by 30, repeat, better luck next time! \nFew other I tried designed to keep you hooked by appearing you are close to winning big. Should be banned. Personal recommendation- delete and stay away, better spend your £2 on an ice cream than a fake scratchcard. More fun."
 },
 {
  "userName": "The Fr3sh One",
  "version": "5.4.1",
  "score": 2,
  "title": "Rigged, false advertisement and a con",
  "text": "It took a long time for me to actually get an account as I had to put my card number and my details in multiple times as it had issues verifying. Then I first played the Monopoly game which is £2.50 a game and states very openly that you will win something 1 in every 2.28 games. I play a few games, won a couple minor prizes and lost a couple too. But after that I have now played my 5th game in a row without a break and won nothing. Not even the default lowest £2.50 win. While it may seem small, imagine if all the mini games they have up with the odds shown are all false and misleading with some games being £5 a go. Everyone will be out of pocket by a large margin while the company profits from literally lying to you right in your face. Avoid the games and just do the lottery."
 },
 {
  "userName": "Lcfc76",
  "version": "6.4.0",
  "score": 2,
  "title": "Instant games",
  "text": "Lucky to win more than £2 on instant win games, I would love to know if anyone actually wins a decent prize.\n\n The app potentially could be very bad for the consumer and very profitable for the lottery, as by having the instant games, with very poor payouts in my experience, compared to shop brought, people have easy access to getting addicted, even if they hadn’t before.\n\n I add funds to play my lotteries, and have the pound or so remaining on instant play, but have will power, and it was a bit of fun, but don’t do it now due to the comments above, it’s only a bit of fun if you have a chance of winning more than you put on, but if i had issues with gambling I would delete the app, and put my lottery on at the shop, so I wouldn’t have access 24 hrs a day to games with the odds stacked in their favour"
 },
 {
  "userName": "Arraminta Louise",
  "version": "6.2.1",
  "score": 5,
  "title": "Brilliant",
  "text": "Think some reviewers can’t be any good with basic apps. This app does open with fingerprint technology and I’ve been using it for a few years that way. Yes, you need to have funds in the account but it takes seconds to transfer - literally. I never buy a ticket any other way now.  Also, whenever I have won I have always had an email and if you click on the app and view your account you also have a message to let you know you have won. Never had any problem and find it a very useful, easy and time saving app. All I need is a six figure win and then I would say it was perfect!"
 },
 {
  "userName": "Zeb (GW)",
  "version": "7.0.0",
  "score": 1,
  "title": "IOS PROBLEM",
  "text": "I’ve been trying for several days to change over a card within the App and online using a new iPhone 11...only when I had missed putting my numbers on for tonight’s ‘not to be missed’ Euro lottery draw did one of the National Lottery call centre staff inform me that they were having problems with payment cards with the new IOS!!!! Not even an error message to that effect came up in the App or Online...which would have given me enough time to change the card on a different device, which I did in 5 minutes...BUT TOO LATE FOR THE DRAW! The App is actually quite good, but the management of it in this case leaves room for improvement.  I only hope the numbers I put on for every Euro Lottery Draw don’t come up tonight...as I was also informed “if they do come up you haven’t purchased a ticket for the draw” GREAT I WONDER WHY THAT WAS THEN..."
 },
 {
  "userName": "Jacer Racer",
  "version": "4.7.1",
  "score": 3,
  "title": "Distinctly average!",
  "text": "Yes the app works okay, but the biggest ballache with this app is that it doesn’t even have the option to let you save your login details, let alone use fingerprint ID. When you have a long email address like I do you wanna kill yourself by the end of the login process! \nThe other thing that’s hugely irritating is that it doesn’t allow you to change the account you make your payment from - and if it does, I have yet to find it! So it’d either difficult or downright hidden! \nPlease app people, at least get the login thing updated to at least save the login details, can’t be that difficult as every other app seems to be able to do it, even the most rudimentary app has this now."
 },
 {
  "userName": "HafizC",
  "version": "7.1.0",
  "score": 4,
  "title": "What were the numbers.",
  "text": "When I check my numbers I go straight to scan my ticket. The results inarevshown and  its either ‘Yes’ or there is always next time. \nBut I always go back to the results listings and check what the numbers were in case the app got them wrong - highly unlikely to happen I know butit’s just human nature. \nI suggest that an an improvement to the scanned ticket results page, not only do you just show the numbers just scanned in and which ones were correct but also show all the winning numbers and codes in the lowered half of the screen for that draw on that day. It would make it much easier for me to use. \nThank you."
 },
 {
  "userName": "Pinball1966",
  "version": "6.6.3",
  "score": 5,
  "title": "Gaz",
  "text": "I’ve been using this App pretty much since it began. At that time I was buying tickets daily, as I’m not earning quite as much now and since the birth of my grandson, I’ve not got as much disposable income, that coupled with the fact I never win anything but the very lowest of wins available, I generally play if there’s a rollover or I’ve a spare few pounds. \nIt is a great App and it saves time and energy for sure but I would like to have the ability to buy tickets later at night when you’ve forgotten to buy tickets during the day but that’s just me and does not detract from the fact this is a great app."
 },
 {
  "userName": "Pr1te5h",
  "version": "7.0.1",
  "score": 3,
  "title": "They’ve made a lot of improvements...but",
  "text": "This app has improved greatly over the years. \n\nBut I have 2 comments...\n1. When I used to buy king term tickets using this app by direct debit, I found thst after a while I was winning nothing each week. The minute I logged in to check if my ticket was still valid etc, the next draw I would win a small amount. Then I’d leave it again, and find I’m winning nothing, login to check, and the next draw I win something...this story repeats forever. I know that’s not how probability of this game works, but an observation which makes me suspicious of playing by direct debit. \n\n2.  Now I buy tickets using cash in different shops. The scan ticket function is really good to check the results. But it just tells me if I won or didn’t and what numbers were a match. It would be nice if they could also display the results for that draw on the same screen, so I could do a visual comparison myself for extra reassurance. Rather than just taking the apps word for it. Hopefully this is an easy update to make and can be included in a near future update."
 },
 {
  "userName": "Baggy-Pants",
  "version": "7.2.2",
  "score": 4,
  "title": "As my teacher used to say.. “ could do better”",
  "text": "Used this app for years & my main grudge with it is... It’s down just a little bit to much. I expect it once in a while, but twice in the past week gone to check my numbers & not been able too.. now I know in an hour or 2 , it will b up & running again- but why is it down for that short space of time , on a regular basis.. My online bank app is down quite a few times throughout the year, but they always let me know a few days in advance , they down for maintenance- they give me date & times they gonna b down & I’m very happy with that- kuz I know what’s going on."
 },
 {
  "userName": "Uncle Pippy",
  "version": "6.4.0",
  "score": 4,
  "title": "Huge Improvement",
  "text": "Updated Feb 2016. Huge improvement. It would seem someone is listening!\n\nUpdated Sept 2017:\nIt really needs to be tuned and made a little more intuitive. For example there should be a dedicated 'My Current Tickets' section, rather than going through ‘My Account’. Also, creating new tickets using an old entry would be good (made easier than currently where you don’t have saved numbers). Messages should be able to be removed in bulk selection rather than one at a time.\nThis app has improved massively though over the years it should be said. Not quite perfect yet but very usable and getting better."
 },
 {
  "userName": "TomTurpin",
  "version": "6.4.0",
  "score": 1,
  "title": "Catch 22",
  "text": "I always ask myself will I or won’t I have a bet on The Euro Millions. I am mostly disappointed.  So I am trying Euro hotpicks instead.  Also, lately, I learned that only a small amount of every £ spent goes to Good Causes.  I stopped your on line scratch card games completely due to a faulty game I was playing failed to play out correctly.  After ringing I was told I hadn’t won anything on it.!!  No evidence shown to me that I hadn’t won anything.  I suspected games were being monitored and Big prizes halted with “Oops something has gone wrong”. Check your internet connection!! ( there was nothing wrong with it) upgrade to Google Chrome ( which I already had) do you know some people are now calling you Scam a lot 🤣\nI know I’m taking a chance parting with my money I think my efforts to win anything from the Lottery are in vain.\nSincerely Tom"
 },
 {
  "userName": "@jojowiththeflow",
  "version": "7.2.2",
  "score": 2,
  "title": "Cluttered app for terrible game",
  "text": "The app is too cluttered in itself and yet it can’t even do everything because it redirects to the website for plenty of things that aren’t incorporated in the app.\nAside from that, it doesn’t make sense to me that if you look to ‘My games’ it lists not your games, but your purchases.\n\nFinally, on the national lottery itself (rather than the app): if your purpose is to give to good causes, taking part is great. If you fancy winning, don’t bother: the odds of winning are terrible and I get that huge jackpots make for great shouty adverts, but the huge differences in payout amounts between top prizes and the levels below, as well as the constant roll-overs because no one’s actually winning, take away any fun: a savings account/app provides more “excitement”."
 },
 {
  "userName": "Rogerdodgerman",
  "version": "7.2.2",
  "score": 1,
  "title": "Awkward to view winnings",
  "text": "Let’s face it, the reason for playing is the excitement of winning. So when you are notified of a win and check the app you would expect all the bells, whistles and fireworks immediately when you log in. However this doesn’t happen and all you see is opportunities to buy more tickets. Not even a hint that you have won. You have to locate your account then your messages to find what you have won and in a very plain text uninspiring format. Very underwhelming. It gives the impression that Camelot just wants to take your money rather than hand it out. They could learn a lot from the Las Vegas Casino winners experience. They really need to rethink the whole winning experience for their customers. Whoever designs this stuff clearly doesn’t gamble or have a clue about what players want."
 },
 {
  "userName": "Ponson",
  "version": "6.1.2",
  "score": 5,
  "title": "Needs work...",
  "text": "Good: Being able to scan a ticket to see if you’ve won. \n\nBad: Fingerprint recognition to open app has NEVER worked, it just hangs for minutes until I close the app and log on using my password. I’ve tried uninstalling and then reinstalling the app and it still didn’t work. All my other apps that use fingerprint recognition on my phone work fine. Developers, please fix. \n\nI’ve had this app on an iPhone 6 and now an iPhone 8 and I'm always using the latest iOS, but this app has still has never logged on using fingerprint recognition."
 },
 {
  "userName": "Naval Airman",
  "version": "5.1.1",
  "score": 4,
  "title": "A useful app",
  "text": "I cannot comment on the apps ability to buy tickets and be notified if you have won. I have only used it to check physical tickets I have bought when out and about.\nIt works quickly and is easy to use, however when checking multiple tickets it becomes frustrating having to go back to the home screen to go back to the scanner to check more tickets as once you have scanned one there is no way to easily repeat. What it needs is a button saying “check another” to repeat the process so when checking multiple tickets it cuts down on the unnecessary steps."
 },
 {
  "userName": "LjH54",
  "version": "7.0.1",
  "score": 5,
  "title": "Easy, convenient, managed.",
  "text": "I’m not a regular player of the lotteries as I have a standing order for something else, occasionally I like to play the odd line when the jackpot is high- just in case! Having the app means I have immediate convenience, I can move some money into the lottery app account, play my line and not have to worry that I forgot to but a ticket whilst out, or missed it etc, \nI like the instant convenience, right there at my fingertips, when it suits me. \nI don’t have a daily or even weekly inclination to play so it’s ok, I can manage the app making everything easy."
 },
 {
  "userName": "joydyson",
  "version": "7.0.1",
  "score": 4,
  "title": "Needs an update",
  "text": "UPDATE: \nThere’s been some good changes! The side navigation is much clearer and most of the sections are inside the app (instead is jumping to the website version). Nice one UX team.\n\nThe home screen is really modern and simple to navigate. However for someone who has never played the lotto they might not understand the rules. If each lotto type was a call to action button then they could find out more information. You could give rules, previous wining number in the month - loads of stuff. \nThe worst part is the side navigation - very outdated and doesn’t look like it belongs to the app. Like it’s been rush or there was no budge for the entire app. \nThe most annoying thing I find it not having a clear view of the current running games, it takes too many clicks to see my running tickets and even when I do find one, it’s really hidden. And there’s just no simple quick way of seeing which are live, won, or lost on. Hire me - can you tell I’m a UX designer."
 },
 {
  "userName": "Dr Haykey",
  "version": "4.7",
  "score": 3,
  "title": "“It’s ok” is the best I can say",
  "text": "Yes you have to log in each time. But if I’ve won I don’t want anyone else transferring the winnings into another account.\nYes you have to have funds in the account but that makes things easier if you play every now and then rather than feed your gambling habit with you open credit card.\nIt isn’t the most intuitive app but after a bit of practice it is manageable. And to be honest I don’t expect to win it is another way of giving to charities so I’m only interested if I do win, please don’t email me to tell me I haven’t won that seems a bit mean. \nThe app is safe, it saves your numbers and emails you if you win, what more do you need?"
 },
 {
  "userName": "janetom4",
  "version": "7.2.0",
  "score": 5,
  "title": "Jane Tomlinson-Wightman",
  "text": "This app is great for playing the weekly lottery draws. It can be managed sensibly and the fun is in the dreaming of what you would do if you won.... 🤔\nI often think of how I would love to help all my family financially..... This would greatly delight me! Being the mother of x4 daughters, with their families fast expanding.....☺️\nAs a midwife and holistic therapist, I dream of how I would continue to work holistically with women with anxiety and complex pregnancies. I would support my fellow workers within the NHS by providing them with therapies in my purpose built holistic retreat. Awe..... One day..... You have to be in it to win it.....🤞"
 },
 {
  "userName": "SlowShopper1",
  "version": "6.7.0",
  "score": 3,
  "title": "Convenient, but how much??",
  "text": "I like the app, it’s quick and easy, makes checking numbers easier. Means o can buy a ticket quickly without having to find a shop first! \nBut I am absolutely staggered at how much the spend limit is! I know I can change the amount, but how is it ok the the default amount is £750??!!! If someone has a gambling problem, do you actually think they are going to lower their limit??!!! Well done for not supporting those who have gambling addiction... oh no wait, that’s exactly what you’re doing! Enablers make my blood run cold.  Personal usage limits should be much, much lower. If you have a syndicate or special circumstances, these all should be managed separately."
 },
 {
  "userName": "HGUTRD",
  "version": "7.2.2",
  "score": 2,
  "title": "Why limit the choice??",
  "text": "Downloaded the App to save me logging in on the desktop version each time ... just assumed all the same games were on offer and that they had just gotten rid of the sorting options on Instant Win games, but that isn’t the case it’s just that they haven’t bothered to configure this within the App and the choice is much more limited. Bit annoyed as was playing games thinking they had just reduced the choice. Now have to sign in on web browser to get access if want to play other games. Thought Apps were supposed to make the experience better/easier ... from a business point of view, will discourage me from playing more in future (at least I save a few quid!)"
 },
 {
  "userName": "mattyjabut",
  "version": "6.3.0",
  "score": 4,
  "title": "Good just slightly confusing at times",
  "text": "This is a great app , so useful to just put numbers on , I always would forget and be sat at home in front the tv when an ad would remind me , but that would be half hour before the dead line and I’d be sat at home in my pjs lol , now I just play straight off my phone straight from home when the reminder pings on my phone , it’s so cool you got to get it.  Only small prob with this app is finding your way around ?? It’s not easy to select the game you wish to play or find the scratch cards then go back to a national or Euro . I think it just needs a better navigation area"
 },
 {
  "userName": "brexiterr",
  "version": "7.2.2",
  "score": 1,
  "title": "B lanky",
  "text": "This is the worst system ever, I have only my iPad, and to log in I need to put in my email ad, plus my password, then have to look at a series of pics, ( not from UK) and all this is to be only seen in less than half width of the screen of the iPad, How many traffic lights can you see, Who cares, even when I think I’ll play your silly game of clicking on pics, it still don’t let me in, I have won 2 free goes, that are given to anyone that gets 2 correct numbers in the winning line, ... Yea, try bloody getting them, it don’t work, I have only recently tried this online lotto, because of isolation from coronavirus, It’s just a total waste of time, never try this system, !!! I had to put one star, as the review wouldn’t send, in honesty I wouldn’t give it even one star,"
 },
 {
  "userName": "Chris.Morris15",
  "version": "7.1.0",
  "score": 4,
  "title": "Good, but not perfect",
  "text": "The Lottery is pretty darn good, but it has made it more difficult to take part with its price rises (£1 Lotto Tickets to £2 and Euromillions from £2 to £2.50). Something which has made it difficult to afford. Anyway, the app has a nice front page, but the rest is quite basic (looks like a desktop page), which is disappointing. There was ample opportunity to make this look a lot slicker. One last thing.; I really wish they made a £5 payment available. Currently, you can only put £10 into the funds, so I would have liked a bit more control over this."
 },
 {
  "userName": "MessUser",
  "version": "6.6.2",
  "score": 3,
  "title": "Why can’t I change my address?",
  "text": "Does anyone ever won through the app? \nThe app itself would be alright and it’s came a long way since, especially since we’ve been able to sign in with fingerprints. The biggest issue with it though is that I can’t change my address. \nIt’s going to be nearly 3 years since I moved house and I try in vain to change my address on the app every so often. Everytime I get a message that I must have moved recently bla bla bla!!!!! So I never get to change it! \nI hope when I win this won’t be a problem.\nAnother issue is the inability to save numbers and replay them another time like you’d on the website."
 },
 {
  "userName": "dkdjcjsjjs",
  "version": "7.3.0",
  "score": 1,
  "title": "Rocket",
  "text": "The old style was much better than this app. If you get a message saying you’ve won it takes you onto your main page so the only way you can see if you’ve won is by checking your balance, the old way was better as the link took you to a page and told you how much you’d won, so it was easy to see.\nIt was also a lot easier to play the games and view what tickets were still valid, you can still go back into this view,  but it’s a bit of a gaff trying to remember where it is!\nDoesn’t seem as easy to be able to put on lucky dips etc.\nI much prefer the older layout.\nOnly reason it gets one star is the scanning facility to check a paper ticket which is good, but as I normally play online I don’t use this much."
 }
]