[
 {
  "userName": "Benamino",
  "version": "1.7.0 UK",
  "score": 5,
  "title": "Really love it!",
  "text": "I’m not much of a gambler, never have been, but the variety of ways that are provided to enjoy the apps betting entertainment just entices you to try at least one of their lottery methods, even to place the smallest of bets can be done with such ease and security. I feel like a lot of people that leave reviews for this sort of thing don’t initially consider the possibility of losing money or the process they would have to go through in order to be eligible for withdrawing winnings etc, but if all aspects have been considered and you enter their world with open-mindedness, then you can’t really be disappointed! I personally love LottoLands layout - both on the website and the mobile app - and find it easy to locate new and intriguing ways to indulge in their gambling practices. 5/5 will definitely remain a fellow LottoLander, thanks to all the team for the hard effort they put in to provide such a service."
 },
 {
  "userName": "chelmsford92",
  "version": "1.5.6 UK",
  "score": 4,
  "title": "Good App",
  "text": "This is a very good app and interesting to see and participate in all the different draws. You have to watch very carefully the bet you place because Lottoland has a very dubious practice of slotting in another game under the price of your bet and when you check out you’ve found your account has been debited for a game you haven’t signed up for. Another dodgy practice is when you choose a new lotto game to play and you click on the betting slip you will find about 5 lines of numbers already pre selected and you have to be wise and delete them all before placing your own bets otherwise you are going to have a very large debit coming from your account. If it wasn’t for these dubious processes I would have given a 5 star rating."
 },
 {
  "userName": "Hueybvb",
  "version": "1.2.0 UK",
  "score": 4,
  "title": "Great App",
  "text": "The App is definitely easy to use when compared to other lotto and betting apps I tried and I would also say it has a greater bag of promos on offer too. In comparison to a majority of other lottery apps Lottoland definitely has a wider variety of lotteries on there, a few tongue twisters Lol but would deffo say the options are there. Customer service is pretty good can’t complain, initially I got confused with the withdrawals and to my amazement I was generally happy with the customer service my issue was resolved first time. Nice swift replies on the online chat and the chap was understanding and really helpful. I wouldn’t mind if the app was a lil faster then again, I wouldn’t mind if I actually won the lottery lool so far so good."
 },
 {
  "userName": "xBLacKDarKnEss",
  "version": "1.7.2 UK",
  "score": 3,
  "title": "Sur-Par",
  "text": "The app itself is fairly decent in the sense, however, once you’ve purchased the deals they provide, you don’t have an option to select those scratch cards from a menu. Instead, you have to manually search for them. Also, I’ve put a bit of cash here and there to this. I’m not the biggest gambler, but when you’re only winning 1p or 2p every now and then, you feel as though gambling on here is useless. That’s the only reason for three stars. Is the app layout. \n\nIf you’re a fan of petty change, this app is for you. If not, find something with a little bit of a winning stance."
 },
 {
  "userName": "An avid fallout lover",
  "version": "1.7.2 UK",
  "score": 1,
  "title": "Very disgusted",
  "text": "Signed up for a bit of fun, games are fun  and the jackpot overdrive was an interesting concept but the sign up was easy no hard verification needed just a card number and that was all, tried to withdraw only £15 and it asked me for ID verification (driving license) took a picture of my license and tried to upload it as per the instructions but there was no way I could, just kept saying contact customer services. I’m really disgusted by the practice. How on earth is it perfectly acceptable to sign up to these things whilst only needing to click a button to say you are over the legal gambling age of your country yet to withdraw they require much more information to verify you. Will never use this again"
 },
 {
  "userName": "Baron Von Poopenplop",
  "version": "1.5.6 UK",
  "score": 5,
  "title": "I initially gave this 1 star but was so wrong....",
  "text": "I initially gave this app 1 star because I thought the payout time was way too long (says on site 5 - 10 working days). My payments have normally appeared within 3 working days so I cannot complain. The online help is also excellent if you have a query - especially Niall and Jim - so I cannot complain. An excellent app and well deserved 5 star!"
 },
 {
  "userName": "adolfnuggets",
  "version": "1.5.6 UK",
  "score": 3,
  "title": "Such a great way to win",
  "text": "So last night I decided to give this app ago as I’ve used other gambling apps before such as William hill & 888 casino and while spending like £25-50 on each of those I never won any of my money back but I decided to give this ago on a few games that I’ve seen you tubers play and I was very impressed that this app allows you to get a few big wins and keeps you interested with a lot of different others such as the scratch cards and live games"
 },
 {
  "userName": "nnptrv",
  "version": "1.0.49 UK",
  "score": 2,
  "title": "Certain games don’t work",
  "text": "The app is quite straightforward and easy to use, however I purchased some tickets for a game and I was not able to use them as the app was unresponsive on that specific game. I email customer support about it without a reply, I tried to use the online chat service but as soon as I explained my problem I got no response, I waited around 15 minutes until I had to disconnect. I don’t really mind about the lost money as it is an insignificant amount but their customer service approach is quite disappointing!"
 },
 {
  "userName": "Cheshhhhh",
  "version": "1.5.6 UK",
  "score": 2,
  "title": "Needs improvement",
  "text": "The app is fairly okay, few glitches here and there but the main reason for this review is... \nIt’s so easy to accidentally purchase things which you haven’t realised have been added to your cart, for example I added a £0.80 scratch card to my cart but didn’t realise a £20 game was added after only viewing that game earlier on...\nThe customer service did help me and I managed to get my money back into my lotto wallet but I was then unable to withdraw my funds."
 },
 {
  "userName": "nechi1998",
  "version": "1.5.3 UK",
  "score": 5,
  "title": "Lottoland web page is in a different language from the first time I downloaded it",
  "text": "I have had no problems with the app until now for some reason the app is totally different and in a different language which I cannot change . I try to login and I can’t"
 },
 {
  "userName": "Afenny Tavares",
  "version": "1.7.3 UK",
  "score": 1,
  "title": "Taking money from my bank account with no permission",
  "text": "I’m very disappointed with this Lottoland app\nYour Lottoland app take money from my account with out me having done any activity on the app, I have been sending email and contact the costumer service and nothing, no answers and no explanation about the situation. If any pound £ comes out again I will take serious actions about that, I will wait for your management send me a email with the reason why and my refund too. I don’t recommend any app acting like that to no one ... kind Regards"
 },
 {
  "userName": "noastargirl",
  "version": "1.7.3 UK",
  "score": 2,
  "title": "val",
  "text": "This app is very unprofessionally designed it glitches and doesn’t load most of the time’s is there any technical difficulties with server or most of things as well as showing how many people won at real time games not introduced doesn’t shows even how many played the game and how many winners at time ... there’s no need hiding information - very poor on winnings as well as it’s designed through algorithm No Win No Never ."
 },
 {
  "userName": "T.Panjay",
  "version": "1.5.6 UK",
  "score": 1,
  "title": "They say 1 in 3.5",
  "text": "I brought all in all 10 scratch cards. On 777 I brought more than 5 and didn’t win on any of them. For my first time on this app I don’t expect winning thousands but when it says 1 in 3 chances and did 5 attempts and win nothing. But of a scam really. Spent £10 got nothing back. I wouldn’t bother.\n\nFrom the layout of the app itself it’s simplistic and easy, you don’t have to keep adding your bank details in it just does it automatically. Easy to use! Shame really."
 },
 {
  "userName": "Silva5169",
  "version": "1.5.6 UK",
  "score": 5,
  "title": "Access not possible when out of home",
  "text": "Why is that it’s not possible to access the website through the app when not in range of my home network??"
 },
 {
  "userName": "euro fraud",
  "version": "1.4.0 UK",
  "score": 4,
  "title": "mr",
  "text": "I've been playing this lotto land now for a long time and I've been doing 50p scratchcard and it seems like any time I am going to win anything it's usually 50p are 25p is this a scam because it seems to me you are making the money out of this 50p scratchcard that that you can select when playing the euro"
 },
 {
  "userName": "chreisd",
  "version": "1.5.6 UK",
  "score": 1,
  "title": "App problem and customer service did not help",
  "text": "I tried the app for the first time, I was playing and it worked then I went on scratch cards and as soon as I went on them it would take me back to the home page but still charge my account. I contacted the chat service and explained and they kept me waiting on the chat in conversation asking for my details only to them copy and paste a response to me about my problem!!!"
 },
 {
  "userName": "randorr beck",
  "version": "1.3.1 UK",
  "score": 1,
  "title": "Not Impressive",
  "text": "My experience of the app is disappointing to say the lest Customer Service on Live Chat is ridiculous and Assistants across as lazy, disinterested and playing games.  At one point I even asked if I were communicating with a auto bot (I spoke to three individuals, first person's name I can't remember, Alex and Justine, Justine twice) because the initial written responses were identical word for word.  \n\nThe service was so bad I even ended up taking screen shots of the conversation."
 },
 {
  "userName": "MortonMummy",
  "version": "1.7.3 UK",
  "score": 5,
  "title": "Not easy claim but easy spend!",
  "text": "Easy to spend money out your account with them but if you win it’s no as easy to claim. Need driving licence, passport etc to claim but not to spend?"
 },
 {
  "userName": "Tottydude2000",
  "version": "1.5.6 UK",
  "score": 4,
  "title": "Okay?:/",
  "text": "Put in £1 for 30 games of lucky horse scratch cards.... came out with 90p. 10p down, not bad obviously worth it for a little fun. BUT 90P OUT OF 30 CARDS😂😂😂😂😂😂😂😂😂 obviously not expecting a big win but would’ve liked to won a few bob. About 5 of my winnings were 2p prizes😭😭😂"
 },
 {
  "userName": "player qpppp",
  "version": "1.7.2 UK",
  "score": 1,
  "title": "Adrian",
  "text": "The worst app ever!!!\nI played few days deposit about £100  i win back £120 i withdraw my money and waited for my money to be received. I contact customer service and after that they closed my account, so my question is: do you think i will get my money??!! I will let you know in few days....... to be continued \nAnyway avoid by any means\nOr you can play and have the same problem"
 },
 {
  "userName": "FN_9",
  "version": "1.5.6 UK",
  "score": 1,
  "title": "Very bad app and no security",
  "text": "I requested to delete and suspend my account they refused to do it otherwise I will have to check with the security cause they refused to remove my details they say it’s the policy to have my details but I am not interested in their app anymore so now I don’t know what will happen after my child did wrong so I can’t remove my details from the app!! Don’t trust!!"
 },
 {
  "userName": "jenaaaaaas",
  "version": "1.3.1 UK",
  "score": 5,
  "title": "I love it!",
  "text": "I love Lottoland, you can bet as little as 25p on the mini lotto which is fab, the app couldn’t be easier to use and they even give you little bonuses here and there"
 },
 {
  "userName": "Witch_F86",
  "version": "1.5.2 UK",
  "score": 1,
  "title": "So frustrating!",
  "text": "I get emails all the time from Lottoland but today I thought actually yea I’m feeling a bit lucky, I’ll take up that offer! Well since paying for it I’ve not been able to get back on the website or app, just constant error messages. Funnily enough it was fine when I was changing my bank details and paying! So so frustrating!!"
 },
 {
  "userName": "Stella boy",
  "version": "1.7.0 UK",
  "score": 5,
  "title": "You’ve won !!!!!",
  "text": "Great site and easy to use, just when the Email arrives saying ‘Fantastic News’ to discover I’ve won about £3.50 !! 🤣🤣"
 },
 {
  "userName": "becky150117",
  "version": "1.2.1 UK",
  "score": 2,
  "title": "Disappointing",
  "text": "Been playing for about a month or 2 and not won over £1! Must have spent around £60 for an overall win of around £8 in the whole time I’ve been playing. Gets burning very fast when you know you’re chances of winning anything are slim to none."
 },
 {
  "userName": "B2535",
  "version": "1.2.0 UK",
  "score": 3,
  "title": "Update app",
  "text": "I’m using IPhone X can you fix app to work properly with my type of device also enable FACE ID! Also there is no sound when I’m playing any of the games! Please update my app to fully support iPhone X\n\nApart from that app is good, games and jackpots are really good!"
 },
 {
  "userName": "valInLondon",
  "version": "1.0.49 UK",
  "score": 5,
  "title": "So much choice!",
  "text": "I have so far a great time with the app, there are a lot of big jackpot lottery games and it’s cheaper than the national lottery. \nQuick payouts too."
 },
 {
  "userName": "your god odin",
  "version": "1.7.3 UK",
  "score": 5,
  "title": "Great site just won £322 on my last 20p spin",
  "text": "Great site just won £322 on my last 20p spin \nI don’t not normally review apps but this was of the rare occasions I do."
 },
 {
  "userName": "Reverend Ronke",
  "version": "1.7.1 UK",
  "score": 5,
  "title": "For me to win",
  "text": "I have won very little money so far. I pray that l will be able to win and have more money of £989,989,989 money and me Reverend Dorcas Ronke Fatobi Khorshidi to be very very beautiful to have everythings l need. Amin"
 },
 {
  "userName": "LouG7t4",
  "version": "1.2.1 UK",
  "score": 2,
  "title": "Not keen!",
  "text": "App is slow and problematic - sticks on certain screens and if you click on a screen in error, you can’t go back and have to close the app down.  Also, withdrawing funds - 5-10 days - 15 in some circs! What?! Really?! Will stick to other sites used regularly thanks"
 },
 {
  "userName": "IstanbulGirl",
  "version": "1.5.6 UK",
  "score": 5,
  "title": "Excellent",
  "text": "The best of all the online lotto apps, easy to navigate and wonderful support. When I was unable to get a promotion discount the agent credited me with the discount."
 },
 {
  "userName": "Lighbulb",
  "version": "1.5.6 UK",
  "score": 5,
  "title": "All in one place👍",
  "text": "Quick and easy to setup with many games to play"
 },
 {
  "userName": "Jackz324",
  "version": "1.3.1 UK",
  "score": 2,
  "title": "Facebook Connectivity Broken!",
  "text": "It might be just my version of your app but for some odd reason it won’t let me link my Facebook account to your app and yet it’s always been connected to it beforehand. So can you please give me a bit of advice. \nThanks"
 },
 {
  "userName": "Wildeone83",
  "version": "1.3.1 UK",
  "score": 2,
  "title": "Poor App",
  "text": "Although the App works it’s a poor setup. Very difficult to understand what subscriptions are still working, changing card details is unclear, live chat doesn’t work. Already looking to leave for a better app."
 },
 {
  "userName": "Adamisawsome211",
  "version": "1.0.49 UK",
  "score": 1,
  "title": "Misleading scam promotion",
  "text": "So I see this pop up on Instagram ohhh a really good offer £1 scratchcard that usually costs £3! It can’t be! Of course it can’t.... I try to pay for the £1 in the cart and it says YOU NEED MINIMUM £3 IN YOUR CART BAAAAHAHAHA. Once again I feel like such an idiot for falling for this type of retarded con. I hope you enjoy my unspent £1 lottoland because I’m out"
 },
 {
  "userName": "my old china",
  "version": "1.5.6 UK",
  "score": 5,
  "title": "Get in there my cocker",
  "text": "Marvellous opportunity to change your fortunes against all the odds, splendid and super , keep them crossed 👍"
 },
 {
  "userName": "majid2585",
  "version": "1.5.6 UK",
  "score": 1,
  "title": "Zero% chance of jackpot",
  "text": "Never try for jackpot here in lotto land. Small amount like under £100 you will be easily get paid in ur account but jackpot ... no way. Lotto land will ask for detail where you born if you win jackpot. Uk and Europe born nationals only can claim jackpot. If you born elsewhere then stop playing Lottoland. There are many more in market."
 },
 {
  "userName": "KimJohnKane",
  "version": "1.7.1 UK",
  "score": 2,
  "title": "Decent but don’t expect anything special",
  "text": "This can be fun to pass the time and if you’re betting small but don’t expect anything more than 0.50p wins. You will not win big on this app. I’ve done enough of them to know."
 },
 {
  "userName": "KingJosey",
  "version": "1.5.6 UK",
  "score": 5,
  "title": "Awesome app",
  "text": "Very useful, better than using safari"
 },
 {
  "userName": "icandy123",
  "version": "1.5.2 UK",
  "score": 2,
  "title": "Playing games",
  "text": "Not Winning much and the games are expensive, it also seems like Lottoland want more from customers but personally I feel I’m not winning enough to buy more tickets. Thank you."
 },
 {
  "userName": "Tim2890",
  "version": "1.7.1 UK",
  "score": 3,
  "title": "Unstable",
  "text": "App is quite basic, slow and keeps crashing and is down for long periods without reason. Unreliable."
 },
 {
  "userName": "John_40586",
  "version": "1.5.1 UK",
  "score": 1,
  "title": "Cashing out",
  "text": "I accidentally added £50 instead of £5 and it wouldn't let me cash out the £50 ! I went to chat and left two messages 1 with Paul and 1 with Kelly and I haven't had any response as yet . Thus is why when I've used up my remaining balance I'll be deleting the app"
 },
 {
  "userName": "delgirl11",
  "version": "1.7.2 UK",
  "score": 3,
  "title": "Price",
  "text": "Use to be value for money now with price increases not so !!!!\nThat was the reason I choose to use the site (the national lottery regrets he change will the drop in sales !!)"
 },
 {
  "userName": "Titchyjj",
  "version": "1.7.0 UK",
  "score": 1,
  "title": "Rubbish. Where did my winnings go",
  "text": "I brought some scratch cards and I won a fair bit on them but nothing came through onto my balance which was still 0.00 at the end and no pay out either so where did my winnings go"
 },
 {
  "userName": "Rizlaruss1979",
  "version": "1.7.3 UK",
  "score": 1,
  "title": "Watch out bad company.",
  "text": "Awesome app to use until it comes to with drawing your winnings.  Photos of utility bills and driving license required as well a photo of your debit card front and back.   Plenty of apps out there that don’t require all of the above... be careful folks...."
 },
 {
  "userName": "SummerMaster",
  "version": "1.7.2 UK",
  "score": 2,
  "title": "Keep crashing",
  "text": "Downloaded app few weeks ago. Anytime I check my account app keep crashing. Difficult to use. Needs a serious renovation and update!!!"
 },
 {
  "userName": "lara0179",
  "version": "1.5.3 UK",
  "score": 3,
  "title": "Miss Laura Pond",
  "text": "I signed up because I was given a promotion of 30 goes on the horseshoe scratch card if I deposited £1.00 I did not receive my 30 scratch cards only 10"
 },
 {
  "userName": "Keeley75",
  "version": "1.7.1 UK",
  "score": 1,
  "title": "Nothing absolutely Nothing",
  "text": "Been playing for a few days and after putting in over £150 I have won nothing on the slots so the percentage payout must be crap 💩 not even worth a star but had to put 1 on"
 },
 {
  "userName": "connokes",
  "version": "1.5.6 UK",
  "score": 5,
  "title": "Know you like me now",
  "text": "The way I talk to everyone make me rich"
 },
 {
  "userName": "jodietaylorellen",
  "version": "1.2.0 UK",
  "score": 1,
  "title": "S##T",
  "text": "Th games crash a lot and when you change stake sometimes it doesn’t Change. If you bought off grouping most the scratch card are you win like 1 or 2p it’s a rubbish site, I wouldn’t use again it’s a waste of money"
 }
]