[
 {
  "appId": "com.iphonesoft3g.blackjack",
  "title": "Blackjack 21: Blackjackist",
  "description": "Play the best blackjack 21 free game with millions of players from all over the world!\nBlackjack is an exciting game that any player is sure to enjoy. Place your bet, get more points than the dealer and win chips. Feel the risk as you dive into the casino atmosphere and hit the big time!\nPlay now to improve your skills, gain experience, make new friends and become the best blackjack player ever!\n\nGame features:\n• FREE CHIPS – Play the game every day to get free chips!\n• GET REWARDS – Up the stakes, win games against the dealer, take risks to get to 21 and unlock achievements.\n• QUESTS – Complete daily quests to get free chips!\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level up. See how many blackjack tournaments you've won and achievements you've completed. Get unique properties and display them on your profile. View other players' profiles to see how you compare!\n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other blackjack players.\n• FAIR PLAY GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest blackjack experience!\n• LEARN TO PLAY – Are you new to blackjack but always wanted to try it? \nOur simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about blackjack, from the rules of the game to winning combinations.\n• 3D GRAPHICS – An absolutely free blackjack game with stunningly realistic 3D graphics.\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\n• SINGLE ACCOUNT – Start playing free blackjack on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.\n\nWant more than blackjack?\nTry our other games for an unforgettable 3D experience: \n• TEXAS HOLD'EM POKER – The most popular casino game among professional gamblers! Test your skills in amazing poker tournaments!\n• SLOTS – Explore our themed slots with lots of unique features!\n• ROULETTE – Featuring stunning 3D graphics and three varieties of table: French, American, and European.\n• OMAHA POKER – A more dynamic version of poker with 4 cards in a hand. Have more fun with amazing combinations!\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\n\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!\nhttps://facebook.com/Pokerist\n\nFollow us on Twitter and get free chips!\nhttps://twitter.com/KamaCasino\n\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2015-01-29T12:12:02Z",
  "updated": "2020-05-04T07:50:11Z",
  "releaseNotes": "Stay home. Be safe!\nWe've planned a lot of new features for you to enjoy!\n\nNew VIP System\nVIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!\n\nWeekly Rankings\nCompete against other players and see how you rank each week!\n\nNow MTT starts every 40 minutes!\n\nQuicker Betting\nTry raising a bet and you'll find a new option to bet 1/2 or the full pot! Raise faster!\n\nImproved navigation in the lobby—now you can view playing tables in a chart.",
  "version": "32.6",
  "price": 0,
  "developer": "KamaGames",
  "score": 4.67534,
  "reviews": 2997,
  "currentVersionScore": 4.67534,
  "currentVersionReviews": 2997,
  "searchTerms": "blackjack"
 },
 {
  "appId": "uk.pokerstarscasino.www",
  "title": "PokerStars Casino Games Online",
  "description": "Play exclusive Slots, popular Blackjack games and enjoy the best Roulette action (including double ball and live dealer tables) at the fastest-growing online casino.\n\nTOP 2 REASONS TO DOWNLOAD POKERSTARS CASINO\n\n1. WE HAVE IT ALL! Play a great variety of new and innovative games: From Multi-Player Blackjack and Roulette to Live Casino and our exclusive Slot game, Millionaires’ Island, you’ll find all your favourite games.\n\n2. REAL MONEY! Enjoy real money and free-to-play mobile casino games, available across a wide range of limits and formats. \n\nPokerStars Casino is brought to you by the world’s largest online gaming company – trusted by over 100m players worldwide.\n\nPOKERSTARS CASINO GAMES:\n\nA HUGE SELECTION OF SLOTS\n- Classic and themed Slot games\n- Special features that give you more chances to win cash prizes\n\nPLENTY OF DIFFERENT BLACKJACK FORMATS\n- Variety of Blackjack games – popular formats include Classic, Atlantic City, European and more!\n- Play online Blackjack in Single Player or Multiplayer mode.\n\nTHE THRILL OF ROULETTE\n- European roulette available, including standard and Double Ball tables.\n- Play Live Roulette games, including the award-winning Immersive Roulette.\n\nDownload PokerStars Casino today and make sure you accept push notifications, to ensure you don’t miss out on any of our great promotions.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-09-22T22:43:59Z",
  "updated": "2020-04-14T16:49:29Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "3.27.1",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.34567,
  "reviews": 1594,
  "currentVersionScore": 4.34567,
  "currentVersionReviews": 1594,
  "searchTerms": "blackjack"
 },
 {
  "appId": "uk.me.decipher.blackjack7",
  "title": "Blackjack",
  "description": "Play blackjack as if you were at the casino! This is the MOST POPULAR blackjack game on the store, with millions of players around the world! Learn blackjack 21 with this FREE blackjack game (designed and optimised for iPhone, iPhone X and iPad) featuring play prompts to help hone your blackjack skills and detailed career history to keep track of your wins! Travel to new destinations for HIGH ROLLERS added often for WINNERS! Including large, funky (and ever changing) detailed cards and chips - see if YOU can PLAY NOW against the dealer and WIN, by getting 21 without going bust! \n\nFeatures:\n• FREE BONUS CHIPS - play every day without ever having to pay! \n• LEARN BLACKJACK - play prompts and tutorials to help hone your skills \n• TRACK YOUR PROGRESS - keep track of your achievements via your own profile page and GET REWARDED with free chips and cool new deck designs for testing your new blackjack skills! \n• UP THE STAKES by travelling between real-world locations for new challenges! \n• High-definition, retina graphics - check out our COOL and unique cards and chip designs NOW! \n• REAL LIFE FEEL - tap your chips, cards and the table as if you were at the casino\n• Blackjack casino rules pays 3:2\n• Insurance casino rules pays 2:1 if the dealer has blackjack\n\nIf you go bust - don't worry, you'll get chip bonuses every 20 minutes and every day so you can come back later and play more blackjack if your luck runs out. Make sure to ENABLE PUSH NOTIFICATIONS FOR FREE CHIPS!\n\nPlease note, in app purchases cost real money - these can be disabled in the system preferences. \n\nWe hope you enjoy playing blackjack! If you have any questions or suggestions, please contact us using the app.\n\nThis game is only available to users of legal age and offers no possibility of winning money or anything of monetary value.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2010-05-20T21:40:10Z",
  "updated": "2020-05-01T16:53:46Z",
  "releaseNotes": "Stay Home... play Blackjack World Tour!!\n• We’ve added a cool new mini game for WINNERS with EPIC NEW GRAPHICS! \n• Minor bug fixes also added",
  "version": "4.20.3",
  "price": 0,
  "developer": "TapTapBoom Ltd.",
  "score": 4.59741,
  "reviews": 2248,
  "currentVersionScore": 4.59741,
  "currentVersionReviews": 2248,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.greenpanda.blackjack",
  "title": "Blackjack ∙",
  "description": "Welcome to the #1 Blackjack! Play as in real casinos and beat the dealer to win tons of dollars!Blackjack, also known as twenty-one, is the most widely played casino banking game in the world.\n\nRULES AND OPTIONS\n\nBlackjack is a card game between a player competing against the dealer. It is played with two or more decks of 52 cards.\nThe object of the game is to beat the dealer in one of the following ways:\n\n- Get a BlackJack on the player's first two cards (21 points), without a dealer blackjack.\n- Reach a final score higher than the dealer without exceeding 21\n- Let the dealer draw additional cards until his or her hand exceeds 21.\n\nCASINOS\n\nTravel all around the world and play in the most popular casinos: \n- Casino of Las Vegas\n- Casino of Paris\n- Casino of Macau\n- Casino of London\n- Casino of Monte Carlo\n- Casino of The Bahamas\n\nFEATURES\n\n- Blackjack pays 3:2 \n- Dealer must stand on a 17 and draw to 16\n- Insurance pays 2:1\n- Hit, Stand, Double Down, Split or Surrender\n\nIMPORTANT NOTICE\n\nThis game contains an algorithm that strictly respects Blackjack rules. Cards are shuffled and dealt in the exact casino way to ensure a 100% fair gameplay.\nIn-app purchases cost real money - be responsible when playing games including money. \nThis Blackjack game is a gambling simulation game, it neither involves real money gambling, nor provides any means to win real money or prize.\n\nCONTACT\n\nPlease feel free to contact us at support@greenpandagames.com if you encounter any problem regarding this app.\nFor the latest news and updates on Green Panda Games:\n\nLIKE us on Facebook\nhttps://www.facebook.com/Green-Panda-Games-1696022237280275/\n\nFollow us on Twitter\n@greenpandagames\n\nVisit us at:\nhttp://www.greenpandagames.com",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-06-08T07:32:10Z",
  "updated": "2018-07-16T13:11:18Z",
  "releaseNotes": "- GDPR update\n- Minor bugs fix\n\nIf you encounter any problem regarding this app, please feel free to contact us at support@greenpandagames.com",
  "version": "2.1",
  "price": 0,
  "developer": "Solitaire Games Studio",
  "score": 4.65751,
  "reviews": 946,
  "currentVersionScore": 4.65751,
  "currentVersionReviews": 946,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.brainiumstudios.blackjack",
  "title": "⋆Blackjack",
  "description": "Blackjack by Brainium, captures what makes Blackjack such an exhilarating game, while making the experience easy, beautiful, and intuitive for your iPhone and iPad. Best of all, there are NO in-app purchases for getting chips in our game!\n\nTap the chips to adjust your bet, and watch the gorgeous, crisp and beautifully animated cards fly on the table. \n\nIf you're unsure of your strategy, ask the dealer for a hint at any time. \n\nHelpful bubbles help you quickly add up your cards, or decide whether you should take a hit on a soft value. \n\nTake advantage of advanced strategies, like splitting multiple times, and doubling down, to win big! \n\nWe love our players so we made sure that you don't spend any money in our game to get more chips. Blackjack by Brainium is completely free to play and all the chips and money used in the game are fictitious. \n\nGive Blackjack by Brainium a try, and we promise you will have a fantastic experience, and with the new skills you pickup, you'll feel more confident for your next trip to Vegas! \n\nBlackjack Rules:\n\nBlackjack, also known as 21, is one of the most popular casino games in the world. Blackjack is a card game where players compete against the dealer. The object of the game is to reach 21 or to reach a score higher than the dealer without exceeding 21. \n\nIn Blackjack by Brainium, the dealer must draw to 16 and stand on soft 17. Blackjack pays 3 to 2, and insurance pays 2 to 1.\n\nHighlights & Features: \n\n- Gorgeous, beautifully animated cards \n- Touch and interact with all of your chips \n- Split hands or double down to win big\n- Buy insurance to dodge a dealer blackjack\n- Surrender to get out of a tough situation \n- Detailed statistics to track your performance \n- Multiple table backdrops to choose from \n- Unlimited dealer hints \n- Unlimited free chips! \n- Universal app looks amazing on iPhone, iPad, and iPod Touch \n\nWe hope you enjoy Blackjack by Brainium, and contact our five star support if you have any questions :)",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-11-15T02:45:36Z",
  "updated": "2018-12-04T17:01:02Z",
  "releaseNotes": "We're happy to bring our Balckjack fans a new update! \n- Improved layout on new devices\n- Increased stability\n- Bug fixes and improvements",
  "version": "1.3.1",
  "price": 0,
  "developer": "Brainium Studios LLC",
  "score": 4.54887,
  "reviews": 665,
  "currentVersionScore": 4.54887,
  "currentVersionReviews": 665,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.house.of.blackjack.free.online.casino",
  "title": "House of Blackjack 21",
  "description": "Enjoy REAL blackjack with the tip of your fingers!\nWhat you've always wished for is right here. Become Vegas’ biggest fish with the best blackjack trainer, House of Blackjack: 21\nAll the best of House of Blackjack: 21\n\n◐ FREE CHIPS EVERYDAY - Get rich with various free chip rewards!\n◐ SIDE BET - Place Side Bets to claim up to X1000 JACKPOT in wins with JACKPOT BUSTER and Jackpot of Gold!\n◐ KEEP UP WITH THE TREND - Free Double Downs, Free Splits, and Golden Bets. \n◐ TOURNAMENTS - Enjoy fast and fun blackjack tournaments and compete against other real players.\n◐ EVERYBODY WINS - Gain Bonus Rewards when every seated player wins.\n◐ REAL RULES - Play blackjack with the same set of official rules of Vegas.\n◐ BLACKJACK TRAINER - See more wins as you play and train, while learning the best strategies of blackjack.\n◐ REAL CASINO VIBES- Immerse yourself at the table with realistic hand motions and automatic chats.\n◐ VIVID GRAPHICS - Professional dealers and the bright city lights await you.\n◐ LEADERBOARD - See who takes the top.\n\nVisit our Facebook Fanpage for more information, BONUS CHIPS, and MUCH MORE!\nhttps://www.facebook.com/HouseofBlackjack\n\nWe would love to receive any questions or comments from you.\n\nblackjack@help.neowiz.com\n\nThis game is only available to people of legal age. The game does not offer real money gambling or an opportunity to win real money or prizes. Practice or success in playing this game does not imply your future success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-12-05T05:26:08Z",
  "updated": "2020-04-14T05:00:19Z",
  "releaseNotes": "[Update] NEW FEATURES added!\n- Popular slots, which you can see in actual VEGAS casinos, are joining House of Blackjack!\n- Try the HOTTEST 5 slots with your phone, RIGHT NOW!\n- Now, sign in with your Apple account!",
  "version": "1.5.30",
  "price": 0,
  "developer": "NEOWIZ",
  "score": 4.89473,
  "reviews": 114,
  "currentVersionScore": 4.89473,
  "currentVersionReviews": 114,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.yaohua.vegasnights",
  "title": "Vegas Nights Slots",
  "description": "Real slots at Vegas Nights - The Best Free online social Casino Slots Game ! \nPLAY NOW to receive a FREE Welcome Bonus Package!\n\nWorld class gambling game design brings real slot games from the casinos to mobile App! New Features and Surprising Bonuses on All New Slots!\n\nVegas Nights Slots is the best slots game there is, offers the most stunning graphics and a realistic casino experience. Enjoy every benefit you can possibly have on a real slot machine! Progressive Jackpot, Stacked Symbols and Locked WILDs! PLAY NOW and get the best slot experience today!\n\nWhat is special at Vegas Nights Slots?\n• Tournament Day, Quest Day, and Challenge Day bring you Extra bonus every day of the week!\n• All levels All slots 100% FREE to play! New Updates online every week!\n• Multiply your winnings to maximize the benefits with Double Ups and Bonus Games!\n• 2,000,000 FREE Coins for starter bonus, plus Hourly bonus, Daily Bonus, Store Bonus, Holiday Bonus, Friends Bonus, Fan Page Bonus and many more FREE coins available everyday!\n• A variety of WILD, Free Spins, Bonus Games, Jackpots and more interesting ways to play!\nPlay Vegas Nights Slots, the BEST Online SLOTS Game ever!\n\nPlay free slots, slot machine games & online casino. Make a fortune with huge jackpots, free daily games on Vegas Night Slots! Ding Ding Ding! Jackpots!\n\nVegas Nights Slots is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling. Use of this application is governed by Mobee's Terms of Service.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-06-03T10:52:15Z",
  "updated": "2020-01-10T03:28:44Z",
  "releaseNotes": "Real Slots at Vegas Nights!\n\n-Fixed Bugs.\n-Overall upgraded.\n-Improved stability and compatibility.\n\nPLAY NOW!\nGold luck & Happy spinning!\n\nFollow us on Facebook at: \nhttps://www.facebook.com/vegasnights.slots\nIf you run into a bug or have a question, you can contact us at support@mobeegaming.com",
  "version": "2.0.8",
  "price": 0,
  "developer": "Mobee Co., Ltd.",
  "score": 4.88889,
  "reviews": 873,
  "currentVersionScore": 4.88889,
  "currentVersionReviews": 873,
  "searchTerms": "blackjack"
 },
 {
  "appId": "uk.me.decipher.blackjackvegas",
  "title": "Blackjack Free",
  "description": "Play Blackjack to test your skills before heading to Vegas! High quality blackjack 21 simulator to practice your game before hitting the strip.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-07-25T18:28:01Z",
  "updated": "2014-07-25T18:28:01Z",
  "version": "1.0",
  "price": 0,
  "developer": "TapTapBoom Ltd.",
  "score": 4.35714,
  "reviews": 14,
  "currentVersionScore": 4.35714,
  "currentVersionReviews": 14,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.cardgamefree.blackjack",
  "title": "Blackjack⋅",
  "description": "Welcome to the world’s MOST beloved card game: BlackJack!\n\nThe same experience as play in real casinos, 6 unique rooms with different bet ranges for you to choose. Whether you are a seasoned veteran or inexperienced newcomer, you will love the fast tables and fun games in this BlackJack game!\n\nFully respects and modeled on real casino rules and performance, cards are shuffled and dealt in exact casino way to ensure a 100% fair gameplay. You will have the most fun and entertaining Blackjack experience with Side Bet and Jackpot game in each room.\n\nGame Features:\n\n- Play multi-level Blackjack Tournaments, win your own Rings and climb the leaderboard!\n- Play with Live Friends, send gifts and likes to other players and make new friends in this game!\n- Play as in real casinos, all scenes designed as the interior of Las Vegas Casino!\n- Unique Side Bet and Jackpot game for each room\n- Travel all around the world and play in the most popular 6 casinos, bet big to unlock new tables and win more!\n- BlackJack pays 3:2\n- Insurance pays 2:1 \n- Flexible rules, you decide the dealer hit or stand on soft 17\n- Come back every 4 hours for Lucky Slots BONUS chips!\n- Easily earn chips by watch a few seconds of video\n- Toggle Basic Strategy on or off to get real-time advice as you play\n- Toggle “Insurance” and “Surrender” on or off anytime\n- Track lifetime player statistics, including wins, pushes, surrenders, hand info and more, always get improved and play skillfully, let’s hit the top!\n- And much more!\n\nAll the fun and exciting features are in BlackJack!\nDownload and get bonus chips now, you are the next big winner!\n\nBlackJack is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-10-21T21:01:59Z",
  "updated": "2020-03-24T09:55:00Z",
  "releaseNotes": "- Improve User Experience\n- Minor Bug Fixed",
  "version": "3.8.8",
  "price": 0,
  "developer": "Happy Palace",
  "score": 4.59835,
  "reviews": 366,
  "currentVersionScore": 4.59835,
  "currentVersionReviews": 366,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.neon.games.WBT",
  "title": "Blackjack 21-World Tournament",
  "description": "■The 1st app in the world to offer REAL Blackjack Tournaments!■\nPractice your strategies, and get ready before you head to a real casino!\n\n\n▶ Compete in Tournament Mode\n\n   * Real Blackjack Tournaments with Official Casino Rules!\n   * Multi-level Tournaments: Rio, Las Vegas, Sydney, Macau, Tokyo\n   * Compete with 3 other players in 8 hands\n   * 2 out of 8 hands are Elimination Hands \n   * One chance to exchange a card at the most crucial moment \n   * See how you stack up to other players around the world\n\n▶Get Lucky in  Spin & Go Mode\n\n   * The top chip-holder gets the prize!\n   * Open to all levels\n   * 4 rounds with no elimination hands\n   * Compete with 3 other players \n\n▶Hone your Skills in Free Bet Mode\n\n   * Play with friends and people around the world \n   * Multi-Bets & Pair Bets: Bet in up to 3 places simultaneously\n   * Double Pay Gauge: A full gauge doubles your pay \n      for the next hand\n   * Play with friends at your own private blackjack table\n   * Rank up and play more advanced tables: \n      Beginners/Amateurs/Advanced/Bigshots/Highrollers/Billionaires\n\n▶(New) Play against friend 1 vs 1 Mode\n\n  * Add friends in game and challenge them! \n  * Play VS mode to show the real blackjack winner!\n  * Four rounds with no elimination hands\n  * Challenge your friend one on one!\n\n▶ Earn Free  Bonuses & Complete Missions\n\n   * Connect with Facebook: Get $500,000 in chips\n   * Welcome Bonus: $500,000 in chips\n   * Time Bonus: $40,000 in chips every 3 Hours\n   * Daily Bonuses: Chips up to $3,500,000\n   * Weekly Bonus: Tournament Ticket or chips up to $1,500,000 \n   * Invite Reward: Tournament Ticket\n   * Daily / Weekly Missions: Free Chips upon completion\n   * Various Seasonal Events & Special Missions!\n\nFor suggestions and help, please contact us at: https://neon-games.zendesk.com/hc/en-us\nLike Us on Facebook for Updates and Free Prizes: https://www.facebook.com/WBTfan \n\n*Disclaimer: The games are intended for an adult audience. Our games are meant for amusement and entertainment purpose only. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.”",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-07-01T08:51:24Z",
  "updated": "2019-11-25T16:27:01Z",
  "releaseNotes": "Minor bug fixes.",
  "version": "1.1.115",
  "price": 0,
  "developer": "NEON Games CO.,LTD",
  "score": 4.60606,
  "reviews": 66,
  "currentVersionScore": 4.60606,
  "currentVersionReviews": 66,
  "searchTerms": "blackjack"
 },
 {
  "appId": "uk.fulltilt.www",
  "title": "Full Tilt Casino & Poker Games",
  "description": "AN AMAZING POKER AND CASINO EXPERIENCE\n\nThe great thing about the Full Tilt mobile app is that it allows you to enjoy your favourite poker and casino games anytime, anywhere. Download the Full Tilt app now and jump into the game of your choice!\n\nTHE BEST ONLINE POKER EXPERIENCE\n\n• Hit No Limit Texas Hold’em and Pot Limit Omaha tables\n• Sit&Go and Multi-table tournaments with huge prizes\n• Play Spin&Go, Zoom or any other special poker game\n• Sit at real-money or play-money poker tables\n• Take advantage of the best poker promotions\n\nALL THE BEST CASINO GAMES\n\n• Play the world’s most popular casino games, such as blackjack, roulette and slots\n• Play Live Casino games on your mobile device with a real dealer\n• All the best Slots available, with huge real money Jackpots\n• Try Multi-Player mode and catch-up with friends at the tables\n\nGREAT FEATURES\n\n Multi-table functionality\n• ‘Find your seat’ feature\n• Table chat\n• Lobby filters\n• Built-in Contact Support Form, with our Support team available 24/7!\n\nVisit our website for more information on what we have to offer. Join our poker community on social media and connect with poker players from around the world.\n\nhttps://www.facebook.com/Fulltiltpoker\nhttps://twitter.com/FullTiltPoker\n\nPlay anytime, anywhere – download the Full Tilt mobile app now.\n\nThis is a real money gambling app. You must be at least 18 years old, and of the legal age of majority in your jurisdiction, to create a Stars Account.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.\n\n************************\n\n£20 Free Play Promotion Terms and Conditions\n\n- Offer only available to players who have never made a real money deposit of £10 or more\n- The £20 Free Play will be credited daily from deposit date: Day 1 = 5 x $1 S&G (Spin & Go) tickets, Day 2 = 5 x $1 S&G tickets, Day 3 = 5 x $1 S&G tickets, Day 4 = $5 cash bonus, Day 5 =5 x $1 S&G tickets, Day 6 = $5 cash bonus\n- We reserve the right to withhold rewards if there is reason to suspect that a deposit is fraudulent, or that it has not been made with the intention of using it to play real money games\n- All Spin & Go tickets issued as part of the £20 Free Play promotion expire 21 days from issue\n- Any unused tickets issued as part of this promotion will be forfeited\n- Tickets cannot be redeemed for cash or any other value, or be transferred\n- A cashout at any time during the bonus period will leave you ineligible to claim this bonus",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-05-17T07:12:23Z",
  "updated": "2020-04-09T11:07:04Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "1.119.0",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.41836,
  "reviews": 1035,
  "currentVersionScore": 4.41836,
  "currentVersionReviews": 1035,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.bananaandco.card.games.casino.blackjack.21.free.chips",
  "title": "Blackjack ◇",
  "description": "Play the best free Blackjack game on the app store. Are you feeling lucky? Just jump right in and play Blackjack completely free! \n\nAlso called 21, Blackjack is one of the most popular casino games in the world. With a beautiful and intuitive design, you will love this modern take on the classic casino card game.\n\n- Popular Las Vegas rules just like at the casino.\n- Intuitive hint system.\n- Our fair table dealer never cheats - unlike other games, in ours you can actually win.\n- Beautiful table customization with HD graphics.\n- Helpful strategy card shows basic strategy for the various rules settings.\n- Double Down, Splits, Insurance and Surrender for an authentic Blackjack experience.\n- Deck shuffle animation lets you know when the deck is being reshuffled.\n- Tons of chip denominations from singles all the way to millions.\n- Large cards and table display for easy playing.\n- Easy, simple to learn controls makes this the sleekest card game available.\n- Stat tracking shows your performance over time.\n- Informative help screen for those who don't already know the rules of 21.\n- The object of the game is to reach 21 or to reach a score higher than the dealer without exceeding 21.\n- Practice your Blackjack skills to become a true Vegas vip!\n\nWe'll be adding some awesome new features soon, so stay tuned.\n\n* For entertainment purposes only.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-03-07T17:17:43Z",
  "updated": "2018-06-05T16:43:17Z",
  "releaseNotes": "- Bug fixes and optimizations.\n\nThank you for playing Blackjack!",
  "version": "1.1",
  "price": 0,
  "developer": "Banana & Co.",
  "score": 4.74286,
  "reviews": 35,
  "currentVersionScore": 4.74286,
  "currentVersionReviews": 35,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.hornetapps.blackjacktrainer.lite",
  "title": "BlackJack Trainer 21",
  "description": "Learn how to play BlackJack, when to Hit, Stand, Split, Double or Surrender. This application will teach you the game of BlackJack and how to play any hand, such that you maximize your chance of winning. \n\nBlackJack Trainer Features: \n* Hit, Stand, Split, Double or Surrender to the cards dealt \n* Get feedback on your decision \n* See the basic strategy table for the selected house rules \n* Learn to play like a professional \n\nThink of it as a school to become better at BlackJack.\n\nThis is NOT a blackjack game, but an application that teaches you the right play.\nThis application will NOT teach you how to count cards in a casino or uses any kind of fictional or real money.\n\nReviews/Comments:\n* * * * * Very impressive. This really helped with all those hands at the casino that i always left up to chance. This app actually teaches you how to make money.\n* * * * *  Highly Recommend. This is great training tool for anyone interested in learning blackjack. BlackJack Trainer Rocks!\n* * * * * Great for learning corner cases. Finally, I remember when to double or surrender. Love the strategy table in my pocket ;)\n\nYour membership starts as soon as you set up payment and subscribe with iTunes. Your monthly charge will occur on the last day of the current billing period. We'll renew your membership for you (unless auto-renew is turned off 24 hours before the end of your billing cycle). You can manage and cancel your subscription by going to your account settings on the App Store. By continuing, you are agreeing to these terms (https://hornetventures.com/tou.html). See the privacy statement (https://hornetventures.com/privacy.html).",
  "genres": [
   "Games",
   "Strategy",
   "Puzzle",
   "Education"
  ],
  "contentRating": "12+",
  "released": "2013-02-10T09:34:48Z",
  "updated": "2020-05-02T13:03:48Z",
  "releaseNotes": "Updated subscription texts to clearly explain the automatic renewal.",
  "version": "2.1.4",
  "price": 0,
  "developer": "Hornet Ventures GmbH",
  "score": 4.61193,
  "reviews": 67,
  "currentVersionScore": 4.61193,
  "currentVersionReviews": 67,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.appstreetsoft.Blackjack",
  "title": "Blackjack 42",
  "description": "Blackjack, or 21, the favorite card game found in casinos around the world, can now be experienced right on your iPhone, iPod and iPad. Impeccably designed and intuitive, this one is sure to make you go \"wow\". \n\nPlay with your friends in private tables or let us match you with anyone around the world automatically. Compete with your friends for interesting titles and achievements. \n\nPlay, compete, show off and make friends!\n\nThe complete game\n************************************\nPlay with all type of possible calls – hit, stand, double, split and surrender. Choose to play it American or European style with 2, 4, 6, 8 or 10 decks. We’ve got everything covered! \n\nFun for free \n************************************\nGet thousands of free chips daily. Refer your friends and get referral bonus every time your friend joins the game. There are other ways to get free chips as well. Play and feel like a high roller without dropping a penny!\n\nOnline Friends and Invite to Match\n************************************\nSee who is online and join in your friends' table automatically. You can also invite your friends or share invite links. If you prefer, you can always play on a public table or play offline in single player mode. There is always a table waiting for you!\n\nFive different lounges \n************************************\nChoose the lounge you want to play in and compete with like-minded people. Start with the Silver lounge and move up to the Diamond lounge.\n\nJoin the league \n************************************\nPlay and make your way to the leader boards and pick up hilarious achievements. \n\nCrowning glory \n******************************\nAs you play and gain expertise in the game, conquer various crowns and show them off to the world.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-12-21T04:04:29Z",
  "updated": "2018-01-31T18:50:36Z",
  "releaseNotes": "* New in 5.0.1\n\n- Fixed a bug which caused the interface to be over bright\n\n* New in 5.0\n\n- Invite friends using in app notifications and game links\n- View currently online friends to play with them\n- Complete revamp of user interface\n- Refer friends and get free chips when they join\n- New leaderboards\n- Multiple bug fixes",
  "version": "5.0.1",
  "price": 0,
  "developer": "App Street Software Private Limited",
  "score": 4.20253,
  "reviews": 79,
  "currentVersionScore": 4.20253,
  "currentVersionReviews": 79,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.okduk.blackjack",
  "title": "Blackjack!",
  "description": "Blackjack! also known as 21, the classic casino game. Now on your iPhone and iPad for FREE!\n\n• Blackjack! Pays 3 to 2\n• Dealer must stand on 17 and draw on 16\n• Insurance Pays 2 to 1\n• Includes double bet & spilt hands\n\nBlackjack! has many features\n\n• Large amount of start coins\n• Real vegas style game play and payout!\n• Loads of daily coins with daily feature\n• Simple and easy to play!\n• Complete with high scores and leader board\n• Rich high quality interface & fast game play!\n• Real sound effects\n• Device Sync gameplay with Facebook\n\nNeed we say more! Download Blackjack! for FREE",
  "genres": [
   "Games",
   "Casino",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2013-05-19T23:54:02Z",
  "updated": "2018-09-23T02:22:54Z",
  "releaseNotes": "+ Support for iPhone X, iPhone XS and iPhone XS Max\n+ Minor and Bug Fixes",
  "version": "2.2",
  "price": 0,
  "developer": "OKD Limited",
  "score": 3,
  "reviews": 4,
  "currentVersionScore": 3,
  "currentVersionReviews": 4,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.abzorba.BlackJack",
  "title": "Blackjack 21: Live Casino game",
  "description": "Play the world’s most popular Blackjack game on the App Store & feel the thrill of sitting right in front of a Vegas-inspired casino, now added with an\nexciting Side-Bet feature! \nInteract with real players playing live at stunning tables with amazing graphics. Take a seat and play in the world’s most glamorous casinos, from Monte Carlo to Las Vegas. Grab the golden trophy from each city as you earn your spot in the Weekly Tournament Series and, ultimately, rise up in the Hall of Fame and make your mark in the fabulous world of social casino gaming among players from all over the world! \n\nThink your Blackjack skills are up to speed? Find out now in the world’s most popular free Blackjack app!\n\nGame Features include:\n    • FREE CHIPS - Hourly & Daily Bonuses await when you log in every day!\n    • SIDE BETS – Win up to 25x with this exclusive feature that only we have!\n    • TOURNAMENTS – Three-round winner takes all. Get ahead & collect trophies to enter our Hall of Fame.\n    • LEADERBOARDS – Weekly leaderboard winners vie for a chance to collect massive prizes.\n    • CASINO JOURNEY – Play in any of our seven casinos, from Athens to Monte Carlo, with high-roller stakes and bigger winnings the further you go!\n    • VIP Prestige club - Within first purchase you can become a member and depending on the level (Bronze, Silver, Gold, Platinum, Ruby, Diamond or Black ) you will receive boosts in daily and hourly bonuses. \n    • CHAT – Live interactive chat-box with players from all over the world.\n    • CUSTOMIZABLE AVATARS – Which cool heroes will you be?\n    • SIGN IN – With Facebook or as a guest (no registration needed as a guest).\n    • PROFILE PAGE – One-touch access to your complete profile and status.\n\nLove playing AbZorba Blackjack? Come & sit at the tables of our other games:\n\n    • POKER LIVE - Multiplayer Texas Hold’em\n    • ROULETTE - French & American classic\n    • BACCARAT - Authentic Asian favorite\n\nLike us on Facebook:\nhttp://facebook.com/liveblackjack21\n\nFollow us on Twitter:\nhttps://twitter.com/liveblackjack21\n\nLive Blackjack 21 is a free online game of chance and skill for entertainment purposes only. It is not possible to win real money, real items/services/gifts or goods in kind by playing our skill games. The virtual currencies used in this game are called Chips and Diamonds, and they can be purchased in the\n‘Store’ with real money. Chips and Diamonds cannot be exchanged for cash or be paid out in any form and can only be used to play our game.\n\nTerms of Service: http://www.abzorbagames.com/terms-of-service",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-11-11T23:24:30Z",
  "updated": "2020-02-13T07:49:27Z",
  "releaseNotes": "AbZorba turns six years old! We're celebrating this momentous event with our\nmost monumental update so far—an all-new “Side Bet” feature & a whole new\nstunning and yet beautifully minimalistic UI design!\n\n* The release of \"Side Bet\" feature. Inspired by real pro tables back in\n  fabulous Las Vegas. We're the only Blackjack game that offers this really fun\n  and engaging in-game addition, just like at the real casino tables.\n* Casino Leagues: Compete against all of the other players and join your own\n  league. Get rewarded both for advancing and retaining your specific ranks. A\n  total of 10 different leagues are available for you to conquer! \n* Bundle Offers: We added new offers that include all of our currencies (Chips,\n  Diamonds, and casino tickets) in a single purchase. A great way to step up your\n  game and raise the stakes!",
  "version": "5.70",
  "price": 0,
  "developer": "AbZorba Games BetriebsgmbH",
  "score": 4.56098,
  "reviews": 41,
  "currentVersionScore": 4.56098,
  "currentVersionReviews": 41,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.bskyb.skycasino",
  "title": "Sky Casino Blackjack, Roulette",
  "description": "The Sky Casino App gives you the opportunity to enjoy an extensive range of Live Casino Table games, plus hundreds of Slots, blackjack and Roulette tables for you to experience either on the move or from the comfort of your own home.\n \nOur App is your gateway to thrills, possibilities and probabilities with every spin or stake. With a wide assortment of Live tables, just take a seat where our expert live dealers are posed to spin, or deal your way into your preferred table whenever you chose. Whether you enjoy Roulette, Blackjack, Baccarat, Casino Hold em or Hi Lo, we have the games for you!\n \nWe  are inviting you to come and play with Sky Casino where you enter a world of entertainment with vast array of promotions and campaigns you can access directly through the App providing a truly immersive online casino experience.\n \nOur easy to navigate and intuitive site, allows you manage your account with our Touch ID, make secure deposits and withdrawals, and choose a range of payment methods.\n \nDownload our App today to enjoy all of our Casino games, there’s something for everybody at Sky Casino. If you live for the unexpected then why not visit Sky Vegas to enjoy a world of exclusive and big name slots, or for a true sports betting fan immerse yourself in the world of Sky Bet, Britain’s most popular online bookmaker\n \n18+, BEGABLEAWARE.ORG\n \nPlease note all app images / previews shown here are for illustrative purposes only*. \n \nResponsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support in the United Kingdom please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/ and in Ireland please contact Gamble Aware at 1800 753 753 or visit http://www.gambleaware.ie/\n\nThe Sky Casino app is brought to you by Bonne Terre Limited, an Alderney registered company majority owned by CVC Capital Partners and licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Bet is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group. The Sky trademarks used in the app are owned by the Sky Plc group of companies and are used under license. To place a bet with Sky Bet you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Bet. Customers located outside of the UK or Ireland will be prohibited from using this app..\n\nPlease Note: Apple Inc. is in no way linked or associated with this or any other competition / contents run in this app.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2014-08-28T08:31:21Z",
  "updated": "2018-07-30T08:52:11Z",
  "releaseNotes": "The Sky Casino app is updated, upgraded and better than ever. We've been busy working on back end of the app so we can improve the overall experience. If you enjoy using our App please support us by leaving a review.",
  "version": "1.12.0",
  "price": 0,
  "developer": "Sky Betting & Gaming",
  "score": 4.56873,
  "reviews": 582,
  "currentVersionScore": 4.56873,
  "currentVersionReviews": 582,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.lobby.enlobby",
  "title": "Texas Casino",
  "description": "Texas Casin contains the hottest and most popular games at the moment, including Casino Bonus Game, Texas Poker, Slot Game, Sic Bo, Baccarat and Teep Patti.\n\nIn this Casino game lobby, you can play mainstream Texas Poker games. We have already opened Teep Patti, Baccarat, Texas Poker, various Slots and Sic Bo games, especially Black Jack and Five Card Stud, which are going to be exciting and fun.\n\nNo matter when and where you are, you can invite friends to play Texas Poker and various games. You will be very happy whenever and wherever you are. Hurry up and win the jackpot.\n\nFeatures:\nVery complete !! Teep Patti, Baccarat, Texas Poker, Slots and Sic Bo are now available. Many other games will be launched in the next plan.\n\nAll online! !! Play with offline players and see who the game is!\n\nSuper bonus! !! In addition to the list of prizes, there are many chips and free prizes waiting for you to pick up every day.\n\n Get a chance to transfer prizes every two hours!\n\n1.A large number of daily tasks are waiting for you to challenge, you can get a lot of rewards after completing!\n\n2. Participate in the game every day, upgrade quickly, and get a lot of chips immediately!\n\n3. Chat whatever you want! !! !! The chat function is online now, let's chat with friends while playing.\n\nplay with friends! !! After successfully becoming friends, you can track your friends in the game and play with them.\n\nSuper cute! !! Many interactive tools and cute expressions to choose from.\n\nvery cool! !! A variety of interesting and unique photo frames are online and more will be opened in the future!\n\nPlayers can log in to their Facebook account, store in-game progress, and more cross-platform logins, so that you can enjoy exciting exciting Las Vegas-style games on different phones or tablets!\nLog in to the game with Facebook and get more rewards!\n\nSuper easy! !! Most of the games in this category are very classic and popular games, no further learning is required. Download and play.\n\nLook and feel comfortable! Beautiful icon layout and beautiful cute dealer\n\nSo what are you waiting for? Hurry up and play with friends. Your leisure time will be more happy and comfortable. If you become a top player, you will have the opportunity to make friends with the game customer service.\n\nCome on and act!\n\nFind our keywords: Teep Patti, Baccarat, Texas Poker, Slot, Sic Bo, Slots, poker, blackjack, casino, games, Texas，Texas Poker, solitaire, pokemon, WSOP, game, card games, card, wwe\n\nIf you still have questions, please contact us through the FB fan page:\nhttps://www.facebook.com/Texas-Casino-112572000227959/?modal=admin_todo_tour",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "12+",
  "released": "2020-01-02T08:00:00Z",
  "updated": "2020-01-10T16:12:07Z",
  "releaseNotes": "1. Optimize the gaming experience,\n2. Fix game issues\n3. Open mall discount activities",
  "version": "1.0.2",
  "price": 0,
  "developer": "palmplay",
  "score": 5,
  "reviews": 2220,
  "currentVersionScore": 5,
  "currentVersionReviews": 2220,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.rl.iphone.dino",
  "title": "888 Casino: Real Money Games",
  "description": "Sign up & Get £88 Free Play - NO DEPOSIT BONUS \nTERMS & CONDITIONS\nNew players only • £88 is granted as FreePlay (FP) • FP must be claimed within 48 hrs of & expires within 14 days • FP wins are credited as bonus and capped at £15, exc. JP win • Bonus wins are capped at £500 • To withdraw bonus & related wins, wager bonus x30 within 90 days • Wagering req. vary by game • Deposit balance is available for withdrawal at any time • General withdrawal restrictions & full T&Cs apply - https://www.888casino.com/terms/88freeplay/\n\nPlay with 50 Real Spins - NO DEPOSIT BONUS \nTERMS & CONDITIONS\nNew players only • Real Spins (RS) must be claimed within 48 hours and expire in 14 days • RS valid for selected games only • Eligibility is limited only to players that are directed via specific marketing channels • RS wins credited as real money & are capped at £7, exc. JP wins • RS winnings granted once all RS have been used or once max winnings cap has been reached • Deposit balance is available for withdrawal at any time. General withdrawal restrictions & full T&Cs apply - https://www.888casino.com/terms/50-realspins/\n\nJoin 888 casino today & get £88 FREE PLAY, No Deposit Needed! Get the top online casino app and enjoy a huge selection of Live Casino games, hundreds of Slot machines and multiple Blackjack, Baccarat & Roulette tables. We have over 20 years of gaming excellence, so you’ve come to the right place!\n\nWhether you’re playing from the comfort of your own home or on-the-go, 888 casino is your ultimate ticket to Las Vegas-style casino entertainment. With millions of registered players from all around the world, you too could join the premier online casino app.\n\n888casino Top App Features:\n\nMobile Casino Games\n• Play Slot, Roulette and Blackjack games on-the-go, on your iPad and iPhone.\n• Wherever you are, you’re at the Live Casino! Feel the thrill of real Las Vegas anywhere, as a real dealer spins the Roulette wheel.\n\nReal Money Online Slots\n• There’s never a dull moment with over 900 of the most popular Slots.\n• With just a tap, you can choose from our selection of top-tier Slot games and unique slot games, exclusive to 888casino.\n• Go back in time to ancient Rome & Egypt in historical slots, search for the Leprechaun’s pot o’ gold or just keep it classic. Whatever theme you’re into, be sure to find your favorite game!\n• Enjoy a wide variety of features such as Bonus Games, Expanding Wilds, Free Spins and Huge progressive Jackpots galore.\n• Play our top slot games including: Millionaire Genie, Gonzo, Rise of the Pharaohs, Jack’s Pot, Spartacus, and Guns N’ Roses.\n\nLive Blackjack, Roulette & More\n• Experience a real life casino while you play at our Live Casino lounge and meet the most charming dealers under the sun.\n\nVegas-style Fun at Your Fingertips\n• Get lucky with the hottest Slot games under the sun!\n• These casino games have funky themes, dazzling audio-visuals and humungous progressive jackpots that are dropping all the time!\n\nBig Bonuses, Fantastic FreePlay & Fabulous Free Spins, there’s always a sizzling hot promotion waiting for you at 888casino.\n\nDownload 888 casino now and enjoy real money casino games at the tap of a button.\n18+\n\nhttps://www.888casino.com/security-and-privacy/responsible-gaming/\nBeGambleAware:\n\nhttps://www.begambleaware.org/\n888responsible\n\nhttp://www.888responsible.com/",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-12-21T19:23:40Z",
  "updated": "2020-02-20T08:09:40Z",
  "releaseNotes": "Bug fixes and performance improvements",
  "version": "2.6.86",
  "price": 0,
  "developer": "Virtual IP Assets Limited",
  "score": 4.44072,
  "reviews": 5820,
  "currentVersionScore": 4.44072,
  "currentVersionReviews": 5820,
  "searchTerms": "blackjack"
 },
 {
  "appId": "uk.co.twentyone.livecasino",
  "title": "21.co.uk Live Casino",
  "description": "Join 21.co.uk and get a £10 free no deposit bonus. All new players will also receive a first deposit welcome offer up to £200.\n\nThe 21.co.uk Live Casino app brings you a wide range of live casino games, so you can enjoy an authentic casino experience in one handy mobile app. Sit back, relax and play a plethora of the most popular online casino and table games on the planet including Blackjack, Roulette and Baccarat from anywhere you like. \n\nLive Casino Show \n\nIf you're looking for an interactive gaming experience, then tune into Channel 5 between 1am and 3am for the 21.co.uk Live Casino Show. Play Blaze Live Roulette and watch as the wheel spins, will luck be on your side? \n\nReal-time Gameplay \n\nWhy go anywhere else? The 21.co.uk Live Casino app delivers an immersive, player focused experience. You can browse tables and get the key statistics you need to join and play with our 'Live Card' feature.  Browse seats, players and results in real-time and join the table you want to instantly with 'Direct Launch', making lobby waiting time a thing of the past. \n\nLive Blackjack, Roulette & Baccarat \n\nPull up a virtual chair today at one of our tables, including our very own 21.co.uk branded table, and enjoy a game of live blackjack, roulette, baccarat or a selection of other Live Casino titles like Live Dream Catcher. You will get that Monte Carlo experience from the comfort of your mobile or tablet, so what's it going to be? Red or black, hit or stand? You decide. \n\n21.co.uk Live Casino App Key Features  \t\t\t\t\t\n\n- Totally Live Experience - Browse seats, players and results in real-time and join the table you want instantly with 'Direct Launch', with no lobby waiting time. \n\n- Cutting edge 'Account Hub' - Up to date, modern and user-friendly features including Touch ID, Face ID, Card Scanning & 'Quick Deposit' making it faster and easier to access and play than ever before.\n\n- Fast Sign Up – We've made our sign-up process fast and simple to get you playing as quickly as possible.\n\n- Lightning Fast Play Speeds – The 21.co.uk Live Casino app has been uniquely designed for speed in load and gameplay. \n\n- Easy Navigation – The 21.co.uk Live Casino app is easy to navigate and intuitive simultaneously.\n\n21.co.uk Branded Tables\n\nThe branded 21.co.uk tables include plush branded felt, lower stakes and a professional live dealer who'll greet you to give you a real immersive experience. It's a casino game for all levels of players, so if you prefer to feel like a VIP but play with lower stakes this is the place to be. \n\nPopular Live Casino Games \n\n- Live Roulette \n- Live Blackjack \n- Lightning Roulette \n- Live Immersive Roulette \n- Live Auto Roulette \n- Monopoly Live \n- Live Dreamcatcher \n\n\n£10 Free - No Deposit Bonus\n\nT&C’s Apply. New players only. Opt in via the “My Promotions” page within 3 days of registration. 99x wagering target. Max single stake with a bonus is £5. £50 max win and withdrawal for non-depositors. Only bonus stakes contribute towards wagering requirements. Wagering contributions vary. 14 day expiry. Not all games contribute towards wagering requirements. £10 free paid as bonus funds.\n\nFirst Deposit Offer Up To £200\n\nT&C’s Apply. New players only. Opt in via the “My Promotions” page within 14 days of registration. Deposit £20, £50, £100, £150 or £200 as a single first deposit and wager 40x for a matched cash reward. Only cash stakes will qualify. Wagering contributions vary.\n\n21.co.uk online casino is owned and operated by LeoVegas Gaming PLC, who are licensed and regulated by the UK Gambling Commission (https://secure.gamblingcommission.gov.uk/PublicRegister/Search/Detail/39198).\n\nSafer Gambling\n\nFor gambling addiction help and support, please contact BeGambleAware at 0808 8020 133 or visit https://www.BeGambleAware.org. 18+",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-12-11T23:19:26Z",
  "updated": "2020-05-01T20:03:30Z",
  "releaseNotes": "Thanks for using 21.co.uk Live Casino. In this version, we've fixed some bugs, improved performance and added a few improvements. We would love to hear any feedback you have so don't forget to rate the app.",
  "version": "3.0.31",
  "price": 0,
  "developer": "LeoVegas Gaming Ltd",
  "score": 4.5061,
  "reviews": 164,
  "currentVersionScore": 4.5061,
  "currentVersionReviews": 164,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.grosvenor.grosvenor",
  "title": "Grosvenor Casino Online Games",
  "description": "Bringing the thrill of the casino, to you. New players will be greeted with a 100% deposit match up to £20 when you sign up with Grosvenor Casinos* - you can do this quickly and easily through the app. Once you’re logged in, you’ll regularly be offered great promotions, competitive bonuses, boosted odds and more. \n\nAt home or on the go, the Grosvenor Casinos app puts you at the heart of every game, hand, race, bout and beyond. The ultimate experience in mobile gaming, our Grosvenor Casinos app combines the buzz of the casino floor with the excitement of online slots and puts it in the palm of your hand. \n\n\nSlots and Games\n\nThe full selection of slots and games in our app have been specifically chosen to bring you the best mobile experience possible. With slots varying from classics like Lucky Ladies Charm, Rainbow Riches and Cleopatra, to more modern games like Extra Chilli as well as exciting Daily Jackpots – we offer something for everyone. We’ve also got a great collection of Grosvenor Original titles on offer, like Egyptian Fortunes and Extra Fruity that you can play here first! \n\n\nLive Casino\n\nOur world-class dealers bring you a huge range of table games, including Roulette, Blackjack, Live Poker and Baccarat. As well as exclusive games, like Victoria Baccarat, that are streamed live from the heart of our very own London Victoria casino. All Live games are streamed straight to your device in stunning HD, ensuring you feel the thrills of every game in real-time, in the most realistic Live Casino experience around. Better still, all of our standard roulette tables offer half your stake back on Even Chance bets if the ball lands on 0!\n\n\nSports Betting\n\nBetting with Grosvenor Sport has never been easier, in this intuitive and easy to navigate app, you’ll get great odds at home, in casino or on the move! Bet on sports including Football, Tennis, Horse Racing, Cricket, Rugby, Boxing, UFC, NFL and lots more. Featuring Grosvenor Goals – our weekly free-to-play scorer prediction game, where you can win £1 Million. Find industry-leading live betting, a Cash Out feature, enhanced odds and accas and regular offers. \n\n\nPoker \n\nGrosvenor Poker offers Tournaments, Cash Games and Jackpot Sit and Go’s on all your favourite devices, with No Limit Holdem, Omaha, Fast Fold poker, Anonymous tables and more. Grosvenor Poker is the only place to qualify for the biggest poker events in the UK, such as Goliath and Grosvenor Casinos’ own GUKPT – the longest running poker series in the UK.\n\n\nGetting started\n\nIf you’re new to Grosvenor Casinos, you can sign up quickly and easily through the app. Or, if you already play online, simply log in with your account details and start playing immediately.\n\n\nSafety and security\n\nGrosvenor Casinos has been a trusted and respected operator of casinos in the UK for over 40 years and remains so today. As the largest land-based casino operator in the UK, we understand that the safety and security of your personal information is of vital importance. That’s why we’ve made every effort to protect your data and ensure that you can play with peace of mind and enjoy the games in our app.\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org/ and 0808 8020 133\n\n*Terms and Conditions apply",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-05-14T21:39:09Z",
  "updated": "2019-09-12T09:27:22Z",
  "releaseNotes": "In this version: \n- Bug fixes and service improvements",
  "version": "2.12",
  "price": 0,
  "developer": "Grosvenor Casinos Ltd",
  "score": 4.20465,
  "reviews": 6196,
  "currentVersionScore": 4.20465,
  "currentVersionReviews": 6196,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.tripledot.blackjack",
  "title": "Blackjack",
  "description": "The Best Blackjack game is out now! Bet big to win big, or play the long game and prove you can beat the dealer! With free chips, you can play this casino style game with no risks, and with random cards, our games are guaranteed fair and fun!\n\nNever played Blackjack before? This is your chance to learn the game in and out. With no real money at risk, you can play this classic casino game just for fun! You'll be winning in no time.\n\nBlackjack is easy to play! Place a bet, and you'll receive 2 cards. Picture cards are worth 10 points and Aces are worth either 1 or 10. \"Hit\" for another card, and get your score as close to 21 as you can without going bust.\n\nIf you like Poker, Roulette or Slots we know you will love this Casino Classic!\n\nBy playing Blackjack, you agree to our Terms of Use and Community Guidelines available at https://www.tripledotstudios.com/tos",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2019-08-30T07:00:00Z",
  "updated": "2020-04-23T07:42:39Z",
  "releaseNotes": "This update to Blackjack brings a number of improvements:\n\n* You can bet even higher with some of our new high-value chips!\n* More levels are coming soon!\n* A new auto-deal feature to increase game speed.\n* We've also made various behind-the-scenes fixes and improvements.\n\nWe hope you'll enjoy this update! Good luck!",
  "version": "1.5.5",
  "price": 0,
  "developer": "Tripledot Studios",
  "score": 4.51206,
  "reviews": 373,
  "currentVersionScore": 4.51206,
  "currentVersionReviews": 373,
  "searchTerms": "blackjack"
 },
 {
  "appId": "card.games.free.blackjack.twenty.one.black.jack",
  "title": "Black Jack∘",
  "description": "#1 REALISTIC BlackJack game on the App Store!\n\nFREE CHIPS every DAY and every HOUR!\n\nPlay FREE Now! Blackjack by Solitaire Games Free is the best way to experience the rush of a REAL BLACKJACK CASINO on your iPhone!\n\nFeatures of BlackJack:\n- Play unlimited Hands \n- FREE chips every hour\n- Even more FREE chips every day\n- REALISTIC Gameplay\n- WIN BIG!",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-08-03T00:09:05Z",
  "updated": "2019-04-13T14:21:11Z",
  "releaseNotes": "- Fixed bug in shop\n- Hourly free chips now properly displayed",
  "version": "1.4",
  "price": 0,
  "developer": "Solitaire Games Free",
  "score": 4.50289,
  "reviews": 173,
  "currentVersionScore": 4.50289,
  "currentVersionReviews": 173,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.card.games.blackjack",
  "title": "Blackjack Classic - Card Game",
  "description": "Blackjack Casino Card Game - The BEST Vegas casino blackjack free game on App Store! Play Blackjack as if you were at the real vegas casinos!\n\nIn Blackjack 21 by HHSDaily, You can set the rule about whether the dealer must hit or stand on soft 17, and the number of decks, from 4 to 8. Split, Double Down, Insurance and  Surrender for an authentic Blackjack experience!\n\nIn our Blackjack game, there are the most popular 6 real casinos, from Las Vegas Downtown to The Mirgae. Play Blackjack against the dealer and see who can WIN by getting 21 without going bust! \n\nBlackjack 21 Features:\n- Easy to play, full of fun.\n- Large cards, great graphics.\n- Awesome sound effects, gorgeous animations.\n- Tap chips, cards and table to play blackjack as if you were at the casino.\n- Flexible Rules: Dealer hit or stand on soft 17.\n- Split hands or double down to win big!\n- Buy insurance to dodge a dealer blackjack.\n- Surrender to get out of a tough situation.\n- Multiple real casino tables to choose from.\n- Detailed statistics to track your performance.\n\nDownload Blackjack - Casino Card Game for FREE and start playing today!",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-12-04T01:25:34Z",
  "updated": "2019-11-22T19:27:45Z",
  "releaseNotes": "Blackjack fans, thank you for your continuous supports!\n- Small bug fixes and updates\n- Performance improvements\nIf you love Blackjack, please leave us a good review, thanks!",
  "version": "1.2.8",
  "price": 0,
  "developer": "HHS Daily",
  "score": 4,
  "reviews": 6,
  "currentVersionScore": 4,
  "currentVersionReviews": 6,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.yourcompany.PRO2Sponsored",
  "title": "21 Pro: Blackjack Multi-Hand",
  "description": "Shuffle up and deal! It’s time to take it to the house with 21 Pro: Blackjack! Play and enjoy the authentic experience today! Win the progressive jackpot with a Triple 777's hand.  Get our app and start a Blackjack 21 hot streak now!\n\n- Win the PROGRESSIVE Jackpot!\n- Play multiple hands at once with our multi-hand option!\n- Set the table limits for high stakes action & reload anytime you need chips!\n- Become a pro with FREE lessons and tips! \n- Ask the dealer for advice and improve!\n- Customize your cards and table for the! perfect Vegas casino setting!\n- In-depth stats to help you track your progress!\n- Players Club: Earn rewards and bonuses with every hand you play!\n\nThe Fun Vegas Casino Experience on the go!  Don't forget to check our Slots, Slot Machine and other casino apps, including blackjack, roulette, craps and poker.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-02-12T08:00:00Z",
  "updated": "2019-02-12T08:00:00Z",
  "releaseNotes": "- Bug Fixes\n\nIf you have a problem or have feedback you want us to respond to, please contact us via email at Customer.Care@AvalinxStudios.com. \n\nAnd please don't forget to submit a Customer Review or a Customer Rating to share your feedback with the Community. This helps us to continue to enhance our applications. You can also keep an eye on what we are working on by checking out our Facebook page and liking us at http://www.Facebook.com/AvalinxStudios.",
  "version": "3.1",
  "price": 0,
  "developer": "Avalinx LLC",
  "score": 4.125,
  "reviews": 8,
  "currentVersionScore": 4.125,
  "currentVersionReviews": 8,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.grosvenor.livecasino",
  "title": "Grosvenor Live Casino Online",
  "description": "The UK’s premier Live Casino mobile experience with a £20 Welcome Bonus for all New Customers*\n\nOr if you’re a member of any of the Grosvenor Casinos across the UK, join today and get up to £200 in welcome bonuses*\n\nEnjoy the thrill of playing Live Casino games with the UK’s biggest casino brand, Grosvenor Casinos, on your phone or tablet.\n \nTake a seat at our Live Roulette, Blackjack, Baccarat, 3 Card Poker or Hold’em tables and enjoy top quality gaming provided by friendly, professional, and experienced dealers in an app that puts the power of the casino in the palm of your hand.\n \nWith HD quality video streaming\n \nImmerse yourself in the full casino experience and never miss a moment of the action thanks to crystal clear video, streamed straight to your device in stunning HD. \n \nAvailable where you want, when you want\n \nThe action never stops in our mobile Live Casino with games available to play 24/7 with a dedicated helpline to provide you with comprehensive support if you need it. Download the app today and you’ll be able to access our full range of features and games wherever you go.\n \nGames currently available\n- Live Roulette \n- Live Lightening Roulette \n- Live Blackjack \n- Live Hold’em \n- Live Baccarat \n- Live 3 Card Poker \n- Live Ultimate Texas Holdem \n- Live Caribbean Stud Poker \n- Live Dream Catcher \n \nGetting started\n \nIf you’re new to Grosvenor Casinos, you can sign up quickly and easily through the app. Or, if you already play online, simply log in with your account details and start playing immediately, with fast Face ID login. \n\n\nSafety and security\n \nGrosvenor Casinos has been a trusted and respected operator of casinos in the UK for over 40 years and remains so today. As the largest land-based casino operator in the UK, we understand that the safety and security of your personal information is of vital importance. That’s why we’ve made every effort to protect your data and ensure that you can play with peace of mind and enjoy the games in our app.\n\t\n*Terms and Conditions apply, see grosvenorcasinos.com for further details.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-05-30T08:09:00Z",
  "updated": "2019-10-22T11:16:10Z",
  "releaseNotes": "In this version: \n• Bug fixes and performance improvements",
  "version": "3.12.1",
  "price": 0,
  "developer": "Grosvenor Casinos Ltd",
  "score": 4.3348,
  "reviews": 911,
  "currentVersionScore": 4.3348,
  "currentVersionReviews": 911,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.wildcardstudios.blackjack",
  "title": "Blackjack Legends: 21 Online",
  "description": "Join the world’s most popular Blackjack Game and play live with real players!\n\nForget all you know about Blackjack and other multiplayer games. Blackjack Legends is the most competitive and addicting game out there! The adrenaline rush of beating live players from around the world while mastering your kills is simply unbeatable. Think you’re the King of Vegas? Join our community of online Blackjack players and get started today!\n\nSpecial Features:\n– Play for Free – Free chips every 4 hours and all features are totally free.\n– Unique Multiplayer Mode – Compete with countless elite Blackjack players around the world\n– Unlock All 12 Locations –  Level up to unlock high stakes tables \n– Earn Your Ring –  Collect all 12 unique rings!\n– Continuous Play – Start playing Blackjack on your phone, then continue playing on your tablet.\n– Facebook Connect Bonus – Pad your bankroll with $10,000 additional chips when you connect your account to Facebook!\n\nHow to Play:\nBlackjack Legends is a live online multiplayer Blackjack game, where 3 competitors have 6 rounds to win the most chips. It’s that simple! Adapt your strategy to not just beat the dealer, but outplay the players next to you as well.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-01-25T06:04:52Z",
  "updated": "2018-05-22T18:57:04Z",
  "releaseNotes": "We've made some big fixes behind the scenes based on your feedback. Good luck on the tables, high rollers!",
  "version": "1.4.6",
  "price": 0,
  "developer": "WildCard Games",
  "score": 4.64706,
  "reviews": 68,
  "currentVersionScore": 4.64706,
  "currentVersionReviews": 68,
  "searchTerms": "blackjack"
 },
 {
  "appId": "sk.inlogic.blackjack21casinovegas",
  "title": "BLACKJACK 21 - Casino Vegas",
  "description": "Get the Blackjack 21 - Casino Vegas and test your skills on smartphone without ever spending a single penny with nice sound effects and graphics. Try different strategies in our free Blackjack simulator and get ready for Las Vegas!\n\nBlackjack 21 - Casino Vegas is the best option for players looking for premium card game in 2019. Amazing sound effects and graphics are making this game extraordinary. Try different strategies and test them before your real adventure in casino playing Blackjack.\nBecome a professional 21 player without risking your money.\n\n- Real blackjack 21 simulator to test your strategies and skills for Las Vegas\n- A wide range of casino chips at your disposal to simulate the real casino feeling\n- Scratch Lucky and Royal Tickets to win up to 2 mil. chips \n- Spin Lucky and Royal wheel for extra prizes\n- Break Piggy Bank to get back your lost chips\n\n\nPush your luck and become a millionaire! Come every day and spin the lucky wheel scratch tickets for a free prize! There is no better trainer before going to Vegas than our blackjack+ you can always  try our roulette game Roulette Pro VIP to get the most authentic casino experience. Play real blackjack and master the cards!\n\nPlay the best blackjack game!",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-04-23T00:19:59Z",
  "updated": "2020-03-02T20:59:43Z",
  "releaseNotes": "- bug fixes",
  "version": "1.0.5",
  "price": 0,
  "developer": "Inlogic Software s.r.o.",
  "score": 4.46154,
  "reviews": 13,
  "currentVersionScore": 4.46154,
  "currentVersionReviews": 13,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.smashatom.Blackjack",
  "title": "Blackjack 21 + Free Casino-style Blackjack game",
  "description": "Get a casino quality Blackjack experience right on your iPhone, iPad, or iPod Touch! Download Blackjack 21+ and double down for intense gambling action with up to three hands at once. Play and feel like a real high roller without ever dropping a penny starting right now!\n\nGet ready for the gambling thrills of Las Vegas on-the-go, right at your fingertips, and all for FREE!\n\nBlackjack 21 + is the gold standard among Blackjack games available on iOS. A flawless virtual Blackjack experience on either your iPhone, iPad, or iPod Touch, this game lets players play up to three Blackjack hands simultaneously on one table! Everything from the game’s beautiful, intricately detailed graphics, to authentic casino sounds, and genuinely exciting gameplay feels like the real thing! Best of all with Blackjack 21 + the fun is always free! If you lose all your chips just hit reset and start playing again!\n\nEverything from the rules, to the betting structure and excitement is true-to-life in Blackjack 21 +. Players start with a base stack of cash and play up the limits until they either go bust or sit down to gamble for millions on every hand in this classic casino card game! All normal Blackjack actions such as doubling down, splitting pairs, taking insurance, and more are all included too. To boot, the game allows players to save their gameplay statistics to easily reference how they do against the house in the long run and to help them hone their strategy as they play!\n\nTo ensure that the game stays accessible to any level of player, Blackjack 21 + includes a handy Hint feature to offer users gameplay tips or help them make the right decision in tough spots. Flexible in-game features also allow gamers to change between different table stakes limits and switch their tables’ felt colors with the click of a button too. More competitive players can unlock achievements, share scores via Facebook and Twitter, and compete online via interactive Game Center leaderboards for ultimate bragging rights too!\n\nPress your bets for a good time and go all in with Blackjack 21 + on iOS today!\n\nFeatures:\n● Authentic casino Blackjack gambling experience! \n● Unlock higher table limits\n● The more $$$ you win the higher you can bet! \n● Play by genuine casino Blackjack rules\n● Keep track of 19 different gameplay statistics\n● Handy Hint feature to help novice players\n● Score sharing via Facebook and Twitter\n● Daily and Hourly Bonuses\n● Unlockable Game Center Achievements\n● Competitive Game Center Leaderboards\n● Engaging scoring features\n● Universal iOS compatibility\n\nBlackjack 21 + is developed by Smash Atom Games.\n\nRemember, Blackjack 21 + is for entertainment purposes ONLY. It does not offer real money gambling!\n\nBecome our fan on Facebook: http://www.facebook.com/Blackjack21Plus",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-03-19T04:55:00Z",
  "updated": "2015-04-03T16:33:55Z",
  "releaseNotes": "- Bug fixes",
  "version": "1.2.12",
  "price": 0,
  "developer": "Smash Atom Software LLC",
  "score": 4.20587,
  "reviews": 136,
  "currentVersionScore": 4.20587,
  "currentVersionReviews": 136,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.royalslots.app",
  "title": "Royal Slots Casino",
  "description": "Welcome to Royal Slots, the online casino with a huge selection of fantastic games.\n\nRoyal Slots is fully licensed and regulated by the UK Gambling commission.\n\nRoyal Slots offers a massive selection of online casino slots and all your favourite live casino games – Blackjack, Roulette, Dream Catcher & More! We’re constantly adding the latest games & offer all your favourites including Fishin Frenzy, Eye of Horus and Rainbow Riches.\n\nPlayers can opt in to our exciting welcome bonus, where we will double your first deposit up to £200 followed by 3 further deposit bonuses*\n\n-Deposit bonus 1 100% up to £200*\n-Deposit bonus 2 50% up to £200*\n-Deposit bonus 3 25% up to £300*\n-Deposit bonus 4 25% up to £300*\n\n*New customers only. Opt-in required. 1st deposit bonus 100% up to £200. 2nd deposit bonus 50% up to £200, 3rd deposit bonus 25% up to £300, 4th deposit bonus 25% up to £300. Min deposit £10. 40x wagering, 30 days to complete wagering, game weighting and game restrictions apply. Max Bet with bonus funds £5. Max withdrawal from bonus funds is £2000. Eligibility restrictions apply, cash balance can be withdrawn at any time. See app for full terms and conditions.\n\nTo download and use this online casino app, you must be a UK resident and over 18.\n\nRoyal Slots is not a free to play app, you are playing with real money. You should only gamble what you can afford to lose and please gamble responsibly. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-10-25T07:00:00Z",
  "updated": "2020-04-22T15:39:05Z",
  "releaseNotes": "Updates for the latest iOS",
  "version": "1.0.33",
  "price": 0,
  "developer": "One Click Limited",
  "score": 4.58882,
  "reviews": 304,
  "currentVersionScore": 4.58882,
  "currentVersionReviews": 304,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.magmamobile.game.BlackJack",
  "title": "Blackjack",
  "description": "Will you join us at our table?\n\nMagma Mobile introduces Black Jack, and it’s totally free !\n \nIn this famous casino game, your goal is to beat the croupier by having a bigger score, without exceeding 21. Use discernment in choosing insurance, split, or double to try to have a \"Black Jack\". Will you be able to win the jackpot without going bankrupt ?\n \nBlack Jack features :\n \n- Customize the casino table with special cards and layouts\n- Get bonus gains by accumulating chips\n- Play the roulette to get free chips\n- Test your luck with the daily challenge\n- Get detailed statistics to track your performance\n- Enjoy unlimited free tokens!\n \nThe croupier is waiting for you ... Download Black Jack for free!",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-01-10T23:27:32Z",
  "updated": "2019-08-10T08:20:25Z",
  "releaseNotes": "Fixing bugs",
  "version": "1.0.1",
  "price": 0,
  "developer": "Magma Mobile",
  "score": 4.2,
  "reviews": 10,
  "currentVersionScore": 4.2,
  "currentVersionReviews": 10,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.hitgrab.blackjack",
  "title": "Blackjack",
  "description": "**Play BlackJack 21 - Casino Style Card Game**\n\nPlay Vegas, London, Paris & Macau casinos for free, as you use your card game skills to beat the dealer. Place your bets, double down, & feel the surge as you get that perfect BlackJack 21!\n\nBe The Card Shark\nIn BlackJack 21 you get to play in Casinos around the globe, using your awesome skills to beat the dealer and increase your cash! Enjoy the thrill of getting 21 and use your betting abilities to maximise your income. \n\nLove The Controls\nBlackJack 21 is easy to use, with its intuitive finger-touch graphics, and simple to learn gameplay. Download and get playing immediately. \n\nEnjoy The Graphics\nExperience the fun casinos of Vegas, London, Paris and Macau, each with their own look, feel and great graphics.\n\nFeatures\nIntuitive gameplay\nDaily Progressive Jackpot\nDaily Rewards\nEasy to use and loads of fun\nCasino style card game dynamics\nTap chips, cards and table to play blackjack\nHD Graphics",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-12-11T15:09:46Z",
  "updated": "2020-04-16T22:35:25Z",
  "releaseNotes": "More opportunities to watch Ads to get chips.",
  "version": "1.9",
  "price": 0,
  "developer": "HitGrab Inc.",
  "score": 4.42856,
  "reviews": 35,
  "currentVersionScore": 4.42856,
  "currentVersionReviews": 35,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.criticalhitsoftware.blackjack",
  "title": "Blackjack Blast",
  "description": "Play blackjack in full HD on any device.  Splits.  Double-down.  Insurance against dealer blackjack.  Hints.  A how-to rulebook.  Extensive customization options.  Now see what makes it really shine!\n\nRealistic Chip Stacks\nTap or drag to bet.  Drag between stacks to make change.  See all of your chips all the time, so you always know how you're doing.\n\nSettings for Popular Rule Variations\nChoose a single deck game or a shoe of up to 8 decks.  Choose whether the dealer hits or stands on soft 17, whether Insurance is offered, and whether Surrender is allowed.\n\nCustomizable Gameplay\nThere are 3 card back designs to choose from, each with Classic and Giant faces.  You can adjust the play speed to set your own pace.  There are convenience options to automatically stand when you reach 21 and to repeat your last bet after a loss.\n\nGet More From The Game\nImprove your play with Basic Strategy hints.  Learn the safest choice in any situation.  Turn on Hi/Lo card counting for more sophisticated betting strategies\n\nFree Chips 6 Times Daily\nIf you run low on chips, you never have to wait long.  Free chips are awarded at least 6 times a day.\n\nWe think you'll enjoy Blackjack Party.   Download it today!  And, please let us know what you think at zelnutapps.com.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-07-23T02:33:10Z",
  "updated": "2017-08-09T05:18:08Z",
  "releaseNotes": "Bug fixes and performance improvements",
  "version": "2.0.1",
  "price": 0,
  "developer": "Zelnut",
  "score": 5,
  "reviews": 2,
  "currentVersionScore": 5,
  "currentVersionReviews": 2,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.abzorbagames.tango.blackjack",
  "title": "Blackjack 21 Live for Tango",
  "description": "Play the #1 and best really Live Multiplayer BlackJack game on the App Strore\nand join the fastest-growing community of ‘BlackJack Live Casino’.\n\nThis is the most fun, smart and authentic classic Las Vegas card game there is\nwith loads of special features such as live chat, challenge friends, swap\ncocktails and dress up in amazing outfits - be as cool as you feel and meet\nmillions of gamers. There are hundreds of tables, VIP privilege suites,\ntournaments and challenges all with Guest and Facebook sign in options.  And\nwhen you want to kick back from the tables there are fantastic mini games such\nas Scratch ’n Match and Luck wheel to try your hand at winning a millions of\nchips!\n\nEvery game is fresh, new and exciting because its the mix of folks there that\nmake this so social. So come and join the fun you never know who you’ll meet\n\n\nBlackjack 21 Live for Tango is a free, online, game of chance and skill for\nentertainment purposes only. It is not possible to win real money, real\nitems/services/gifts or goods in kind by playing our skill games. The virtual\ncurrencies used in this game are called Chips and Diamonds and can be purchased\nin the ‘Store’ by using real money. Chips and Diamonds cannot be exchanged for\ncash or be paid out in any form and can only be used to play our game.\nBlackjack 21 Live for Tango is intended for mature audiences and local legal\nage limits apply according to the App Store.\n\nPlaying BlackJack does not imply future success at real money gambling.\n\nTerms of Service: https://www.abzorbagames.com/terms-of-service",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-08-04T02:17:12Z",
  "updated": "2018-05-20T00:04:03Z",
  "releaseNotes": "PLAY BlackJack 21 Live Casino it's the world’s most downloaded free multiplayer\nblackjack on the App Store with real people playing live on stunning tables\nwith awesome graphics. It's the closest game to the real thing, millions of\ngamers for over six years can’t be wrong.\n\nSit and play in the world’s most glamorous casinos from Monte Carlo to Vegas on\nan incredible and rewarding blackjack journey then join the electric excitement\nand be the best ‘Black Master Tournament’ champion in our latest fast and\nfurious tournament. \n\nWin mega and be top of the leader board ranks.\n\nEvery player gets free daily bonuses, sales offers and discounts with the\nopportunity to join our exclusive ‘VIP Privilege Club’. With seven unique\nlevels from Bronze to Black opening up boosts huge Chip and Diamond deals the\nhigher up you go he more you are privileged!\n\n+ What’s New:\nOur latest update is available now and it’s big! See what’s new:\n\n• FRESH FACELIFT – Reimagined tables and stunning UI graphics, now with 3 seats for more room to play, it’s still your favourite game just better\n• NEW TOURNAMENTS – 3 rounds winner-takes-all. A totally unique and fantastic new blackjack tournament in hot casino cities\n• CASINO JOURNEY – Play in any of the 7 casinos of your choice from Athens to Monte Carlo with high roller stakes and winning the further you go\n• CLASSIC BLACJACK REMAINS INSIDE –the original it’s still there in the city of BAHAMAS but try all the city casinos in the all-new look, you’ll love them\n\n+ What to expect in the game \n• EXCITEMENT AND ENJOYMENT\n• FREE CHIPS EVERY DAY\n• HOURLY & DAILY BONUSES\n• VIP PRESTIEGE CLUB - 7 all new LOYALTY levels, Bronze to Diamond\n• BOOSTERS rewarding your purchases\n• TOURNAMENTS  - 3 rounds winner takes all. This is a totally unique and fantastic new blackjack tournament in hot casino cities. Winners go on to play the next gamer in next round, win that and play in the final to clinch Winner Takes All.\n• CASINO JOURNEY – Play in the casino of your choice from Athens to Monte Carlo\n• AUTHENTICITY – Real casino feeling, same rules same fun\n• CHAT – Live chat with gamers all over the world\n• AVATARS –Cool heroes, who will you be today?\n• SIGN IN – With Facebook or as a guest with no registration\n• SINGLE ACCOUNT – Your same account for smartphones and tablets\n• PROFILE PAGE – One touch access to your complete profile and status\n• LEADERBOARDS – Weekly leaderboard winners collect kudos and prizes\n\n+ NOW PLAY OUR OTHER GAMES TOO: \n• POKERLIVE - Multiplayer Texas Holdem\n• ROULETTE –French & American classic\n• BACCARAT – Authentic Asian favourite\n\nPlease like us on Facebook!\nhttp://facebook.com/liveblackjack21\nFollow us on Twitter!\nhttps://twitter.com/liveblackjack21\n\nBlackjack 21 Live Casino is a free, online, game of chance and skill for\nentertainment purposes only. It is not possible to win real money, real\nitems/services/gifts or goods in kind by playing our skill games. The virtual\ncurrencies used in this game are called Chips and Diamonds and can be purchased\nin the ‘Store’ by using real money. Chips and Diamonds cannot be exchanged for\ncash or be paid out in any form and can only be used to play our game.\nBlackjack 21 Live Casino is intended solely for an adult audience which is\neighteen years or over.\n\nPlaying BlackJack 21 does not imply future success at real money gambling.",
  "version": "5.39",
  "price": 0,
  "developer": "AbZorba Games BetriebsgmbH",
  "score": 3.83333,
  "reviews": 6,
  "currentVersionScore": 3.83333,
  "currentVersionReviews": 6,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.rnftechnologies.roulette",
  "title": "Roulette - Casino Style",
  "description": "---#1 Roulette app on iPhone/iPad/iPod.---\nNow experience the excitement and thrill of playing roulette in the real Las Vegas casino surroundings on your iPhone/iPad.\n\nTake your gaming experience to the next level with new Roulette – Casino Style. Enjoy the fun of playing the real roulette in the amazing Las Vegas theme without ever dropping a single penny with never before sound effects and graphics.\n\n***Game Features ***\n\n- American & European tables\n- 20 different types of bets.\n- Free daily bonus chips. \n- Hourly bonus chips.\n- Five different tables\n- Achievements to unlock.\n- Nice casino style sound and music to give the casino ambience.\n- Leader-board.\n- free roulette\n\nGet ready for the intense gambling thrills of Las Vegas, this is the right roulette app for you to learn the basics and get your roulette strategy right!\n\nGo! Go! Go! Bring out the real gambler in you!\n\n***For Support and Feedback***\ncontact@phonato.com\nhttp://www.facebook.com/Phonato",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-04-18T01:52:40Z",
  "updated": "2019-09-27T14:29:47Z",
  "releaseNotes": "- Minor Graphics Enhancement.\n- More FREE Coins.\n- Deals have been introduced.\n\nShare feedback and let us know how we can make the game better.",
  "version": "2.5",
  "price": 0,
  "developer": "Rnf Technologies",
  "score": 4.7981,
  "reviews": 1793,
  "currentVersionScore": 4.7981,
  "currentVersionReviews": 1793,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.tljtek.www",
  "title": "Casino & Sportsbook",
  "description": "Are you tired of Casino apps that make you buy your chips via in-app purchase?  Quit spending your hard-earned money on fake chips.  31-in-1 Casino and Sportsbook gives you unlimited Casino chips without needing to buy more if you lose them all!\n\ngApp Technology is proud to bring you the latest update for their flagship Casino app for the iPhone.  31-in-1 Casino and Sportsbook now has a brand new interface and a great new slot game.  \n\nUse Your iPhone or iPod Touch to experience all the fun & excitement of 31 classic Las Vegas casino games without ever losing a cent!   31-in-1 Casino offers authentic casino sounds, life-like animations, and a full cashier where you can control your chip count. \n\nTry your luck, hone your skills and become an expert at the following action-packed casino games:\n\n\nBlackjack \nFaceup Blackjack \nCount Blackjack \nPlus Blackjack\nPerfect Pair Blackjack\nRoulette \nCraps \nFishing Slots\nBaseball Slots\nWild Slots\nOr Nothing Slots\nLucky Spin Slots\nSports Slots (5 Reel)\nGold Rush Slots (5 Reel)\nBaccarat \nJacks or Better Video Poker \nDeuces Wild Video Poker \nJokers Wild Video Poker \nTens or Better Video Poker\nAcey Deucey Video Poker\nGoing For Fours Video Poker\nCaribbean Poker \nTexas Poker\nSportsbook\nKeno\nRed Dog Poker\nSlot Farmer Slots\nGrocery Shopper Slots\nCasino Gold Slots\nKitchen Heat Slots\nRockin' & Rollin' Slots\n\nImmerse yourself in the atmosphere of a miniature Las Vegas casino without ever leaving your home or office with 29-in-1 Casino!",
  "genres": [
   "Games",
   "Sports",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2008-09-27T19:37:32Z",
  "updated": "2018-08-17T01:34:51Z",
  "releaseNotes": "Fixed crash in sportsbook teasers screen.",
  "version": "6.0.0",
  "price": 0,
  "developer": "gApp Technology, Inc.",
  "score": 3.33333,
  "reviews": 3,
  "currentVersionScore": 3.33333,
  "currentVersionReviews": 3,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.playojo.skillonnet",
  "title": "Play Casino Games at PlayOJO",
  "description": "The PlayOJO casino app brings over 3,000 of the best REAL MONEY CASINO GAMES to your fingertips so you can win JACKPOT PRIZES wherever you are. Play VEGAS style, LIVE CASINO table games like BLACKJACK, ROULETTE and BACCARAT, or leading casino slots like STARBURST, RAGING RHINO, MEGA FORTUNE and MEGA MOOLAH where players can win jackpots worth millions in seconds! \n\nPlay at OJO today and get 50 FREE SPINS on your first deposit on our casino slot machines. At PlayOJO, there are no wagering requirements to withdraw and with OJO Plus, players earn MONEY BACK on every bet - win or lose. What’s more, OJO has no withdrawal limits!\n\nSo, what are you waiting for? Download the UK's favourite mobile casino today!\n\nWhy PlayOJO? \n\nMONEY BACK on every bet - win or lose with no restrictions\nHUGE JACKPOTS ready to be won!\nAll rewards paid in CASH - with ZERO WAGERING REQUIREMENTS ever!\nKickers – rewards offered every day to give you more playtime!\nReel Spinoffs – daily slot tournaments with big FREE SPIN packages to win.\nThe OJO Wheel – win FREE SPINS and get paid in cash!\nNo withdrawal limits!\n\nWith OJO’s innovative search function, players can search for their favourite game by category, what’s new, most popular, jackpot size, rating or by minimum/maximum bet size. \n\nAt PlayOJO, we want all our customers to enjoy:\n\n• The MOST POPULAR SLOT GAMES – like Rainbow Riches, Starburst, Slots of Gold and Fortunes of the Amazons \n• Huge PROGRESSIVE JACKPOT SLOTS like Mega Moolah and Mega Fortune. \n• All of the LATEST SLOTS like Vikings Go Berzerk, Valley of the Gods, The Reel Deal, Jewell Quest Riches and Orient Express\n• A top LIVE DEALER CASINO from Evolution Gaming that offers Roulette, Blackjack and Baccarat.\n• Fast withdrawals from 12 leading payment providers - each offering 24/7 support. \n• A high performance gaming platform that offers both real money and play money modes.\n• The safety and protection of PlayOJO's Gaming Commission of Great Britain license\n\n2017 Awards \n'Rising Star of the Year' - eGaming Review Operator Awards \n'Casino of the Year' - Malta iGaming Awards \n\nEvery time you play, you’ll move through the OJO Levels, picking up regular rewards like a spin on the OJO Wheel game where you can pick a prize wheel based on risk and reward. Win from a free spin and GET PAID IN CASH! \n\nEnjoy plenty of casino action with OJO’s Reel Spinoff tournaments in the form of FREEROLL and BUY-IN  SLOT TOURNAMENTS throughout the day. Simply enter, spin the selected slot and all wins will convert to points on a leader-board. You can win yourself a generous FREE SPINS package with no absolutely ZERO WAGERING RESTRICTIONS on wins.\n\nBut, it’s our PROGRESSIVE JACKPOT SLOTS where the BIG wins are. These slot games have jackpots that increase incrementally as players (from all around the world) play. The jackpot amount keeps progressing until the right symbols are aligned and the jackpot is triggered. There are many progressive jackpot games to play, with big and small jackpots. The top progressive jackpot slots are MEGA MOOLAH (which paid out the highest jackpot ever – £13.2 million) and MEGA FORTUNE.\n\nWith the Play OJO app you can enjoy all the excitement of the desktop casino straight from your mobile device. Enjoy OJO’s brilliant rewards and player-friendly platform through your touchscreen and get a fully interactive experience whether you’re on the commute, a work break or simply lounging at home!\n\nPlay OJO Casino is completely safe to play with all deposits protected with state-of-the-art security software.\n\nSo, what are you waiting for? Download today and enjoy all the fun of your favourite casinos the OJO way. \n\nConnect with OJO on Social!\nWebsite: www.playOJO.com\nTwitter: www.twitter.com/playOJO\nFacebook: www.facebook.com/playOJO\nInstagram: www.instagram.com/playOJO\n\n18+ only. www.BeGambleAware.org",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2017-03-20T19:23:21Z",
  "updated": "2019-10-16T20:01:49Z",
  "releaseNotes": "We’ve added performance improvements as well as new games for you to enjoy!",
  "version": "iOS APP 2.6",
  "price": 0,
  "developer": "Skill On Net Ltd",
  "score": 4.56968,
  "reviews": 5754,
  "currentVersionScore": 4.56968,
  "currentVersionReviews": 5754,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.mobilityware.BlackJackFree",
  "title": "Blackjack – Casino Card Game",
  "description": "Win BIG at your next casino trip by playing this Blackjack app, with the best casino-style experience. Learn to master the most popular card game found in casinos all over the world, from the best Blackjack developer in the App Store.\n\nREAL BLACKJACK STRATEGY\nThere’s more to this Blackjack app than just Hit or Stand. Just like a real casino, you have the option to split, double down, and even take insurance!\n\nCARD COUNTING FEATURE\nOur Blackjack game has Hi-Lo and KO card counting strategies. Both strategies are perfect for beginners interested in learning card counting!\n\nMULTIPLE TABLE OPTIONS\nThink you’re ready to play with the High Rollers? Try your hand in the high stakes tables! Start with Beginner’s Luck and work your way up to The Penthouse! Compete with players around the world by working your way to the top of the Leaderboards.\n\nMORE BLACKJACK FEATURES\n• Option to play 1 to 8 decks\n• Come back every few hours for BONUS chips\n• Toggle strategic Advice on or off to get real-time feedback as you play\n• Toggle “Insurance” and “Surrender” on or off\n\nDownload Blackjack today and master your game!\n\nDISCLAIMER\n• The games are intended for an adult audience.\n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n• Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\n\nFor answers to frequently asked questions, head over to\nhttp://www.mobilityware.com/support.php\n\nLIKE US on Facebook\nhttp://www.facebook.com/mobilityware\n\nFOLLOW US on Twitter\n@mobilityware\n\nCreated and supported by MobilityWare",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-01-31T08:00:00Z",
  "updated": "2019-08-19T15:34:35Z",
  "releaseNotes": "Hey Blackjack Fans! We’ve made some new updates to the gameplay to make sure you have the best Blackjack experience around!\n\nIf you’re enjoying this game, please take a moment to leave us a review. Have fun and Good Luck!",
  "version": "2019.8.0",
  "price": 0,
  "developer": "MobilityWare",
  "score": 4.54652,
  "reviews": 935,
  "currentVersionScore": 4.54652,
  "currentVersionReviews": 935,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.zynga.livepoker.700",
  "title": "Zynga Poker - Texas Holdem",
  "description": "﻿Join one of the world's most popular online poker games with more tables, more tournaments, more jackpots, and more players to challenge than ever before! Whether you prefer casual Texas Holdem Poker or competitive tournaments, Zynga Poker is your home for authentic gameplay.\n\n==ZYNGA POKER FEATURES==\n\nAUTHENTIC WORLD POKER TOUR EXPERIENCE – Play like a pro at the WPT Final Table in the new WPT Tournament mode!\n\nHIGHER STAKES, BIGGER PAYOUTS – Higher buy-ins mean you can win even more virtual chips for every tournament you play.\n\nFASTER TOURNAMENTS – Compete at the traditional 9-person table or the new 5-person table for faster play.\n\nVIP PROGRAM – Earn in-game benefits and features by reaching higher Tiers in our VIP Program! Enjoy exclusive chip package offerings and special poker game modes.\n\nFREE CHIPS – Get a welcome bonus of 60,000 FREE chips just for downloading your new favorite poker game! Plus, win a daily bonus of up to $45,000,000 in in-game money!\n\nTEXAS HOLDEM YOUR WAY – Stay casual with the classic Texas Holdem game or turn up the heat and go for the high-stakes jackpot. It’s up to you how high the stakes go! Texas Holdem Poker games for all experience and skill levels! \n\nFAIR PLAY – Zynga Poker is officially certified to play like a real table experience. Take your online poker games anywhere and know that you’re getting the true Vegas-style game.\n\nVARIETY – Play poker however you want! Join a Sit n Go game or a casual online poker game, and win generous in-game payouts! 5 player or 9 player, fast or slow, join the table and stakes you want. \n\nLEAGUES – Join millions of players across the World competing in our online Poker Season competition. Win the most chips to come out on top and become the Texas Holdem Poker champion!\n\nSOCIAL POKER EXPERIENCE – Challenge your friends to poker games, or meet new friends online. Zynga Poker has the strongest community of any poker game.\n\nPLAY ANYWHERE – Take your favorite card game anywhere. Play seamlessly across all web and mobile versions -- just log in with your Facebook profile!\n\nZynga Poker is the destination for video poker players, social casino fans and table top poker players alike. If you’re a fan of the Vegas casino experience, you’ll feel right at home in our friendly poker community!\n\nDownload Zynga Poker and start playing today! The classic casino card game, now for mobile and online play!\n\nTALK TO US – Let us know what you'd like to see next by hitting us up on Facebook or Twitter:\nFacebook: https://www.facebook.com/TexasHoldEm/\nTwitter: https://twitter.com/zyngapoker\n\nAdditional Information:\n· This Poker game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.\n· The game is free to play; however, in-app purchases are available for additional content and in-game currency.\n· Use of this application is governed by Zynga’s Terms of Service, found at www.zynga.com/legal/terms-of-service.\n· For information about how Zynga uses personal data, please read our privacy policy at www.zynga.com/privacy/policy.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2010-05-14T22:10:46Z",
  "updated": "2020-05-11T15:46:05Z",
  "releaseNotes": "﻿More Rewards, More Challenges, More FREE CHIPS!  Play in all new challenges to earn tons and tons of free chips!",
  "version": "21.94",
  "price": 0,
  "developer": "Zynga Inc.",
  "score": 4.56717,
  "reviews": 10898,
  "currentVersionScore": 4.56717,
  "currentVersionReviews": 10898,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.mansion.mcslots",
  "title": "MansionCasino.com",
  "description": "### DOUBLE YOUR MONEY WITH OUR WELCOME BONUS ###\n\nEnjoy all the thrills of MansionCasino.com wherever you are with our super speedy app, and if you’re a new customer we’ll double your first deposit up to £200! \n\nJOIN NOW AND GET 100% EXTRA ON YOUR FIRST DEPOSIT!\n\nIf you’re already a member of MansionCasino.com you won’t need to register – simply download our snazzy app and get spinning. We want to double your fun, with double the funds… Simply download our app and register, and we’ll give you 100% extra on your first deposit, up to a juicy £200. What a way to start your mobile gaming fun with us!\n\nBut that’s not all! Get used to doubling your money when you play with us – as with our monthly promotion ‘Make your Match’, you can grab a 100% reload bonus on your first deposit of each month.\nAnd with a whole host of exciting online slots, blackjack, roulette and classic casino games all just a tap away, you’re spoilt for choice with where to play your bonuses. So if you’re looking for a new favourite casino, look no further than MansionCasino.com! \n\nSignificant Terms: **New customers only**\n•\tMaximum bonus £200, wagering 20x, Minimum deposit £20\n•\tGame weighting applies, see below table \n•\tBonus betting limits: Slots - £5 All other games – 10% of bonus amount.\nFor more info and full T&Cs please go here: http://mobile.mansioncasino.com/promotions/welcome-bonus\n\n*** GAMES FEATURES GALORE ***\nThere’s something for everyone at MansionCasino.com! If you fancy a spin on our action-packed slots, you’ll be spoilt for choice. We have a huge selection offering multiple reels and paylines, boasting all the features you’ll find on desktop and more.\n\nIf you prefer, you can enjoy the classic casino games such as blackjack, roulette or poker, or try out one of our more unique games. Whatever your favourite is – you’re sure to find it here!\n\nMobile gaming has never been better, and offers a host of touch-screen benefits to add to the fun! Get ready to spin your own reels and tap and drag your own chips, with a host of interactive features to enjoy.\nMansionCasino.com has been designed purely with the player in mind, ensuring it’s easy to use and intuitive to navigate.\n\n*** PLAY FOR REAL MONEY OR FOR FUN ***\nWhether you want to practice your skills first, or get straight to spinning and (hopefully!) winning – you can play all our games in either fun mode, or for real money once you create an account. The choice is yours!\n\n*** 24/7 CUSTOMER SERVICE ***\nMansionCasino.com are committed to providing unrivalled customer care to our players. Our friendly support team is available 24 hours a day, 7 days a week! Simply email support@mansioncasino.com or call us on 0800 376 8375 – our free phone number in the UK – and we’ll be happy to help.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-12-17T03:35:03Z",
  "updated": "2019-10-01T21:55:15Z",
  "releaseNotes": "General bug fixes, improved localisation and welcome offer to enhance your app experience.",
  "version": "4.3.1",
  "price": 0,
  "developer": "Casino.com",
  "score": 4.91327,
  "reviews": 1349,
  "currentVersionScore": 4.91327,
  "currentVersionReviews": 1349,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.rnftechnologies.BlackJack",
  "title": "BlackJack - Casino Style!",
  "description": "The best blackjack app for your iPhone/iPod Touch or iPad\n\nPlay your favorite game - Blackjack in real casino environment. Realistic and intuitive graphics further adds to the experience.\n\nBefore leaving for Las Vegas, this is the right app for you to learn the basics and get your black jack strategy right.\n\nGet the thrill of winning money against the dealer in almost real life scenarios with this App.\nDefine your strategies, practice using this app and get to perfection.\n\nThis BlackJack App follows the rule \"Dealer Must stand on All 17's\"\n\n-----------------------------------------\n\nFeatures of the Black Jack App :\n\n*Three tables to chose from depending on your risk taking abilities - the minimum and maximum bet varies along with the number of decks. The third table is for the high-rollers with no upper cap on maximum bet.\n\n*Nice casino style sound and music added.\n\n*Shuffling after half of the hands played. Card counting can be done.\n\n*Split option available if the initial two cards are same.\n\n*Double down option available if you wish to double your bet after seeing the first two cards.\n\n*Hourly Free Bonus Chips - The more you play, the more you get.\n\n*Learn section which has everything you need to know about blackjack. This can be used by a beginner as well as advanced players.\n\n*Leaderboard to boast your earnings!\n\n\nComing Soon : Card Counting Trainer \n\nFor Support and Feedback : contact@rnftechnologies.com",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-04-12T17:52:11Z",
  "updated": "2017-10-17T14:09:01Z",
  "releaseNotes": "- iOS 11 Optimisations.\n\n- Minor Game Logic Optimisation.",
  "version": "4.2",
  "price": 0,
  "developer": "Rnf Technologies",
  "score": 4.55556,
  "reviews": 18,
  "currentVersionScore": 4.55556,
  "currentVersionReviews": 18,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.phonato.blackjack",
  "title": "BlackJack Online - Multiplayer",
  "description": "►►► #1 BlackJack Multiplayer - Now available on iPhone/iPad/iPod ►►►\nEnjoy the most authentic blackjack game on your iPhone, iPad or iPod touch! Download the BlackJack Online - Just like Vegas! now for the most thrilling gambling action brought to you by casino veterans.\n\nPlay this timeless classic card game against real people from anywhere in the world. Get the thrill and excitement of Vegas on the go, at the comfort you decide.\n\nThe most fun, smart and authentic Las Vegas card game on the market, packed with some best social features you ever wanted!.\n\nThe only thing you need is your mobile phone and internet connection! Now just add a bit of skill and you'll have your first winnings!.\n\nChoose the table you want to play on and compete with like-minded people.\n\nIntuitive graphics and game play gives you the real feel of a Casino.\n\nEnjoy the real and the ORIGINAL BlackJack Online - Just Like Vegas!\n\nFeatures and Benefits :\n\n► On Signup, get a bonus of $5,000 chips FREE.\n► FREE Daily bonus which can go up to $100,000.\n► FREE weekend and special occasion Bonus.\n► MORE FREE CHIPS, MORE OFTEN – Collect FREE chips every hour!\n\nGame Features:-\n\n► CASINO FEEL - Authentic Casino look and feel.\n► GUEST MODE - Login using Facebook, or play the full game as a guest.\n► Hi-LO GAME - Bonus games for collecting FREE coins.\n► LIVE CHAT - Chat with friends and other players. Send gifts in real time! \n► FACEBOOK CONNECT - Facebook connect for fast registration.\n► EASY GAME PLAY - Easy and fast game play.\n\nPractice your strategies, and get ready before you head to a real casino!\n\nFor Support, contact us at support@phonato.com",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2015-06-25T20:02:11Z",
  "updated": "2019-12-20T13:55:21Z",
  "releaseNotes": "- Faster Game Play! Less waiting time between hands.\n- More Bonus coins.\n- Graphics Improvement.\n- Minor Fixes.\n\nDo share feedback with us!",
  "version": "1.3",
  "price": 0,
  "developer": "Phonato Studios",
  "score": 4.93333,
  "reviews": 15,
  "currentVersionScore": 4.93333,
  "currentVersionReviews": 15,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.betway.livedealer",
  "title": "Betway- Live Casino & Roulette",
  "description": "You’re sat in a casino. You know what it's like to have the urge to win. You know what it feels like when your luck comes in. Now all the thrills and excitement of the Live Casino experience are available at your fingertips! \n\nThe Betway Live Casino App brings high definition live streamed Roulette, Blackjack, Poker and Baccarat casino games from our many studios across the globe!\n\nInteract and chat with our world class croupiers and dealers, who bring you the best possible chance of taking down the house. This way you can play without the hassle of trawling your money down the local Casino. Just cash out your winnings on your mobile in a matter of hours. \n\nCouple this with our exclusive Welcome Bonus* to get you started, which is available to all new players, and you’ll be able to kick start your adventure and explore everything we’ve got to offer. \n\nYou’ll have access to our regular exclusive Live Casino Bonuses and tournaments that can now be claimed straight from your mobile, allowing you instantly join the action - even when you’re on the go!\n\nWe want you to make the most out of your time with us here which is why we’re giving you the power to make your Betway experience a unique one, with our Betway Plus loyalty scheme. Each and every time you play with us you’ll earn Plus Points that let you progress up through our loyalty tiers, where you’ll gain exclusive bonuses and tailor-made offers! \n\nThe good times don’t stop there, because when you download the Betway Live Casino App we’ll give you exclusive promotions and plus point initiatives. You can even redeem your points straight from your mobile to keep the good times rolling!\n\nEnter a world of sleek graphics, immersive sound effects and top notch gaming, all brilliantly optimised to work seamlessly on your iOS device and replicate the thrills of a real casino. \n\nChoose from the following game types:\n\nRoulette, Blackjack, Poker and Baccarat \n\nABOUT US: \n\nBetway was launched in 2006 and has become one of the world’s leading online and mobile gaming sites. We offer both Sports Betting and Casino and have a wide variety of games and markets to bet on. \n\n*Apple is in no way associated with this Betway Welcome Bonus promotion. £250 Welcome Bonus is split over the following deposit match promotions: \n\nNew customers only. Opt-in required. 100% Match Bonus up to £250 on 1st deposit of £20+. 50x bonus wagering applies as do weighting requirements. Debit Card & PayPal deposits only. Advantage Play may invalidate your bonus. Terms apply.\n\nSee http://casino.betway.com/terms-welcome-bonus/ for Welcome Bonus T&Cs and http://casino.betway.com/terms-and-conditions/ for full T&Cs.\n\n**Please be aware the continued use of GPS running in the background can dramatically decrease battery life.\n***Please note, in light of new regulations, if you are using the app in the UK, to make use of the Session Reminder feature, please update to the latest version of the app.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2015-07-13T09:13:57Z",
  "updated": "2020-05-07T08:36:13Z",
  "releaseNotes": "Take a seat at your favourite casino game, we’ll take care of the rest. From slots to blackjack and roulette, we’ve got all the top games for you to choose from, including:\n\n• Slots: Starburst, Mega Moolah \n• Roulette: European Roulette Gold, Evolution Roulette & Live Roulette HD\n• Blackjack: European Blackjack Gold, Evolution Blackjack & HD Live Blackjack\n• Wheel of Fortune: Evolution Dream Catcher\n\nAre we your favourite casino app or could we do better? Let us know & leave a review.",
  "version": "7.5.2",
  "price": 0,
  "developer": "Betway",
  "score": 4.81081,
  "reviews": 148,
  "currentVersionScore": 4.81081,
  "currentVersionReviews": 148,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.bananaandco.blackjack",
  "title": "Blackjack 21!",
  "description": "Do you love Blackjack? Play the best FREE Blackjack game on the app store!\n\n- Jump right in and play Blackjack completely free!\n- Popular Las Vegas rules just like at the casino.\n- Beautiful table customizations with HD graphics.\n- Easy, simple to learn controls make this the sleekest Blackjack available.\n- Stat tracking shows your performance over time.\n- Double Down, Splits, Insurance and Surrender for an authentic Blackjack experience.\n- Deck shuffle animation lets you know when the deck is being reshuffled.\n- Tons of chip denominations from singles all the way to millions!\n- Customization options including decks, tables, face card style, hints, music, sfx, surrender.\n- Informative help screen for those who don't already know how to play Blackjack.\n\nThe current game has hints enabled by default. This will highlight the suggested move based on basic Blackjack strategy. If you want to turn this off, toggle the \"Move Advice\" setting in the menu.\n\nWe'll be adding some awesome new features to Blackjack soon, so stay tuned! Thanks for playing!! For fast and friendly support, email us at contact@maplemedia.io. We would love to hear from you!",
  "genres": [
   "Games",
   "Card",
   "Lifestyle",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-07-03T22:32:27Z",
  "updated": "2019-06-19T19:07:15Z",
  "releaseNotes": "Get ready to double down! We've made some behind the scenes changes to keep you in the action longer. \n\nKeep playing and rack up those chips! Good luck!",
  "version": "1.8",
  "price": 0,
  "developer": "Banana & Co.",
  "score": 4.58462,
  "reviews": 65,
  "currentVersionScore": 4.58462,
  "currentVersionReviews": 65,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.bet365.bet365CasinoApp",
  "title": "bet365 Casino: Games & Slots",
  "description": "bet365 Casino app is the place to play Blackjack, Roulette and Slots. We have a large selection of games, jackpots and slots.\n\nWhether you’re an aspiring spinner or a vegas veteran, the bet365 Casino app is the perfect casino app for you. \n\nJoin bet365 Casino today and play straight away. \n\nPlay all the latest games on your device with the bet365 Casino app, with a huge selection of Casino table games such as Roulette, Blackjack and Baccarat. \n\nPersonalise your play and access to your favourite real money games, whether you prefer Casino classics such as Blackjack and Roulette or the thrill and excitement of Slots - there’s something for everyone.\n\nPlay Live Casino, where you can play Blackjack, Roulette, Baccarat and Dragon Tiger with real life dealers. \nUse your existing bet365 account to log in, or sign up now.\n\nSpin to win across a wide range of slots - keep an eye out for familiar faces such as Superman and Batman. Play a range of video slots, search for the pot of gold with Plenty of Fortune or keep it classic with Crazy 7 and Lotto madness.\n\nGo for big cash jackpot slots in Age of the Gods and Jackpot Giant.\n\nGet lucky with fantastic slot games with bonus games, free spins and massive progressive jackpots.\n\nExperience live Roulette, Blackjack and other table games, when you play Live Casino with real life dealers. Sitting across from our live dealers who are ready to chat and waiting to spin the Roulette wheel or deal you in to Blackjack, Poker, Baccarat and lots more Live Casino games.\n\n•\tCompete in a range of exciting bet365 exclusive monthly promotions\n•\tLive Casino games\n•\tTable games\n•\tJackpot Slots\n•\tInstant Wins\n•\tNew games every week\n\nDownload the bet365 Casino app and start playing today! \n\nOur customer support team is on hand 24/7 to help with any queries.\n\nYou must be 18 or over to have a bet365 account.\nThis is a real money gambling app. Please gamble responsibly.\n\nFor the full terms and conditions please follow the link to the Developer Website below.\nPlease read the bet365 Privacy Policy (see link below) before installing this application. By installing and opening the application you are accepting this policy.\n\nFor gambling help and support in the UK, users can contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org.\nFor gambling help and support in IE, users can contact Gamble Aware at 1800 753 753 or visit http://www.problemgambling.ie.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2014-10-16T14:13:31Z",
  "updated": "2020-01-08T09:48:40Z",
  "releaseNotes": "We've made a number of enhancements and improvements. Please send us any feedback you have as we're always looking to improve our app!",
  "version": "19.60.8",
  "price": 0,
  "developer": "bet365",
  "score": 2.93373,
  "reviews": 166,
  "currentVersionScore": 2.93373,
  "currentVersionReviews": 166,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.youdagames.gop3multiplayer",
  "title": "Governor of Poker 3 - Online",
  "description": "Play this great multiplayer Texas Hold’em Poker game for FREE today!\n\nBecoming a poker pro is a long journey through the Wild West in Texas. You will start as a poker rookie and work yourself all the way up to become a VIP poker player, a high roller to end up winning high stake poker games in Las Vegas!\n\nDownload the game now, get your free chips, invite your friends and make it a great poker night. Still not sure this is the best poker game? Read all Governor of Poker game features.\n\nThe main game features : \n● BIG FREE WELCOME PACKAGE:\n$30,000 free poker chips, gold and hat!\n● 7 DIFFERENT POKER FORMATS:\nCash games, Sit & Go tournament, Spin & Go, Heads Up Challenge, Push or Fold, Big Win, Jackpot poker and Royal poker.\n● POKERTEAMS: PLAY WITH FRIENDS\nInvite friends and compete against other teams and check out the all new challenges!\n● ENJOY TEXAS:\nTravel through Texas by winning poker tournaments, beat friends at Texas Hold’em cash games and Big Win Poker tournaments. The further you travel the higher the stakes!\n● BLACKJACK 21:\nPlay Blackjack for many different betting amounts.\n● FREE CHIPS:\nGet your free chips stack bonus every 4 hours!\n● MISSIONS: \nComplete them all in every area and claim great rewards!\n● WIN BADGES & ACHIEVEMENTS:\nDistinguish yourself by winning badges and trophies with your poker skills!\n● PLAY ALWAYS AND EVERYWHERE:\nPlay poker on your mobile device and continue to play on your laptop.\n● BONUS FOR CONNECTING WITH FACEBOOK:\nEarn extra chips and play poker with friends!\n● CHAT:\nTalk with other hold’em players through chat and animating emoticons. Use them to bluff or taunt players so you win the poker hand !\n\nDo you want more than just poker? Do you want to join the greatest free multiplayer poker experience in the world? The only thing you need to do is to download this exciting Texas Holdem poker game.\n\nNote: The games are intended for an adult audience. (e.g Intended for use by those 21 or older)\nThe games do not offer “real money gambling” or an opportunity to win real money or prizes. (e.g the game is for amusement purposes only)\nPractice or success at social casino gaming does not imply future success at “real money gambling”.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-12-10T17:11:54Z",
  "updated": "2020-04-15T07:25:53Z",
  "releaseNotes": "A new Governor of Poker 3 update has arrived:\n- We have made it easier for you to find information about a certain feature! Simply tap on the question mark icon now available in each menu.\n- Tweaked the volume of loud sound effects.\n- Stability improvements.",
  "version": "6.4.2",
  "price": 0,
  "developer": "Youda Games Holding B.V.",
  "score": 4.67645,
  "reviews": 2352,
  "currentVersionScore": 4.67645,
  "currentVersionReviews": 2352,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.GalaInteractive.GalaCasino",
  "title": "Gala Casino: Real Money Games",
  "description": "Play all of your favourite REAL MONEY CASINO GAMES at Gala Casino, including SLOTS, BLACKJACK, ROULETTE, baccarat and INSTANT WIN games.  Play anywhere, anytime using your iOS device.\n\nWhy Gala Casino? \n\nSLOTS \nPlay hundreds of slots and jackpot slot games including STARBURST, Big Banker Slot, The Goonies and Rainbow Riches or any of our many jackpot slots like DRAGON’S FIRE, Mystery Reels Megaways™ and Slot O Gold™.  \n\nLIVE CASINO\n\nGet even closer to the experience of an authentic casino by playing a wide selection of table games in our LIVE CASINO suite, from Blackjack, Roulette, Baccarat and Hi-Lo to Spin a Win, 3 Card Brag and Casino Hold’em.\n\nASIAN GAMES\nLove Macau Slots?  Download the app to play over a dozen Asian slot games like Astro Cat, Emperor’s Garden, Pai Gow Poker, Craps and Eastern Emeralds.\n\nBecome a Gala Casino VIP!\n\n•\tWelcome Bonus\n•\tWeekly Cashback \n•\tExclusive VIP Promotions & Events\n•\tDedicated Personal Account Manager\n•\t24 Hour VIPA Team Support\n•\tBespoke Offers & Bonuses\n•\tPriority Withdrawals\n•\tVIP Table Limits\n•\tExclusive VIP Promotions & Events\n\nFor a full list of VIP benefits, visit www.galacasino.com/vip\n\nFor the latest offers, follow us on Social Media \nwww.facebook.com/galacasinoofficial\nwww.twitter.com/GalaCasinocom\n\nFor Full Terms & Conditions on each bonus: \nhttps://www.galacasino.com/promotions/first-deposit-bonus\n\nResponsible Gambling \n18+.   This is a real money gambling app.  Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org.  \n\nFor users in the Republic of Ireland, please contact telephone 1800 753 753 or visit www.problemgambling.ie.\n\nGala Casino operates under licence and in accordance with applicable laws and regulations.  For further licence information, please visit our website at www.galacasino.com.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-10-08T22:35:05Z",
  "updated": "2020-01-06T10:51:41Z",
  "releaseNotes": "We regularly bring updates to the App Store for your enhanced Casino experience.This update includes:\nChanges to enhance the push updates \nBetter crashlytics tracking \n\nThe Gala Casino Team!",
  "version": "19.12.03",
  "price": 0,
  "developer": "Gala",
  "score": 4.60044,
  "reviews": 458,
  "currentVersionScore": 4.60044,
  "currentVersionReviews": 458,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.virginbet.virginbetuk",
  "title": "Virgin Bet: Sports Betting App",
  "description": "Virgin Bet is the sports betting app made for you. Whether you’re building accumulators or placing a quick single bet before kick-off, Virgin Bet has the markets and the in-play odds for the bets you want.\n\nVIRGIN BET PRICE BOOSTS\nWhether it’s the next hotly anticipated horse race, the latest Premier League or Champions League clash, we’ll have a Virgin Bet price boost you won’t want to miss. From football, to horse racing, to tennis, all major events will have a tasty offer for you to check out.\n\nLIVE STREAMING \nWatch live football, tennis, basketball and more to see all the action during your in-play bets. \nPlus, you can also watch live UK, Irish and international horse racing. You’ll just need to place a bet of a minimum £1 single unit stake or 50p E/W bet on the race you want to stream.\n\nFAST IN-PLAY BETTING\nBet in-play across a range of including football, tennis, basketball and follow the action on detailed Virgin Bet scoreboards. With loads of markets including next goalscorer and half-time result even on international leagues such as Serie A and Bundesliga, in-play football betting has just got better.\n\nBEST ODDS GUARANTEED ON HORSE RACING BETS\nIf the starting price is bigger than your original price, we’ll give you the bigger odds. That’s on all win/each-way bets from 7am on UK/Irish horse race days. Including the big races at Ascot. Rules/exclusions: virginbet.com/promo/terms/best-odds Max enhancement £50k/day.\n\nFULL RACECARDS\nFancy betting on the horses? With Racing Post Spotlights and form, you can check the latest on all horse races from Ascot to York with Virgin Bet’s card view. Or, tap the “Next off” button from the home page to go straight to upcoming horse races. You’ll also be able to view the full race results afterwards.\n\nMATCH STATS\nFor all the big football leagues, check out the results for each team’s last five matches, as well as the head-to-head history before placing your bets. Perfect for brushing up your knowledge on international leagues such as Serie A and Bundesliga.\n\nLIVE ROULETTE, CASINO & SLOTS\nStep into our live casino and try your luck at the roulette and blackjack tables with live casino dealers. Spin the reels of your favourite casino slot games and bet on popular games including Rainbow Riches and Deal or No Deal: What’s in Your Box slot.\n\nSlide out our in-play blackjack game from the tab on your screen and play blackjack between your sport bets.\n\nVIRTUAL SPORT\nCasino games not your thing? Try your luck and bet on virtual football and horse racing.\n\nTOP SPORTS AND BETTING MARKETS\nFrom global football leagues to ATP tennis tours, or football corners & cards to tennis sets & double faults, there’s betting markets for everyone at Virgin Bet. We even offer markets on esports such as eSoccer Liga Pro. See the latest betting odds for everything from horse racing to basketball.\n\nFAST LOGIN\nGet to your sports betting sooner, by using Face or Touch ID for a speedy log in.\n\nHOT PROMOTIONS\nFrom exclusive racing offers to Premier League betting promos, to basketball price boosts, take a look at our promotions pages to see what offers you could take advantage of.\n\n\n18+. Virgin Bet is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.\n\nVirgin Bet T&Cs: web.virginbet.com/en/vb-terms-and-conditions/\n\nPlease Bet Responsibly. BeGambleAware.org. 0808 8020 133",
  "genres": [
   "Sports",
   "Casino",
   "Games"
  ],
  "contentRating": "17+",
  "released": "2019-06-12T13:38:37Z",
  "updated": "2020-05-04T10:09:04Z",
  "releaseNotes": "We’ve smoothed out some niggles to make your betting experience with us even better than before.",
  "version": "1.7",
  "price": 0,
  "developer": "Virgin Bet Ltd",
  "score": 4.74061,
  "reviews": 852,
  "currentVersionScore": 4.74061,
  "currentVersionReviews": 852,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.bigfishgames.bfcasinouniversalfreemium",
  "title": "Big Fish Casino: Slots & Games",
  "description": "You must be 18+ to access this game.  This game does not offer gambling or an opportunity to win real money or prizes.  Practice or success at social gaming does not imply future success at gambling.\n\n------------------\n\nDownload now! New players get 100,000 FREE BONUS CHIPS in the #1 FREE to play Casino app in the world! Over 65,000 5-star reviews!\n\nBig Fish Casino gives you the chance to WIN BIG in Slots, Blackjack, Texas Hold'em Poker, Roulette, and more! Play live with your friends, with all the thrill of Las Vegas! Sit down, relax, have a drink & some chips – on us. We've got gorgeous games and millions of friendly people to play with for FREE!\n\nMake a fortune with HUGE Jackpots, Free Daily Games, Slots Bonus Games, and more! Will you play it safe and hold your cards, or double down and get a lucky ace? Over 16 BILLION chips in Jackpots given out each day!\n\nHave an adventure like no other in our original Slot Machines! Hit Flaming 7's for multiple jackpot levels in Jackpot City! Hunt for clues to uncover a huge win in Sherlock Mysteries! Fortune awaits those brave enough to enter the Enchanted Cavern…\n\nTOP FEATURES: \n• Exciting slot machines with FREE SPINS and Bonus Games you won't find anywhere else!\n• Everybody wins together in our unique Social Scatter™ Slots Games!\n• Win up to 1 MILLION chips in our Reward Center games!\n• Daily FREE game and bonuses could win you up to 65k FREE Chips just for logging in!\n• Play LIVE with your friends! Beat the house in Blackjack or test your skills in Poker! \n• Customize and strut your stuff with free pets, gifts, and power ups! \n\n--------------------- \n\nQuestions? Suggestions? Contact us at www.bigfishcasinosupport.com!",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-12-17T20:03:18Z",
  "updated": "2020-03-23T17:03:04Z",
  "releaseNotes": "•Minor bug fixes. \n•Don’t miss out on the upcoming Easter Treasure Rush!",
  "version": "12.2.8",
  "price": 0,
  "developer": "Big Fish Games, Inc",
  "score": 4.573,
  "reviews": 8972,
  "currentVersionScore": 4.573,
  "currentVersionReviews": 8972,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.huge.slots.casino.vegas.ios.avidly",
  "title": "Double Win Casino Slots Game",
  "description": "Double Win Slots for free! Install Double Win Slots now to embrace the real thrill of true Las Vegas casino experience. best selection of casino slot machines, and huge payouts for free spins and jackpots.\nDouble Win Slots brings you the best slot machine gaming experience you have ever had with tons of fun!\nSpin this casino slots with gorgeous graphics, smooth animations and fantastic bonuses, collect daily FREE COINS and hourly FREE GIFTS! \nYou are starting an awesome casino journey in this best online casino Double Win Slots.\n\nGet ready to have fun?\nINSTALL NOW and make a fortune with excitement and entertainment!\n*******************************************************\nInstall Double Win Slots and Enjoy:\n► Huge payouts, incredible big wins, mega wins and super mega wins;\n► FREE daily login bonus, FREE mega wheel bonus and FREE coins every 3 hours;\n► Amazing new beautiful free slots games added on a weekly basis ;\n► WIN BIG with amazing jackpots, scatter slots and more\n► Lots of high quality slots with diverse thems and variety of gameplays;\n► Wild multipiers, free spins, expanding wilds makes you a fortune;\n► Wonderful quests will set you on the path to riches!\n► Install now to start having real slots fun!\n*******************************************************\nGo and install Double Win Slots now! You will discover an incredible world of Slots and Casino games. Wherever you are, you can open the Double Win Slots app to experience the wonderful night in real Vegas!\n*******************************************************\nFollow Double Win Slots on Facebook for free offers and exclusive coin packages.\nFacebook：www.facebook.com/DoubleWinSlotsGames",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-10-19T20:44:00Z",
  "updated": "2020-03-18T09:03:24Z",
  "releaseNotes": "Dear players：\n\nFixed some bugs in the game.\n\nMore rewards and more surprises in Double Win!\n\nGOOD LUCK!",
  "version": "1.71",
  "price": 0,
  "developer": "FG Games",
  "score": 4.89462,
  "reviews": 6339,
  "currentVersionScore": 4.89462,
  "currentVersionReviews": 6339,
  "searchTerms": "blackjack"
 },
 {
  "appId": "Cf.FoodCircle",
  "title": "Cooking Master",
  "description": "Do you like doughnut or biscuit? Help cute cook to complete delicious food in Food Circle!\n\nHow to play:\n1. Tap in one of the outer circles to place the current slice.\n2. Complete a circle and put the food into target plate along with adjacent circles blasting.\n3. Be careful! Game over if there is no corresponding space in outer circles to place the current slice.\n4. Use Clean prop, you can remove all slices of any outer circle.\n5. Accomplish food in targeted number, complete levels to play with new slices!",
  "genres": [
   "Games",
   "Board",
   "Family",
   "Entertainment"
  ],
  "contentRating": "4+",
  "released": "2019-02-20T08:00:00Z",
  "updated": "2020-03-23T16:04:41Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "2.1",
  "price": 0,
  "developer": "Zhenhui Yang",
  "score": 4.46038,
  "reviews": 795,
  "currentVersionScore": 4.46038,
  "currentVersionReviews": 795,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.luckios.buffaloslots",
  "title": "Slots: Royal Casino Slot Games",
  "description": "Play the greatest slot machines for FREE! 20,000,000 FREE coins to get you started! \n\nPlay Royal Slots, the FREE slots with impressive graphics and sounds will give you the best slot machine gaming experience you have ever had. Join party fever and let beauty show you the way to get Mega Bonus and Big Jackpot! And We have all the best gambling games and unique slots. Welcome to play! \n\nGame Features\n\n- Get started with 20,000,000 FREE coins!\n- Free coins every hour so you can play your favorite slots anytime. \n- Cumulative wheel spin rewards enable you to get more Free Coins and Gems.\n- Kinds of gameplay, including classic slot machines style and some new one.\n\nThe game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Any success in social casino gaming is not indicative of future success at real money gambling.\n\nQuestions?\nE-mail us at: support@luckios.com",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-06-07T18:40:28Z",
  "updated": "2019-04-20T01:36:18Z",
  "releaseNotes": "Happy Easter Day, dear Royal Slots fans! \n\n- Optimize several slots gaming experiences for you! \n- Squash bugs and improve royal casino slot game performance.\n\nUpdate now and enjoy fantastic slots! Happy spinning!",
  "version": "1.4.4",
  "price": 0,
  "developer": "Luckios Game Co., Ltd.",
  "score": 4.70607,
  "reviews": 2157,
  "currentVersionScore": 4.70607,
  "currentVersionReviews": 2157,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.realmoneycasinogames",
  "title": "Real Money Casino Slots Games",
  "description": "Play casino games for REAL MONEY or just for fun with our built-in games. Experience the ambiance of a real casino with our never seen before graphics and sound. This app is a must for anyone who enjoys casino games, either for fun or for the thrills of real money.\n\nEnjoy exclusive REAL MONEY bonuses and promotions, such as:\n* Free Spins: Start playing your favorite slots machines for real money without depositing one cent.\n* No Deposit Bonus: Play any casino games for real money just by signing up.\n* Welcome Bonus: Take advantage of our incredible match bonus offers. Any deposit you make will add up to 400% to your balance.\n\nIf you're interested in playing for fun, you can now play for absolutely free!\nPlay for fun with our built-in casino games:\n* Slots Machines: We offer dozens of different slots machines. Unlock more themes as you advance.\n* Video Poker: Enjoy many different types for video poker, with incredible jackpots.\n* Roulette: American Roulette, French Roulette... We support all roulette tables for the ultimate casino experience.\n* Blackjack: Play Blackjack at one of our many tables, with all types included.\n\nUpon installation receive a free balance of 500 and another 500 every 5 minutes absolutely free. This balance is playable in all free games.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-07-28T16:52:16Z",
  "updated": "2018-12-18T19:15:44Z",
  "releaseNotes": "- Improved stability",
  "version": "1.0.5",
  "price": 0,
  "developer": "Slots Games Apps SL",
  "score": 4.88462,
  "reviews": 52,
  "currentVersionScore": 4.88462,
  "currentVersionReviews": 52,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.playstudios.myvegas.blackjack",
  "title": "myVEGAS Blackjack – Casino",
  "description": "myVEGAS Blackjack is intended for individuals 18 years and older.\n\nPlay the #1 Blackjack 21 game on App Store for free!\n\nIt’s the ONLY LAS VEGAS CASINO – style free black jack 21 app where players can enjoy Las Vegas experiences.\n\n* TONS OF DIFFERENT WAYS TO HIT THAT 21! *\n\n*** FREE CHIPS – Collect free chips multiple times per day!\n*** Free Bonuses - Join the thousands who enjoy free bonuses just by playing!\n*** Unique bonus games – Double or Nothing!\n*** Collect unique collectible cards (CCG) by unlocking new casinos!\n*** Las Vegas Inspired Blackjack tables - MGM Grand, Excalibur, Mirage, New York New York, Aria, Circus Circus, Luxor and more!\n*** Multiple Casino - style Online Card Game Variants - Freebet Blackjack, Single-deck Black jack, Las Vegas - style Progressive Multi-deck free Blackjack.\n*** Hit 21点 like a true Las Vegas professional blackjackist.\n\nDon’t forget to play myVEGAS Slots, my KONAMI Slots, and POP! Slots to enjoy the Las Vegas experience.\n\nLike Us on Facebook: facebook.com/myVEGASBlackjack\nFollow Us on Twitter: @myVEGAS\n\nDisclaimers:\n- myVEGAS Blackjack is intended for individuals 18 years and older.\n- myVEGAS Blackjack does not offer real money gambling.\n- PLAYSTUDIOS, the developer of myVEGAS Blackjack, is not affiliated in any direct or indirect way with any real-money gambling operations on other domains.\n- Virtual chips used in myVEGAS Blackjack have no real-world value and cannot be redeemed for anything of value.\n- Playing free-to-play slots games does not imply future success at real money gambling.\n- In-app purchases available.\n- PLAYSTUDIOS, the developer of myVEGAS Blackjack, is a member of the International Social Games Association (“ISGA”) and has adopted its “Best Practice Principles.”  See more about the ISGA at www.i-sga.org.  For information, guidance, tips, and advice on social gaming, visit “Smart Social Gamers” at www.smartsocialgamers.org.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-09-28T10:56:13Z",
  "updated": "2019-12-07T01:38:38Z",
  "releaseNotes": "- Loyalty Points will now be rewarded along side chips for watching Rewarded Video Ads starting December 9th, 2019!\n- Norwegian Cruise Line has been added as a reward partner!  Look out for these new rewards in the coming weeks!\n- Be on the look out for new notifications with free chips, special offers and more!\n- Improved performance, and added support for iOS 13",
  "version": "1.24.2",
  "price": 0,
  "developer": "PlayStudios",
  "score": 4.65896,
  "reviews": 346,
  "currentVersionScore": 4.65896,
  "currentVersionReviews": 346,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.mansion.casinoslots",
  "title": "Casino.com: Live Games & Cards",
  "description": "Play for a chance to win jackpots on slots and Live Casino games such as Roulette, Blackjack and other fun card games. \n\nJoin in the fun! Whether you’re a whizz on live slots or a master at Roulette, check out our Welcome Offers today! You’ll get a double your money, plus 200 spins Welcome Package. Or you can choose our Table Welcome Bonus and get 20 Golden Chips - wager free.\n\n3 reasons you’ll love to play with Casino.com:\n\n1. There’s never a dull moment - Play one of our many live slots and casino games. Plus, you could win big on a progressive jackpot. \n2. Practice or play for real - Practice playing our games until you find one you love. Our demo mode option lets you experiment as much as you like. \n3. Get rewarded when you play - Enjoy a double-your-money plus 200 spins Welcome Package, and other exciting promotions.\n\nBrowse through your favourite games easily. Play anywhere, anytime with our easy to use app design. Don’t miss out on any fun and games - there’s something for everyone at Casino.com. \n\n>>>> DOWNLOAD FOR A DOUBLE-YOUR-MONEY WELCOME BONUS AND 200 SPINS* <<<< \nPlay all your favourite games with Casino.com including slots, Roulette, Blackjack and more for the chance to win big! \n\nWe are thrilled to introduce you to the latest generation casino app, built exclusively for your iPhone and iPad. \n\nWelcome Package \n\nSpins\n• New customers only\n• Total of 200 spins available upon first deposit \n• 20 spins given on registration (UK only)\n• Spins and bonus wagering on Age of the Gods slot games only\n• Wager 20x before withdrawing\n\nWelcome Bonus\n• New customers only\n• Minimum deposit $/£/€20\n• Maximum bonus $/£/€100\n• Wager 40x before withdrawing\n• Game weighting applies – please see below table\n• Bonus Betting limits: Slots - £5 All other games – 10% of bonus amount\n• Full T&Cs: https://www.casino.com/promotions/welcome-bonus/ \n\nTable Welcome Bonus Significant Terms and Conditions \n\n• New customers only.\n• Min deposit $/£/€20.\n• $/£/€20 real money stake on selected Blackjack games or Roulette to earn 20 Golden Chips.\n• Roulette wagering contribution weighting applies.\n• Golden Chips wagering on selected Blackjack and Roulette games only, expire within 14 days.\n\nFull T&Cs: https://www.casino.com/uk/promotions/table_card/ \n\nUNBEATABLE CUSTOMER SUPPORT\nCasino.com offers unrivalled customer care – if you need help with a specific issue the Customer Support team are ready to listen 24/7. \n\nSAFE AND SECURE\nLicensed and regulated to operate in the UK, Casino.com is a key player in the highly respected Mansion Group. Our online casino is safe, secure, and second-to-none. From cleverly engineered games for mobile devices and tablets, to an interactive Live Casino where you can enjoy all the action in the company of a real croupier, Casino.com UK has your online casino experience covered.\n\nDownload Casino.com and join the fun today.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-10-13T11:24:02Z",
  "updated": "2020-01-08T16:46:59Z",
  "releaseNotes": "General improvements and optimizations.",
  "version": "5.5.0",
  "price": 0,
  "developer": "Casino.com",
  "score": 4.88919,
  "reviews": 1101,
  "currentVersionScore": 4.88919,
  "currentVersionReviews": 1101,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.iphonesoft3g.roulette",
  "title": "Casino Roulette: Roulettist",
  "description": "Play the best free roulette game with millions of players from all over the world! \nA realistic roulette table with 3D graphics, featuring all varieties of roulette: three-sector European, \"double zero\" American and French with additional betting on sectors. \nPlace bets, take risks, improve your skills, and gain experience! Experiment and win to become the best online roulette player!\n\nGame features:\n• FREE CHIPS – Play the game every day to get free chips!\n• 3 VERSIONS OF ROULETTE – Try European, French and American roulette and choose the best for you.\n• ROULETTE TOURNAMENTS – Compete against lots of worthy opponents and try your luck!\n• GET REWARDS – Up the stakes, win games, take risks and unlock achievements.\n• QUESTS - Complete daily quests to get free chips!\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level-up. See how many roulette games you've won and achievements you've completed. Get unique properties and display them on your profile! View other players' profiles to see how you compare! \n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other roulette players!\n• FAIR PLAY GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest roulette experience.\n• LEARN TO PLAY – Are you new to roulette but always wanted to try it?\nOur simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about roulette, from the rules of the game to betting combinations.\n• 3D GRAPHICS – An absolutely free roulette game with stunningly realistic 3D graphics.\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\n• SINGLE ACCOUNT – Start playing free roulette on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.\n\nWant more than roulette?\nTry our other games for an unforgettable 3D experience: \n• TEXAS HOLD'EM POKER – The most popular casino game among professional gamblers! Test your skills in our amazing weekly poker tournaments!\n• SLOTS – Explore our themed slots with lots of unique features!\n• BLACKJACK – A simple game of \"21\". An exciting 3D game that any blackjack fan is sure to enjoy.\n• OMAHA POKER – A more dynamic version of poker, with 4 cards in your hand. Have more fun with amazing combinations!\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\n\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!\nhttps://facebook.com/Pokerist\n\nFollow us on Twitter and get free chips!\nhttps://twitter.com/KamaCasino\n\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-04-22T17:29:17Z",
  "updated": "2020-05-05T09:02:18Z",
  "releaseNotes": "Stay home. Be safe!\nWe've planned a lot of new features for you to enjoy!\n\nNew VIP System\nVIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!\n\nWeekly Rankings\nCompete against other players and see how you rank each week!\n\nNow MTT starts every 40 minutes!\n\nQuicker Betting\nTry raising a bet and you'll find a new option to bet 1/2 or the full pot! Raise faster!\n\nImproved navigation in the lobby—now you can view playing tables in a chart.",
  "version": "32.6",
  "price": 0,
  "developer": "KamaGames",
  "score": 4.60354,
  "reviews": 903,
  "currentVersionScore": 4.60354,
  "currentVersionReviews": 903,
  "searchTerms": "blackjack"
 },
 {
  "appId": "uk.pokerstarsmobile.www",
  "title": "PokerStars Online Poker Games",
  "description": "PokerStars Mobile: get ready to play poker with millions of players. With Texas Hold’em, Omaha and more, now’s the time to enter the world of online poker. \n\nHOW TO ENJOY OUR POKER GAMES\n\nDownload the app. Create your account. Make a deposit to start playing. It’s that easy to join the action. With hundreds of games to choose from, in traditional and unique formats, it’s time to start playing real poker with real people. \n\nNew to poker? Read more about how to play poker on our site (https://www.pokerstars.uk/poker/) or visit our Poker School for free lessons, advice, and the chance to win free tickets for must-play tournaments:\nhttps://www.pokerstarsschool.com/\n\nNeed help with your account? Our Support team is on-hand to bring you the best experience possible. Visit the Help Centre to get started.\nhttps://www.pokerstars.uk/help/\n\nENJOY REAL MONEY POKER GAMES ALL DAY LONG\n\n- Ready to challenge for real money prizes? Kick-start your real money adventure with £20 extra play. This exclusive welcome offer is open to new players. Here's how to claim:\n•\tVisit the Cashier\n•\tMake a first deposit of £10 or more\n•\tUse bonus code 'TWENTY' when you deposit\n\n- Play online poker games with the world’s largest community of real poker players. Join the biggest - and best - online poker games including Texas Hold'em tournaments. Enjoy promotions you won’t find anywhere else.\n\n- From Texas Hold'em to Omaha, PokerStars offers the widest selection of games anywhere online. For more on all our games, visit our site: \nhttps://www.pokerstars.uk/poker/games/\n\n- Experience unique poker formats\n•\tUnforgettable Tournaments: Play the largest number of multiplayer tournaments anywhere online. Battle for huge guaranteed prize pools.\n•\tSit & Go's On-Demand: Looking for a quick tournament? Hit the Sit & Go's, where the action starts as soon as enough players have registered. \n•\tOne-of-a-kind Zoom: Try the fast-paced poker game format where opponents change every hand.\nFind out more here: \nhttps://www.pokerstars.uk/poker/tournaments/\n\nSPORTS BETTING AND CASINO GAMES \n\n- Poker. Casino games. Sports betting. PokerStars Mobile offers them all in the same app. So, you can add to the action by placing a bet or trying the latest Slots while you’re playing poker.\n\n- Bet on over 30 different sports with great odds on leagues from around the world.\n\n- Choose from hundreds of casino games, including:\n•\tClassic and themed Slots\n•\tExclusive Slots with unique jackpots\n•\tVariety of Blackjack games\n\nAccept push notifications to make sure you never miss out on our great promotions.\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at www.begambleaware.org or 0808 8020 133.\n\n\n******************************************\n\n£20 Free Play Promotion Terms and Conditions\n\n•\tOffer only available to players who have never made a real money deposit of £10 or more \n•\tThe £20 Free Play will be credited daily from deposit date: Day 1 = 5 x $1 tickets, Day 2 = 5 x tickets, Day 3 = 5 x $1 tickets, Day 4 = $5 cash bonus, Day 5 =5 x $1 tickets, Day 6 = $5 cash bonus\n•\tWe reserve the right to withhold rewards if there is reason to suspect that a deposit is fraudulent, or that it has not been made with the intention of using it to play real money games\n•\tAll tickets issued as part of the £20 Free Play promotion expire 21 days from issue \n•\tAny unused tickets issued as part of this promotion will be forfeited \n•\tTickets cannot be redeemed for cash or any other value, or be transferred \n•\tDuring the bonus period, you are not permitted to cashout the bonus amount. For the avoidance of doubt, you may withdraw any deposit funds you have made (or winnings from same) at any time.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-11-04T19:14:01Z",
  "updated": "2020-05-01T21:27:43Z",
  "releaseNotes": "Performance improvements and bug fixes",
  "version": "3.28.4",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.52927,
  "reviews": 34712,
  "currentVersionScore": 4.52927,
  "currentVersionReviews": 34712,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.funstage.gta",
  "title": "GameTwist Online Casino Games",
  "description": "Play some of the most legendary slots in the ultimate casino for Novoline slot machines! Enjoy Book of Ra, Sizzling Hot, Lucky Lady's Charm and many more popular slots & casino games in the GameTwist online casino! Play these exciting games whenever you want and wherever you are on your smartphone and tablet. In addition to slot machines, you can also play real casino classics such as roulette or blackjack! \n\nThe GameTwist app also provides you with a wealth of exciting Challenges to enjoy your favourite casino games and earn exciting rewards. From Spin Challenges to Stake Challenges and much more, spinning the reels is extremely rewarding on GameTwist! \n\nOne of the most popular features on GameTwist are our Leaderboard games that allow you to compete against other players in our community and fight for top positions and huge rewards! \nOr how about linked jackpots or promotions with Free Spins? There are many ways to have fun at GameTwist Casino!\n\nHere are just a few of our top titles:\n- Book of Ra™ \n- Faust™ \n- Lucky Lady’s Charm™ deluxe \n- Sizzling Hot™ deluxe\n- Roaring Forties™\n- Reel King™\n- Book of Ra™ deluxe\n- Dolphin’s Pearl™\n- Fruit Sensation™\n- Just Jewels™ deluxe\n- Dolphin’s Pearl™ deluxe\n- Ultra Hot™ deluxe\n- Lord of the Ocean™\n- Mystic Secrets™\n- Pharaoh’s Tomb™\n- Fruits’n Royals™\n- Golden Sevens\n- Fruits’n Sevens™\n- Golden Ark\n- Gorilla™\n- African Simba™\n- Katana™ \n\nAlso included in our gaming universe: \n\n+++ Legendary table games from Poker to Roulette to Blackjack +++ Hugely popular skill games like Pool and Solitaire +++ Bingo in a range of exciting variations +++\n\nAnd then there are our extra features: Daily Bonus (Wheel of Fortune game), Time Bonus, level system, VIP Club, special holiday promotions, leaderboard games, slot battles and much more! \n\nReady to become part of a vast community and take your gaming fun to the next level? \nThen get the GameTwist app now!\n\nPlease note: \nGameTwist is a free online game of chance for entertainment purposes only. It is not possible to win real money or real items/services/gifts or goods in kind by playing our slot machines. The virtual currency used in this game is called ‘Twists’ and can be purchased in the ‘Shop’ using real money. ‘Twists’ cannot be exchanged for cash or be paid out in any form. ‘Twists’ can only be used to play these games. The games are intended solely for an adult audience which is 18+ years.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2011-12-12T11:07:15Z",
  "updated": "2020-04-28T09:14:30Z",
  "releaseNotes": "Hi GameTwist Fans!\nHere's a new update with fixes to improve your game experience!\nEnjoy playing the GameTwist App? Then please consider rating us. Your feedback counts!",
  "version": "5.20.1",
  "price": 0,
  "developer": "Funstage Spielewebseiten Betriebsges.m.b.H.",
  "score": 4.58424,
  "reviews": 1751,
  "currentVersionScore": 4.58424,
  "currentVersionReviews": 1751,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.smallscreencasinos.thephonecasino",
  "title": "Play Slots at The Phone Casino",
  "description": "At The Phone Casino, we don't believe in phoney cash bonuses, we believe in giving all players FREE SPINS that can be spun into CASH PRIZES and withdrawn with NO WAGERING REQUIREMENTS.\n\nThe Phone Casino brings you all of your favourite REAL MONEY CASINO games straight to your iPhone or iPad.\n\nPlay favourite Slots like;\n- Monopoly\n- Rainbow Riches\n- Foxin' Wins\n- Reels of Luck\n- Kings of Cash\n- Irish Eyes\n- Bingo Billions\n\nPlay classic casino table games like;  \n- Blackjack\n- Roulette\n- Bacarrat \n- Video Poker\n\nOr enter our LIVE CASINO to play; \n- Blackjack\n- Roulette\n- Bacarrat\n- Casino Hold'em\n\nLooking for an alternative to casino games?  How about our enormous range of INSTANT WIN Games like KENO, SCRATCH CARDS or SKILL GAMES?  \n\nDaily Slots Freeroll Tournament: \nEvery day, we give players one entry into our daily freeroll tournament.  Place in the top 20 to win cash you can either use on other games or withdraw with NO WAGERING REQUIREMENTS.  The choice is yours.  Players can also win prizes like iPhones, computers, TV’s, VIP holidays or the chance to win £1 million….that’s right £1 million.  Its that simple!\n\nWith 100's of games and new games added weekly, there's plenty to do at The Phone Casino.\n\nWe offer fast, secure, encrypted deposits and withdrawals and you can even top up using your mobile, debit card. credit card, Paysafe or Skrill.\n\nWhat are you waiting for? Download today!\n\nWe’d love to hear from you, so please rate us here in the App Store.  Or, if you’re not 100% satisfied feel free to email \nsupport@smallscreencasinos.com and we’ll happily help you. Or follow us on Social here\n\nwww.facebook.com/PhoneCasino/\nTwitter - @thephonecasino\nwww.instagram.com/thephonecasino\n\nThe Phone Casino is licensed by the UK Gambling Commission and the Alderney Gambling Control Commission. All communications are encrypted making The Phone Casino a safe, secure and trusted. UK Gambling Commission, licence number: 000-039397-R-319363-002.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-04-24T15:58:29Z",
  "updated": "2018-12-11T13:46:06Z",
  "releaseNotes": "We’ve updated our bonus system to enable users to cash out all bonuses with no wagering requirements. Plus, we’ve also added enhanced ID document security to keep players even more safe and secure.",
  "version": "3.0",
  "price": 0,
  "developer": "SmallScreenCasinos Ltd",
  "score": 2.35417,
  "reviews": 48,
  "currentVersionScore": 2.35417,
  "currentVersionReviews": 48,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.secondgamestudio.casinomaster",
  "title": "Casino Master - Slots Poker",
  "description": "Want to win the casino?\nWant to learn the best strategies of winning?\nWant to be the Master of the casino in the world!\nCasino Master is what you want!\nIt's not just a game\nbut the best and the most useful casino training app in store!\n\nGame Features:\n- 9 different Games\n3 card Poker, Baccarat, Black Jack, Caribbean Poker, \nKeno, Roulette, Sicbo, Slot Machine & Video Poker (More games coming)\n\n- Game Strategy\nProvide full Statistics, Strategy and Tips of each games.\nhelp you to train your skill with realistic gameplay.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2011-11-23T23:09:19Z",
  "updated": "2018-08-18T00:11:56Z",
  "releaseNotes": "Performance Improvement",
  "version": "1.13",
  "price": 0,
  "developer": "Taplay Limited",
  "score": 3.37037,
  "reviews": 27,
  "currentVersionScore": 3.37037,
  "currentVersionReviews": 27,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.coderedman.blackjack88",
  "title": "Blackjack 88",
  "description": "Blackjack 88 is the BIG card one deck Blackjack game. Designed for your device rather than a table. It has great animation and beautiful retina graphics. It's bright, easy to play and FREE to download.\n\n\"Best blackjack app in the store! 5 Stars\" - hexdump1979\n\nThe game features: \n\n+ Large realistic playing cards with 3D table. \n+ Full support for splitting to four hands. \n+ Fast smooth play. \n+ Configurable table colors and card backs.\n+ One deck game. \n+ Uses trusted shuffling algorithm - there is no \"fixing\" here! \n+ With the optional (IAP) Basic Strategy Guide recommended plays are built right in.\n+ With optional (IAP) Infinite Chips if you run out of virtual chips you are topped back up again immediately and for free. \n+ Game Center support so you can compare with your friends. \n+ Listen to your own music via iPod or other background app. \n+ No adverts. \n\nNOTE: Blackjack 88 has free chips to start you off. If you run out you'll get more chips, completely FREE, 20 minutes later. You can optionally buy larger amounts of chips anytime. But, it is possible to play completely free forever!\n\nEnjoy and good luck!",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2011-03-23T03:10:57Z",
  "updated": "2018-04-28T04:17:03Z",
  "releaseNotes": "This update fixes the mute option for sounds effects that is affecting users of iOS 11.3.",
  "version": "6.4",
  "price": 0,
  "developer": "Code Redman Ltd",
  "score": 3.33333,
  "reviews": 3,
  "currentVersionScore": 3.33333,
  "currentVersionReviews": 3,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.coldfiregames.idle.casino.tycoon",
  "title": "Idle Casino Manager",
  "description": "Rule your casino and become the richest manager!\n\nAre you ready to run a huge gambling establishment?\n\nStart with a small casino and work hard to make your business grow. Add new games to create an exciting experience where visitors can play poker, roulette, blackjack or try their luck at the slot machine.\n\nManage your cocktail bar and exchange booth wisely to earn money. Expand the Casino with new floors and unlock the most amazing games and machines.\n\nImprove the attractions of your casino with an all-new poker table, a golden roulette ball or new games for the arcade machines. Scale up your parking lot and launch marketing campaigns to get even more visitors to your gambling establishment.\n\nAs you slowly become a huge casino tycoon you'll need to hire new employees or raise their salaries as your business grows. The decision where to invest your hard-earned money is all yours. Will you unlock new games first? Or would you like to further improve the ones you already got? There are different ways to achieve glory but which one is the best for your establishment?\n\nIf you like management and idle games, you’ll enjoy Idle Casino Manager. Although it's an easy-to-play game it takes all your strategic decisions into account. Invest your money wisely and transform your small business into a huge Las Vegas-like casino!\n\nFeatures:\n► Easy-to-play game for every player\n► Take important business decisions.\n► Many different games available.\n► No internet connection needed. Play offline anywhere, anytime.\n► Make important managing decisions to expand your establishment\n\nBecome the biggest casino tycoon the world has ever seen!\n\nWhat are you waiting for? Play now!\n\nDo you have any Ideas, praises or problems?\nJust drop us a message: support@coldfiregames.com\nOr via Facebook: https://www.facebook.com/IdleCasino\nWebsite: https://coldfiregames.com\n\nYour Idle Casino Manager team",
  "genres": [
   "Games",
   "Simulation",
   "Strategy",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2019-12-12T08:00:00Z",
  "updated": "2020-05-01T01:29:11Z",
  "releaseNotes": "- Minor Bugfixes\n\nWe'd love to hear your feedback\nFacebook: http://www.fb.me/IdleCasino\nDiscord: https://discord.gg/KyR4Mzn\nSupport: support@coldfiregames.com",
  "version": "1.9.1",
  "price": 0,
  "developer": "ColdFire Games",
  "score": 4.74437,
  "reviews": 489,
  "currentVersionScore": 4.74437,
  "currentVersionReviews": 489,
  "searchTerms": "blackjack"
 },
 {
  "appId": "cr.Technology.BlackJack",
  "title": "Black Jack Training",
  "description": "Black Jack Training\n\nTrain yourself to play Blackjack\nDiscover your lucky numbers referring to the section \"Statistics\".",
  "genres": [
   "Games",
   "Simulation",
   "Entertainment",
   "Card"
  ],
  "contentRating": "4+",
  "released": "2013-12-03T01:44:22Z",
  "updated": "2016-05-25T23:11:48Z",
  "releaseNotes": "IOS 9.3\nBug fix",
  "version": "2.1",
  "price": 0,
  "developer": "CRT Technology",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.barakedry.yaniv",
  "title": "Yaniv",
  "description": "Yaniv is probably the best card game you've never heard of!\nIt offers quick and challenging fun with uniquely addictive gameplay.\nIt's very easy to learn, and has a great balance of strategy and luck.\nOptimized for single hand use, Yaniv is perfect for quick sessions. \nEnjoy online matchmaking matches and climb the leaderboards! \n\nThe objective of the game is to earn the fewest points in each round. The player with the fewest points at the end of the game is the winner.\n\nHOW TO PLAY\n- Reduce your hand’s value at all costs.\n- Outsmart your opponents with wits, intuition and pre-planned strategies, .\n- Discarding sets of equal ranking cards and sets of consecutive cards of the same suit to effectively lower your hand value.\n- When you think you have the lowest hand, call “YANIV!”\n- All players reveal their cards\n- If your hand's value is the lowest, you win the round and your opponents get their hand value in points (points are bad).\n- Be careful, if you call “YANIV” and an opponent has a lower hand you lose and get 30 penalty points on top of your hand value!\n\nFEATURES.\n- An easy to follow, Step-by-Step tutorial introduces new players to the game.\n- Play online with thousands of players around the world.\n- Play offline against smart and challenging computer opponents\n- Invite your friends and challenge up to 3 players at once.\n- Chat with friends and connect with leaderboard support for online matches.\n- Earn 40 fun and exciting achievements.\n- Today and All-Time leaderboards.\n- Access player profiles by tapping on a player's name in an online match.\n- Additional difficulty levels, game statistics, and modes are available.\n- 3 Difficulty levels (Pro difficulty for Pro users only) & fully customizable game settings.",
  "genres": [
   "Games",
   "Card",
   "Travel",
   "Casino"
  ],
  "contentRating": "4+",
  "released": "2011-06-01T00:51:07Z",
  "updated": "2019-10-17T22:41:25Z",
  "releaseNotes": "- Fixed a tutorial issue when running on dark mode",
  "version": "2.2.3",
  "price": 0,
  "developer": "Barak Edry",
  "score": 4.6574,
  "reviews": 108,
  "currentVersionScore": 4.6574,
  "currentVersionReviews": 108,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.bskyb.SkyVegas",
  "title": "Sky Vegas: Casino Games",
  "description": "Sky Vegas is the ultimate destination for new, exclusive and exciting online slots. Download the Sky Vegas app to enjoy exclusive games, head-turning bonuses and offers, and the thrill of the unexpected, wherever you choose to play.\n\nEvery spin at Sky Vegas is another chance for a bonus game to kick in, a line to win or a jackpot to hit – the best bit is it could happen at any moment.\n\nSigning up is quick and easy. If you already have an account with Sky Vegas, Sky Bet, Sky Casino, Sky Poker or Sky Bingo, you can log in with your existing account details and discover all that Sky Vegas has to offer!\n\nPlay your way… \nOur app gives you complete control over your gameplay as you can…\n\nManage your account within the app\nRegister and log in\nRecover login details\nAdd payment details \nDeposit and withdraw funds \nView your account history\nAccess help & support\nUse Apple Pay to deposit quicker and easier than ever before\n\nSee this link for details on how to set up Apple Pay on your device: https://support.apple.com/en-gb/HT204506\n\nLike us on Facebook at: https://www.facebook.com/SkyVegas/\n\nFollow us on Twitter at: @skyvegas\n\n18+, BEGABLEAWARE.ORG\n\nPlease note all app images / previews shown here are for illustrative purposes only. Live promotions and offers on Sky Vegas may differ to those shown. See skyvegas.com for full details.\n\nResponsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support in the United Kingdom please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/ and in Ireland please contact Gamble Aware at 1800 753 753 or visit http://www.gambleaware.ie/\n\nThe Sky Vegas app is brought to you by Bonne Terre Limited, an Alderney registered company, and member of a group of companies known as “The Stars Interactive Group”.  Bonne Terre Limited is licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Vegas is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group of products. The Sky trademarks used in the app are owned by the Sky UK Group and are used under license. To place a bet with Sky Vegas you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Vegas. Customers located outside of the UK or Ireland will be prohibited from using this app.\n\nPlease Note: Apple Inc. is in no way linked or associated with this or any other competition / contents run in this app.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-01-11T10:07:40Z",
  "updated": "2019-08-05T09:42:19Z",
  "releaseNotes": "Maintenance release with bug fixes to keep Sky Vegas running as smoothly as possible for you.",
  "version": "2.9.0",
  "price": 0,
  "developer": "Sky Betting & Gaming",
  "score": 4.62579,
  "reviews": 3319,
  "currentVersionScore": 4.62579,
  "currentVersionReviews": 3319,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.yesgnome.blackjack",
  "title": "Blackjack-black jack 21 casino",
  "description": "MOST popular Blackjack game on the store.This is a free Blackjack game that you can play against the dealer. The game is designed for both the iPhone and iPad. Play Black jack against the dealer and see who can WIN by getting 21 without going bust! \n\n\t•\tBest blackjack trainer which helps you in real time casino.\n\t•\tTheme specific cards, HD graphics.\n\t•\tEasy and fun to play.\n\t•\tInteractive game play with voice overs.\n\t•\tPlay multiple hands against the dealer.\n\t•\tTap or drag to place the bet.\n\t•\tTap to split your cards \n\t•\tChoose between different table themes .\n\t•\tBlackjack casino rules pays 3 : 2 \n\t•\tInsurance: pays 2:1 if the dealer has Blackjack .\n\t•\tHit: Take another card from the dealer.\n\t•\tDouble : The player is allowed to increase the initial bet by up to 100% in exchange for committing to stand after receiving exactly one more card. \n\nThere's always more! Our team is already developing content for our next major update! \nThis game is for amusement purposes only & is intended for use by players 21 and over.\n\nPrivacy Policy: http://yesgnome.com/privacy-policy/\nTerms of service: http://yesgnome.com/terms-of-service/",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-03-08T12:36:54Z",
  "updated": "2020-04-02T11:10:39Z",
  "releaseNotes": "Bug Fixes & Performance Improvements",
  "version": "2.6.1",
  "price": 0,
  "developer": "YesGnome Gaming Solutions",
  "score": 4.90909,
  "reviews": 11,
  "currentVersionScore": 4.90909,
  "currentVersionReviews": 11,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.egogames.21jack",
  "title": "21 Jack - Real Money BlackJack",
  "description": "21 Jack is a mix of Blackjack and Solitaire. A modern version with eSports competitions.\n \nCompete in multiple tournaments and head-to-head competitions with cash prizes *where available *\n\nSome key features:\n\n- Make 21s or stacks of 5 cards to get points.\n- It only takes 5 minutes to win a competition.\n- Get the best score and take advantage of the combos you get.\n- Different competition halls.\n- Attractive game modes that allow you to earn money in just 3 minutes.\n- Play for free as long as you want without constantly sitting through ads.\n\nNo longer a solitary experience!\n \n• Enjoy our different tournament modalities (Scoring Tournaments, Personalized Code Tournaments and Live Streaming Tournaments) where you can access to much bigger premiums apart from economic prizes. \n• Add any user as a friend and challenge him directly. Challenge your friends and show who the champion is by winning the prize!\n• Our monthly league will give all eGoGames users the option to win incredible. In this way, everyone starts the month with the same opportunities to win the succulent prize pool, which does not stop increasing with each game played as the delivery of the prize pool approaches! \n• Cash tournaments are available in about 70% of the world. Cash tournaments are not enabled in the following States AZ, AR, CT, DE, FL, IL, LA, MD, MT, SC, SD, and TN. If you don't live in a cash-enabled region, you can still play for fun with our virtual currency.\n\nChallenge people around the world with eGoGames, a competition platform complete with leaderboards, trophies, Cash or free virtual currency prizes.\n \nIf you have any questions, feel free to reach us at support@egogames.com\nAny questions regarding the eGoGames system or cash tournament please let us know.",
  "genres": [
   "Games",
   "Entertainment",
   "Casual",
   "Strategy"
  ],
  "contentRating": "17+",
  "released": "2019-10-11T07:00:00Z",
  "updated": "2020-05-01T09:44:47Z",
  "releaseNotes": "Improved First Time Experience. Bug fixing",
  "version": "1.7",
  "price": 0,
  "developer": "eGoGames",
  "score": 5,
  "reviews": 8,
  "currentVersionScore": 5,
  "currentVersionReviews": 8,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.bwin.casino",
  "title": "bwin Online Casino Games",
  "description": "Download the new bwin Casino app and grab your Welcome Bonus!*\n\n\nEnter the new bwin Casino and play slots, Roulette games and Blackjack. Beside these classics, we offer lots of different casino games and great promotions. So make your start into the exciting world of our bwin Casino and why not try to crack the casino jackpot, or get cashback!\n\nThis is what awaits you in our bwin Casino:\n\n•\tPlay Blackjack and Roulette games – various versions of these classic casino games are right at your fingertips. Simply select your favourite and start playing for real-money stakes at our casino!\n•\tLive Casino with Live Dealers: no need to suit up, simply log in hit the tables and play Blackjack & Roulette games with our gorgeous Live Dealers. \n•\tWe’ve optimised the interface of the bwin Casino app. What awaits you is an easier navigation and new bonus notifications – so you’ll never miss out on your chance to play for real-money stakes at the bwin Casino.\n•\tIn the new “Recently played” category of the bwin Casino, you can find your favourite casino games even faster.\n•\tA large collection of proprietary casino games - and also from industry leaders like NetEnt and Evolution. \n•\tHead over to the “Top Games” tab for our popular casino games. New slots online? Want to play Blackjack? Updated Roulette games available? How heavy is the current casino jackpot? Where can I get the next slot bonus? Here’s the right place to stay informed. \n\nConvinced? Then download the bwin Casino app now and enter the thrilling world of our online casino games! For players who have a bwin account already, it’s easy to update or install the new bwin Casino app and start playing. For all new customers, there is a casino Welcome Bonus worth up to €200 waiting for you. So download, open a bwin account, deposit, play for real-money stakes at the bwin Casino and grab your casino bonus on the way!\n\nKnow your limits\nNo matter how much you love playing casino games, everyone needs to know their limits. \nYou must be 18 years of age or over to use the bwin Casino application.\n\n*For the full promotional Terms and Conditions, please follow this link: https://casino.bwin.com/en/casino/p/promotions/6000/65/6581 (the “T&Cs”)\n\nOnline Support:\nhttps://www.bwin.com/en/account/contact",
  "genres": [
   "Entertainment",
   "Casino",
   "Games"
  ],
  "contentRating": "17+",
  "released": "2015-01-14T01:16:19Z",
  "updated": "2018-06-18T05:54:24Z",
  "releaseNotes": "Thanks for using bwin! To make our app better for you, we bring updates to the App Store regularly. Every update of our bwin app includes improvements in speed and reliability. As new features become available, we’ll highlight those for you in the app.",
  "version": "18.05.06",
  "price": 0,
  "developer": "ElectraWorks Limited",
  "score": 4.66474,
  "reviews": 173,
  "currentVersionScore": 4.66474,
  "currentVersionReviews": 173,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.ladbrokes.pt.livecasino",
  "title": "Ladbrokes Live Casino Games",
  "description": "Fix up, look sharp for the banging full Live casino experience, all on the go. The new Ladbrokes Live Casino app allows you to take on the dealer wherever you are ! \n\nOur Live Casino provides all the thrill of a high-end casino with none of the hassle. Get ready for Live Roulette, Live Blackjack, Live Baccarat and more against a real dealer in the comfort of your own home.\n\nWe’ve got over 60 exclusive Live Casino dealers, who all add their own flavour to proceedings. With our new and improved app, you can ‘Pin’ your favourite dealers and tables. They’ll be right there for you when the app opens. \n\nOur studio design puts you at centre stage with its truly immersive experience. And now you can see a video preview and real-time info of every Live Casino table before you play.\n\nBut don’t worry, you’ll still get top-notch service from our live dealers, stunning HD graphics and unbeatable gameplay!  \n\nIt’s the Laaaaaaaaaadbrokes Live Casino you already know. But even better.\n\n\nUnique Features: \n\n•\tSlick new studio design offers enhanced realism and immersion\n•\tVideo preview and real-time information for every table\n•\tDynamic HD cameras bring the action to life on our exclusive Live \n        Roulette and Live Blackjack tables\n•\tLive Casino dealers\n•\tExclusive offers for Ladbrokes players\n•\tSimple sign-up process\n•\tSuperfast performance, whether you’re connected over wifi, 3G or 4G\n•\tSpecially designed for iOS and Apple products\n•\tLog in and play with your existing Ladbrokes Casino username and \n        password\n•\t24/7 Customer Service \n\n\n\nWe’re confident you’ll love the Ladbrokes Live Casino app, but if you find something that you think we can improve, send your feedback to reviewladbrokes@ladbrokes.com \n\n18+, Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please see below contact details for Gamble Aware in both UK and Ireland.\n\nUK: https://www.begambleaware.org and 0808 8020 133\n\nIreland: https://www.problemgambling.ie and 1800 753 753\n\nLadbrokes Betting & Gaming Ltd. is licensed (licence no. 1611) and regulated by the British Gambling Commission for persons gambling in Great Britain and LC International Limited, Suites 6-8, 5th Floor, Europort, Gibraltar are licensed (RGL Nos. 010, 012) by the Government of Gibraltar and regulated by the Gibraltar Gambling Commissioner.\n\nCopyright © 2018 Ladbrokes\n\nThis App is not endorsed or sponsored by Apple for any of its contests or sweepstakes within this app and is solely the responsibility Ladbrokes Betting & Gaming Ltd. © 2018 Ladbrokes",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-04-28T07:00:00Z",
  "updated": "2019-09-25T07:04:14Z",
  "releaseNotes": "Play HD live casino games such as Blackjack, Roulette, Baccarat and more from the comfort of your home with a real live dealer!\nIn this version:\n- Stability improvements\n- Bug fixes\nThe thrills of table games await you - only at Ladbrokes Live Casino Games App.",
  "version": "18.48",
  "price": 0,
  "developer": "Ladbrokes Sportsbook LP",
  "score": 4.63873,
  "reviews": 346,
  "currentVersionScore": 4.63873,
  "currentVersionReviews": 346,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.32red.casino",
  "title": "32Red Casino & Slots",
  "description": "The award-winning casino, 32Red, presents the best mobile real money casino app straight to your iOS device and other smartphones... Play a huge range of casino games all under one app, including the latest slots and old favourites like Roulette and Blackjack - you can also take a seat at the live tables too!\n\n◆◆JOIN TODAY TO CLAIM £10 ABSOLUTELY FREE – NO DEPOSIT REQUIRED◆◆ \n\nExperience the thrill of a casino right in the palm of your hand, with over 150 top quality games available, fantastic daily bonuses and the chance to win life changing jackpots! The multi-award winning 32Red Casino has it all. \n\nInstall the app today and not only will new customers get £10 absolutely free – but you can also take advantage of our exclusive first deposit bonus! What are you waiting for? Win real cash today!\n\n32Red Games & Features:\n\n◆ Play new and exclusive slots only at 32Red including Ant & Dec’s Saturday Night Takeaway™ and I’m A Celebrity… Get Me Out Of Here!™\n\n◆ Get the very best real Roulette experience straight from your device, our Live Roulette tables provide the full package - expert, friendly dealers and an exciting real-time environment.\n\n◆ Enjoy our selection of Live Blackjack tables which take the game to a new level of excitement, realism and fun.\n\n◆ Play classics such as European Roulette & Blackjack, the mainstay of all top casinos.\n\n◆ Huge Progressive Jackpot slots such as Megah Moolah (guaranteed £1 million) and Major Millions, with life changing sums up for grabs.\n\n◆ Round the clock help from an award winning player support team.\n\n◆ The very best VIP experience… Become casino royalty!\n\n\n32Red Bonuses:\n\n◆ Get industry leading promotions - from welcome bonuses, daily offers, leaderboards and tournaments… It’s all covered for both new and existing players!\n\n\n◆◆Install the 32Red app today for the very best casino experience!◆◆ \n\nWelcome bonuses apply to new accounts only. Wagering and terms apply. 18+. Begambleware.org.\n\nAnt & Dec © is a registered trade mark of Anthony McPartlin and Declan Donnelly. SATURDAY NIGHT TAKEAWAY™ & © ITV Studios Limited 2018. Licensed by ITV Broadcasting Limited. All rights reserved.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-01-10T22:44:10Z",
  "updated": "2018-05-25T00:17:14Z",
  "releaseNotes": "Thank you for using the 32Red Casino app – we’ve added some fantastic features to this new update to give you the very best gaming experience!\n \n◆ LATEST RELEASES – With over 150+ games already we don’t want to stop there. We’ve added some more thrilling games to keep you entertained including Highlander™ & Deco Diamonds – packed to the brim with exciting features and each offering you the chance to win whopping payouts!\n \n◆ PROMOTIONS – Cash in on some of our latest promotions available to our app players. From leaderboards to free game giveaways – it’s all covered!\n \n◆ SPEED – It’s quicker than ever before… Play your favourite games seamlessly and enjoy the thrills of the casino on all iOS devices",
  "version": "2.1.1",
  "price": 0,
  "developer": "32Red",
  "score": 1.98684,
  "reviews": 228,
  "currentVersionScore": 1.98684,
  "currentVersionReviews": 228,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.cosmicforces.goosebumps",
  "title": "Goosebumps Night of Scares",
  "description": "VR compatible! - Featuring Jack Black as the Voice of R.L. Stine\n\n***GOOSEBUMPS’ GREATEST MONSTERS COME TO LIFE! WILL YOU SURVIVE?***\n\nThe bestselling horror series comes to life on mobile for the first time and features Goosebumps most frightening monsters, including Slappy the Dummy, evil gnomes, werewolves, and more. Can you survive a night in R.L. Stine’s house - a living trap filled with his most famous monsters? Mystery, madness, and frightening moments await!\n\n****HIGHLIGHTS****\n\nThe first-ever Goosebumps game for Smart Phones and Tablets.\n\nGoosebumps’ greatest monsters come to life, including Slappy the Dummy, evil gnomes, werewolves, and more.\n\nJump scares galore! Play a terrifying survival game of hide-n-seek with Goosebumps’ most feared villains.\n\nHide to survive! Learn the secrets of R.L. Stine’s mysterious house to avoid being detected.\n\nSolve the mysteries! Collect pages from R.L. Stine’s most famous books to trap monsters.\n\nVirtual Reality mode: Place your phone in a VR-compatible headset to get even closer to the action! Compatible with any Smart Phone-compatible VR headset.\n\nStop Slappy from unleashing havoc, but beware of the TWIST that may lead to your doom. \n\n*** READ THE BOOKS. SEE THE MOVIE. PLAY THE GAME!***\n\nGoosebumps TM Scholastic. Movie © 2016 CPII. Game code © 2016 Cosmic Forces, Inc. All Rights Reserved.\n\nGame Developer & Publisher: Cosmic Forces\nGame Developer: Free Range Games",
  "genres": [
   "Games",
   "Action",
   "Adventure"
  ],
  "contentRating": "9+",
  "released": "2016-01-12T03:10:43Z",
  "updated": "2018-06-12T16:45:52Z",
  "releaseNotes": "Bug Fixes, Improved Language Support",
  "version": "1.3.7",
  "price": 0,
  "developer": "Cosmic Forces",
  "score": 4.28009,
  "reviews": 432,
  "currentVersionScore": 4.28009,
  "currentVersionReviews": 432,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.avalinx.pro21universal",
  "title": "Blackjack Pro: 21 Vegas Casino",
  "description": "Do you love blackjack? We do! 21 Pro provides the most beautiful and realistic blackjack experience in the App Store.\n\nFree chip reloads if you run out!\n\n- Play the best!\n- You can use gestures to control your actions!\n- Learn the mathematically correct strategy with our \"Mastering the Game\" lessons or by asking the dealer\n- Learn how to count cards like the pros...then you can really take it to the casinos!\n- See how you rank up against everyone else, or challenge your friends in Game Center\n- Customize the rules to your liking. You can even customize the table and cards!\n- See detailed statistics about your play\n\nThe Fun Vegas Casino Experience on the go!  Don't forget to check our Slots, Slot Machine and other casino apps, including blackjack, roulette, craps and poker.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-10-23T19:15:45Z",
  "updated": "2018-02-19T20:26:55Z",
  "releaseNotes": "- Bug Fixes\n\nIf you have a problem or have feedback you want us to respond to, please contact us via email at Customer.Care@AvalinxStudios.com. \n\nAnd please don't forget to submit a Customer Review or a Customer Rating to share your feedback with the Community. This helps us to continue to enhance our applications. You can also keep an eye on what we are working on by checking out our Facebook page and liking us at http://www.Facebook.com/AvalinxStudios.",
  "version": "3.1",
  "price": 0,
  "developer": "Avalinx LLC",
  "score": 4.4,
  "reviews": 5,
  "currentVersionScore": 4.4,
  "currentVersionReviews": 5,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.puzzleartgames.snakeroad3d",
  "title": "Snake Road 3D: Hit Color Block",
  "description": "Welcome to this exciting and fun game full of colorful block to break and snakes to grow. And guess what? It's  all in 3D!\nThe concept of the game is quite simple jet challenging. Touch the screen to move the snake right or left. Try to avoid the obstacles standing in your way and break the blocks to get points, \nDon' forget to collects the bodies to increase the length of the snake. You can also unlock new awesome snakes and new environments full of traps. \n\nHow far can you go?\nHurry up and download the game today for free. You won't regret it. Have fun and enjoy!",
  "genres": [
   "Games",
   "Puzzle",
   "Word",
   "Photo & Video"
  ],
  "contentRating": "4+",
  "released": "2019-03-09T08:00:00Z",
  "updated": "2020-02-18T17:09:08Z",
  "releaseNotes": "- Improved the drag control sensitivity.\n- Overall performance improvements and enhancements.\n- Minor changes and bug fixes.",
  "version": "1.1",
  "price": 0,
  "developer": "Aljosha Pavshic",
  "score": 4.15,
  "reviews": 200,
  "currentVersionScore": 4.15,
  "currentVersionReviews": 200,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.gt.playbfc",
  "title": "Admiral Casino - Online Slots",
  "description": "Download the Admiral Casino app for FREE.\n\nPlay your favourite Admiral Casino, Astra & Novomatic slots on the Admiral Casino app, the most exciting mobile real money casino in the UK! A fantastic range of Casino games and Slot games, with the added bonus of a great Live Casino! Claim your 1st Deposit BONUS 100% up to £200!\n\nThe most popular slot games Cops ’n’ Robbers, Reel King ™, Book of Ra ™ Deluxe, Sizzling Hot™ and Lucky Lady’s Charm™ all in one app! \n\nAdmiral Casino has added classic slot favourites such as Rainbow Riches, Spartacus, Sevens to Burn and Monopoly slots. \n\nThe app comes with improved navigation, intelligent search, enhanced speed and performance. \n\nNow you can personalise your experience by using the favourite games feature; group all your favourite games in one location.  Games are optimised for all mobile devises, so you can enjoy a great Casino experience on the move.  \n\nFEATURES\n- Premium real money slots and casino games\n- New Slots and Casino game regularly launched\n- 1st DEPOSIT BONUS up to £200*\n- Easy registration\n- Jackpot slot games\n- Secure payment systems\n- One account for all devices\n- Dedicated customer support\n- Personalise your website with the Favourite Game feature \n- New intelligent search and recently played feature. \n\nREGISTER EASILY\n1: Download the Admiral Casino app for FREE\n2: Register (in less than 2 minutes) or log in with your existing Admiral Casino account\n3: Deposit and immediately get your welcome BONUS deposit match 100% up to £200*\n\n+++PLAY on our real money slot & casino games+++\nALL THE MOST POPULAR GAMES IN ONE APP\n\nOriginal content from Admiral Casino, Astra, SG Gaming and Novomatic, including the most popular games in the UK & Ireland:\n- Reel King™\n- Cops ’n’ Robbers\n- Lucky Lady’s Charm™ Deluxe\n- Sizzling Hot™ Deluxe\n- Book of Ra™ Deluxe\n- Rainbow Riches\n- Monopoly\n- Rainbow Reels\n- Happy Fruits\n- Rainbow King™\n- Clockwork Oranges\n- Royal Crown Roulette European\n- Lord of the Ocean™\n- Wizard of Odds\n- Spartacus\n- Zeus \n- Just Jewels™ Deluxe… \nAnd many more!!\n\nSignificant Offer Terms and Condition\n*18+, new players only, 100% bonus on min. £10 deposit, 35X wagering on slots, other game types vary. T&Cs apply\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at (UK: 0808 8020 133 and Ireland: 1800 753 753) or visit (UK: https://www.begambleaware.org/ and Ireland: http://www.gambleaware.ie/).",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2015-01-20T22:13:09Z",
  "updated": "2018-06-07T08:18:19Z",
  "releaseNotes": "Great new games, including favourites like Rainbow Riches, Spartacus and Monopoly.\nGames are optimised for all mobile devices, so you can enjoy a great Casino experience on the move.\nNew faster app, improved navigation & intelligent search.\nBonuses that now start turning to cash in increments, making bonus waging much simpler and easier.\nNow you can personalise your experience by using the favourite games feature; group all your favourite games in one location.",
  "version": "5.0.1",
  "price": 0,
  "developer": "Greentube Alderney Ltd.",
  "score": 2,
  "reviews": 87,
  "currentVersionScore": 2,
  "currentVersionReviews": 87,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.bpgamesltd.vegasslots",
  "title": "Vegas Slots UK",
  "description": "Welcome to Vegas Slots, the Premier destination for Real Money Slots and Table Games.\n\nWe have all your favourite games from the biggest Casino suppliers including Blueprint, Big Time Gaming, Evolution, Netent and Playtech. Play Slots, Blackjack, Roulette or Face-off against Real Dealers at our exclusive Live Casino.\n\nBig stakes or Small we cater for all! We have games to suit everyone's appetite. With dozens of themes including Egyptian, Megaways, Mythical and Classic, you'll be spoilt for choice!\n\nLike a Bonus? Then good news, there's plenty to choose from. Just check out the app for the latest offerings. But please remember T&Cs apply, so make sure you take the time to read through the terms within the app.\n\nTo install and use this casino app, you must be 18 or over and a resident of the UK.\n\nNote: Vegas Slots is not a free-to-play Casino app. You are required to make real money deposits. You should only gamble what you can afford to lose. If you feel your gambling is getting out of control, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org. Please Gamble Responsibly.",
  "genres": [
   "Games"
  ],
  "contentRating": "17+",
  "released": "2020-02-22T08:00:00Z",
  "updated": "2020-02-22T17:31:49Z",
  "version": "1.0.5",
  "price": 0,
  "developer": "SolveIT LLC",
  "score": 4.72414,
  "reviews": 29,
  "currentVersionScore": 4.72414,
  "currentVersionReviews": 29,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.foxycasino.stage",
  "title": "Foxy Casino - Slots & Games",
  "description": "At Foxy Casino you can play all the best table, slots and Live Casino games plus win real money prizes with huge jackpots! Whether it’s Blackjack, Roulette, Starburst or any number of other games, the Foxy Casino app has you covered.\nDownload the app for your chance to experience the thrill of winning big.\nWhen the fun stops, stop.\n*TERMS & CONDITIONS\n• 18+ only\n• Players who join Think bingo agree to adhere to Company's general terms and conditions.\n• When The Fun Stops. Stop.\n• begambleaware.org\n--------------------------------------------------------\nThis app requires you to be over 18 in order to participate in any betting activity. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit begambleaware.org.\n \nWe're always happy to hear from you guys! If you have any feedback or questions please call us on 0800 376 7967 or email us at: support@foxycasino.com",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-03-03T23:55:57Z",
  "updated": "2018-09-14T09:16:12Z",
  "releaseNotes": "New and improved app",
  "version": "18.08.08",
  "price": 0,
  "developer": "Cashcade LTD",
  "score": 4.66714,
  "reviews": 703,
  "currentVersionScore": 4.66714,
  "currentVersionReviews": 703,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.bingo.tour.party.crazy.free.ios.avidly",
  "title": "Bingo Party - Bingo Games",
  "description": "Bingo Party is the Classic & Special Bingo Game with 8 CARD VERSION!  Wanna get more bingos? Wanna be more fun? Just play Bingo Party!\n\nGame Features:\n# Realtime multiplayer! Play with more than 10,000 players at a time!\n# Join elite to play up to 8 cards!\n# Over 30 bingo rooms! We will be rolling out more rooms!\n# 500 Tickets & 30 powerups to start off. Each day you have another 150+ tickets to continue the bingo trip. Don't miss it!\n# Your daily bonus will increase by your level up!\n# Complete kinds of puzzles to get BIG BONUS!\n# 7 types of power-ups - Help you get more bingos!\n# Daily Tournament - Complete other players to win big!\n# Achievement - Over 200 achievements to challenge. Complete to win!\nIf you love bingo and want to try a new one, Bingo Party is a good choice. Just have a rest out from other bingo games, we will not let you down!\nIf you love bingo and want to try a new one, Bingo Party is the good choice. Come experience the fantastic NEW BINGO game, we will not let you down!\nDon't Wait and download now, a new Bingo Party is waiting for you!\n\nPractice or success at social casino gaming does not imply future success at real money gambling. \n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n•The games are intended for an adult audience.\n***********************************************************************\n\nHave questions or suggestions about Bingo Party - Bingo Casino & Slots Games?\nEmail your questions to bingo@avid.ly.\n\nThank you for playing and have a wonderful bingo trip!",
  "genres": [
   "Games",
   "Board",
   "Casino"
  ],
  "contentRating": "12+",
  "released": "2017-08-10T01:53:14Z",
  "updated": "2020-04-30T16:03:50Z",
  "releaseNotes": "1. Bug fixed and game optimized.\n2. Newly added Advancement Pack for new players.",
  "version": "2.5.0",
  "price": 0,
  "developer": "Avid.ly",
  "score": 4.65123,
  "reviews": 10305,
  "currentVersionScore": 4.65123,
  "currentVersionReviews": 10305,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.hornetapps.blackjacktrainer",
  "title": "BlackJack Trainer PRO",
  "description": "Learn how to play BlackJack, when to Hit, Stand, Split, Double or Surrender. This application will teach you the game of BlackJack and how to play any hand, such that you maximize your chance of winning. \n\nBlackJack Trainer Features: \n* Hit, Stand, Split, Double or Surrender to the cards dealt \n* Get feedback on your decision \n* See the basic strategy table for the selected house rules \n* Learn to play like a professional \n\nThink of it as a school to become better at BlackJack.\n\nThis is NOT a blackjack game, but an application that teaches you the right play.\nThis application will NOT teach you how to count cards in a casino.\n\nReviews/Comments:\n* * * * * Very impressive. This really helped with all those hands at the casino that i always left up to chance. This app actually teaches you how to make money.\n* * * * *  Highly Recommend. This is great training tool for anyone interested in learning blackjack. BlackJack Trainer Rocks!\n* * * * * Great for learning corner cases. Finally, I remember when to double or surrender. Love the strategy table in my pocket ;)",
  "genres": [
   "Entertainment",
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "12+",
  "released": "2013-02-02T19:31:19Z",
  "updated": "2017-10-27T03:19:19Z",
  "releaseNotes": "* Statistics about your best and weakest hands\n* Session-Statistics during play\n* Many UI improvements",
  "version": "2.0.5",
  "price": 3.99,
  "developer": "Michael Hurnaus",
  "score": 4.62069,
  "reviews": 29,
  "currentVersionScore": 4.62069,
  "currentVersionReviews": 29,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.queensgame.collection",
  "title": "Solitaire Collection⋆",
  "description": "In this Solitaire collection, we kept the games true to the spirit of best classic solitaire games, including Klondike, FreeCell and Spider solitaire. We specifically optimized the games for unmatchable Solitaire experiences on mobile phones and tablets. With many beautiful Themes and Daily Challenges, you will find this all-in-one Solitaire Collection to be the best solitaire games.\n\nCLASSIC SOLITAIRE\nIn Classic Solitaire (also known as Klondike or Patience), try to collect all the cards in 1 card or 3 card mode. Don’t forget to try the Vegas scoring mode as well!\n\nSPIDER SOLITAIRE\nPlay with two decks of 52 cards each. Depending on difficulty, the deck consists of one, two or four different suits. Try to collect them with fewest moves possible!\n\nFREECELL SOLITAIRE\nWin a game by creating four stacks of cards, one per suit. The secret of winning is the extra four cells!\n\nDAILY CHALLENGES\nLooking forward for more challenges? Try to solve all daily challenges! The challenges are guaranteed solvable and will be updated every day!\n\nTOURNAMENT\nJoin the tournament and play against real players from all over the world, practice your skills and get the first place in the weekly rank leaderboard!\n\n\nGame highlights: \n\nThe best of Solitaire games (Including Klondike, FreeCell, Spider and so on)\nAddictive and challenging \nOptimized for mobile phone play\nBeautiful and customizable themes\n\n\nOur Game Features\nDaily challenges with different levels\nClean and user-friendly menus  \nBig and easy to see card\nSingle tap or drag&drop to move card\nCustomizable beautiful themes\nDraw 1 card \nDraw 3 card \nAuto-collect card on completion\nAuto-save game in play\nFeature to UNDO moves\nFeature to use hints\nStandard or Vegas scoring\nTimer mode supported\nLeft-handed supported\nLandscape mode supported\nUp to 10 top records\nOffline play and no data cost\nMore features to come!\n\n\nIf you like playing Solitaire on PC then you will love this! This is the best Solitaire collection game in hands! Highly Addictive and 100% Fun, Download Now for Free!\n\nHave a burning question? Send us a message!",
  "genres": [
   "Games",
   "Card",
   "Puzzle",
   "Entertainment"
  ],
  "contentRating": "4+",
  "released": "2017-03-04T11:23:45Z",
  "updated": "2020-04-07T18:17:29Z",
  "releaseNotes": "- Bug fixes and performance improvements\n\nJoin our group  https://www.facebook.com/groups/SolitaireGames",
  "version": "1.2.8",
  "price": 0,
  "developer": "WePlay Technologies",
  "score": 4.76563,
  "reviews": 64,
  "currentVersionScore": 4.76563,
  "currentVersionReviews": 64,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.jalsaa.blackjack",
  "title": "BlackJack * Bonus",
  "description": "Blackjack! also known as 21, the classic casino game. Now on your iPhone and iPad for FREE!\n\n• Blackjack! Pays 3 to 2\n• Dealer must stand on 17 and draw on 16\n• Insurance Pays 2 to 1\n• Includes double bet & spilt hands\n\n\nIMPORTANT NOTICE\n\nThis game contains an algorithm that strictly respects Blackjack rules. Cards are shuffled and dealt in the exact casino way to ensure a 100% fair gameplay.\nIn-app purchases cost real money - be responsible when playing games including money.\nThis Blackjack game is a gambling simulation game, it neither involves real money gambling, nor provides any means to win real money or prize.",
  "genres": [
   "Games",
   "Casino",
   "Productivity",
   "Card"
  ],
  "contentRating": "12+",
  "released": "2019-06-07T00:27:44Z",
  "updated": "2019-06-07T00:27:44Z",
  "version": "1.0.0",
  "price": 0,
  "developer": "Jalsaa",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.idorweb.fma",
  "title": "Fruity Cashino Fruit Machines",
  "description": "Fruity Cashino lands on the iPhone and iPad in glorious free to play 3D. A collection of real pub and arcade fruit machines including Jackpot Genie, Luck O’ The Irish, Bar-X, 5 Star Roulette, and other familiar names such as Double up the Diamond, iFruitBomb Revolution and VIZ Showtime. With a raft of trophies to be won, you’re gonna love this compilation.\n\nJackpot Genie\nAn all new pub fruit machine, packed with features such as Ali Grabba, Aladdin Riches, Golden Wonders, Dream Maker, and plenty more.\n\nBar-X Classic Deluxe\nThe most popular fruit machine in the UK for many years, Bar-X has been in constant production since 1981. With over 100,000 machines sold to arcades, clubs and bingo halls, Bar-X now lands on your iPhone and iPad in glorious free to play 3D.\n\nLuck O’ The Irish\nThe hilarious tongue in cheek, Irish themed fruit machine. Packed with features such as Lotta Luck, On the Fiddle, Clover Cash, The Little Fella, In the Money, Make a Wish, and a whole lot more.\n\nAlice in Bonusland\nAn all new slots game, based around a well known theme, packed with fun features.\n\niFruitBomb Revolution\nThe iFruitBomb games have been available on the iPhone and iPad since 2009. The first in the series was originally launched as a 2D game, being transformed with the introduction of 3D gameplay very early in its evolution. iFruitBomb Revolution is a real machine arcade prototype based around these existing games.\n\nDouble up the Diamond\nBased on a real pub fruit machine, packed with features such as Reel Roulette, Diamond Scatter, Rise and Fall, Filthy Rich, Diamond Dash, and plenty more.\n\nKingdom of Wealth\nBased on the real machine of the same name, head into battle as the Queen, Monk and Barbarian attempt to take control of the kingdom.\n\n5 Star Roulette\nBased on the pub roulette game of the same name, 5 Star Roulette brings the high stakes world of the roulette table to your fingertips. Featuring bonus in-game scratch cards when you grab your winnings.\n\nVIZ Showtime\nRoger Mellie, the Man on the Telly presents his gameshow themed fruit machine, VIZ Showtime, on the iPhone and iPad in glorious free to play 3D. Based on the real pub fruit machine of the same name, it packs a punch with a stack of features including Morning Glory, Cash Convoy, Razzle Dazzle, Mellie’s Money, Roger’s Big Deal and plenty more.\n\nFree Gameplay Credit - Run out of credit? You’ll get free virtual scratch cards to play with every hour (Requires an online connection) to try your luck and grab free credit awards.\n\nHighscores - On the Bank Run you have 10 minutes to cash out with as much virtual cash as possible\n\nPlease note: All wins are simulated with the award of virtual credits for use within this game compilation. An internet connection is required in order to download the games within this compilation.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2016-01-27T01:55:54Z",
  "updated": "2018-03-31T16:16:12Z",
  "releaseNotes": "Head into battle with our exciting new game, Kingdom of Wealth.\nAlso contains updates and full screen support for the latest devices.",
  "version": "1.20",
  "price": 0,
  "developer": "Idor Interactive Ltd.",
  "score": 4.09837,
  "reviews": 1047,
  "currentVersionScore": 4.09837,
  "currentVersionReviews": 1047,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.agilepixel.genting",
  "title": "Genting: Real UK Online Casino",
  "description": "New Player Welcome Bonus details:\nValid from 17/06/18 to 27/02/19. New players only (first deposit). 100% Deposit Match Bonus from £20 to £200: Min 50x wagering (% game weightings apply https://www.gentingcasino.com/bonus-and-promo/wagering-new/), play restrictions apply. Max bonus bet of £5, 15 days to accept & 30 days to complete wagering. Deposited funds locked to casino platform until wagering met. Your own deposited funds can be withdrawn at any time. Real money funds used first. Free Spins: Available after deposit bonus is redeemed/lost, credited as £2 bonus. Dream Catcher https://www.gentingcasino.com/game/dream-catcher/ only. 1x wagering and Max bonus bet of £5 applies to winnings. 7 days to accept & 7 days to complete wagering, maximum withdrawal from winnings is £200. Bonus funds used first. Full T&C's https://www.gentingcasino.com/bonus-and-promo/new-player-welcome-bonus/.\nYou must be over 18 to participate in any gambling activity. Begambleaware.org. Play it Safe. \n\nPlay Casino on exclusive tables, live from Genting Casinos. Enjoy a huge selection of favourite games: Blackjack, Roulette, Baccarat, Wheel of Fortune, or slots and jackpot slots. Download the app and deposit now! \n\nLive Casino\n\nImmerse yourself in a full range of Real Casino, Live & Online table games including:\n\n● Genting Live Blackjack\n● Genting Live Roulette\n● Genting Live Baccarat\n● Genting Live Three Card Poker\n\nFor an altogether superior experience, why not step into our online recreation of Mayfair's premium gaming club, Crockfords. Now featuring Baccarat Squeeze!\n\nSlots \n\nWe have over 300 of the biggest, best known and most played titles in the slots world with a selection of games featuring progressive jackpots which can exceed £1 million!\n\n● Cleopatra\n● Mega Jackpots Cleopatra\n● Da Vinci Diamonds\n● Lucky Lady's Charm Deluxe\n● Book of Ra Deluxe\n● Wish upon a Jackpot\n\nAdvocates of safe and responsible gaming, Genting Casinos UK Limited (Genting) are committed to providing our customers with a safe and secure environment in which to gamble. If you are subject to self-exclusion from Genting then please do not install this app. Furthermore, Genting holds no liability for notifications received on a device if this app has not been deleted.\nGenting understand that the safety and security of your personal data is of paramount importance and make every effort to protect personal data to ensure you can play online with peace of mind.\n\nThis website is owned and operated by Genting Casinos UK Limited who is licensed and regulated by the UK Gambling Commission (licence number 537). Details of its current licensed status as recorded on the Gambling Commission's website can be found at https://secure.gamblingcommission.gov.uk/PublicRegister/Search/Detail/537",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-02-10T15:35:43Z",
  "updated": "2019-02-21T17:23:16Z",
  "releaseNotes": "We regularly update the Genting app in order to give you the best possible user experience.\nIn this release we have:\n\nUpdated the SR logos",
  "version": "1.3.10",
  "price": 0,
  "developer": "Genting",
  "score": 2.9697,
  "reviews": 33,
  "currentVersionScore": 2.9697,
  "currentVersionReviews": 33,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.purplekiwii.vegaslive",
  "title": "Vegas Live Slots Casino",
  "description": "Looking for the best all-in-one casino in the world?\nCheck out this exhilarating casino app - Vegas Live Slots!\n\n# A growing library of modern and classic slots. More than 60 free-to-play slots are available right now.\n# Features 15 keno games, 8 video poker machines, Roulette, Huge wheel and blackjack tables to play.\n# Enormous welcome gifts, free coins every day, and amazing seasonal events and bonuses that never end.\n# Jackpot winners can earn special reward Cadillacs to ride down the dazzling Vegas strip lined with real casinos.\n# Complete your missions and get cute and adorable pets!\n# Join a new Club with other enthusiastic players or create your own and become a legend with new friends.\n# Enjoy the daily live lottery, Vegas Billions in the casino lounge with other users all over the world. You might become a billionaire winner in the next drawing! \n# Unique and thrilling new features, the 100 Spins Challenge is ready every day with different slot games for you.\n\nSpin and win the way you want to with all your favorite slots and get massive jackpots!\nPlay new blackjack, video poker, keno, big wheel and roulette games at the touch of a button.\nExperience the excitement and thrill of the authentic Vegas-style casinos anywhere, on any device.\nJoin today and be a part of a growing experience with unique new features, events, and never-ending updates!\n\n*Vegas Live Slots is intended for use by those 21 or older for amusement purposes only.\n*Vegas Live Slots does not offer real money gambling or an opportunity to win real money or prizes.\n*Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-11-16T02:06:03Z",
  "updated": "2020-05-12T13:29:47Z",
  "releaseNotes": "- Resolved app crash issues that some users were reporting\n- Minor bug fixes and performance improvements\n- Happy Spinning! Win Big at Vegas!",
  "version": "1.2.25",
  "price": 0,
  "developer": "purplekiwii",
  "score": 4.66974,
  "reviews": 648,
  "currentVersionScore": 4.66974,
  "currentVersionReviews": 648,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.partycasino.casino",
  "title": "PartyCasino: Play Casino Games",
  "description": "Play all of your favourite REAL MONEY CASINO GAMES at PartyCasino, including SLOTS, BLACKJACK, ROULETTE, baccarat and INSTANT WIN games. Slick and easy to use, play anywhere, anytime using your iPhone or iPad.\n\nLOVE SLOTS?\nPlay over 1,500 slots and jackpot slot games including BUFFALO BLITZ, STARBURST, THUNDERSTUCK, ALIENS, CLEOPATRA, SOUTH PARK, WOLF RUN, BOOK OF DEAD and RAINBOW RICHES, or any of our many progressive jackpot slots like MELON MADNESS, BOOK OF MYTHS and MEGA FORTUNE WHEEL. All jackpots increase daily, with some reaching over £2 MILLION.\n\nLIVE CASINO\nGet even closer to the thrill of an authentic casino by playing a wide selection of table games in our LIVE CASINO suite. Powered by live casino specialists, Evolution Gaming, we have titles like Speed Live Roulette, Blackjack, Casino Hold’em and Baccarat.\n\nPLAY TABLE GAMES\nAre you a BLACKJACK whizz? Play one of a dozen blackjack variations, including Pro, Hi Lo, Charlie 7 or a live dealer version in our LIVE CASINO. We also have a choice of ROULETTE games to play on the go, from American to European and LIVE ROULETTE.\n\nINSTANT WIN GAMES\nLove INSTANT WIN games? Download the app to play over 50 different instant win games, from SLINGO, SUPER CASH BUSTER and BREAKING BAD to CLEOPATRA, GHOST BUSTERS and WHEEL OF FORTUNE.\n\nBONUSES AND PROMOTIONS\nAt PartyCasino, you can look forward to a personalised selection of easy-to-understand promotions, including WELCOME BONUSES, RELOAD BONUSES and FREE SPINS.\n\nBECOME A VIP\nHere at PartyCasino, we believe that our most valued players deserve the best possible rewards. That’s why we’ve set up an exclusive VIP SCHEME to bring them all of these personalised benefits and more:\n• bespoke bonuses\n• gifts and rewards\n• exclusive VIP events\n• personal account manager\n• dedicated 24/7 support\n• tailored cashier service\n\nGET CASHBACK\nOur new and improved CASBACK SCHEME provides instant, easy to claim REWARDS that build up every time you place a real money wager.\n\nSo what are you waiting for? Download the all new PartyCasino app for the ultimate casino experience.\n\nFor the best offers, follow us on social media;\n\nFacebook: facebook.com/partycasinouk/\nBlog: casino.partycasino.com/en/blog/\nTwitter: twitter.com/partycasino\nInstagram: Instagram.com/partycasino\n\nCUSTOMER SERVICE\nAt PartyCasino, we pride ourselves on our friendly and responsive customer service team, who are on hand 24/7 to answer any questions or issues you may have. Making a deposit is super quick and easy and if you win, cash outs are super-fast, so you will receive your winnings in no time at all.\n\nResponsible Gambling\n18+ T&Cs apply. begambleaware.org. Play responsibly.\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org\n\nLicensing \nPartyCasino operates under licence and in accordance with applicable laws and regulations.  For further licence information, please visit our website at www.partycasino.com.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-06-29T02:22:27Z",
  "updated": "2020-05-05T06:48:08Z",
  "releaseNotes": "In this version of PartyCasino, we've fixed some bugs, made load times faster, and improved overall app performance. We hope you like it!",
  "version": "20.04.06",
  "price": 0,
  "developer": "ElectraWorks Limited",
  "score": 4.67997,
  "reviews": 1303,
  "currentVersionScore": 4.67997,
  "currentVersionReviews": 1303,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.onewinner.owsolitario21",
  "title": "OneWinner's BlackJack",
  "description": "Do you want to test your skill by playing BlackJack against players from around the world? Then this is your game!\n\nOneWinner's BlackJack is a BlackJack variation in which you can also compete and win real money prizes.\n\n- Face players from many countries.\n- Play fast to earn more points.\n- Different types of competition room.\n- Various game carpets.\n- Different game modes: 1vs1, tournaments and more!\n- Currently in English, Spanish and French.",
  "genres": [
   "Games",
   "Board",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-07-24T08:19:34Z",
  "updated": "2020-04-25T08:27:00Z",
  "releaseNotes": "- Better adjustment of some UI elements to the different resolutions and screen ratios.",
  "version": "3.0.3",
  "price": 0,
  "developer": "One Winner",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.solitaire.garden.tripeaks",
  "title": "Solitaire Garden TriPeak Story",
  "description": "Finding amazing classic Klondike, Pyramid, FreeCell, or Spider solitaire games? Just download Solitaire Garden. It's like Spider Solitaire or Pyramid Solitaire taken to whole new levels! You will love to play this classic card game !\n\nTop reasons people love playing Solitaire Garden:\n● Easy to learn, and easy to master ^_^. \n● Different gardens with tons of challenging levels! \n● Harvest your crops every 2 hours will get tons of coins and booster rewards! \n● Every day you login game, there are free bonuses waiting for you!! \n● Tiny bonus game every 8 levels! \n● Collects 40 cute pets and get kinds of rewards ! \n● It’s totally free to play!\n\nDownload and Play NOW to harvest your crops and cards! Begin your exciting adventure with Solitaire Garden !\n\nLike US: https://www.facebook.com/Solitaire-Garden-100961427950586\n\nSubscription options\nThe game is totally Free to download and play. We have the following subscription periods in our game:\n\n1. Weekly Royal Membership offers weekly subscription for $7.99 after 3-day free trial which provides 20% extra coins , daily Royal Task;  Removes ADS.\n\n2. Monthly Royal Membership offers monthly subscription for $19.99 which provides  20% extra coins , daily Royal Task; Removes ADS.\n\n3. Yearly Royal Membership offers yearly subscription for $99.99 which provides  20% extra coins , daily Royal Task; Removes ADS.\n\nEnd of trial and subscription renewal\n\nThis price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.\n\nPayment will be charged to your iTunes Account at confirmation of purchase.\n\nSubscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.\n\nAccount will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.\n\nSubscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.\n\nAny unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.\n\nCanceling trial or subscription\n\nYou can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039 . When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. When your subscription expires, you will no longer be able to use elements included in Subscription option.\n\nIf you have any questions or comments, feel free to contact us at bubblego2016@gmail.com\n\nPrivacy Policy: https://sites.google.com/site/gamecasualtermsofuse/policy\nTerms of Use: https://sites.google.com/site/gamecasualtermsofuse/home\nTerms of Subscription: https://sites.google.com/site/gamecasualtermsofuse/subscription",
  "genres": [
   "Games",
   "Board",
   "Card"
  ],
  "contentRating": "12+",
  "released": "2019-09-13T07:00:00Z",
  "updated": "2020-04-30T17:47:52Z",
  "releaseNotes": "What's New:\n- 250 new fun levels!\n\nWish you enjoy the update of this Solitaire game!",
  "version": "1.3.0",
  "price": 0,
  "developer": "Candy Match Three Puzzle Games",
  "score": 4.82327,
  "reviews": 481,
  "currentVersionScore": 4.82327,
  "currentVersionReviews": 481,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.lesunga.Poker",
  "title": "Poker",
  "description": "Poker is a family of card games that share betting rules and usually (but not always) hand rankings. Poker games differ in how the cards are dealt, how hands may be formed, whether the high or low hand wins the pot in a showdown (in some games, the pot is split between the high and low hands), limits on bet sizes, and how many rounds of betting are allowed.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2011-07-14T02:41:06Z",
  "updated": "2015-09-17T00:54:55Z",
  "releaseNotes": "single game bug fixed",
  "version": "5.96",
  "price": 0,
  "developer": "Orgajja Co Ltd",
  "score": 2.55555,
  "reviews": 9,
  "currentVersionScore": 2.55555,
  "currentVersionReviews": 9,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.tw.tycoon.casino",
  "title": "Tycoon Casino - Vegas Slots",
  "description": "Tycoon Casino Slots is a new slot game to attract everyone’s attention. Different styles of games, huge prizes, big jackpots, and so on, everything you want in the slots game can be found here. Come and seek your luck here- Play Tycoon Casino Slots and Win huge prizes! \n\nStart your spins and enjoy the game, Tycoon Casino Slots can make you forget all the bad things and boring days, because we want to provide slots lovers and beginners with best slot machines and massive grand wins.\n\n►Get 100,000,000 free coins instantly as Welcome Bonus.\n►Every 12 minutes you will receive a store gift,and every 8 hours you can spin bonus wheel for one time. Keep spinning! \n►Interesting graphic, smooth animations and vivid sound offer you the best casino atmosphere.\n►Different feature games, huge prize and bonus, winning symbols like Scatter & expanding WILD.\n►Enjoy our gorgeous Slots Games like being in Vegas heart.\n►Authentic slot machines designed by casino professionals.\n►Hold on to Autospin and listen to the sweet casino melody. Plenty wins will tell you how time flies. \n\n►Enough free coins to bet large in a spin and win more back.\n►Lots of free spins, respin, hold&spin, bonus games.\n►Finish daily goals and get big reward!\n►Participate in different kinds of activities to win extra prizes in special slot machines.\n\n►Get five scatters in Dragon Spin and win free games.\n►Spin and get specific wolves in special reels to multiply your prizes. \n►Come to see the Star Panda and win big prizes.\n►Spin to get plenty respin chances in 88 Riches. \n►Make a big fortune in the volcano Riches, wins never ends.\n\nThe Tycoon Casino Slots can give you an incredible gambling feeling with its attractive appearance and the sound. Don't miss this opportunity to experience different styles of slots games! Come and download the game right now. Huge prizes and bonus are waiting for you!\n\nThis product is intended for use by those 21 or older for amusement purposes only. \nPractice or success at social casino gaming does not imply future success at real money gambling. \n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-10-21T10:44:15Z",
  "updated": "2020-04-30T01:53:04Z",
  "releaseNotes": "Hey Tycoon Lovers! Here's our new updates with:\n• New Slot: Legend Ages\n• New Event: Card Album \n• Great promotion and deals\nWe are always working hard to make Tycoon Casino the best casino slots game out there. Come and seek your luck here!",
  "version": "1.5.2",
  "price": 0,
  "developer": "Triwin Inc.",
  "score": 4.83474,
  "reviews": 3292,
  "currentVersionScore": 4.83474,
  "currentVersionReviews": 3292,
  "searchTerms": "blackjack"
 },
 {
  "appId": "at.ner.SolitaireNewFree",
  "title": "Solitaire ∙ Card Game",
  "description": "Play the ORIGINAL Solitaire card game for FREE on iOS!\n\nSolitaire, also known as Klondike and Patience, is the most popular card game in the world. Try our BEST SOLITAIRE card app, which is beautiful and fun, just like classic Windows Solitaire™. It is a truly solitary experience!\n\nThis Solitaire game also includes DAILY CHALLENGES! Each day you’ll receive a unique daily challenge. Receive a crown for each day you solve the daily challenge. Win all the daily crowns in any month to win a special trophy!\n\nAre you bored of Solitaire apps that always seem to have the same rough gameplay and tired looking graphics? Try this completely custom version of Solitaire App, for iPad, iPod, and all iPhone models. This Solitaire has the best gameplay of any Solitaire on the market. Please try this Solitaire as we know you'll see and feel the difference. What have you got to lose? Solitaire is a free download!\n\n== Features ==\n\n• Simple and intuitive interface\n• Unlimited undos\n• Custom Settings: play in portrait or landscape mode, draw 1 or 3 card mode\n• Statistics\n• Simple \"Tap to move\" control for fast gameplay\n• Custom card decks and backgrounds\n• Right and left handed mode\n• Daily Challenges\n• Additional game modes: Yukon, 100% winnable deals and Vegas scoring\n\nPlay the popular CLASSIC Solitaire card game on iOS for FREE now!",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "4+",
  "released": "2016-02-02T21:31:27Z",
  "updated": "2020-04-06T07:30:00Z",
  "releaseNotes": "Thanks for playing Solitaire! We hope you like it and would love to read your review about it.\n+ Bug fixes and performance improvements\n\nLet’s play! :)",
  "version": "3.2.0",
  "price": 0,
  "developer": "nerByte GmbH",
  "score": 4.74186,
  "reviews": 523,
  "currentVersionScore": 4.74186,
  "currentVersionReviews": 523,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.youdagames.pokerworld",
  "title": "Poker World - Offline Poker",
  "description": "FREE OFFLINE TEXAS HOLDEM POKER GAME, no internet required.\n\nBecome the World Poker Champion - play poker around the world in the most famous poker cities.\n\nPoker World is brought to you by the makers of Governor of Poker. In this great offline poker game, you're battling and bluffing your way through several continents and famous poker cities. Ever played poker in Macau? Or visited the majestic Monaco casino? Or went all in in the Bellagio in Las Vegas? This is your chance. And you'll play poker with only one goal: to become the best poker player in the world.\n\nIn Poker World, you start your first poker tournament in the United States. By winning tournaments you progress and build up your reputation as a poker player. You will be able to join bigger and more exciting poker tournaments, get better poker sponsor deals and buy cool items to show off your poker status. And don’t be surprised if you get challenged by the best players in the world. You'll play heads-up poker against these World Top players and climb your way to the top.\n\nTRY POKER WORLD - SINGLE PLAYER POKER FOR FREE, SHOW OFF YOUR SKILLS AND BECOME THE WORLD’S BEST TEXAS HOLD'EM POKER PLAYER IN THIS GREAT OFFLINE POKER ADVENTURE!\n\nGreat game features:\n- MORE THAN 30 HOURS of Texas Hold'em Poker play;\n- OVER 60 POKER CITIES in the world where you can participate in challenging poker tournaments. Every tournament varies in buy-in, number of players and poker winnings;\n- COLLECT STATUS SYMBOLS to build up your reputation in the poker scene and get access to certain tournaments;\n- SIGN SPONSORSHIPS to earn more chips and tickets for special tournaments;\n- WORLD TOP 10: beat all World Top players and win tickets for special tournaments;\n- PLAY ANYTIME, ANYWHERE: Poker offline, no internet connection required:\nThere is no internet connection required to play this great game. And one other big advantage: you don't have to wait for real world players like you do in live multiplayer poker. Slick, fast gameplay!\n- THE BEST AND MOST FUN POKER AI IN THE WORLD\nThis poker engine is created to give you the best poker experience and the feeling you are playing against real players. We made the AI to ensure the game is great for both beginning poker players who are learning poker and experienced players. Refine your card tactics to match the style of your opponents! The offline players will play better in each new city and poker tournament!\n- BIG FREE WELCOME PACKAGE: 20,000 free poker chips;\n- MORE FREE CHIPS: Collect FREE chips every day with your daily bonus;\n- EARN MORE CHIPS: Watch videos and earn free bonus poker chips in this poker paradise;\n- GREAT HD GRAPHICS: The poker game is beautifully designed and includes HD poker graphics for a great poker experience. \n\nMillions of poker players have already enjoyed our Governor of Poker games.\nPlay this very exciting Texas Hold'em poker game and prove you are the best poker player in the world. Press Install and download Poker World NOW.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2017-03-06T22:21:16Z",
  "updated": "2020-05-08T12:43:46Z",
  "releaseNotes": "Thanks for playing this awesome game! You guys gave us some great feedback, so we made lots of updates.",
  "version": "1.17.4",
  "price": 0,
  "developer": "Youda Games Holding B.V.",
  "score": 4.46387,
  "reviews": 3889,
  "currentVersionScore": 4.46387,
  "currentVersionReviews": 3889,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.mansion.slotsheaven",
  "title": "Slots Heaven Card & Slot Games",
  "description": ">>>DOUBLE YOUR MONEY WITH OUR 100% UP TO £100, PLUS 200 SPINS WELCOME PACKAGE<<<\n\nDownload today for the chance to win huge jackpots on the very best slot games!\n\nPlay all your favourite online casino games on the go; including slots, Roulette, Blackjack, Live Casino, and plenty more – with hundreds to choose from, you’ll be spoilt for choice. \n\n5 reasons you’ll love to play at Slots Heaven: \n\n1. Tonnes of regular promotions, offers and giveaways – from big bonuses to luxury holidays \n2. Collect Loyalty Points each time you play, then turn them into cash bonuses \n3. Experience the thrill of Live Casino, right in the palm of your hand \n4. Play for real money, or play or fun with demo mode \n5. Giant progressive jackpot games are ready to spin whenever, wherever\nJump in and join the fun today; whether you’re a master at Roulette, a whiz on the slots or love a bit of Live Casino action – there’s never a dull moment at Slots Heaven! \n\n24/7 CUSTOMER SUPPORT:\nWhatever the query, our friendly Customer Support team are always ready to help. \nFor any assistance, day or night, simply email: support@slotsheaven.com or give us a call on our UK Freephone number: 0800 279 7347\n\nSAFE AND SECURE \nLicensed and regulated in the UK, Slots Heaven is a key player in the highly respected Mansion Group. Our online casino is safe, secure, and second-to-none. From cleverly engineered games for mobile devices and tablets, to an interactive live casino where you can enjoy all the action in the company of a real croupier, Slots Heaven has your online casino experience covered.\n\n\n\nRESPONSIBLE GAMBLING\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/\n\n\n\nSIGNIFICANT TERMS:\n100% Welcome Bonus: \nNew customers only. \nMin. deposit £20. \nMax. bonus £100, applied to 1st qualifying deposit only. \nBonus is non-redeemable with 40x wagering. \nGame weighting applies. \nBonus Betting limits: Slots - £5 All other games – 10% of bonus amount. \n\nSpins: \nNew customers only. \n40 on 1st deposit + 20 per day for the next 8 days (valued £0.20 - £0.25). \nWagering on Age of the Gods slot games only. \nWager 20x before withdrawing. \n30 days to complete wagering. \nMax. winnings £100.\nFor more info and the full T&Cs, please visit: https://play.slotsheaven.com/promotions/welcome-bonus",
  "genres": [
   "Games",
   "Casual",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-05-26T14:39:38Z",
  "updated": "2020-03-20T11:19:46Z",
  "releaseNotes": "Fully optimised with the best native games, improved app speed and overall user experience.",
  "version": "7.1.0",
  "price": 0,
  "developer": "Casino.com",
  "score": 4.46666,
  "reviews": 105,
  "currentVersionScore": 4.46666,
  "currentVersionReviews": 105,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.paddypower.hybridgames",
  "title": "Paddy Power Games",
  "description": "New Customer Offer – 60 Free Spins to Play Daily Jackpots! T&C’s Apply\nUK and Ireland's hottest new real money games app from Paddy Power is here! Our app offers the biggest and best selection of real money casino games in the Google Play Store. All of your Casino favourites including Online Roulette, Blackjack, Slots and Scratchcards! \n\nPlay classic slots including Cleopatra, Rainbow Riches, and Genie Jackpots. Other popular games: King Kong Cash, Top Cat, Starburst. \n-Over 200 games to choose from that can be played with real or fun money\n-Jackpot slot games including Rainbow Jackpots, Bomb the Jackpot and Dragon’s Luck\n-Share games with your friends through Twitter, Facebook, Email and SMS\n-Award winning customer service available 24 hours a day\n-Play over 3G, 4G or Wifi\n\nLogin with your existing Paddy Power account to play the games. Our games are fully certified and offer you the chance to win real cash. Questions? Email us at support@paddypowergames.com\nPlease note this app is available to play for customers in the UK and Ireland only and you must be over 18 years of age.\n\n60 FREE SPINS T&C’s\n1) To take part, you must register via the registration code PGCTV1 and opt in to this promotion. 2) Get SMS-verified by supplying a valid telephone number. 3) Enter the validation code received by SMS to redeem the free spins. 4) Free Spins are valid on any of our Daily Jackpot games. 5) Free Spins will expire in 10 days from receipt of the offer.\n\nAll Paddy Power Games NEW CUSTOMERS can receive 60 Free Spins on our Daily Jackpots Slots Collection once they Opt In and complete the steps outlined below.\nALSO, all NEW CUSTOMERS can also receive a €30 Bonus on our Daily Jackpots Slots Collection when they Opt In, deposit and stake €10 or more on Daily Jackpot games. \nYou will receive 60 Free Spins for use on all valid Daily Jackpot games. The free spins each have a value of €0.10.\nTo take part, you must register via the registration code PGCTV1, opt in on-site and supply a valid telephone number that is capable of receiving an SMS. You will then be sent a validation code to that phone, which you must enter on site to redeem the free spins.\nIf you have previously taken part in our 10 Free Spins on Daily Jackpot games promotion, as seen on TV, or our 30 Free Spin on Daily Jackpot games promotion, you are not eligible for this promotion.\nOnce verified, launch any of the eligible Daily Jackpot games to claim your spins.\nThe offer is available to new Paddy Power customers in the UK & Ireland who have a valid mobile number.\nOnce you have completed using the bonus, you will begin staking real cash.\nFree Spins expire 10 days from receipt of the offer.\n•\tBy participating in this offer, you agree with these standard Terms and Conditions:\n•\tPaddy Power reserves the right to withhold any withdrawals and / or confiscate all winnings for irregular play.\n•\tOnly one bonus is available per customer\n•\tIf a Player is ineligible, PP reserves the right to withhold payment of the prize.\n•\tEntry will be forfeited if players are found to have multiple accounts.\n•\tPP games reserves the right to modify, alter, discontinue or terminate this promotion at any time for any reason what so ever without notice to players.\n•\tIn the event of any dispute, the decision of paddypower.com will be considered final.\n•\tThis offer is only available to customers in the UK & Ireland.\n•\tIf any of term of the promotion is breached, or if there is evidence that a customer is using the promotion to guarantee profits regardless of the outcome (whether individually or as part of a group), we reserve the right to reclaim the bonus element, and any pending winnings from play generated using the bonus funds.\n•\tFull T&Cs apply https://promos.paddypower.com/promotion?promoCode=GASUO60FS10PSUO \n•\tPaddy Power Games terms and conditions apply https://www.paddypower.com/en/aboutUs/Terms.and.Conditions/#PartF",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-02-06T10:52:49Z",
  "updated": "2019-05-09T12:57:14Z",
  "releaseNotes": "We have listened your feedback and want to make sure that customers get the best experience with Paddy Power Games. This version has improvements along with bug fixes.",
  "version": "6.0.0",
  "price": 0,
  "developer": "Paddy Power PLC",
  "score": 2.4,
  "reviews": 20,
  "currentVersionScore": 2.4,
  "currentVersionReviews": 20,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.coldmathewgames.jumprun",
  "title": "Jump Run: Jumping Race Runner",
  "description": "Jump Run is a fun and addictive endless runner game where you have to rescue the captured animals that are trapped by the evil witch.\n\nAll you have to do is tap on the screen to jump and run.\n\nReady for the challenge? Download the game today for FREE and start rescuing the little poor animals and become the jumping hero. Enjoy!",
  "genres": [
   "Games",
   "Sports",
   "Adventure",
   "Racing"
  ],
  "contentRating": "4+",
  "released": "2019-07-19T07:00:00Z",
  "updated": "2020-02-20T06:27:40Z",
  "releaseNotes": "- Added new awesome challenges.\n- Performance improvements and bug fixes.",
  "version": "1,1",
  "price": 0,
  "developer": "Hlad Matej",
  "score": 4.42038,
  "reviews": 314,
  "currentVersionScore": 4.42038,
  "currentVersionReviews": 314,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.unibet.flashgordon",
  "title": "Unibet Casino - Slots & Games",
  "description": "With 100s of slot games to choose from and live dealers ready to greet you at the tables, we have something for everyone. Simply download the app to start playing.\n\nUnibet Casino app features both the favourites you know and love, and a realm of new slot games waiting to be discovered. Pick from fruit machine classics, huge jackpot games, or TV-themed slots such as Game of Thrones or Family Guy. \n\nUnibet Casino also offers an impressive selection of live table games featuring professional dealers, so you can recreate the true casino experience on-the-go. Add to this regular casino tournaments to spice up play, this app delivers a casino experience like no other.\n\nDownload our app and enjoy:\n\n• Over 500 slot games, including all-time favourites like Starburst and Rainbow Riches.\n\n• Progressive jackpot slots such as Mega Fortune Dreams and Mega Moolah.\n\n• A huge variety of live games, including HD immersive roulette with slow-mo replays.\n\n• Quick-loading games, simple navigation, and Touch/Face ID login. \n\nUse your existing Unibet account to log in, or simply create an account through the app.\n\nYou must be 18 years or older and have a valid Unibet account to be able to place a bet with this service. \n\nUnibet (operated by Platinum Gaming Limited) is licensed by: (i) The Great British Gambling Commission under licence number 45322; and (ii) The Irish Revenue under licence number 1013174; and (iii) The Government of Gibraltar (under Licence numbers RGL 091 & RGL 092).\n\nUnibet.\nBy Players for Players.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-10-01T10:48:21Z",
  "updated": "2020-04-15T09:36:19Z",
  "releaseNotes": "Thank you for using Unibet’s Casino app. To constantly improve our app we bring updates regularly to the App Store. To make sure you don’t miss a thing, keep updating your app to get all the available features and improvements.",
  "version": "4.22.1",
  "price": 0,
  "developer": "Unibet",
  "score": 3.03521,
  "reviews": 142,
  "currentVersionScore": 3.03521,
  "currentVersionReviews": 142,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.gamesys.jackpotjoy",
  "title": "Jackpotjoy: Bingo & Slot Games",
  "description": "Enter a world of fun at the award-winning Jackpotjoy and play our fantastic Bingo, Slots and Casino games. \n\nThere's Bingo and Slot game jackpots worth thousands, which can be won from as little as 1p. As well as super promotions to play in our entertaining Chat rooms, Jackpotjoy is the place to be!\n\nSo join Jackpotjoy today, the proud winners of Global Gaming’s ‘Bingo Operator of the Year’ in 2018 and 2019. \n\nDaily Free Game**\nTry the Daily Free Game Doubly Bubbly where you could win Cash or Free Spins on the hugely popular Double Bubble Slot game. With a £750 top prize available, it’s time to get playing! \n\n**You just need to have wagered £2 in the last 7 days and deposited a total of £10 or more in your lifetime. \n\nBingo\nIn our 90 ball Bingo games you can play for super Jackpots and Full House prizes! In our Sapphire Bingo room enjoy exciting Bingo offers, like 1p games, BOGOF Bingo, Evens Stevens and Free Bingo!\n\nSlots\nIf you fancy a spin instead, Slots are where it’s at. Enjoy stunning titles such as Paper Wins, Winfall Wishes, Sapphire Sorceress and more.\n\nBest Chat and more\nYou’ll always be sure of a warm welcome whenever you join the conversation in Chat with our Hosts. You can have a natter about the latest soap drama, your new pet, even who makes the tea at home! And if it gets lively, they’re ready to party just as hardy as you can! There’s loads of games and quizzes to play, and you could even win cash or physical prizes just for taking part!\n\nThat’s on top of all our exciting onsite promotions as well, which could give you the chance to win anything from a household kettle to a holiday to America and beyond!\n\nCasino\nPull up a chair at our fantastic range of Casino games, including Roulette!\n\n\nPlease play responsibly. BeGambleAware.org. 18+\n\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.",
  "genres": [
   "Games",
   "Casino",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2013-08-21T18:06:47Z",
  "updated": "2020-03-11T11:39:47Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.6203,
  "reviews": 9713,
  "currentVersionScore": 4.6203,
  "currentVersionReviews": 9713,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.idorweb.Luck-O-the-Irish",
  "title": "Luck O' The Irish - The Real Pub Fruit Machine",
  "description": "Luck O’ The Irish, the hilarious tongue in cheek, Irish themed fruit machine lands on the iPhone and iPad in glorious free to play 3D. Based on Blueprint Gaming's real pub fruit machine of the same name, it packs a punch with a multitude of features. If you like your slots games/fruit machines, you’re gonna love this.\n\nFeatures include:\nThe skill based features are piled high with Lotta Luck, On the Fiddle, Clover Cash, The Little Fella, In the Money, Make a Wish, and a load more besides.\nSuperboard games include Pathway Picks, Super Streaks, and Rainbow Strikes amongst others, topped off with the Luck O’ The Irish big money feature.\nBonus Squares, Mystery Squares, Feature Shots, Cash Shots and more await.\nHead for the Big Prizes in Rainbow Fortunes, a decision based game where only the canny hit the jackpot.\nA Unique Game Design - Has you playing the feature board on every spin.\nOnline/Offline Trophies - A bucket full of in-game achievements are there for the taking.\nOnline/Offline Highscores - On the Bank Run you have 10 minutes to cash out with as much virtual cash as possible.\nFree Gameplay Credit - Run out of credit? You’ll get a tenner of free virtual cash to play with every day! (Requires an online connection)\n\nPlease note: All wins are simulated with the award of virtual credits for use within the game.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2013-12-30T00:03:54Z",
  "updated": "2014-10-06T16:47:25Z",
  "releaseNotes": "Fixes a number of issues on both iPhone and iPad running iOS8.",
  "version": "1.13",
  "price": 0,
  "developer": "Idor Interactive Ltd.",
  "score": 3.70982,
  "reviews": 672,
  "currentVersionScore": 3.70982,
  "currentVersionReviews": 672,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.icemochi.solitaire",
  "title": "Solitaire Classic Card Game™",
  "description": "Welcome to the best looking Solitaire game in the App Store! Play FREE forever!\n\nClassic Solitaire can’t be beat! Play the timeless card game with a beautiful new look and easy-to-use controls. Smoothly move cards around the table with a tap or drag of your finger. Play easy games to relax, hard games to test your Solitaire skills, or even Vegas-style games with casino scoring! Stuck? No problem! Use the Hint and Undo features as many times as you need!\n\nFEATURES:\n\n- Classic Solitaire! The game you know and love!\n- Two Draw Modes: 1 or 3 at a time!\n- Three Challenge Modes! \n- Easy Games for New Players!\n- Hard Games for Passionate Solitaire Fans!\n- Responsive Cards! Watch them fly into place!\n- Smooth Animations & Beautiful Graphics! Solitaire never looked better!\n- Personal Score Tracking! Can you beat your best?\n- Stumped? Unlimited hints are here to help!\n- Make a mistake? Use unlimited undos!\n- AutoComplete to get the best possible time!\n- Standard Scoring Offers Classic Solitaire Challenge!\n- Vegas Scoring Mode Brings You Right Into the Casino! \n- Bored of traditional card designs? Customize your own!\n- Don’t like the background? Choose a new one!\n- Play offline! No Internet connection required.\n\nTop notch performance on your iPhone, iPad, or iPod Touch!\n\nFollow Storm8 Studios\nwww.storm8-studios.com\nfacebook.com/storm8\ntwitter.com/storm8",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "4+",
  "released": "2013-02-28T03:57:12Z",
  "updated": "2019-11-13T20:00:26Z",
  "releaseNotes": "- Bug fixes\n- Performance improvements",
  "version": "1.3.3",
  "price": 0,
  "developer": "Storm8 Studios",
  "score": 4.4963,
  "reviews": 947,
  "currentVersionScore": 4.4963,
  "currentVersionReviews": 947,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.arcadegame.games.blackjack.trainer",
  "title": "Blackjack 21 - Best Vegas Casino Card Game",
  "description": "If you are new to the game of blackjack, want to beat the house and win money at the casino, just download Blackjack 21 - Best Casino Strategy Practice now!\n\nBlackjack Trainer helps you easily learn blackjack basic strategy and card counting. The game can help make it easy to learn the basics of when to hit, when to stand, when to double double down and when to split pairs in any situation. \n\nThe Hi-Lo strategy is one of the most popular card counting strategies, as well as one of the easiest to learn. This is a great strategy for beginning to intermediate blackjack card counters and if you can do the simplest of math then you can use it to improve your blackjack success.The Hi-Lo strategy of counting cards is a fantastic system for new card counters and is a great way to ease yourself into the world of card counting and improve your chances of winning at blackjack.\n\nFeatures:\n- Popular Las Vegas rules just like at the casino!\n- Intuitive hint system!\n- Double Down, Splits, Insurance and Surrender!\n- Authentic casino blackjack gambling experience!\n- Learn blackjack basic strategy\n- Lean the most popular card counting strategy: Hi-Lo Strategy\n- Help you practice your card counting skills\n- Improve your chances of winning at blackjack.\n- Keep track lots of different gameplay statistics\n- Multiple casino table backdrops to choose from \n- Practice your Blackjack skills to become a true Vegas vip!\n\n We don’t play luck, we make our own luck. We don’t hit, we calculate. We are not gambler, we are REAL Blackjack player!",
  "genres": [
   "Games",
   "News",
   "Card",
   "Casino"
  ],
  "contentRating": "12+",
  "released": "2016-12-16T15:25:47Z",
  "updated": "2017-08-01T17:01:52Z",
  "releaseNotes": "Blackjack keeps getting better! Get the latest version and check it out.\n- Optimizations and Bug Fixes.",
  "version": "1.0.2",
  "price": 0,
  "developer": "Theotino",
  "score": 4.81818,
  "reviews": 22,
  "currentVersionScore": 4.81818,
  "currentVersionReviews": 22,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.betvictor.casino.app",
  "title": "BetVictor: Online Casino Games",
  "description": "Wager £10 Get £70: Our best ever Welcome Offer!\n\nThe BetVictor Casino app has the perfect Welcome Offer to get you started. New customers can get ahead with £70 in bonuses when you wager just £10. Already a customer? There’s an offer for you too! BetVictor offers some of the best betting and casino welcome offers out there.\n\nWhat you get:\n\nA £20 Slots Bonus, which can be used on any of our Slots;\nA £20 Table Games Bonus, which can be used on any of our table games except for Baccarat (all versions) or any Live Casino table games;\nA £10 Bonus for any of our Blackjack tables on Casino or Live Casino\nA £10 Bonus for any of our Roulette tables on Casino or Live Casino\nA £10 Game Show Bonus\n\nNew customers only. Wager £10 to get £70 bonus.Card Payments only. Up to 60 x wagering applicable. Deposit and wager within 7 days of opening new account. begambleaware.org. Please Gamble Responsibly. T&Cs apply https://bit.ly/2Je8qAZ\n\n\n\nAll The Best Online Games\n\nBetVictor has a live casino, slots and table game selection of over 1,000 of the world’s favourite games for you to explore. From traditional casino games like Blackjack and Roulette, to fun new games, you will find them all here. Enjoy placing a bet? Get great odds on your bets! Browse through games from the biggest and most trusted names in the industry. Easily view games and slots by most played, most popular and newest.\n\nNot sure which game is for you? Not sure if you’re better at blackjack or roulette?Try them out for fun and perfect your strategy before playing with real cash.\n\nHuge Jackpots\n\nThere’s millions to be won on BetVictor’s ready-to-drop Jackpot slots, so try your luck and keep your eyes out for that 777! It’s like being right there at the slot machine. Take part in our Game of the Week promotion each week. One featured game is chosen, and for each £10 wagered, you get one entry to win a share of £5,000. Whether your money is on red or black, experience the thrill and adrenaline rush of playing online. All that’s missing is a winner – will it be you?\n\nGuaranteed Winners With Daily Jackpots\n\nJackpots are dropping TODAY. Guaranteed! Try our selection of Daily Jackpots for your chance to win big at BetVictor Casino. \n\nAll 10 of our exclusive Daily Jackpot Slots come loaded with a Flash Jackpot that can drop multiple times a day, the bigger Daily Jackpot guaranteed to drop by 11pm, and the huge Mega Jackpot – the big progressive you can win any time!\n\nLove, Laugh, LIVE Casino!\n\nWant that authentic Casino experience? Then head over to our Live Casino where our friendly Live Dealers are ready to take your bets. Whether it’s Live Blackjack, Live Roulette or Live Baccarat you prefer, there’s always a seat for you at the table. \n\nBut the fun doesn’t stop there – not when you’ve got our all new Live Game Shows to play! Spin the wheel on Dream Catcher, beat the Banker in Deal Or No Deal, or build your property empire on MONOPOLY Live – all available to play now at BetVictor Casino!\n\nCasino bonus notifications\n\nIn addition to the frequent bonuses offered, you will receive notifications on your casino bonuses the minute it has been credited to you.\n\nAnd if you have a question or comment about a game, bet, or offer, our team is on call 24/7 to help you.\n\nNo matter if you’re more of a table game or jackpot slots kind of gambler, you’ll find what you’re looking for (and more) on the BetVictorCasino app. Download the app to play and enjoy the lights, sounds and thrill of winning!\n\nDisclaimer:\n\nThis is a real money gambling app. Please gamble responsibly and only what you can afford. For gambling addiction help and support, please Contact Gamble Aware UK (call 0808 8020 133 or visit begambleaware.org) or Problem Gambling Ireland (call 089 241 5401 or visit problemgambling.ie)",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-11-30T16:25:33Z",
  "updated": "2020-05-11T09:44:21Z",
  "releaseNotes": "We make regular improvements to the BetVictor Casino app. Our latest update focuses on bug fixing and improved performance.",
  "version": "11.9",
  "price": 0,
  "developer": "BetVictor Ltd",
  "score": 4.47965,
  "reviews": 565,
  "currentVersionScore": 4.47965,
  "currentVersionReviews": 565,
  "searchTerms": "blackjack"
 },
 {
  "appId": "com.aaagame.goldencasino",
  "title": "Golden Casino - Vegas Slots",
  "description": "Play Golden Casino for a FREE chance at Big Payouts, tons of Free Spins, and Gigantic jackpots just like in a real Vegas casino! \n\nJoin now and to get 200,000s of free coins right away! Get more on top of that with Daily Bonuses, Tournaments, Friend Bonuses and more!\n\nPlay the best slots straight from Vega Casinos all for FREE! The graphics are so good you’ll think you’re in a real casino! Pick from our huge selection of slot games, with new ones added all the time!\n\nInstall Golden Casino now to get:\n- Dozens of FREE slot machines & multiple FREE coin bonuses every day!\n- Big Welcome Bonus and Free Hammers to break open your always growing Piggy Bank!\n- Access to the classic Vegas casino games you know and love, with Dragons, Cherries, Piggy and many more\n- Play with friends for extra bonuses and compete in huge tournaments with amazing prizes!\n- Join the VIP Club for even bigger bonuses every day!\n- Play on the go, with or without internet!\n\n\nINSTALL NOW AND WIN BIG NOW!\n\n\"Golden Casino\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-03-29T20:28:07Z",
  "updated": "2020-05-11T21:58:31Z",
  "releaseNotes": "New and improved Blackbeard's Treasure! \nLots of fun new games!\nBug fixes\nImproved user experience",
  "version": "1.0.84",
  "price": 0,
  "developer": "Slots Limited",
  "score": 4.94484,
  "reviews": 2556,
  "currentVersionScore": 4.94484,
  "currentVersionReviews": 2556,
  "searchTerms": "blackjack"
 }
]