[
 {
  "appId": "uk.pokerstarsmobile.www",
  "title": "PokerStars Online Poker Games",
  "description": "PokerStars Mobile: get ready to play poker with millions of players. With Texas Hold’em, Omaha and more, now’s the time to enter the world of online poker. \n\nHOW TO ENJOY OUR POKER GAMES\n\nDownload the app. Create your account. Make a deposit to start playing. It’s that easy to join the action. With hundreds of games to choose from, in traditional and unique formats, it’s time to start playing real poker with real people. \n\nNew to poker? Read more about how to play poker on our site (https://www.pokerstars.uk/poker/) or visit our Poker School for free lessons, advice, and the chance to win free tickets for must-play tournaments:\nhttps://www.pokerstarsschool.com/\n\nNeed help with your account? Our Support team is on-hand to bring you the best experience possible. Visit the Help Centre to get started.\nhttps://www.pokerstars.uk/help/\n\nENJOY REAL MONEY POKER GAMES ALL DAY LONG\n\n- Ready to challenge for real money prizes? Kick-start your real money adventure with £20 extra play. This exclusive welcome offer is open to new players. Here's how to claim:\n•\tVisit the Cashier\n•\tMake a first deposit of £10 or more\n•\tUse bonus code 'TWENTY' when you deposit\n\n- Play online poker games with the world’s largest community of real poker players. Join the biggest - and best - online poker games including Texas Hold'em tournaments. Enjoy promotions you won’t find anywhere else.\n\n- From Texas Hold'em to Omaha, PokerStars offers the widest selection of games anywhere online. For more on all our games, visit our site: \nhttps://www.pokerstars.uk/poker/games/\n\n- Experience unique poker formats\n•\tUnforgettable Tournaments: Play the largest number of multiplayer tournaments anywhere online. Battle for huge guaranteed prize pools.\n•\tSit & Go's On-Demand: Looking for a quick tournament? Hit the Sit & Go's, where the action starts as soon as enough players have registered. \n•\tOne-of-a-kind Zoom: Try the fast-paced poker game format where opponents change every hand.\nFind out more here: \nhttps://www.pokerstars.uk/poker/tournaments/\n\nSPORTS BETTING AND CASINO GAMES \n\n- Poker. Casino games. Sports betting. PokerStars Mobile offers them all in the same app. So, you can add to the action by placing a bet or trying the latest Slots while you’re playing poker.\n\n- Bet on over 30 different sports with great odds on leagues from around the world.\n\n- Choose from hundreds of casino games, including:\n•\tClassic and themed Slots\n•\tExclusive Slots with unique jackpots\n•\tVariety of Blackjack games\n\nAccept push notifications to make sure you never miss out on our great promotions.\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at www.begambleaware.org or 0808 8020 133.\n\n\n******************************************\n\n£20 Free Play Promotion Terms and Conditions\n\n•\tOffer only available to players who have never made a real money deposit of £10 or more \n•\tThe £20 Free Play will be credited daily from deposit date: Day 1 = 5 x $1 tickets, Day 2 = 5 x tickets, Day 3 = 5 x $1 tickets, Day 4 = $5 cash bonus, Day 5 =5 x $1 tickets, Day 6 = $5 cash bonus\n•\tWe reserve the right to withhold rewards if there is reason to suspect that a deposit is fraudulent, or that it has not been made with the intention of using it to play real money games\n•\tAll tickets issued as part of the £20 Free Play promotion expire 21 days from issue \n•\tAny unused tickets issued as part of this promotion will be forfeited \n•\tTickets cannot be redeemed for cash or any other value, or be transferred \n•\tDuring the bonus period, you are not permitted to cashout the bonus amount. For the avoidance of doubt, you may withdraw any deposit funds you have made (or winnings from same) at any time.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-11-04T19:14:01Z",
  "updated": "2020-05-01T21:27:43Z",
  "releaseNotes": "Performance improvements and bug fixes",
  "version": "3.28.4",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.52927,
  "reviews": 34712,
  "currentVersionScore": 4.52927,
  "currentVersionReviews": 34712,
  "searchTerms": "poker"
 },
 {
  "appId": "com.iphonesoft3g.texaspoker",
  "title": "Texas Hold'em Poker: Pokerist",
  "description": "Play Texas hold’em poker for free with millions of players from all over the world!\nImmerse yourself in the world of Texas hold'em excitement, challenges and victories to prove that you're a true winner.\nBluff and raise, improve your skills, gain experience, make new friends and become the best poker player ever!\n\nGame features:\n• FREE CHIPS – Play the game every day to get free chips!\n• TOURNAMENTS – Master your poker skills! Participate in WEEKLY Sit'n'Go and Shootout tournaments, where you can WIN unique trophies or millions of chips and top our Leaderboard!\n• GET REWARDS – Up the stakes, win hands, go all-in and unlock achievements.\n• PARTY MODES – Mix up your Texas hold'em poker game with unique game modes and get amazing combinations!\n• BOOST POKER MODE – The biggest \"winner takes all\" weekly tournament, where you spin the reel for a chance to win 5 billion chips! Boost your balance with this incredibly exciting game!\n• PLAY AGAINST THE CASINO – Try your luck at unique poker modes. Challenge the dealer in Split bet poker and Set poker!\n• MULTI-TABLE TOURNAMENTS (MTT) – The most popular offline tournaments are now available online! Play at several tables with lots of worthy competitors and reach the final table!\n• QUESTS – Complete daily quests to get free chips!\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level up. See how many poker tournaments you've won and achievements you've completed. Get unique properties and display them on your profile. View other players' profiles to see how you compare!\n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other Texas hold'em players.\n• FAIR PLAY GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest Texas hold'em experience!\n• LEARN TO PLAY – Are you new to Texas hold’em poker, blackjack or roulette but always wanted to try it?\nOur simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about poker, from the rules of the game to winning combinations.\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\n• SINGLE ACCOUNT – Start playing free Texas hold'em poker on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.\n\nWant more than poker?\nTry our other games for an unforgettable 3D experience:\n• SLOTS – Explore our themed slots with lots of unique features!\n• BLACKJACK – A simple game of \"21\". An exciting 3D game that any blackjack fan is sure to enjoy.\n• ROULETTE – Featuring stunning 3D graphics and three table varieties: French, American, and European.\n• OMAHA POKER – A more dynamic version of poker, with 4 cards in your hand. Have more fun with amazing combinations!\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\n\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!\nhttps://facebook.com/Pokerist\n\nFollow us on Twitter and get free chips!\nhttps://twitter.com/KamaCasino\n\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2010-05-29T00:10:15Z",
  "updated": "2020-05-05T08:59:37Z",
  "releaseNotes": "Stay home. Be safe!\nWe've planned a lot of new features for you to enjoy!\n\nNew VIP System\nVIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!\n\nWeekly Rankings\nCompete against other players and see how you rank each week!\n\nNow MTT starts every 40 minutes!\n\nQuicker Betting\nTry raising a bet and you'll find a new option to bet 1/2 or the full pot! Raise faster!\n\nImproved navigation in the lobby—now you can view playing tables in a chart.",
  "version": "32.6",
  "price": 0,
  "developer": "KamaGames",
  "score": 4.57728,
  "reviews": 1973,
  "currentVersionScore": 4.57728,
  "currentVersionReviews": 1973,
  "searchTerms": "poker"
 },
 {
  "appId": "com.zynga.livepoker.700",
  "title": "Zynga Poker - Texas Holdem",
  "description": "﻿Join one of the world's most popular online poker games with more tables, more tournaments, more jackpots, and more players to challenge than ever before! Whether you prefer casual Texas Holdem Poker or competitive tournaments, Zynga Poker is your home for authentic gameplay.\n\n==ZYNGA POKER FEATURES==\n\nAUTHENTIC WORLD POKER TOUR EXPERIENCE – Play like a pro at the WPT Final Table in the new WPT Tournament mode!\n\nHIGHER STAKES, BIGGER PAYOUTS – Higher buy-ins mean you can win even more virtual chips for every tournament you play.\n\nFASTER TOURNAMENTS – Compete at the traditional 9-person table or the new 5-person table for faster play.\n\nVIP PROGRAM – Earn in-game benefits and features by reaching higher Tiers in our VIP Program! Enjoy exclusive chip package offerings and special poker game modes.\n\nFREE CHIPS – Get a welcome bonus of 60,000 FREE chips just for downloading your new favorite poker game! Plus, win a daily bonus of up to $45,000,000 in in-game money!\n\nTEXAS HOLDEM YOUR WAY – Stay casual with the classic Texas Holdem game or turn up the heat and go for the high-stakes jackpot. It’s up to you how high the stakes go! Texas Holdem Poker games for all experience and skill levels! \n\nFAIR PLAY – Zynga Poker is officially certified to play like a real table experience. Take your online poker games anywhere and know that you’re getting the true Vegas-style game.\n\nVARIETY – Play poker however you want! Join a Sit n Go game or a casual online poker game, and win generous in-game payouts! 5 player or 9 player, fast or slow, join the table and stakes you want. \n\nLEAGUES – Join millions of players across the World competing in our online Poker Season competition. Win the most chips to come out on top and become the Texas Holdem Poker champion!\n\nSOCIAL POKER EXPERIENCE – Challenge your friends to poker games, or meet new friends online. Zynga Poker has the strongest community of any poker game.\n\nPLAY ANYWHERE – Take your favorite card game anywhere. Play seamlessly across all web and mobile versions -- just log in with your Facebook profile!\n\nZynga Poker is the destination for video poker players, social casino fans and table top poker players alike. If you’re a fan of the Vegas casino experience, you’ll feel right at home in our friendly poker community!\n\nDownload Zynga Poker and start playing today! The classic casino card game, now for mobile and online play!\n\nTALK TO US – Let us know what you'd like to see next by hitting us up on Facebook or Twitter:\nFacebook: https://www.facebook.com/TexasHoldEm/\nTwitter: https://twitter.com/zyngapoker\n\nAdditional Information:\n· This Poker game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.\n· The game is free to play; however, in-app purchases are available for additional content and in-game currency.\n· Use of this application is governed by Zynga’s Terms of Service, found at www.zynga.com/legal/terms-of-service.\n· For information about how Zynga uses personal data, please read our privacy policy at www.zynga.com/privacy/policy.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2010-05-14T22:10:46Z",
  "updated": "2020-05-11T15:46:05Z",
  "releaseNotes": "﻿More Rewards, More Challenges, More FREE CHIPS!  Play in all new challenges to earn tons and tons of free chips!",
  "version": "21.94",
  "price": 0,
  "developer": "Zynga Inc.",
  "score": 4.56717,
  "reviews": 10898,
  "currentVersionScore": 4.56717,
  "currentVersionReviews": 10898,
  "searchTerms": "poker"
 },
 {
  "appId": "com.playtika.wsop",
  "title": "WSOP - Texas Holdem Poker Game",
  "description": "Play the world’s #1 POKER APP!\nJoin millions of players in the official World Series of Poker app!\n\nThe most prestigious poker brand raises the stakes with THE authentic poker experience on your iPhone or iPad. Compete to win the ultimate prize in poker; your very own WSOP Bracelet! Do you have what it takes to become a champion? \n\nKey Features: \n● CHIPS EVERY 3 HOURS – Only at the World Series of Poker!\n● WSOP BRACELETS – Fill up your Collectors’ Chip collections & win the most prestigious prize in poker; the WSOP Bracelet.\n● CIRCUIT TOURNAMENTS – Compete in Texas Hold’em poker tournaments, with fast gameplay and magnificent prizes! You can win it all! \n● EXCLUSIVE EVENTS – Return daily to experience new game modes, free chip events and more, for FREE!\n● RNG CERTIFIED – Certified fair hand dealing. The cards in the game are shuffled randomly to provide you the best poker experience.     \n● WSOP CLUBS – Test your skills to earn your place in exclusive clubs and get elite benefits. Will you become a part of poker royalty?\n● POKER RECALL – Challenge your memory and poker skills in our mini-game to win huge jackpots!\n● PIGGY BANK – Bet, save and break! WSOP has your back. Save chips on every bet; the more you bet, the more you’ll save!\n● POKER STATISTICS – Improve your game with the most extensive stats’ tracking in any poker app!\n● TEXAS HOLD’EM OR OMAHA – Your choice! \n● MISSIONS – Stay on top of your game with daily and weekly missions!\n● PLAY LIVE WITH FRIENDS – Invite your friends to play and make it a poker night anytime, anywhere. \n● CONTINUOUS PLAY – Start playing poker on your iPhone or iPad and continue on PlayWSOP.com or Facebook with the same bankroll. \n● GUEST MODE – Rock the tables and play Texas Hold’em or Omaha anonymously. Don’t be afraid to bluff!\n● FACEBOOK CONNECT BONUS – Pad your bankroll with 250,000 additional chips when you connect your account to Facebook. Start your journey to become a World Series of Poker VIP!\n● SLOTS MINI-GAME – Spin and win chips in between hands with the slot machine.\n\nWE’D LOVE YOUR FEEDBACK!\nConnect with us on Facebook (http://bit.ly/WSOP_Fanpage) and on Twitter (http://bit.ly/TwitterWSOP).\n\nPractice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-11-20T15:34:42Z",
  "updated": "2020-04-29T08:11:41Z",
  "releaseNotes": "● We’ve folded more bugs to improve your WSOP experience.",
  "version": "7.7.0",
  "price": 0,
  "developer": "Playtika LTD",
  "score": 4.47339,
  "reviews": 9584,
  "currentVersionScore": 4.47339,
  "currentVersionReviews": 9584,
  "searchTerms": "poker"
 },
 {
  "appId": "com.open4games.pokerup",
  "title": "PokerUp: Social Poker",
  "description": "Chat and play mobile poker with friends. As simple as making a call. \n\nChallenge players across the globe for great prizes and enjoy the best mobile poker experience. \n\nSOCIAL POKER\nFancy a game of poker with friends? Look no further. PokerUp is the only poker application that lets you play with you friends from your contacts. Chat before, during and after the game. Share emotions like in real life using our unique instant video feature during the game. \n\nMOBILE POKER\nDesigned with attention to detail to give you the best mobile poker experience. Play poker holding your phone in one hand. Gameplay has never been cooler with all the controls in the palm of your hand.\n\nSIMPLE POKER\nNo complications, variations or other endless settings. Simply a game of holdem poker with highly intuitive user interface and clean design. \n\nGLOBAL POKER\nChallenge players all over the world in PokerUp Duels and win prizes. Unlock more levels to compete for bigger prizes and challenge new players. \n\nPREMIUM POKER\nEnjoy our premium account feature to enhance your poker experience with extras like unique table themes, hand strength meter and gameplay features such as showing off your bluff of chasing the rabbit. \n\nOTHER FEATURES AND BENEFITS:\n- Multiplayer Games: challenge up to 3 players from your contact list\n- Messenger: use PokerUp as any other messenger to chat with your friends;\n- Leaderboard: challenge your friends and rise up in the friendly leaderboard\n- Night Mode: choose our beautiful night theme to enjoy poker at night\n- Left-Handed Mode: play with your left hand with the same comfort\"\n\nNOTES ON SUBSCRIPTION PRICING AND TERMS:\nOur Premium Account is offered as option with monthly based subscription as per below:\n- Subscription is optional with a single monthly price of $0.99 which will be charged in a currency of your Apple ID account.\n- The length of subscription is 1 month from the date of purchase. \n- The subscription will upgrade your current account to Premium Account status and give you the following benefits: Extra Game Features, Hand Strength Meter, Unique Table Themes, Access to All Duels and Monthly Bonus of 3,000 upcoins. \n- You will be charged to your iTunes Account at confirmation of purchase.\n- Subscription will automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period.\n- Your account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.\n- You may manage the subscription and may turn it off by going to your Account Settings after purchase.\n\nPrivacy Policy and Terms of Use apply.\nhttp://www.pokerup.net/privacy.html\nhttp://www.pokerup.net/terms.html",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-12-20T23:31:59Z",
  "updated": "2020-05-09T06:36:12Z",
  "releaseNotes": "NEW DAILY BATTLE & WEEKLY FINALS\n\nStop sitting out! It's your golden hour to make yourself known to the PokerUp world! Arm yourself with gaming functions to the fullest, as with the new Daily Battle & Weekly Finals the struggle will be even stronger. So do you want to be in the Hall of Fame? - Get ready to sweat a lot!\n\nDAILY BATTLE. Every week, fight with other players for your place in the Club. Do your best to take one of the prize-places to move to the next level - WEEKLY FINALS.\n\n\nWEEKLY FINALS. Only the smartest will get here. If you want, we may call this place THE BATTLEFIELD OF THE REAL TITANS... Only the absolute winners will be honored to enter the throne door of the PokerUp Hall of Fame. We hope to see you among them!\n\n\nWhile you're still here, the others have already begun their battle. Hurry up!\n\nPokerUp",
  "version": "3.5.9",
  "price": 0,
  "developer": "UpGames Limited",
  "score": 4.62626,
  "reviews": 594,
  "currentVersionScore": 4.62626,
  "currentVersionReviews": 594,
  "searchTerms": "poker"
 },
 {
  "appId": "com.yaohua.vegasnights",
  "title": "Vegas Nights Slots",
  "description": "Real slots at Vegas Nights - The Best Free online social Casino Slots Game ! \nPLAY NOW to receive a FREE Welcome Bonus Package!\n\nWorld class gambling game design brings real slot games from the casinos to mobile App! New Features and Surprising Bonuses on All New Slots!\n\nVegas Nights Slots is the best slots game there is, offers the most stunning graphics and a realistic casino experience. Enjoy every benefit you can possibly have on a real slot machine! Progressive Jackpot, Stacked Symbols and Locked WILDs! PLAY NOW and get the best slot experience today!\n\nWhat is special at Vegas Nights Slots?\n• Tournament Day, Quest Day, and Challenge Day bring you Extra bonus every day of the week!\n• All levels All slots 100% FREE to play! New Updates online every week!\n• Multiply your winnings to maximize the benefits with Double Ups and Bonus Games!\n• 2,000,000 FREE Coins for starter bonus, plus Hourly bonus, Daily Bonus, Store Bonus, Holiday Bonus, Friends Bonus, Fan Page Bonus and many more FREE coins available everyday!\n• A variety of WILD, Free Spins, Bonus Games, Jackpots and more interesting ways to play!\nPlay Vegas Nights Slots, the BEST Online SLOTS Game ever!\n\nPlay free slots, slot machine games & online casino. Make a fortune with huge jackpots, free daily games on Vegas Night Slots! Ding Ding Ding! Jackpots!\n\nVegas Nights Slots is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling. Use of this application is governed by Mobee's Terms of Service.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-06-03T10:52:15Z",
  "updated": "2020-01-10T03:28:44Z",
  "releaseNotes": "Real Slots at Vegas Nights!\n\n-Fixed Bugs.\n-Overall upgraded.\n-Improved stability and compatibility.\n\nPLAY NOW!\nGold luck & Happy spinning!\n\nFollow us on Facebook at: \nhttps://www.facebook.com/vegasnights.slots\nIf you run into a bug or have a question, you can contact us at support@mobeegaming.com",
  "version": "2.0.8",
  "price": 0,
  "developer": "Mobee Co., Ltd.",
  "score": 4.88889,
  "reviews": 873,
  "currentVersionScore": 4.88889,
  "currentVersionReviews": 873,
  "searchTerms": "poker"
 },
 {
  "appId": "com.youdagames.pokerworld",
  "title": "Poker World - Offline Poker",
  "description": "FREE OFFLINE TEXAS HOLDEM POKER GAME, no internet required.\n\nBecome the World Poker Champion - play poker around the world in the most famous poker cities.\n\nPoker World is brought to you by the makers of Governor of Poker. In this great offline poker game, you're battling and bluffing your way through several continents and famous poker cities. Ever played poker in Macau? Or visited the majestic Monaco casino? Or went all in in the Bellagio in Las Vegas? This is your chance. And you'll play poker with only one goal: to become the best poker player in the world.\n\nIn Poker World, you start your first poker tournament in the United States. By winning tournaments you progress and build up your reputation as a poker player. You will be able to join bigger and more exciting poker tournaments, get better poker sponsor deals and buy cool items to show off your poker status. And don’t be surprised if you get challenged by the best players in the world. You'll play heads-up poker against these World Top players and climb your way to the top.\n\nTRY POKER WORLD - SINGLE PLAYER POKER FOR FREE, SHOW OFF YOUR SKILLS AND BECOME THE WORLD’S BEST TEXAS HOLD'EM POKER PLAYER IN THIS GREAT OFFLINE POKER ADVENTURE!\n\nGreat game features:\n- MORE THAN 30 HOURS of Texas Hold'em Poker play;\n- OVER 60 POKER CITIES in the world where you can participate in challenging poker tournaments. Every tournament varies in buy-in, number of players and poker winnings;\n- COLLECT STATUS SYMBOLS to build up your reputation in the poker scene and get access to certain tournaments;\n- SIGN SPONSORSHIPS to earn more chips and tickets for special tournaments;\n- WORLD TOP 10: beat all World Top players and win tickets for special tournaments;\n- PLAY ANYTIME, ANYWHERE: Poker offline, no internet connection required:\nThere is no internet connection required to play this great game. And one other big advantage: you don't have to wait for real world players like you do in live multiplayer poker. Slick, fast gameplay!\n- THE BEST AND MOST FUN POKER AI IN THE WORLD\nThis poker engine is created to give you the best poker experience and the feeling you are playing against real players. We made the AI to ensure the game is great for both beginning poker players who are learning poker and experienced players. Refine your card tactics to match the style of your opponents! The offline players will play better in each new city and poker tournament!\n- BIG FREE WELCOME PACKAGE: 20,000 free poker chips;\n- MORE FREE CHIPS: Collect FREE chips every day with your daily bonus;\n- EARN MORE CHIPS: Watch videos and earn free bonus poker chips in this poker paradise;\n- GREAT HD GRAPHICS: The poker game is beautifully designed and includes HD poker graphics for a great poker experience. \n\nMillions of poker players have already enjoyed our Governor of Poker games.\nPlay this very exciting Texas Hold'em poker game and prove you are the best poker player in the world. Press Install and download Poker World NOW.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2017-03-06T22:21:16Z",
  "updated": "2020-05-08T12:43:46Z",
  "releaseNotes": "Thanks for playing this awesome game! You guys gave us some great feedback, so we made lots of updates.",
  "version": "1.17.4",
  "price": 0,
  "developer": "Youda Games Holding B.V.",
  "score": 4.46387,
  "reviews": 3889,
  "currentVersionScore": 4.46387,
  "currentVersionReviews": 3889,
  "searchTerms": "poker"
 },
 {
  "appId": "com.apple.Holdem",
  "title": "Texas Hold’em",
  "description": "Apple’s Texas Hold’em is back! To celebrate the 10-year anniversary of the App Store, we’ve brought back one of its first games, a popular classic. Originally created for iPod, then brought to iPhone, fans will love the polished redesign, featuring new characters, more challenging gameplay, and stunning graphics for the newest iPhone, iPod touch and iPad. Players will also love that it’s free to play — for the very first time.\n\nTexas Hold’em lets you play like a pro against 24 realistic opponents — or with your friends over Wi-Fi. Use all of the hints, tips, tells and your mastery to gain access to more challenging locations with higher stakes and even bigger rewards!\n\nFeatures:\n- Opponents bet, bluff and have secret tells\n- Winning advances you to the next location\n- Includes 10 distinctive locations — including Las Vegas, Paris and Macau\n- Bring up in-game hints, tips, statistics, and player ratings\n- Texas Hold’em is entirely free-to-play, works online or off\n- Play against up to 8 friends with Wi-Fi multiplayer\n- Rotate between immersive first-person and top-down gameplay\n- Re-designed, re-rendered and re-built to use high-resolution graphics that look stunning\n- On iPad, use Split View or Slide Over to play Texas Hold’em while using other apps.\n- Designed for iOS 12 and later",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2019-07-17T07:00:00Z",
  "updated": "2019-10-09T19:28:00Z",
  "releaseNotes": "Texas Hold’em comes to iPad — enjoy it fullscreen, or play it while you do something else using Split View or Slide Over.\n\nThis update also includes accessibility improvements and performance enhancements.",
  "version": "2.1",
  "price": 0,
  "developer": "Apple",
  "score": 4.63743,
  "reviews": 2987,
  "currentVersionScore": 4.63743,
  "currentVersionReviews": 2987,
  "searchTerms": "poker"
 },
 {
  "appId": "com.youdagames.gop2free",
  "title": "Governor of Poker 2 - Offline",
  "description": "PLAY POKER, FREE SINGLE PLAYER HOLDEM POKER OFFLINE on your iOS device and beat every cowboy in Texas in this great Texas Hold'em Poker RPG game called Governor of Poker 2.\n\nMillions of poker players have enjoyed Governor of Poker, without an internet connection.\nWith an easy Texas Holdem poker tutorial for players that don't know how to play poker, but want to learn poker and good opponents for star poker players with real poker skills!\nThe poker chips you win are required to buy houses, win transportation, play against advanced poker AI opponents, win Texas and beat the new Governor of Poker.\n\nTRY GOVERNOR OF POKER FOR FREE, THEN UNLOCK THE FULL POKER ADVENTURE IN THE GAME!\n\n•Get ready for many hours and hours of Hold'm Poker play:\n- Over 80 challenging poker opponents to beat;\n- 27 stunning card saloons in 19 amazing Texas Holdem cities;\n- Get hold of the five big poker assets.\n\n•Amazing Texas Poker AI Engine:\nA great poker engine will challenge new poker players and world poker champions alike.\nRefine your tactics to match the countless poker playing styles of your opponents and watch them go \"Steamy\" and Tilt after showing off your great card bluffs!\nPlayers will play better in each new city and poker tournament, no cheating allowed!\n\n•Full Story:\nGovernor of Poker 2 starts where the first game ended.\nA new Dallas government decided to put a ban on all Texas Holdem poker games and now considers the game to be illegal.\nTime to take matters in your own hands and prove them wrong! Poker isn't a game of luck, but requires poker skill.\n\n•Play Always and Everywhere Offline Poker, no internet connection required:\nBecause there is no live internet connection needed to play a good game of Texas hold'em poker, you can just play Governor of Poker 2 offline anywhere you want!\nDon't wait for human players in multiplayer poker games, that don't respond or leave the pokergame or go allin all the time. Just play this offline poker game !\n\n•Customize poker characters:\nProve you are a bigshot by customizing your poker style to fit your reputation. Be sure to visit one of the many great hat shops across Texas and get yourself the poker deluxe hat of your dreams!\nThe game includes HD Poker graphics for a great experience on all iOS iPhones and iPads.\n\nTravel through Texas by Train, Casino Boat or Stage Coach and play poker whilst on your way to the next poker city in Texas.\nEvery city has lots of exciting cash games and big poker tournaments with even bigger Chip prizes, competition and bigger tournaments. You’ll experience more checks, calls, raises, folds and all-ins than you can imagine!\nEnjoy sit-n-go tournaments, Shootout tournaments, Bounty tournaments, Cash games.\n\n** NO INTERNET CONNECTION REQUIRED **\nYou don't need an internet connection and don't have to wait for other poker players, it's an offline poker game.\n\nHave you always been a Texas holde'm pokee fanatic? You'll love Governor of Poker 2! What are you waiting for partner? Click install, download and prove you're worthy of the great poker title: GOVERNOR OF POKER !\n\n**** Governor of Poker 2 Reviews ****\n- Gamezebo: \"Makes poker accessible without being too simple. Great sense of personality. Excellent poker tutorial.. It's a Royal Flush.\"\n- Jayisgames: \"Governor of Poker 2 is well-made, highly accessible, and surprisingly addictive for all kinds of players.\"\n- Zylom: \"Play this challenging poker game now!\"\n- Miniclip 5 stars out of 5: \"Howdy! Finally it’s here, Governor of Poker 2! Packed with lots and lots of poker extra’s! More cities to conquer and tournaments to play!\"\n\n** NOTE:\nThis pokergame is FREE to play in Amarillo, but will require IAP to enjoy the full game. :)\nPlease contact support@youdagames.com if you have any issues or suggestions, we would love to help!\nYou can also follow us at Facebook : https://www.facebook.com/governorofpoker2\n\nGo download Governor of Poker 2 and enjoy the Texas Holdem Poker Adventure!",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-11-22T08:00:00Z",
  "updated": "2018-03-05T18:47:32Z",
  "releaseNotes": "Bugfixes",
  "version": "3.0.8",
  "price": 0,
  "developer": "Youda Games Holding B.V.",
  "score": 3.60181,
  "reviews": 221,
  "currentVersionScore": 3.60181,
  "currentVersionReviews": 221,
  "searchTerms": "poker"
 },
 {
  "appId": "com.comunix.pokerface",
  "title": "Poker Face social Texas Holdem",
  "description": "Pokerface, the world's first social poker game that enables you to connect and play with friends via live group video chat around a Poker Table.\n\n●●● Playing poker with Avatar is sooo Last year. ●●● \n\nFor the first time now you can play Texas Hold’em Poker together in the most human way. It’s simple and synchronous up to 5 people at the same time, and now you and your friends can meet for your poker night - wherever they are ;)\n\nHow good is your poker face? Will you be able to bluff your friends? Download Poker Face Now: Play Poker with Friends | Multiplayer and let’s see what you’ve got!!! \nReceive up to $1,000,000 welcome bonus.\n\n◉ LIVE FRIENDS:\nPlay Texas Hold'em Poker with your friends anytime anywhere!\n\n◉ DYNAMIC FRIENDS:\nJump and invite your friends to tables in one click. We empower people to have more frequent conversations and fun with the people they care about most.\n\n◉ WORLDWIDE: \nBuy-in and play friendly poker with Friends and their friends too and meet new poker players across the globe.\n\nWelcome to 2019.\n\nFor the first time, you can engage with your friends while you play Texas Hold’em Poker together! Chat before, during, and after the game, share reactions and communicate like in real life as you play using our unique live video feature!\n\nSocial Poker\nWherever you are, wherever they are, play poker with buddies in a tap of a screen! Watch their reactions, communicate naturally as if they’re sitting right beside you. That’s what Poker Face is all about - The only REAL Social Poker App!\n\nMAIN FEATURES:\n\nGroup Video Chat Poker Game: \nLive group video chat with up to 5 people at a time!\n\nLucky Bonus:\nGet exciting prizes from the wheel every 4 hours!\n\nFair Play:\nFair hand dealing. The cards in the game are shuffled randomly to provide you the best Texas hold'em experience!\n\nLook in your opponent’s eyes.\nSheer luck will not do anymore. You’ll have to work your entire body to win this game! Feel the adrenaline rush throughout the fight, and they will be watching every movement you make. Can you keep them in the game and win the pot?\n\nPut on your poker face strategy, feel the heat, and bet like a true VIP poker player!  Download Poker Face NOW!!!\n \nConnect with us on social: \nFacebook:  https://facebook.com/joinpokerface \nTwitter:  @pokerface_game \nInstagram: @pokerface_game \n\n*Practice or success at a social poker casino gaming does not imply future success at 'real money' gambling.\n*This game is intended for an adult audience for amusement purposes only and does not offer 'real money' gambling, or an opportunity to win real money or prizes based gameplay.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2019-04-09T21:44:33Z",
  "updated": "2020-04-29T05:11:43Z",
  "releaseNotes": "Thank you very much for your support and for using Pokerface to socialize with your friends during this difficult time. \nWe are all in this together, and we wish everyone can stay safe and healthy. \nWe're working super hard to make the games much better every day, so you can still have fun with your friends when physically apart!\n\n◉ This update is the best update we ever built we improved connection performance.\n◉ We fixed annoying bug ;) Now, Your game will be smoother than ever!\n\nMany exciting things are developing behind the scenes, and we can’t wait to share them with you!\n\nAlways be sure to keep your game up to date so you can experience everything Pokerface has to offer.\nThis version includes performance improvements & bug fixes. \nMany exciting things are developing behind the scenes, and we can’t wait to share them with you! \nBe sure your game is up to date so you can truly experience all there is to offer.\nDon’t forget to invite your friends to get your FREE REWARDS and to join our Facebook & Instagram communities for more fun and find secret rewards: Enjoying Pokerface? Leave a review.",
  "version": "1.1.10",
  "price": 0,
  "developer": "Comunix Ltd",
  "score": 4.53733,
  "reviews": 2304,
  "currentVersionScore": 4.53733,
  "currentVersionReviews": 2304,
  "searchTerms": "poker"
 },
 {
  "appId": "com.888.Poker.2",
  "title": "888 Poker -Texas Holdem online",
  "description": "Join millions of poker players on 888 Poker and enjoy the best poker experience in the world!\n\nThe 888 Poker mobile app provides the widest variety of Texas Hold’em games including cash games, tournaments, BLAST and SNAP poker games.\n\n\nPlay 888 Poker today with £20 FREE Bonus– no deposit needed!\n\nTERMS & CONDITIONS:\nThis offer is limited to UK Only • New players only • £20 free bonus: includes $1 immediate bonus & $31 in tournament tickets • Bonus will be granted gradually throughout the 7 days after it was claimed • Each part of the bonus will expire 24 hours after it was granted • All immediate bonuses may be withdrawn only after a player has accumulated 2.5 Bonus Points for every $1 of the received Bonus amount • This offer may not be combined with any other offer • Deposit balance is available for withdrawal at any time •Further T&Cs: https://www.888poker.com/terms/20gbp-32USD-poker-reg-bonus_new/ \n\nCheck out other special poker promotions and exciting offers at: https://uk.888poker.com/poker-promotions/\n888 Poker is the ultimate poker experience!\n\nLOADS OF INCREDIBLE POKER GAMES\n• Your pick of Texas Hold’em or Omaha games at your fingertips.\n• Looking for something a little different? Check out our 7 Card Stud, Progressive Knockout poker games and so much more.\n\n888POKER EXCLUSIVE GAMES\n• BLAST – play our explosive short-handed, super-turbo game for the ultimate Sit & Go experience!\n• SNAP fast-fold poker – just fold and get a new hand immediately.\n\nSPECIAL TOURNAMENTS & SERIES \n• XL Series – XL yourself as you head to the championships where massive prizes are up for grabs.\n• Tons of low buy-in tournaments with chances to win huge prizes\n\nUSER-FRIENDLY & PERSONALISED EXPERIENCE\n• Tailor your gaming experience to your personal level and individual preferences.\n• Choose from loads of ‘practice play’ tables to improve your poker skills.\n• Enjoy an easier and smoother connection via 3G/4G LTE Network or WIFI than ever before.\n• Advanced 24/7 online payment platform to ensure all financial transactions are absolutely safe and secure.\n\nAWARDS & ACHIEVEMENTS\n• Over 10 million members playing poker games.\n• EGR award winner - Best Poker Operator, 3 years in a row.\n• Global Gaming Awards - Best Digital Operator of the Year.\n• Winner of Socially Responsible Operator of the Year Awards.\n• Owned by publicly traded company on the London Stock Exchange since 2007.\n• 15 years of responsible, reliable & transparent operational service.\n\nBy associating with support sites such as Gamble Aware: https://www.begambleaware.org/  we make sure that our games are available only to 18+ players: https://www.888poker.com/responsible-gaming/ \nSafer.Better.Together : https://responsiblegamblinguk.org/\n888 responsible : http://www.888responsible.com/ \n\nFollow us for the latest 888poker news\n• Check out our community: http://my.888poker.com/\n• Facebook: http://www.facebook.com/888Poker\n• Twitter: https://twitter.com/888poker\n• YouTube: http://www.youtube.com/888poker\n• Instagram: http://instagram.com/888poker_official",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-09-18T13:39:54Z",
  "updated": "2020-02-12T06:21:19Z",
  "releaseNotes": "Bug fixes and performance improvements",
  "version": "7.4.6",
  "price": 0,
  "developer": "Cassava Enterprises (Gibraltar) Ltd",
  "score": 4.46593,
  "reviews": 7647,
  "currentVersionScore": 4.46593,
  "currentVersionReviews": 7647,
  "searchTerms": "poker"
 },
 {
  "appId": "com.lesunga.Poker",
  "title": "Poker",
  "description": "Poker is a family of card games that share betting rules and usually (but not always) hand rankings. Poker games differ in how the cards are dealt, how hands may be formed, whether the high or low hand wins the pot in a showdown (in some games, the pot is split between the high and low hands), limits on bet sizes, and how many rounds of betting are allowed.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2011-07-14T02:41:06Z",
  "updated": "2015-09-17T00:54:55Z",
  "releaseNotes": "single game bug fixed",
  "version": "5.96",
  "price": 0,
  "developer": "Orgajja Co Ltd",
  "score": 2.55555,
  "reviews": 9,
  "currentVersionScore": 2.55555,
  "currentVersionReviews": 9,
  "searchTerms": "poker"
 },
 {
  "appId": "BuildApp.JajaPoker",
  "title": "Poker Heat: Texas Holdem Poker",
  "description": "Poker Heat – The new FREE ONLINE POKER game brought to you by the creators of World Series of Poker (WSOP) - Playtika\n\nCompete in intense poker games as you place your bets online in the best POKER APP WITH EPIC LEAGUES. Put your Texas poker strategy to the test & place your best bet like a true VIP Texas poker player! Move up the ranks of TEN poker leagues to reach the top and claim jackpots of MILLIONS of chips!! Enjoy the best Vegas Casino Poker online while you compete in live poker games vs other VIP players from Las Vegas and all over the world.\n\nFeel the HEAT with Free Texas Hold’em poker – your free chips await in the poker room - just a click away!\n\nPrepare - New Poker Rings are Coming\nYou might be a good poker player, you might be a great at Texas Holdem, but can your poker skills grant you our RING? We’ve just turned the HEAT ON and enhanced your poker casino experience with an all new poker rings collection. Play free Texas Hold’em poker and complete missions to win crowns. After you’ve earned enough crowns, and only then, you will be worthy of the ring. Claim your free poker chips and wear your best ring at the poker table and flaunt your achievement in front of your opponents\n\nLeague-based competition\nLooking for something more exciting than simple Las Vegas poker games, where you can truly test your poker strategy? Poker Heat’s unique league-based competition with party-like classic poker gameplay gives you intensely competitive gameplay and large variety of online poker rooms, better than any other standard online poker app. Start by playing in the Newbie Court to get into the ‘Promotion Zone’ and progress into the next league. Compete in 10 leagues, bet your free chips online and finish in the top tier to win HUGE PRIZES!! Free Poker games are here for you to play – Place your gamble, join The poker party and play free online poker!\n\nCompete against friends and players from around the world\nParticipate in a world poker tour straight from your phone! Show your poker hand, ante up, go ALL IN or fold - bluff your friends and outsmart poker players from all around the world! Login anonymously or with your Facebook profile to show everybody you are the real poker star in one of the best free cards games online. Want to play classic poker online with a friend? Just use the INVITE button at the poker tables and play free poker Texas Holdem together. Participate in exciting poker tournaments and win BIG!\n\nWin Daily Bonuses and Free Perks\nGet your daily free poker chips bonus multiplied by your league ranking! The higher the league – the bigger the multiplier! A Prize pool filled with free chips awaits the league’s top poker players in the Promotion Zone. Reach the World Class league to become a poker legend of poker stars in Poker Heat - the best online Texas Holdem app! Play poker online games anytime, everywhere!\n\nExciting Content\nGet into online casino of poker heat as a true poker king and discover nine different stadiums with their own poker style and mood! Start at the Newbie Court, advance through Victory Cage and move on to the Ring of Honor - for the true poker pro! Enjoy player statistics, hand strength info, amazing animations and so much more! Find special deals at the Chips Store to buy chips instantly for a cheap price!\nConnect with us on Facebook (https://www.facebook.com/Pokerheat/)\nInstall the latest Texas Holdem poker game, brought to you by the creators of the WSOP official online game (World Series of Poker).\n\nThis game is intended for an adult audience (21+) for amusement purposes only and does not offer ‘real money’ gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at ‘real money’ gambling.\n\nPoker Heat – can you feel it?",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Sports"
  ],
  "contentRating": "17+",
  "released": "2012-08-15T07:00:00Z",
  "updated": "2020-01-29T07:04:38Z",
  "releaseNotes": "- Performance and stability improvements\n- Bug fixes",
  "version": "4.41.7",
  "price": 0,
  "developer": "Playtika LTD",
  "score": 4.77626,
  "reviews": 6454,
  "currentVersionScore": 4.77626,
  "currentVersionReviews": 6454,
  "searchTerms": "poker"
 },
 {
  "appId": "cota.iphone.TexasHoldem",
  "title": "Offline Poker - Texas Holdem",
  "description": "Free Offline Poker at its best!\n\n* Offline Play - play anytime, anywhere, no waiting for slow online opponents\n* 142 Unique Offline Opponents (some seemingly drunk and aggressive, some tight)\n* Fast Fold - no waiting for the next hand\n* Leagues - play offline, collect thousands of league chips if you go online\n* Optional Increasing Blinds (doubling every 5, 10 or 15 minutes)\n* Heads Up or Six Player Tables\n* Realistic sounds, and smooth animations\n\n\n\n=== A NOTE ABOUT THE AI (ARTIFICIAL INTELLIGENCE) ===\n\nThe cards are drawn 100% randomly and nothing is done to give the AI any unfair advantage whatsoever.\n\nThe AI learned by playing hundreds of millions of hands against itself (starting completely randomly and gradually improving). To test it I had it play online on real money holdem tables and it could hold its own.  It plays better than I do myself.\n\nFor those users that are whining about the app being rigged against them, you should probably recognize that you don't really know how to play poker very well and that you don't have a real understanding of statistical variation.  \n\nIf you are unable to beat the AI and feel it rigged against you, please let me know if you play anywhere online for real money.  I myself (the developer) am a less than average poker player (I lack the required patience), but I am sure I can beat you.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2011-10-14T20:02:41Z",
  "updated": "2020-05-10T11:46:13Z",
  "releaseNotes": "+ Further development of the poker AI\n+ Fixes some occasional crashing that occurred on the Cashier screen",
  "version": "8.06",
  "price": 0,
  "developer": "The Othernet, LLC",
  "score": 4.67037,
  "reviews": 540,
  "currentVersionScore": 4.67037,
  "currentVersionReviews": 540,
  "searchTerms": "poker"
 },
 {
  "appId": "com.youdagames.gop3multiplayer",
  "title": "Governor of Poker 3 - Online",
  "description": "Play this great multiplayer Texas Hold’em Poker game for FREE today!\n\nBecoming a poker pro is a long journey through the Wild West in Texas. You will start as a poker rookie and work yourself all the way up to become a VIP poker player, a high roller to end up winning high stake poker games in Las Vegas!\n\nDownload the game now, get your free chips, invite your friends and make it a great poker night. Still not sure this is the best poker game? Read all Governor of Poker game features.\n\nThe main game features : \n● BIG FREE WELCOME PACKAGE:\n$30,000 free poker chips, gold and hat!\n● 7 DIFFERENT POKER FORMATS:\nCash games, Sit & Go tournament, Spin & Go, Heads Up Challenge, Push or Fold, Big Win, Jackpot poker and Royal poker.\n● POKERTEAMS: PLAY WITH FRIENDS\nInvite friends and compete against other teams and check out the all new challenges!\n● ENJOY TEXAS:\nTravel through Texas by winning poker tournaments, beat friends at Texas Hold’em cash games and Big Win Poker tournaments. The further you travel the higher the stakes!\n● BLACKJACK 21:\nPlay Blackjack for many different betting amounts.\n● FREE CHIPS:\nGet your free chips stack bonus every 4 hours!\n● MISSIONS: \nComplete them all in every area and claim great rewards!\n● WIN BADGES & ACHIEVEMENTS:\nDistinguish yourself by winning badges and trophies with your poker skills!\n● PLAY ALWAYS AND EVERYWHERE:\nPlay poker on your mobile device and continue to play on your laptop.\n● BONUS FOR CONNECTING WITH FACEBOOK:\nEarn extra chips and play poker with friends!\n● CHAT:\nTalk with other hold’em players through chat and animating emoticons. Use them to bluff or taunt players so you win the poker hand !\n\nDo you want more than just poker? Do you want to join the greatest free multiplayer poker experience in the world? The only thing you need to do is to download this exciting Texas Holdem poker game.\n\nNote: The games are intended for an adult audience. (e.g Intended for use by those 21 or older)\nThe games do not offer “real money gambling” or an opportunity to win real money or prizes. (e.g the game is for amusement purposes only)\nPractice or success at social casino gaming does not imply future success at “real money gambling”.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-12-10T17:11:54Z",
  "updated": "2020-04-15T07:25:53Z",
  "releaseNotes": "A new Governor of Poker 3 update has arrived:\n- We have made it easier for you to find information about a certain feature! Simply tap on the question mark icon now available in each menu.\n- Tweaked the volume of loud sound effects.\n- Stability improvements.",
  "version": "6.4.2",
  "price": 0,
  "developer": "Youda Games Holding B.V.",
  "score": 4.67645,
  "reviews": 2352,
  "currentVersionScore": 4.67645,
  "currentVersionReviews": 2352,
  "searchTerms": "poker"
 },
 {
  "appId": "uk.fulltilt.www",
  "title": "Full Tilt Casino & Poker Games",
  "description": "AN AMAZING POKER AND CASINO EXPERIENCE\n\nThe great thing about the Full Tilt mobile app is that it allows you to enjoy your favourite poker and casino games anytime, anywhere. Download the Full Tilt app now and jump into the game of your choice!\n\nTHE BEST ONLINE POKER EXPERIENCE\n\n• Hit No Limit Texas Hold’em and Pot Limit Omaha tables\n• Sit&Go and Multi-table tournaments with huge prizes\n• Play Spin&Go, Zoom or any other special poker game\n• Sit at real-money or play-money poker tables\n• Take advantage of the best poker promotions\n\nALL THE BEST CASINO GAMES\n\n• Play the world’s most popular casino games, such as blackjack, roulette and slots\n• Play Live Casino games on your mobile device with a real dealer\n• All the best Slots available, with huge real money Jackpots\n• Try Multi-Player mode and catch-up with friends at the tables\n\nGREAT FEATURES\n\n Multi-table functionality\n• ‘Find your seat’ feature\n• Table chat\n• Lobby filters\n• Built-in Contact Support Form, with our Support team available 24/7!\n\nVisit our website for more information on what we have to offer. Join our poker community on social media and connect with poker players from around the world.\n\nhttps://www.facebook.com/Fulltiltpoker\nhttps://twitter.com/FullTiltPoker\n\nPlay anytime, anywhere – download the Full Tilt mobile app now.\n\nThis is a real money gambling app. You must be at least 18 years old, and of the legal age of majority in your jurisdiction, to create a Stars Account.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.\n\n************************\n\n£20 Free Play Promotion Terms and Conditions\n\n- Offer only available to players who have never made a real money deposit of £10 or more\n- The £20 Free Play will be credited daily from deposit date: Day 1 = 5 x $1 S&G (Spin & Go) tickets, Day 2 = 5 x $1 S&G tickets, Day 3 = 5 x $1 S&G tickets, Day 4 = $5 cash bonus, Day 5 =5 x $1 S&G tickets, Day 6 = $5 cash bonus\n- We reserve the right to withhold rewards if there is reason to suspect that a deposit is fraudulent, or that it has not been made with the intention of using it to play real money games\n- All Spin & Go tickets issued as part of the £20 Free Play promotion expire 21 days from issue\n- Any unused tickets issued as part of this promotion will be forfeited\n- Tickets cannot be redeemed for cash or any other value, or be transferred\n- A cashout at any time during the bonus period will leave you ineligible to claim this bonus",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-05-17T07:12:23Z",
  "updated": "2020-04-09T11:07:04Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "1.119.0",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.41836,
  "reviews": 1035,
  "currentVersionScore": 4.41836,
  "currentVersionReviews": 1035,
  "searchTerms": "poker"
 },
 {
  "appId": "com.bskyb.SkyPoker",
  "title": "Sky Poker Texas Holdem & Omaha",
  "description": "With Sky Poker’s app you can enjoy all your favourite Cash games, Tournaments and Sit & Go’s on your iPad and iPhone. Play in £’s today against thousands of like-minded UK poker players and learn to improve your game with our dedicated poker strategy videos.\n \nThe Sky Poker app allows you to play whenever and wherever you like. New customers will need to create a new account which is quick and easy. Existing customers can simply log in with their Sky Poker User ID and PIN, or with the lightening quick Touch ID.\n \nAs a Sky Poker customer you can enjoy some fantastic features within the app:\n•              All your favourite Hold’em, Omaha and Omaha Hi-Lo Cash games, Tournaments and Sit & Go’s\n•              Access to strategy videos that will help you develop your game\n•             ‘Play Now’ Feature – we will find you a Cash table or Sit & Go in seconds that suits your bankroll\n•              Enjoy all the great features of the Sky Poker Desktop tables, such as auto top up\n•              Full account history, deposits and withdrawals all direct from your device\n•              Access to all our great promotions and our dedicated poker forum from the app\n•              Log in with your fingerprint using Touch ID\n•              Deposit with Apple Pay\n \nAt Sky Poker we love to reward our players, that’s why whenever and wherever you play you will earn poker points. These can be converted to cash bonuses every week through the Sky Poker Rewards loyalty scheme. Visit the promotions area today for details on how to opt in to Sky Poker Rewards and start earning bonuses every week.\n\nUse Apple Pay to deposit quicker and easier than ever before.\nSee this link for details on how to set up Apple Pay on your device: https://support.apple.com/en-gb/HT204506\n \nThe Sky Poker app is brought to you by Bonne Terre Limited, an Alderney registered company majority owned by CVC Capital Partners and licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Bet is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group.  The Sky trademarks used in the app are owned by the Sky Plc group of companies and are used under license. To place a bet with Sky Bet you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Bet. Customers located outside of the UK or Ireland will be prohibited from using this app.\n \n© 2017 Bonne Terre Limited. The Sky trademarks are owned by the Sky Plc group of companies and are used under licence.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-05-12T10:27:39Z",
  "updated": "2018-02-12T19:50:20Z",
  "releaseNotes": "We've improved our support for Face ID and Touch ID and fixed a few bugs.  If you enjoy using Sky Poker please support us by leaving an App Store review.",
  "version": "4.7",
  "price": 0,
  "developer": "Sky Betting & Gaming",
  "score": 4.37587,
  "reviews": 572,
  "currentVersionScore": 4.37587,
  "currentVersionReviews": 572,
  "searchTerms": "poker"
 },
 {
  "appId": "com.geaxgame.pokerkingonline",
  "title": "Texas Holdem Poker",
  "description": "Do you love poker? Do you want to play with real people whenever and wherever you want? The only thing you need is your mobile phone and internet connection! Now just add a bit of skill and you'll have your first winnings! It doesn't really matter whether you are a newbie without basic knowledge of rules or a weathered poker-shark, you will find a table suitable for you. Come and join the club where poker fans from all over the world gather to play and chat about the best gambling game in the world. \n\nGame features: \n* Live Chat \n* Personal Avatars \n* Sit-n-Go tournamet Mode \n* Ring Games \n* Free daily Gold \n* Lottery Draw \n* 200+ Virtual goods you can send ppl on tables \n* Facebook connect for fast registration (optional) \n\nWe request the following permissions for the following reasons: \n- Network communications – \n1.To play online with other players. \n- Phone calls: Preventing “phone time-outs” in the middle of the game. \n- Vibration: Notification in silent areas. \n- Billing: To enable a possibility of purchasing premium services. \n\nIf you love poker, come and join the club for devoted and occasional poker-players alike. Getting in is easy. Just click on the button and download the app now for free.",
  "genres": [
   "Games",
   "Sports",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2011-07-13T23:53:14Z",
  "updated": "2019-10-12T08:12:36Z",
  "releaseNotes": "1.fixed facebook login bug\n2.Optimization for IPhone X",
  "version": "4.0.0",
  "price": 0,
  "developer": "Guizhou Yingfantian Online Game Co.,Ltd.",
  "score": 4.38842,
  "reviews": 242,
  "currentVersionScore": 4.38842,
  "currentVersionReviews": 242,
  "searchTerms": "poker"
 },
 {
  "appId": "com.partypoker.poker",
  "title": "partypoker: Texas Holdem Poker",
  "description": "Play poker ONE HANDED wherever and whenever you want with the ALL NEW partypoker app!\n\nPlay for FREE or choose the thrill of REAL MONEY poker action! Choose from Sit & Go’s, multi-table tournaments, cash games or our very own SPINS, where players can turn a $5 buy-in into $1 MILLION. \n\nAnd now, partypoker is injecting even more fun into your poker-playing experience with a host of NEW FEATURES like: \n•\tA revolutionary PORTRAIT gameplay view that allows you to play any game ONE HANDED on the go \n•\tMULTI-TABLING! Play up to four tables at once on a single screen.\n•\tA gestural slider bar for RAISING\n•\tA new HAND REPLAYER feature that allows you to re-live hands and see your showdown percentages across all game types\n•\tCHAT with your friends and rivals\n•\tIn-game currency: Earn Diamonds and convert them into stuff you can throw at your opponents, or go RABBIT HUNTING to see the cards that would have been dealt.\n•\tA new lobby that allows you to switch between a carousel or tiled view and use filters to narrow results.\n\nPlay for FREE or choose the thrill of REAL MONEY poker action! Choose from Sit & Go’s, multi-table tournaments, cash games or our very own SPINS, where players can turn a $5 buy-in into $1 MILLION. \n\nTHE BEST POKER ACTION:\n• POKER GAMES – play all Hold’em and Omaha variations\n• CASH GAMES – play Short Deck and Texas Hold’em anytime, anywhere with blinds starting at $0.01/$0.02.\n• MULTI-TABLE TOURNAMENTS – we have over $6 million in guaranteed prizes for our weekly Power Series. We also have Gladiator, Bounty Hunter, Daily PLO and many more tournament formats to choose from\n• LIVE Events - qualify for partypoker MILLIONS or World Poker Tour and WSOP circuit events, where you can play in some of the most glamorous locations across Europe, North America and Latin America.\n• SIT & GO'S – choose from hundreds of Texas Hold’em tables with buy-ins from as little as $1.10.\n• FREEROLLS – practice for free and win real prizes.\n\nFEATURES:\n• SPINS - three-handed Sit & Go tournaments where the size of the prize pool is randomly multiplied by between 2 and 240,000 before the first card is dealt. This means you could turn a $5 buy-in into $1 MILLION.\n• fastforward poker - don’t like the hand that you’ve been dealt? Fold instantly and get dealt new cards at a different table.\n• Short Deck – a variation of poker which uses just 36 cards. \n• Casino side games - enjoy the thrill and excitement of blackjack or roulette while you’re in a hand!\n• Become a partypoker VIP! Get up to 40% CASHBACK on your rake\n\nFor our latest promotions and exclusive offers check out our website and follow us on social media:\nwww.partypoker.com/\nwww.partypoker.com/live\nwww.partypoker.com/blog\nfacebook/partypoker\nTwitter @partypoker\n\nEXPLORE OUR CASINO:\nPlay table games like blackjack and roulette or choose from over 1500 of slots and jackpot slot games, including STARBURST, WOLF RUN, BOOK OF DEAD and RAINBOW RICHES.\n\nBET ON SPORTS:\nBet IN-PLAY, EDIT your bet and cash out AUTOMATICALLY with a single click on all of the UK and Europe’s top football leagues.\n\nSo what are you waiting for? Download partypoker today for the best poker, casino and sports betting experience on mobile.\n\nResponsible Gambling:\n18+. \n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org. For users in the Republic of Ireland, please contact telephone 1800 753 753 or visit www.problemgambling.ie.\n\nLicensing:\npartypoker operates under licence and in accordance with applicable laws and regulations. For further licence information, please visit our website at www.partypoker.com.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-09-05T07:00:00Z",
  "updated": "2020-05-04T13:35:02Z",
  "releaseNotes": "At partypoker, we are always updating our app to deliver the best online poker experience. The latest update introduces a new main lobby and cash game lobby as well as introducing portrait table support for cash games.",
  "version": "6.3.0",
  "price": 0,
  "developer": "ElectraWorks Limited",
  "score": 4.2924,
  "reviews": 3933,
  "currentVersionScore": 4.2924,
  "currentVersionReviews": 3933,
  "searchTerms": "poker"
 },
 {
  "appId": "com.ptfarm.Pokerrrr",
  "title": "Pokerrrr 2- Holdem, OFC, Omaha",
  "description": "Pokerrrr 2 is the ultimate multiplayer poker app to play with your buddies! \n\nIt’s as simple as creating a private room or tournament clock/timer, setting the rules( No Limit Hold’em, OFC-13 card poker, Short Deck Poker, Pot-Limit Omaha, Round of Each, Sit-and-go, MTT and so on) and dealing out the cards. It’s like having poker night in the palm of your hand, anytime, anywhere!\n\nWant to meet new poker buddies? Join our Global PRR Challenge or create a poker club to play with players from around the world!\n\nHow to Play?\n- Host games live or online in private rooms, just for friends!\n- Choose Multiple game modes, including NL Hold’em, OFC-13 card poker, SNG, MTT, PLO, R.O.E.and tournament clock, for up to 9 players.\n\nCreate your own Clubs :\n- Create free private clubs with your friends from around the world, or join other clubs to meet new players.\n- Each club has a members-only chat and place for hosted games/records.\n- Share any intense hand with club friends whenever you want.\n- Invite friends to a club with the unique club code\n\nPoker party on the Big Screen :\nHosting a poker party? Host the game with your phone and use iPad to join it! Community cards will be shown on iPad(connected to Big Screen) while two hand cards are dealt to each player's phone. Big Screen mode supports all regular games and SNG.\n\n《 What others say 》\n\"It’s great for those times when you don’t have a deck of cards or poker chips lying around.\" - AppAdvice\n\n\"Don’t wait for Vegas. This app lets you create your own poker club and play poker with friends anytime, anywhere.\" - Yahoo\n\n”It’s a really great update on poker playing experience, so download Pokerrrr and try something new for POKER NIGHT.“ - APPSAGA\n\nTop p2p poker app in AppStore:\n- Top 1 in 20+ countries\n- Top 10 in 60+ countries\n\n-------------------------------------\n\nAdditional information:\n- This game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.\n- Use of this application is governed by Pokerrrr 2's Terms of Service, found at http://pokerrrrapp.com/terms/",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-01-30T17:37:53Z",
  "updated": "2020-04-29T02:31:07Z",
  "releaseNotes": "- Fix minor bugs.",
  "version": "4.3.18",
  "price": 0,
  "developer": "PT.FARM CO., LTD.",
  "score": 4.60407,
  "reviews": 639,
  "currentVersionScore": 4.60407,
  "currentVersionReviews": 639,
  "searchTerms": "poker"
 },
 {
  "appId": "com.bet365.bet365PokerApp",
  "title": "bet365 Poker: Texas Holdem",
  "description": "bet365 Poker is our primary poker app to enjoy playing real money poker. We have an extensive range of card games including Texas hold’em, Omaha, Jackpot Twister, Six Plus Hold’em, Sit & Go, Premium Steps and lots of tournaments that you can sign up to.\n\nYou can play how you want with limit games or no limit games, up to 9 players at a table and stakes starting from as little as €0.02.\n\nThis is a real casino poker experience, with millions of real players playing poker from around the world.\n\nYou can:\n\n•\tPlay at our exclusive bet365 Premium Tables and join up to six tables at once\n•\tPlay Six Plus Hold'em poker\n•\tPlay for prize pools of up to €100,000 in our Jackpot Twister sit & gos\n•\tPlay in multi-table tournaments\n•\tCompete in a range of exciting bet365 exclusive monthly promotions\n•\tComplete missions to get prizes\n\nUse your existing bet365 account to log in, or sign up now.\n\nbet365 brings you our best online poker experience. Place your bets and compete against poker players from around the world. Join exciting tournaments featuring Texas Hold’em and Omaha Poker games, playing with real money.\n\nPlay all your favourite poker games, like speed Poker, Sit & Go, Twister Poker or a traditional cash game. Sign up for tournaments for both Hold’em and Omaha. Play casino games like Blackjack, Roulette and slots whilst you wait on your table.\n\nPlay Texas Hold’em Poker games on your phone with other players from all over the world. \nStay casual with the classic Texas Hold‘Em cash game or turn up the heat and go for the high-stakes jackpot. It’s up to you how high the stakes go!\n\nPlay Poker however you want. Join a Sit n Go game or a casual card game, play with 2 players or 9 players, fast or slow game - join the table and stakes you want.\n\nThe bet365 Poker app features:\n\n•\tTexas Hold’em poker\n•\tOmaha poker\n•\tSit&Go\n•\tMulti-table tournaments with huge prizes\n•\tPlay Six Plus or Twister poker\n•\tTake advantage of some great poker promotions\n•\tPlay the world’s most popular casino games, such as Blackjack and Roulette\n•\tFantastic slots are available, with huge real money jackpots \n\nDownload the bet365 Poker app and start playing today! \n\nOur customer support team is on hand 24/7 to help with any queries.\n\nYou must be 18 or over to have a bet365 account.\n\nThis is a real money gambling app. Please gamble responsibly.\n\nFor the full terms and conditions please follow the link to the Developer Website below.\nPlease read the bet365 Privacy Policy (see link below) before installing this application. By installing and opening the application you are accepting this policy.\n\nFor gambling help and support in the UK, users can contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org .\nFor gambling help and support in IE, users can contact Gamble Aware at 1800 753 753 or visit http://www.problemgambling.ie .",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-10-24T00:03:19Z",
  "updated": "2020-04-06T09:15:19Z",
  "releaseNotes": "We've improved the user experience and made the app more stable.",
  "version": "20.1.05003",
  "price": 0,
  "developer": "bet365",
  "score": 4.27599,
  "reviews": 558,
  "currentVersionScore": 4.27599,
  "currentVersionReviews": 558,
  "searchTerms": "poker"
 },
 {
  "appId": "com.youdagames.learnpoker",
  "title": "Learn Poker - How to Play",
  "description": "Learn how to play Texas Holdem Poker with this great iOS poker tutorial app.\nThis is an easy poker guide for any holdem player and will teach poker basics for beginners and advanced poker lessons for advanced card players.\nRules are explained hands-on, so we'll teach you at the poker table with offline opponents.\n\nWe explain rules about Texas Hold'm Poker, winning hands and Texas Holdem terms.\nYou will learn poker quickly and use this app to improve your poker skills to become a real pro.\nDon't be a dummy and learn the difference between: preflop, flop, turn, river, showdown and all-in.\n\nSupported languages for this tutorial: English, German, French, Dutch, Spanish, Italian, Brazilian, Russian, Japanese, Chinese, Malaysian, Thai, Indonesian\n\nNote:\n-This easy to use iOS app is offered for free by the offline Poker Game: GOVERNOR OF POKER !\n-If you have any questions, please send a mail to: support@youdagames.com",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2015-09-12T00:08:50Z",
  "updated": "2018-01-26T23:29:20Z",
  "releaseNotes": "Updated sdks to fix crashes",
  "version": "1.0.5",
  "price": 0,
  "developer": "Youda Games Holding B.V.",
  "score": 3.96875,
  "reviews": 32,
  "currentVersionScore": 3.96875,
  "currentVersionReviews": 32,
  "searchTerms": "poker"
 },
 {
  "appId": "uk.me.decipher.blackjack7",
  "title": "Blackjack",
  "description": "Play blackjack as if you were at the casino! This is the MOST POPULAR blackjack game on the store, with millions of players around the world! Learn blackjack 21 with this FREE blackjack game (designed and optimised for iPhone, iPhone X and iPad) featuring play prompts to help hone your blackjack skills and detailed career history to keep track of your wins! Travel to new destinations for HIGH ROLLERS added often for WINNERS! Including large, funky (and ever changing) detailed cards and chips - see if YOU can PLAY NOW against the dealer and WIN, by getting 21 without going bust! \n\nFeatures:\n• FREE BONUS CHIPS - play every day without ever having to pay! \n• LEARN BLACKJACK - play prompts and tutorials to help hone your skills \n• TRACK YOUR PROGRESS - keep track of your achievements via your own profile page and GET REWARDED with free chips and cool new deck designs for testing your new blackjack skills! \n• UP THE STAKES by travelling between real-world locations for new challenges! \n• High-definition, retina graphics - check out our COOL and unique cards and chip designs NOW! \n• REAL LIFE FEEL - tap your chips, cards and the table as if you were at the casino\n• Blackjack casino rules pays 3:2\n• Insurance casino rules pays 2:1 if the dealer has blackjack\n\nIf you go bust - don't worry, you'll get chip bonuses every 20 minutes and every day so you can come back later and play more blackjack if your luck runs out. Make sure to ENABLE PUSH NOTIFICATIONS FOR FREE CHIPS!\n\nPlease note, in app purchases cost real money - these can be disabled in the system preferences. \n\nWe hope you enjoy playing blackjack! If you have any questions or suggestions, please contact us using the app.\n\nThis game is only available to users of legal age and offers no possibility of winning money or anything of monetary value.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2010-05-20T21:40:10Z",
  "updated": "2020-05-01T16:53:46Z",
  "releaseNotes": "Stay Home... play Blackjack World Tour!!\n• We’ve added a cool new mini game for WINNERS with EPIC NEW GRAPHICS! \n• Minor bug fixes also added",
  "version": "4.20.3",
  "price": 0,
  "developer": "TapTapBoom Ltd.",
  "score": 4.59741,
  "reviews": 2248,
  "currentVersionScore": 4.59741,
  "currentVersionReviews": 2248,
  "searchTerms": "poker"
 },
 {
  "appId": "ru.crazypanda.wpcm",
  "title": "Poker Game: World Poker Club",
  "description": "It's arrived! Now the incredibly popular World Poker Club social game is available on App Store!\n\nFind yourself in the world of bets, stakes and winnings! Play your favorite poker games – the Texas Hold 'Em and Omaha and make sure to try your luck in the competitive Weekly tournaments. Finally, enjoy the stylish interface and friendly atmosphere we’ve created in the World Poker Club especially for you! \n\nTo hype up the experience and the thrill we’ve prepared all sorts of surprises and bonuses for our players: complete themed collections by playing in different poker rooms and exchange them for game currency; send gifts to your friends and receive kind gestures in return; use the chat to talk to other players and aim high in the top charts of our club. Prove to millions of other players that you’re on the very top of your poker game. \n\nLet’s play! \n\nFEATURES: \n\n• Free chips \n• Poker classics: the Texas Hold 'Em and Omaha \n• Weekly tournaments \n• Play via your Facebook account \n• Player ratings \n• Stylish interface and friendly atmosphere \n• Gifts, awards and collections",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-01-25T23:01:11Z",
  "updated": "2020-02-26T07:26:46Z",
  "releaseNotes": "Dear players!\nThe new World Poker Club app version contains a number of bug fixes that make the app run faster and smoother. However, there is a major overhaul coming up with the following update: stay with us to be the first to reap all the benefits of the next version and check out a few nice surprises!",
  "version": "1.139",
  "price": 0,
  "developer": "Crazy Panda",
  "score": 4.80328,
  "reviews": 122,
  "currentVersionScore": 4.80328,
  "currentVersionReviews": 122,
  "searchTerms": "poker"
 },
 {
  "appId": "com.wonderpeople.megahitpoker.global",
  "title": "Mega Hit Poker: Texas Holdem",
  "description": "Go against up to 1,000 players at the same time to play big and win even bigger!\n\n   Mega Hit Poker is designed to offer the BEST EXPERIENCE POSSIBLE in a hand held device! Become a Champion in our Top Player Mode and prove that you are better than the rest! Are you up for the challenge? Play now and find out!\n\n* RNG Certified\n  The card shuffling algorithm used in Mega Hit Poker has been tested and certified by iTech Labs! You can check the certification by going to the in-game settings menu! Mega Hit Poker supports fair game play!\n\n* Features\n  FREE CHIPS EVERY 4 HOURS - Get up to LOADS of free chips! Don’t forget about the Mega Spin that comes after every 5 servings! Spin and win big!\nMASSIVE ONLINE TOURNAMENTS - Compete with UP TO 1,000 PLAYERS in real time! Win and prove that you are better than the rest!\nVARIOUS GAME MODES – Cash Games, Sit & Go, Shoot-out, and Tournaments. Play what you want! Don’t forget about the special game modes we have as well!\nAll-in - Play big, win big! The real player is never afraid to go all-in.\nPLAYER RECORDS - Check your play history to improve yourself or check others to find out their play patterns to beat them!\nSOCIAL FEATURES – Connect your Facebook Account to the game to get a handsome reward! Being able to safely secure your account is a plus!\nSLOT MACHINE – Bored at the table? Don’t worry! Hit the SLOTS while you’re waiting!\nTOP PLAYER – Are you a Champion? Can you reign supreme over others? Prove to the rest that you are better and mark your name in the Hall of Fame!\nVARIOUS EVENT SALES PROMOTION – Interested in buying some chips? We’ve got you covered! Enjoy the various sales promotions we have going at ALL TIMES!\n\nWe are happy to hear your voice! Come find us at Facebook Page(http://bit.ly/MHP_Fanpage) or send us a ticket via the in-game CS feature!\n\nIt’s your time to shine! Hit the tables and show them what you’ve got!\n\nPractice or success at social gaming does not imply future success at “real money gambling.\"",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-07-04T01:42:28Z",
  "updated": "2020-03-30T00:04:39Z",
  "releaseNotes": "Jump in for the best poker experience ever!\nMega Hit Poker is RNG ready! Certified by iTech Labs!\n\n*Whats new?\n- Added New Content: Challenges\n- Drastically Improved VIP Benefits\n- New Player Level Bonuses",
  "version": "v.3.10.1",
  "price": 0,
  "developer": "Wonder People Co. Ltd",
  "score": 4.54385,
  "reviews": 228,
  "currentVersionScore": 4.54385,
  "currentVersionReviews": 228,
  "searchTerms": "poker"
 },
 {
  "appId": "com.grosvenor.grosvenor",
  "title": "Grosvenor Casino Online Games",
  "description": "Bringing the thrill of the casino, to you. New players will be greeted with a 100% deposit match up to £20 when you sign up with Grosvenor Casinos* - you can do this quickly and easily through the app. Once you’re logged in, you’ll regularly be offered great promotions, competitive bonuses, boosted odds and more. \n\nAt home or on the go, the Grosvenor Casinos app puts you at the heart of every game, hand, race, bout and beyond. The ultimate experience in mobile gaming, our Grosvenor Casinos app combines the buzz of the casino floor with the excitement of online slots and puts it in the palm of your hand. \n\n\nSlots and Games\n\nThe full selection of slots and games in our app have been specifically chosen to bring you the best mobile experience possible. With slots varying from classics like Lucky Ladies Charm, Rainbow Riches and Cleopatra, to more modern games like Extra Chilli as well as exciting Daily Jackpots – we offer something for everyone. We’ve also got a great collection of Grosvenor Original titles on offer, like Egyptian Fortunes and Extra Fruity that you can play here first! \n\n\nLive Casino\n\nOur world-class dealers bring you a huge range of table games, including Roulette, Blackjack, Live Poker and Baccarat. As well as exclusive games, like Victoria Baccarat, that are streamed live from the heart of our very own London Victoria casino. All Live games are streamed straight to your device in stunning HD, ensuring you feel the thrills of every game in real-time, in the most realistic Live Casino experience around. Better still, all of our standard roulette tables offer half your stake back on Even Chance bets if the ball lands on 0!\n\n\nSports Betting\n\nBetting with Grosvenor Sport has never been easier, in this intuitive and easy to navigate app, you’ll get great odds at home, in casino or on the move! Bet on sports including Football, Tennis, Horse Racing, Cricket, Rugby, Boxing, UFC, NFL and lots more. Featuring Grosvenor Goals – our weekly free-to-play scorer prediction game, where you can win £1 Million. Find industry-leading live betting, a Cash Out feature, enhanced odds and accas and regular offers. \n\n\nPoker \n\nGrosvenor Poker offers Tournaments, Cash Games and Jackpot Sit and Go’s on all your favourite devices, with No Limit Holdem, Omaha, Fast Fold poker, Anonymous tables and more. Grosvenor Poker is the only place to qualify for the biggest poker events in the UK, such as Goliath and Grosvenor Casinos’ own GUKPT – the longest running poker series in the UK.\n\n\nGetting started\n\nIf you’re new to Grosvenor Casinos, you can sign up quickly and easily through the app. Or, if you already play online, simply log in with your account details and start playing immediately.\n\n\nSafety and security\n\nGrosvenor Casinos has been a trusted and respected operator of casinos in the UK for over 40 years and remains so today. As the largest land-based casino operator in the UK, we understand that the safety and security of your personal information is of vital importance. That’s why we’ve made every effort to protect your data and ensure that you can play with peace of mind and enjoy the games in our app.\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org/ and 0808 8020 133\n\n*Terms and Conditions apply",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-05-14T21:39:09Z",
  "updated": "2019-09-12T09:27:22Z",
  "releaseNotes": "In this version: \n- Bug fixes and service improvements",
  "version": "2.12",
  "price": 0,
  "developer": "Grosvenor Casinos Ltd",
  "score": 4.20465,
  "reviews": 6196,
  "currentVersionScore": 4.20465,
  "currentVersionReviews": 6196,
  "searchTerms": "poker"
 },
 {
  "appId": "com.williamhill.poker",
  "title": "William Hill Poker",
  "description": "Poker is there to be enjoyed, and we have something for everyone. Whether you want to play at our free tables for a bit of fun, or up the ante and play for cash, we have the table for you. \n•\tEnjoy state of the art technology and features in our interactive poker app.\n\n•\tWhether you prefer Cash tables, Speed Poker, Sit & Go tables, Twister Sit & Go Jackpots or multi-table tournaments, there is a seat for you at our many various tables.\n\n•\tGet even more from your experience, thanks to our multi-table functionality, where you can sit and play at more than one table at the same time. You can also use our lobby filters to quickly and easily find the games you want to play.\nIf it’s Texas Hold’em, Omaha, or any other type of poker game that you wish to play, we can meet your needs. It’s your call. So, don’t delay and download our new app today.\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org\nIf you have any feedback or need help with anything, we’re here for you. Our Support team is available 24/7 through our built-in Contact Support Form.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-05-16T05:03:41Z",
  "updated": "2019-09-04T12:36:20Z",
  "releaseNotes": "You can now experience a whole host of brand-new updates to our Poker table, such as the 'Card Hunt' mission, auto opt in, portrait-oriented table and the client lobby. These new elements make for an enhanced gaming experience with improved visibility, especially when playing on the go.",
  "version": "19_5_07004",
  "price": 0,
  "developer": "WHG (International) Limited",
  "score": 3.88971,
  "reviews": 136,
  "currentVersionScore": 3.88971,
  "currentVersionReviews": 136,
  "searchTerms": "poker"
 },
 {
  "appId": "net.gamoz.instapoker",
  "title": "Insta Poker Coach Texas Holdem",
  "description": "The #1 Texas Holdem poker coaching app where top pros evaluate your every move and reward you for making quality decisions.\n\nCheck out what reviewers are saying:\n\n5 stars:  \"Fantastic! - This app really makes you think! It's like playing at a real tournament. Glad I bought it. It has definitely changed the way I will play from now on!\"\n\n5 stars: \"Excellent App! Don't use this and sit at my table!\"\n\n5 stars: \"Makes you realize how deep the game is. This app is improving my game tremendously\"\n\n5 stars: \"Great way to brush up our thinking skills before a game! Love this app...\"\n\n5 stars: \"Great app - Finally a Poker app that helps me improve my game against my poker buddies\"\n\nOn Twitter: \n\n\"@InstaPoker - I really loving this app. It breaks scenarios down in a very detailed and playable manner. Great job guys\"\n\nPlay challenging hands and receive instant feedback from the pros, including poker’s all-time leading money winner, Antonio Esfandiari, and WSOP Main Event winner and owner of 4 WSOP bracelets, Huckleberry Seed.\n\n\nWin and score by making quality decisions, not by winning chips.\n \nFeatures:\n* Poker hands are packaged into Hand-Packs™, covering various aspects of Hold'em from low-stakes home games to major tournament events.\n\n* Win in-app currency, called ProCoins, based on the merit of your play, not the outcome of the hand. Use ProCoins to unlock Bonus Hand-Packs.\n\n* Game scenarios crafted by world-class poker pros and based on actual hands played in WSOP and WPT tournaments and cash games.\n\n* Contributing pros include Antonio Esfandiari, Huck Seed, Daniel O’Brien, Jonathan Little, Amir Lehavot,  Matt Berkey and Konstantin Othmer.\n\n* Each move is followed by detailed explanations that open your eyes to the way top pros think and play.\n\n* Play for FREE an entire Hand-Pack! You can also PREVIEW a hand from each Premium Hand-Pack,  over 24 free hands.\n\n* No account creation, no network connection to play. Download the hand-packs and play anywhere to improve your poker skills and to see if you can play like a pro.\n \n****************************\n“I thought I was a decent hold ‘em player – until pros Antonio Esfandiari and Huck Seed told me otherwise.”\n- Michael Shapiro, San Francisco Chronicle\n****************************\n \nGameplay basics:\nMake the “Best Move,” and you are awarded +3 ProCoins. Make a “Good Move” or “Fair Move” and you’ll earn +2 or +1 ProCoins, respectively. Make a “Bad Move,” and well, zero points for you, but you will earn the advice of the pro, who will explain why it was the wrong decision and his thought process behind making the right one.\n\nThe goal of each Hand-Pack is to score a perfect +3 ProCoins on every move of every hand. Do so, and you’ll be fast on your way to mastering No-Limit Hold ‘em and outplaying your opponents at the poker table, whether in your home game or the World Series in Las Vegas.",
  "genres": [
   "Games",
   "Card",
   "Education",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-05-30T00:19:33Z",
  "updated": "2019-10-28T15:03:32Z",
  "releaseNotes": "Various fixes",
  "version": "3.13",
  "price": 0,
  "developer": "Gamoz, Inc",
  "score": 4.4074,
  "reviews": 27,
  "currentVersionScore": 4.4074,
  "currentVersionReviews": 27,
  "searchTerms": "poker"
 },
 {
  "appId": "com.lobby.enlobby",
  "title": "Texas Casino",
  "description": "Texas Casin contains the hottest and most popular games at the moment, including Casino Bonus Game, Texas Poker, Slot Game, Sic Bo, Baccarat and Teep Patti.\n\nIn this Casino game lobby, you can play mainstream Texas Poker games. We have already opened Teep Patti, Baccarat, Texas Poker, various Slots and Sic Bo games, especially Black Jack and Five Card Stud, which are going to be exciting and fun.\n\nNo matter when and where you are, you can invite friends to play Texas Poker and various games. You will be very happy whenever and wherever you are. Hurry up and win the jackpot.\n\nFeatures:\nVery complete !! Teep Patti, Baccarat, Texas Poker, Slots and Sic Bo are now available. Many other games will be launched in the next plan.\n\nAll online! !! Play with offline players and see who the game is!\n\nSuper bonus! !! In addition to the list of prizes, there are many chips and free prizes waiting for you to pick up every day.\n\n Get a chance to transfer prizes every two hours!\n\n1.A large number of daily tasks are waiting for you to challenge, you can get a lot of rewards after completing!\n\n2. Participate in the game every day, upgrade quickly, and get a lot of chips immediately!\n\n3. Chat whatever you want! !! !! The chat function is online now, let's chat with friends while playing.\n\nplay with friends! !! After successfully becoming friends, you can track your friends in the game and play with them.\n\nSuper cute! !! Many interactive tools and cute expressions to choose from.\n\nvery cool! !! A variety of interesting and unique photo frames are online and more will be opened in the future!\n\nPlayers can log in to their Facebook account, store in-game progress, and more cross-platform logins, so that you can enjoy exciting exciting Las Vegas-style games on different phones or tablets!\nLog in to the game with Facebook and get more rewards!\n\nSuper easy! !! Most of the games in this category are very classic and popular games, no further learning is required. Download and play.\n\nLook and feel comfortable! Beautiful icon layout and beautiful cute dealer\n\nSo what are you waiting for? Hurry up and play with friends. Your leisure time will be more happy and comfortable. If you become a top player, you will have the opportunity to make friends with the game customer service.\n\nCome on and act!\n\nFind our keywords: Teep Patti, Baccarat, Texas Poker, Slot, Sic Bo, Slots, poker, blackjack, casino, games, Texas，Texas Poker, solitaire, pokemon, WSOP, game, card games, card, wwe\n\nIf you still have questions, please contact us through the FB fan page:\nhttps://www.facebook.com/Texas-Casino-112572000227959/?modal=admin_todo_tour",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "12+",
  "released": "2020-01-02T08:00:00Z",
  "updated": "2020-01-10T16:12:07Z",
  "releaseNotes": "1. Optimize the gaming experience,\n2. Fix game issues\n3. Open mall discount activities",
  "version": "1.0.2",
  "price": 0,
  "developer": "palmplay",
  "score": 5,
  "reviews": 2220,
  "currentVersionScore": 5,
  "currentVersionReviews": 2220,
  "searchTerms": "poker"
 },
 {
  "appId": "com.zmgzs.ios.overseas.texas",
  "title": "Poker World Mega Billions",
  "description": "Plentiful and interesting game types and cool game interfaces will bring you tremendous fascination and gaming experience! Join us to enjoy the purest game environment with fair and open random licensing rules and massive amounts of chips with abundant gifts!\nMain Features:\n● Massive amounts of chips: You will own massive amounts of chips here every four hours!\n● Invite friends: You can invite your friends for an exciting Texas party. You'll meet many Texas players from all over the world!\n● Glory rings and trophies: Win rings! Win a variety of tournaments and grab your own trophies!\n● Colorful game modes: Here, novel game modes will be regularly launched, bringing you unprecedented game experience. Come and open the door to a new world!\n● Game level setting: You will meet advanced players and learn advanced poker skills by improving your level. You will also obtain a higher reward rate and incentives.\n● Facebook bonus: Connecting to your Facebook account, you'll get more chips every day and numerous fans. The next poker superstar is you! \nLooking forward to your participation, we are very pleased to receive your valuable opinion! Play poker with players around the world and obtain daily chips! \nThis game is only for entertainment for adults (21+). It does not involve any gambling function. It does not offer real money gambling , nor to provide an opportunity to win real money or physical goods as well.\nAny success in this game is not indicative of future success at real money gambling.",
  "genres": [
   "Games",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2019-10-24T07:00:00Z",
  "updated": "2020-04-30T06:16:00Z",
  "releaseNotes": "- CLUB 2.0 goes live. \n- Optimizes Club details display. \n- Loading screen performance improvements. \n- New Mission System. \n- Fixed bug of the last version.",
  "version": "1.3.01",
  "price": 0,
  "developer": "Tuyoo Online HK Limited",
  "score": 3.68421,
  "reviews": 19,
  "currentVersionScore": 3.68421,
  "currentVersionReviews": 19,
  "searchTerms": "poker"
 },
 {
  "appId": "io.bbstud.pkc",
  "title": "Poker Championship - Holdem",
  "description": "[Fair Play Guaranteed]\nThe strong Random Number Generator (RNG) implements every hand dealing of Poker Championship, thereby ensuring absolute fair game. Our game has been certified by Gaming Laboratories International, the global leading company in gaming and lottery testing.\n\n[Key Features]\nSpend massively fun time with our top-of-the line game provided with many special features for you to feel real casino atmosphere!\n\n• HUGE TOURNAMENT : Up to 500 players in a Multi-Table Poker Tournament! Free buy-in events are held every day.\n• WORLD POKER TOUR : Two weeks challenge to earn Tour Credits in various cities. Move up your ranking and join the final tournament!\n• FREE CHIPS EVERY 4 HOURS : All you need to do to get free chips is just come back every day.\n• LUCKY BOX : What will happen when you collect the free chips 4 times? Open the golden box with the red ribbon around!\n• JACKPOT : Every poker table has a chance of hitting the Jackpot. Get your chance to be the winner!\n• AVATAR : Huge variety of portraits collection representing your achievements! Show off your new lucky decorations.\n• EVENTS AND MISSIONS : Many various exciting seasonal events. Stay on top of your game with daily and weekly missions!\n• WEEKLY RANKINGS : Compete with outstanding Texas hold’em players throughout the world in real time and be the world champion!\n• INTERNATIONAL COMPETITION : While competing with poker players from all over the world, you become the member of the national team of your country.\n• CONTINUOUS PLAY : Start playing poker on your phone or tablet and continue on TV or PC with the same bankroll!\n\nThis product is intended for use by an adult audience for amusement purposes only. Practice or success at social casino gaming does not imply future success at real money gambling. This product does not offer real money gambling or an opportunity to win real money or prizes.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Sports"
  ],
  "contentRating": "17+",
  "released": "2018-08-03T00:46:13Z",
  "updated": "2020-05-05T18:46:03Z",
  "releaseNotes": "* Improved World Tour UI for rankers.\n* Minor UI bug fixes.",
  "version": "3.0.4",
  "price": 0,
  "developer": "BBstudio Inc.",
  "score": 4.55319,
  "reviews": 94,
  "currentVersionScore": 4.55319,
  "currentVersionReviews": 94,
  "searchTerms": "poker"
 },
 {
  "appId": "www.lutongnet.com.LTPokerBrazil",
  "title": "Artrix Poker",
  "description": "Texas Hold'em Poker, Casino Cards and Slots that give YOU a real life Casino experience! Join thousands of players in this fun and challenging Casino Poker experience!\n\nFREE CHIPS Win up to 1,000,000 chips on the Daily Wheel of Fortune! Hooray, more free chips from Daily Fan Page Bonus, Friend Referral Bonus, Online Time Bonus and other in-game money!\n\nTEXAS HOLD'EM POKER Attractive dealers, professional players, adrenaline rushes from bluffing, thrill of winning the Jackpot… just like a real casino! Crush the table and make yourself a master in the world of Texas Hold'em!\n\nMULTIPLE GAME MODES Fast/slow tables, private tables, Sit and Go competition, daily/weekly tournament and more! Pick your favorite mode and stack up your chips on the table!\n\nLEAGUE:  Beat amateurs and pros alike to climb to the top of the League. Gratify yourself with the triumph of victory as you progress on the leaderboard.\n\nPLAY WITH FRIENDS Get more free chips by inviting and playing with friends! Live chat with them while playing and send playful emoticons/gifts to experience more fun of the game. Here, you'll earn something greater than chips!\n\nSPECIAL VIP BONUS Enjoy exclusive rewards and access to more features by becoming a member of the VIP club. \n\nSLOTS Check it out slot fans! Gorgeous graphics and awesome rewards at the professional 5*3 slot and Mini table slot. Increase your bankroll at the click of the handle!\n\nEXCLUSIVE CASINO CARDS GAME Advanced and innovative card-guessing games where you can win chips quickly! Feel the throbbing of your heart as the cards face up one by one.\n\nHOLIDAY EVENTS AND BONUSES Specially-designed game events are launched during holidays and festivals! Add more flavor to your holiday with all the bonuses we prepare for you!\n\nSUPPORT MULTI-LANGUAGE Not only for English speaking countries! Also for Český, Slovenský, France,Philippines, Polska, Magyarország, Indonesia, España, Latinoamérica, Ελλάδας, Κύπρου, Deutschland, Österreich, Holland, Belga, Romania, Italia, Brasil, Portugal, Türkiye or Balkans, you can play poker games in your Native Language!\n\nGUEST MODE No registration is needed to play the game. Use guest mode to start your journey with Artrix Poker right away!\n\nCROSS-DEVICE PLAY Once you connect your account to Facebook, you will be able to play on any device without losing any piece of chip in your bankroll.\n\n\nThis game is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-04-15T11:12:15Z",
  "updated": "2020-04-03T06:41:55Z",
  "releaseNotes": "General improvements.\nBugs have been fixed.",
  "version": "9.0.203",
  "price": 0,
  "developer": "Outerdawn Limited",
  "score": 4.46711,
  "reviews": 152,
  "currentVersionScore": 4.46711,
  "currentVersionReviews": 152,
  "searchTerms": "poker"
 },
 {
  "appId": "com.craftywheel.NashShove",
  "title": "Preflop+ Poker GTO Nash Charts",
  "description": "Preflop+ is THE best app to improve as a poker player. GTO preflop charts pre-loaded (no internet connection required) to make +EV shove, calls and rejams based on Nash equilibrium. \n\nMatt Berkey, High Stakes Cash Game Player and Founder of Solve For Why Academy says \"Preflop+ is a great tool. It takes all the Nash Charts and distills them at your fingertips. It is far better than other apps as it displays EV of what each hand will be earning.\"\n\nLara Eisenberg, WSOP Circuit Ring Winner 2019, says \"Preflop+ is a fantastic app for poker training.  I find it particularly useful for drilling pot odds and equity which is something I haven’t found with any other app on the market.  I use the app every single day to improve my ability to quickly calculate pot odds/equity situations which is invaluable to be able to do quickly, especially in the live setting.\"\n\nUnlike many popular solutions, we present you with the exact EV of all the hole cards  as a chart so you are equipped with making your own decision. This will help you make better decisions such as avoiding marginal spots when you have clear edge over the field.  And also help you take any +EV spots when the field is pretty tough knowing the exact EV of your holdings.\n\nNow you can create your ranges and view them on the go. Create ranges  OPEN, CALL, 3-BET, 4-BET and more! Beautiful Chart overlays lets you see relevant actions in one chart.\n\nThe app also has the fastest and most accurate equity calculator for all streets - Preflop, flop, turn and river. \n\nWe have training modules to train different aspects of Poker. Pot Odds, Equity Drills, Shove/Fold Charts Trainer, Combinatorics are some of the training modules available in app for you to train. Train regularly and become the best poker player, ever!\n\nSome of the features include:\n\n- Beautiful charts, color coded so you can make your decisions quickly\n- EV of every single shove and/or call is shown so that you can base your decisions based on EV and avoid those marginal spots as an exploit!\n- Training Mode lets you train to improve on all situations.\n- Equity Calculator and Equity Drills lets you study equity calculations - hand vs hand, hand vs range, range vs hand and range vs range.\n- Training can be targeted for specific spots so you can choose what to train and what not to.\n- Easy to navigate and use.\n- Eye-friendly color schemes to use the app for long period of times.\n- No internet connection required and results are shown instantly as soon as you choose the spots!\n- 100% satisfaction guaranteed!\n\nWe are continously working on the app to keep it up-to-date. If you do have any suggestions or feature request, please email us on info@craftywheel.com\n\nSUBSCRIPTION PRICING AND TERMS\n\nPreflop+ offers two auto-renewing subscription options:\n$3.99 per month\n$31.99 per year\n\nThese prices are for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.\n\nThe subscription will automatically renews unless turned off in your iTunes Account Settings at least 24 hours before current period ends. Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. You can go to your iTunes Account settings to manage your subscription and turn off auto-renew. Your iTunes Account will be charged when the purchase is confirmed. If you subscribe before your free trial ends, the rest of your free trial period will be forfeited as soon as your purchase is confirmed.\n\nPreflop+ also offers a Forever subscription which is paid for by a one-off upfront payment of $74.99 with unlimited access to the Preflop+ forever.\n\n\nRead more about our terms and conditions here -\nhttp://craftywheel.com/terms-conditions.html\n\nRead more about our privacy policy here -\nhttp://craftywheel.com/privacy.html",
  "genres": [
   "Utilities",
   "Casino",
   "Games",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-09-11T15:30:21Z",
  "updated": "2020-04-03T00:06:28Z",
  "releaseNotes": "Minor fixes and enhancements.",
  "version": "14.4",
  "price": 0,
  "developer": "Crafty Wheel Studios Pty Ltd",
  "score": 4.48332,
  "reviews": 60,
  "currentVersionScore": 4.48332,
  "currentVersionReviews": 60,
  "searchTerms": "poker"
 },
 {
  "appId": "com.z4.hdpoker",
  "title": "HD Poker: Texas Holdem",
  "description": "Do you like poker? HD Poker is the place for you!\n\nExperience the High Def Poker experience! Crush the competition with the newest FREE poker game.\n\nHD Poker is the latest and greatest multiplayer online poker app in the world. Play with friends and compete against opponents across the globe for chips and prizes - win billions and climb the ranks to become a poker champ.\n\nPlay Hold'em in a cutting-edge immersive poker app with a huge range of table themes and stakes - play casually or clash with the competition in high stakes games at HD Poker.\n\nFREE CHIPS - Get a welcome bonus of 125,000 FREE chips and 50 FREE gems just for downloading! Collect a bonus every 4 hours and keep your streak going to win a daily Bonus Chest!\n\nCUSTOMIZE - Create your own HD Poker experience - choose your character from hundreds of Avatars and vote for your favorite table theme.\n\nCOLLECT AND TRADE - Win Gems for completing Achievements, then use them on in-game content! Collect, Trade with friends, and open Chests to expand your inventory and further customize your experience.\n\nLEADERBOARD - Compete with players across the globe in HD Poker's unique ranking system. Win trophies for winning hands and playing skillful poker. Rank up to earn better Rewards!\n\nPLAY WITH YOUR FRIENDS - Recruit your friends to the HD Poker app and earn an exclusive chest! Invite friends to join your table - play poker, trade, chat, send gifts, and have fun!\n\nJACKPOTS - Have a chance to win millions or even billions of chips by hitting a Royal Flush or triggering the Bad Beat Jackpot!\n\nSIDE GAMES - Find tickets in chests or purchase them in the store with Gems, then play Side Games and win bonus prizes! Spin the Super Mega Wheel and win millions!\n\nMULTI PLATFORM - Play our casino app on any platform – desktop, mobile, and web.\n\nNEW CONTENT - The HD Poker app offers an immersive casino world with new content being released all the time. Have a cool idea that you want to share with us? Drop us some feedback using the in-game Help system.\n\nWE’D LOVE YOUR FEEDBACK! - Connect with us on Facebook and Twitter:\nFacebook: facebook.com/hdpoker\nTwitter: twitter.com/hdpoker\nVisit us at: hdpoker.com\n\n\nDISCLAIMER – HD Poker is intended for an adult audience (18+) for amusement purposes only and does not offer 'real money' gambling. HD Poker is free to play; however, in-app purchases are available for additional content and in-game currency. Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Strategy",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-09-20T23:07:20Z",
  "updated": "2020-01-16T19:50:56Z",
  "releaseNotes": "Patch Notes: Version: 1.6.5.2\n- New \"Show All\" for faster Chest Opening\n- Faster loading and greater stability\n- Various bug fixes and improvements",
  "version": "1.6.5.2",
  "price": 0,
  "developer": "Z4",
  "score": 4.67816,
  "reviews": 87,
  "currentVersionScore": 4.67816,
  "currentVersionReviews": 87,
  "searchTerms": "poker"
 },
 {
  "appId": "com.reflex.arcade",
  "title": "Pub Fruit & Roulette by Reflex",
  "description": "Ever wanted to take your favourite fruit machine with you? Now you can! Play all the great fruit machines you see in pubs, clubs, arcades and bingo halls up and down the UK in one fantastic app!\n\n* 500 free credits collectable every 90 minutes, boost this to *1000* credits when purchasing credit!\n\n* Free credit for telling your Twitter and Facebook friends about the app!\n\n* All fruit machines now support portrait and landscape modes on both iPad and iPhone!\n\n* Pinch to zoom anywhere on the screen to get a closer view of the action!\n\n* Double-tap on important gameplay areas to quickly zoom in! \n\nLoads of fantastic games covering our entire fruit machine product range available right now, with more coming soon, along with some great new features that we're really excited about... stay tuned!\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nAlthough the games can be played without a network connection, you need to be connected to the internet to be able to receive free credit.\n\nEach game included in this app is for amusement only and does not replicate the odds of winning or the payouts of it or similar games from Reflex Gaming.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2013-11-01T07:42:31Z",
  "updated": "2019-02-21T10:19:36Z",
  "releaseNotes": "Fixed audio issue on Crazy Crowns",
  "version": "1.38.3",
  "price": 0,
  "developer": "Reflex Gaming",
  "score": 4.3724,
  "reviews": 2978,
  "currentVersionScore": 4.3724,
  "currentVersionReviews": 2978,
  "searchTerms": "poker"
 },
 {
  "appId": "com.sa.netbet.poker",
  "title": "NetBet Poker UK",
  "description": "Ranging from fast paced 10 minutes poker games with €10,000 jackpots to amazing tournaments (over €5,000,000 guaranteed a month) and plenty of cash game tables, you will be able to enjoy our poker games anywhere! \nWaiting for the bus or travelling on the train will never be the same with NetBet Poker app.\n\nAt NetBet Poker, we always value our players’ feedbacks, so feel free to contact us at contact@netbet.com\nFully licensed by the UK Gambling Commission. Safe and secure with over 10 years experience!",
  "genres": [
   "Games"
  ],
  "contentRating": "17+",
  "released": "2015-10-10T11:40:15Z",
  "updated": "2019-08-30T10:33:15Z",
  "releaseNotes": "Performance optimisations",
  "version": "5.3",
  "price": 0,
  "developer": "Cosmo Gaming",
  "score": 4.775,
  "reviews": 40,
  "currentVersionScore": 4.775,
  "currentVersionReviews": 40,
  "searchTerms": "poker"
 },
 {
  "appId": "com.betdash",
  "title": "Paddy Power Poker",
  "description": "Poker Welcome Pack | Deposit £/€5 Get €15 in Bonuses | T&C's apply – Details below.\n\nIntroducing Paddy Power’s brand spanking new Poker app! Enjoy everything Paddy Power Poker has to offer on the go. \nFEATURES:\nQuick Access to Games: Our quick launch icons allow customers to join a game with one tap. Choose from Texas hold’em to speed games and tournaments and play with poker customers around the world. Customers also have quick access to both cashier and missions features making waiting around a thing of the past\nTwister Poker: Win up to 1000 times your buy in our fast paced 3 man sit & go’s. Buy in from €1 to €50 and at the start of each game you’ll spin the reel to see what you’re playing for, going all the way to 1000 times your buy in.\n\nFree Tournaments: If you’re new to Poker then why not improve your Poker skills by entering our daily free roll tournaments. Exactly the same as your normal tournament except it’s free to enter!\nPoker Casino: To wind down after a tough Poker session, why not try out the Poker Casino. We have all your favourites with Roulette and Blackjack and we’re always releasing new games. \n\nDeposit £/€5 Get €15 in Bonuses T&C’s\nThis offer is open to registered Paddy Power customers, aged 18 years or over who are depositing in to their Poker account for the 1st time.\nTo participate:\n1.\tDownload the Paddy Power Poker app\n2.\tSign up to Paddy Power Poker\n3.\tCreate a Poker Nickname \n4.\tDeposit at least £/€5 into your account and earn 1 or more Power Points.\nNew customers are entitled to receive:\no\t€5 Twister Tokens x 2 (Your Account will be credited with 2 x €5 Twister Tokens after making your first deposit of £/€5 or more and earning 1 or more power point)\no\t€5 Mobile Heads Up Tourney (Your Account will be credited with the €5 Mobile Only Heads Up Tournament Token after making your first deposit of £/€5 or more and earning 1 or more power point)\no\t100% Match Deposit Bonus up to €200 (To receive the full Sign-up Bonus of €200, you must accumulate a total of 13,700 Power Points within the period as set out in the 'My Poker’ section of the Cashier. (For each €5 increment released 350 Power Points)\no\tMonth of Free Poker (Your account will be credited with 30 x \"New Player Daily Tickets\" automatically after making your first deposit of £/€5). \n\n•\t€5 Twister Tokens x 2\no\tUnused Twister Tournament Tokens expire in 7 days.\n•\t€5 Mobile Heads Up Tourney\no\tThe Mobile Only Heads Up Tournament, will begin as soon as two players register.\no\tYou have 7 days to wager the bonus from claim date.\no\tAny bonus not claimed within 7 days will expire.\n•\t100% Match Deposit Bonus up to €200\no\tThe 100% Match Deposit Bonus up to €200 applies for all deposits over £/€10.\no\tTo qualify you must accrue the required level of Power Points within 90 days of activating the bonus.\no\tThe Sign-up Bonus is released in increments of €5 for every 350 Power Points earned. Your 1st bonus of €5 is released after the 1st 150 points and your 2nd bonus after 250. After this your bonus will be released in increment of €5 for every 350 Power points.\n•\tMonth of Free Poker\no\tThe \"New Player Daily Tickets\" give you free access to a Daily Freeroll Tournament that gives away €50 in cash prizes.\no\tUnused \"New Player Daily Tickets\" expire after 30 days after receiving them.\n•\tPower Points are calculated as follows: \no\tCash/Ring Games = 20 Power Points are awarded for every €1 of rake paid. \no\tSit 'n' Go Tournaments = 20 Power Points are awarded for every €1 paid in fees. \no\tMulti-Table Tournaments = 20 Power Points are awarded for every €1 paid in fees.\n•\tThis promotion is limited to one account per customer\n•\tWe reserve the right to exclude players that participate in the promotion with multiple accounts, or who adopt an abusive strategy\n•\tWe reserve the right to change or discontinue this promotion at any time\n•\tFull T&C’s apply https://www.paddypower.com/en/aboutUs/Terms.and.Conditions/#PartE",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-01-28T10:22:57Z",
  "updated": "2018-11-08T08:12:15Z",
  "releaseNotes": "Celebrate the summer with our latest features and games. Our newest version includes:\n•New poker table card views\n•A new keyboard\n•When going all in, players can now see the stakes of winning\n•New and improved chat\nWe always strive to provide our players with the best mobile poker experience, that’s why we’re always making improvements to the app. If you like what we’re doing, please take a moment to rate our app and let us know.",
  "version": "18.05.06015",
  "price": 0,
  "developer": "Paddy Power PLC",
  "score": 2.21622,
  "reviews": 37,
  "currentVersionScore": 2.21622,
  "currentVersionReviews": 37,
  "searchTerms": "poker"
 },
 {
  "appId": "com.pokerstarsplay.www",
  "title": "Jackpot Poker by PokerStars",
  "description": "ARE YOU A REAL POKER PLAYER? DOWNLOAD TODAY TO BECOME A POKER STAR!\n\n\n\n• PLAY POKER ONLINE FOR FREE by PokerStars™\n\nPlay free poker online games of Texas Holdem Poker by the world’s largest online Poker brand! \n\n• Play Online Poker Spin and Go™ TEXAS HOLDEM Poker Tournaments – fast 3 players poker tournaments where poker players with the best poker hand can win up to 3,000 times their initial gamble buy-in! \n\n• The Official Spin & Go Poker App for poker casino online\n\nPLAY FREE POKER ONLINE GAMES WITH STYLE! Live poker games online on the best poker site, the way WSOP mean it! Choose your free poker tournaments, spin the poker bonus wheel and get a Jackpot poker reward multiplier. Pick up the strongest 888 Poker hand or bluff your way to victory on your poker tournaments opponents to win free poker chips. Just like sit and go poker games - spin & go has many buy-in levels - so you can start off small and practice for the full tilt high stakes poker and build your free Texas HOLDEM Poker skills to perfection. The WSOP poker league awaits you!   \n \n• Never Wait! Fast Paced 3 Players free online Poker Games\n\nPLAY SOCIAL POKER online for free AT A NEW SPEED. Enjoy free casino poker games with a huge range of tables that are always open for more Texas Holdem poker players. Thanks to our fast-paced 3-player free poker games online, your next turn is only a few seconds away, and the best poker hand might be yours! Fast way to polish your online poker game moves on your way to become poker star. With hundreds of tables and thousands of real Poker players, you can experience more gambling excitement, more betting thrills, MORE POKER TOURNAMENTS, more Poker!\n\n\n• Win Endless Free Poker Chips\nWe give away up to 100 million Free Poker Bonus Casino poker Chips every week! Amazing daily poker chips bonus and lucky poker hand with Jackpot Poker! Receive regular chip bonuses every 4 hours and participate in our free coin giveaways as you play Poker Texas Holdem. Casino Poker chips for everyone!\nPlay freepoker and spin the bonus wheel at the beginning of the tournament for a chance to win up to 3,000 times your original buy-in. Better than any Poker tour, more riveting than any Poker Casino! Invest the bonus casino poker chips in a fearless play, expecting a Royal Flush on the flop? Get that Poker face to action and Bet all in!\n\n\n• Additional Features to Enhance your TEXAS HOLDEM Poker playing Experience\n\nAuthentic: The ultimate poker environment, nothing but real Poker players, real poker odds, no machines, no computers, no other casino games\n\nReal Poker Feel: Feel the game with swipe and flick controls creating an authentic user experience.\n\n888 Poker Skills Quizzes: Solve Poker questions and riddles & win free poker prizes\n\nLiquidity With over 400,000 PokerStars™ daily poker players - a huge range of poker tournaments and cash game buy-ins\n\nProgress: Progress through game levels and edge your way to the top tables as you become a true Texas Poker master,\n\nChat: Shoot the breeze with poker table talk, brag about being the best Poker players in the table and throw your opponents off their game\n\n\nHundreds of thousands of Poker players play Jackpot Poker every day – can you beat them?\n\nIf you want to contact support, please email info@playjackpotpoker.com\n\n\nThis product is intended for use by those 21 or older for amusement purposes only. Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-12-10T14:04:40Z",
  "updated": "2020-04-21T08:10:08Z",
  "releaseNotes": "NEW TABLE ITEMS - Climb the Leagues to battle other Poker Stars for bragging rights!\nCOMING SOON - Daily and Hourly FREE Scratch Cards\nCOMING SOON - Slots Father 2 a game you cannot refuse!",
  "version": "6.0.3",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.65007,
  "reviews": 703,
  "currentVersionScore": 4.65007,
  "currentVersionReviews": 703,
  "searchTerms": "poker"
 },
 {
  "appId": "com.bwin.bwin-Poker",
  "title": "bwin Poker and Casino Games",
  "description": "Play poker whenever and wherever you are with the bwin poker app and take a seat playing HUGE TOURNAMENTS or CASH GAMES worth MILLIONS!   Play for FREE or choose the thrill of REAL MONEY action, from Sit & Go’s, multi-table tournaments and cash games to our very own SPINS, where players can turn a $5 buy-in into $1 MILLION.  Play casino games like ROULETTE, BLACKJACK and SLOTS, or bet on THOUSANDS of markets in our sportsbook. \n\nGET THE BEST POKER ACTION:\nPlay a wide range of poker games like No Limit, Pot Limit, Fixed Limit Hold’em or Pot Limit and Pot Limit Hi-Lo Omaha. \n \n•        CASH GAMES – play Short Deck, Full Ring and Heads Up Texas Hold’em or Omaha with blinds from as little as $0.01/$0.02.\n•        MULTI-TABLE TOURNAMENTS – we have over $2.5 million in guaranteed daily and weekly prizes in our Power Series, Gladiator, Bounty Hunters, Daily Majors and Daily PLO tournaments.\n•        LIVE Events qualifiers – qualify for Partypoker Live MILLIONS, or World Poker Tour and WSOP circuit events, where you can play in some of the most glamorous locations across Europe, North America and Latin America.\n•        SIT & GO'S – choose from hundreds of Texas Hold’em and Omaha tables with buy-ins from as little as $1.10.\n•        FREEROLLS – practise for free and win real prizes.\n\nPOKER FEATURES:\n•        SPINS: Play three-handed Sit & Go tournaments where the size of the prize pool is randomly multiplied between 2 and 240,000 before the first card is dealt.  This means you could turn a $5 buy-in into $1 MILLION. \n\n•        fastforward poker: Don’t like your draw or the hand you’ve been dealt? Didn’t make that flush you were looking for? Fold instantly and get dealt new cards at a different table.\n\n•        Short Deck:  A variation of poker which uses just 36 cards. The game plays similarly to Texas Hold’em, however the reduced deck opens up a whole new level of strategy!\n\n•        Get up to 40% CASH BACK on your rake #rewards\n\n•        Attend sporting events with hospitality or partypoker LIVE events \n\nTRY OUR CASINO:   \nTake a break from poker and choose from 1000+ games from our world-class casino, where players can play popular:\n•        TABLE GAMES – enjoy exclusive casino table games like ROULETTE, BLACKJACK and BACCARAT in multiple varieties\n•        SLOTS – play classic slots like Book of Dead, Starburst, Melon Madness Deluxe, Book of Horus. or JACKPOT PROGRESSIVE SLOTS like Gold Frenzy, Lootenkhamun or Luck of the Jackpot where users can win MILLIONS in a SINGLE SPIN\n•        LIVE CASINO – get the real life experience playing Blackjack, speed Baccarat, Roulette, 3 Card Poker, Caribbean Stud Poker or try show games like Monopoly Live or Dreamcatcher.\n\nCASH IN ON SPORTS:  \nGet all of your favourite bwin sports features like Acca BOOST, live event STREAMING, IN PLAY betting, BUILD A BET,  EDIT MY BET and automatic CASH OUT.   Bet on 30+ sports and THOUSANDS of markets from Football, Tennis, Horse Racing, Golf, Cricket, NFL, Basketball, Volleyball, Formula One, Boxing, Snooker, Darts and Handball to Ice Hockey, Baseball and many more...\n\nResponsible Gambling\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org.  Participation in the bwin gaming line-up is only permitted for persons aged 18+.  \n\nbwin commits itself to integrity, fairness and reliability and we always do our best to prevent gaming related problems.   Please contact us directly if you have any questions.  Our responsible Gaming team is at your disposal at any time via email – responsible.gaming@bwin.com\n\nElectraWorks Limited is licensed by the UK Gambling Commission under the Gambling (Licensing and Advertising) Act 2014. ElectraWorks Limited has been granted License No. 000-039011-R-319371-004 for the operation of remote gambling in Britain.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2010-12-20T19:42:08Z",
  "updated": "2020-05-04T13:33:24Z",
  "releaseNotes": "We are always updating our app to deliver the best online poker experience. Minor issues have also been ironed out, making gameplay ultra-smooth.",
  "version": "6.3.0",
  "price": 0,
  "developer": "ElectraWorks Limited",
  "score": 3.4,
  "reviews": 15,
  "currentVersionScore": 3.4,
  "currentVersionReviews": 15,
  "searchTerms": "poker"
 },
 {
  "appId": "com.unibet.poker",
  "title": "Unibet Poker",
  "description": "Love poker? Want to play on the go? Download Unibet’s Poker app and play whenever and wherever you want.\n\nPlay against hundreds of users on Cash Games and Sit & Go and multi-table tournaments.\nEnjoy all these great innovative features in the palm of your hands:\n\n• Change your identity up to three times a day – great if your opponent knows how you play\n• Choose from over 100 avatars with modern graphics\n• Show off your prowess, earn over 40 achievements\n• Pick your game type and stakes in our brand-new quick seat lobby\n• Enjoy regularly-updated missions and promotions\n\nDiscover the world of Unibet Poker and claim some of the amazing sign-up offers available. \nNew to Unibet? Just sign up for an account – it’s quick and easy. Already signed up? Simply log in and start playing.\n\nThe app requires you to be over 18 and to have a valid Unibet account to play.\n\nUnibet International Ltd is licensed by the Lotteries and Gaming Authority (LGA) of Malta Full details can be found at www.unibetgrouplc.com",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-04-10T10:36:46Z",
  "updated": "2020-04-21T07:29:51Z",
  "releaseNotes": "- New exciting promotion: Unibet Online Series 8!\n- New exciting promotion: May Mission!\n- Other bug fixes and improvements",
  "version": "2.41",
  "price": 0,
  "developer": "Unibet",
  "score": 2.58974,
  "reviews": 39,
  "currentVersionScore": 2.58974,
  "currentVersionReviews": 39,
  "searchTerms": "poker"
 },
 {
  "appId": "com.droidhen.game.poker",
  "title": "DH Texas Poker",
  "description": "The #1 user experience Texas Hold'em Poker comes to APP STORE NOW! 100% FREE to play! 50K initial FREE chips, DAILY gift, friends gift and online rewards - They're totally FREE! \n\nExciting features that you can only experience in DH Texas Poker:\n# VIP Table - Experience Las Vegas VIP!\n# Private Table - Play with your friends!\n# Game mode - Play Now, Private Room, Select Casino, Sit&Go\n# Daily login lottery\n# Daily special offer\n# Online reward\n# Super chip package\n# Facebook connect is supported.\n\nIf you have any suggestion/comment/problem, please mailto: support@droidhen.com.\n\nDISCLAIM: \"DH Texas Poker\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-06-09T04:35:43Z",
  "updated": "2020-04-02T11:28:57Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "3.11.1",
  "price": 0,
  "developer": "DROIDHEN LIMITED",
  "score": 3.72152,
  "reviews": 79,
  "currentVersionScore": 3.72152,
  "currentVersionReviews": 79,
  "searchTerms": "poker"
 },
 {
  "appId": "com.lein.pppokergame2.dis",
  "title": "PPPoker-Holdem, Omaha, OFC",
  "description": "PPPoker is one of the world's largest private club-based online poker platform, and boasts a global community of poker lovers!\n\nLaunched in 2016, PPPoker strives to offer the best poker experience to millions of real players from over 100 countries worldwide.\n\nIn PPPoker, you can create and play in your private Club against friends and family in the most unique and personalised online poker experience. Play across a variety of popular poker variations such as NLH, PLO & OFC, and do battle at the tables anytime you want. \n\n【Diverse Poker Experiences】Expand your Club’s community and qualify for PPPoker Live Events.\n\n【Exciting Poker Variants】Play games such as NLH, PLO, OFC, Short Deck and more!\n\n【Dynamic Poker Community】Share and discuss poker hands in our online Forum and at events.\n\n【Global Tournaments】 Compete in tournaments against players across the world!\n\n【Multi-table action】Play up to three-tables at once with ease\n\nOur motto is \"For Poker Lovers, By Poker Lovers\" - here at PPPoker we strive to provide a safe and fair gaming platform for all poker enthusiasts:\n\n【Dedicated Anti-Cheating Procedures】\n\nPPPoker is fully certified by the Gaming Laboratories International (GLI) standards and also implements several Anti-Cheating and reliability measures, including an Anti-Cheating team, Random Number Generator tests (RNG), Big Data analytics, and IP/GPS restrictions. \nOur Anti-Cheating team regularly generates GLI standard RNG tests to ensure randomness in the online dealing process meets the appropriate levels for an entirely fair playing environment. Club owners can implement both IP and GPS restrictions into games to ensure players do not have an unfair advantage over others. \nPPPoker is also proud to report our platform has a cheating detection over 99.8%, and a platform uptime of 99%. \n\n【Top-Rated Application Shielding】\n\nThe advanced built-in DDOS protection detects and identifies all kinds of threats automatically while blocking sophisticated attacks to ensure the server is secure and reliable at all times. We aim to provide a secure and steady gaming platform, which includes minimising all risks, including third-party incidents.\n\n【Disconnection Protection】 \n\nWe understand that sometimes external connection factors will table issues for our players, which can result in unnecessary downtime and potential loss. To combat the problem, our Disconnection Protection feature gives players extra 'time to act' to secure a stable connection before being sat out at the table.\n\nFor more information about PPPoker: https://bit.ly/2Vvjb7G \n\nFollow us on socia media:\n\nFacebook: https://bit.ly/2XIUyas \nInstagram: https://bit.ly/2RHE7HC \nTwitter: https://bit.ly/3eDrRSi\nYoutube: https://bit.ly/2xATnz1",
  "genres": [
   "Sports"
  ],
  "contentRating": "17+",
  "released": "2016-04-23T20:09:10Z",
  "updated": "2020-04-20T22:13:25Z",
  "releaseNotes": "Some Software Updates and Fixes",
  "version": "3.3.0",
  "price": 0,
  "developer": "AceKing Tech Limited",
  "score": 4.14706,
  "reviews": 34,
  "currentVersionScore": 4.14706,
  "currentVersionReviews": 34,
  "searchTerms": "poker"
 },
 {
  "appId": "com.tinycorp.poker",
  "title": "VIP Poker - Texas Holdem",
  "description": "Play Texas Hold’em Poker live with thousands of players from around the world. Whether you’re a pro or a beginner at Texas Holdem, VIP Poker has the right table for you. You'll feel like a poker star playing in a Vegas casino. Bet and try your hand against the competition! \n\nFeatures in VIP Poker:\n -  FREE to play!\n -  FREE bonus daily chips!\n -  Play online with thousands of players over 3G or WIFI!\n -  Chat with other players using quick chat or the keyboard!\n -  5 or 9 seat Texas Hold em Poker tables!\n -  No account creation needed. Just get in and play!\n -  Play at your own pace with different speeds!\n -  Beautiful Retina display graphics!\n -  Buy chips or earn them for FREE!\n -  Universal app support. Play on your iPhone, iPod Touch, or iPad!\n\nPlease note: A network connection is required to play.\n\n********************************\nLike us on Facebook:\nhttp://www.facebook.com/VIPPoker\n\nFollow us on Twitter:\nhttp://twitter.com/#!/vippokergame\n\nDon't forget to rate us on iTunes!\n********************************\n\nhttp://games.swipeforwardgames.com/websitetermsofuse.htm\nhttp://games.swipeforwardgames.com/privacypolicy.htm",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2011-02-27T01:51:51Z",
  "updated": "2018-04-18T23:46:33Z",
  "releaseNotes": "Fixed mute sound setting not working on iOS version 11.3.",
  "version": "1.51",
  "price": 0,
  "developer": "Swipe Forward LLC",
  "score": 4.04545,
  "reviews": 44,
  "currentVersionScore": 4.04545,
  "currentVersionReviews": 44,
  "searchTerms": "poker"
 },
 {
  "appId": "com.youdagames.howtopoker",
  "title": "How to Poker - Learn Holdem",
  "description": "Learn how to play poker! From an introduction to basic poker rules, to advanced poker tactics. This offline poker app explains the hand combinations, poker terms, hand rankings, who wins, split pot, side pot and much more! It's poker explained in an easy way with clear instructions and lessons.\n \nPractice while you learn texas holdem rules! This poker trainer teaches poker dummies, but also has great poker tips for advanced holdem online players.\n \nThis Poker Tutorial includes:\n- Instruction for beginners and advanced poker players.\n- Clear tutorials about when to fold, how to bet and when to go all-in.\n- A cheat sheet, a manual for poker hand ranking, learn what beats what in hand values. It's easy to learn as it matches yahtzee rules.\n- Quick rules on hands to play and when to fold.\n- Instructions for All in rules.\n- Learn how split pot works.\n- How does a side pot work.\n- Betting rules and who will win in poker.\n- Practice offline poker, no internet required, and get yourself ready for poker online.\n- Poker game rules are explained.\n- Tips are paused, so you can read and learn poker on your own pace. You don't need to pause any video tutorial, you will learn it at the poker tables.\n- Learn hand analysis and poker odds and probability.\n \nBe a poker star in a Vegas Casino! Install this great poker app now and learn Texas Holdem poker today!\n \nNote:\n-This easy to use iOS app is offered for free by the offline and online Poker Game: GOVERNOR OF POKER!\n- Suggestions or issues: support@governorofpoker.com\n- Facebook: https://www.facebook.com/GOP3/\n- Youtube: https://www.youtube.com/user/youdagames",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-08-16T07:28:37Z",
  "updated": "2018-04-03T08:04:31Z",
  "releaseNotes": "- Added new languages:\nSpanish\nRussian\nGerman\nFrench\nPortuguese\n\n- Bugfixes",
  "version": "1.0.3",
  "price": 0,
  "developer": "Youda Games Holding B.V.",
  "score": 4.14286,
  "reviews": 7,
  "currentVersionScore": 4.14286,
  "currentVersionReviews": 7,
  "searchTerms": "poker"
 },
 {
  "appId": "net.gamoz.wpt",
  "title": "Tournament Poker Coach",
  "description": "Master the strategies of no-limit Holdem tournaments including daily fast tournaments in your local card room, online MTBs or major WSOP, WPT or HPT events by having your own coach in your pocket. \n\nPoker Coach professionals evaluate your every move and reward you for making quality decisions. \n\nPlay challenging hands, actually played inmajor events or simulated for training, from a variety of tournament structures, levels and stack sizes facing a rangeof opponent’ skills and receive instant and detailed feedback.\n\nPractice and refresh your skills before showing up to any tournament and significantly increase your chances to reach the final table and win. \n\nFeatures: \n\n* Poker hands are packaged into Hand-Packs™, covering various aspects of Hold'em tournament strategies from the fundamentals to advanced professional play. \n* Win in-app currency, called ProCoins, based on the merit of your play, not the outcome of the hand. Use ProCoins to unlock Bonus Hand-Packs. \n* Game scenarios crafted or actually played by world-class poker coaches\n* Each move is followed by detailed explanations that open your eyes to opportunities to win pots. \n* Play for FREE an entire preview Hand-Pack! You can also PREVIEW a hand from each Premium Hand-Pack. \n* No account creation. Just start playing to improve your poker skills.\n\nPrivacy Policy:\nhttp://support.gamoz.net/privacy.html",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-12-20T05:05:21Z",
  "updated": "2019-10-28T15:05:35Z",
  "releaseNotes": "Various fixes",
  "version": "2.10",
  "price": 0,
  "developer": "Gamoz, Inc",
  "score": 4.07143,
  "reviews": 14,
  "currentVersionScore": 4.07143,
  "currentVersionReviews": 14,
  "searchTerms": "poker"
 },
 {
  "appId": "sk.alligator.games.casino.CasinoLauncher",
  "title": "American & Fruit Poker Casino",
  "description": "Do you like Poker Machines? This is the right game for you. In this Casino, you can play American Poker 90's, Fruit Poker Original, American Poker 3, Fruit Poker II, and Bonus Poker 3-7-9.\nThere are progressive free coins, starting from 50 coins every 4 hours, and growing by 5 coins up to 150 coins for every 4 hours.\nBe smart and play low bets if you have a small amount of money in your wallet. For example 1 or 2. Do not play 20 coins bet if you have only 200 coins in your wallet!\nIf you became rich, then you can play with bets up to 1000 for free. There are a higher bets for small purchase, from 2000 up to 1 million!\nDo not hesitate and download this old style poker casino game right now.",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-11-15T08:38:03Z",
  "updated": "2020-03-11T22:31:40Z",
  "releaseNotes": "You can find a new draggable home (lobby) screen in the game and, couple of small bugs was fixed.",
  "version": "2.2.16",
  "price": 0,
  "developer": "ALLIGATOR IT SERVICES, s.r.o.",
  "score": 4.56716,
  "reviews": 67,
  "currentVersionScore": 4.56716,
  "currentVersionReviews": 67,
  "searchTerms": "poker"
 },
 {
  "appId": "com.solverlabs.poker",
  "title": "Texas Hold'em Poker Online",
  "description": "#1 Online Porker Game on BlackBerry!\n\nPlay LIVE Texas Hold’em Poker against millions of real players ONLINE!\n\nGet $50K in chips FREE for your first time playing plus $2K in chips FREE as DAILY bonuses!\n\nFEATURES:\n- Play live Poker with friends and random players\n- Login with Facebook or play as guest\n- Invite your Facebook friends to play Poker together\n- Play online over mobile network or Wi-Fi\n- Get free daily bonuses\n- Chat with your poker buddies\n- Buy chips\n- Enjoy smooth gameplay with perfect graphics, and sounds\n- Choose the avatar and nickname you like\n- Raise your experience level\n- Track your game results and stats",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "12+",
  "released": "2015-07-23T05:19:59Z",
  "updated": "2020-04-30T15:22:53Z",
  "releaseNotes": "Great game update!\n\n- Added Hand Strength Meter! Now you can see your current cards combination easier to play better\n- Now you can easily change current UI language using Help -> Options screen \n- Added Top Notifications instead of Alert Messages for better usability \n- Added sounds for button clicks \n- Minor bug fixes\n- Network speed improvements \n\nYOUTUBE: https://www.youtube.com/channel/UCR3t7AkIQi3Hwd9WKFP5TrA\nFACEBOOK: https://www.facebook.com/pokersolverlabs/ \nTWITTER: https://twitter.com/pokersolverlabs",
  "version": "3.2.1",
  "price": 0,
  "developer": "SolverLabs",
  "score": 4.375,
  "reviews": 8,
  "currentVersionScore": 4.375,
  "currentVersionReviews": 8,
  "searchTerms": "poker"
 },
 {
  "appId": "com.combay.MegaPokerLite",
  "title": "Mega Poker Texas Holdem",
  "description": "Mega Poker is a unique Texas Hold'em multiplayer card games that lets you play live poker with live players across the internet. It supports several sit and go poker types included (No-Limit, Pot-Limit and Fixed-Limit). You can now connect with your friends and family to go against thousands of other players around the world. Watch the pros, or join and play with them if you think you are good enough.\n\nJoin us now and receive daily FREE up to 1-million chips. Running low? Not to worry, we are also giving out extra extend play chips to keep you on the games. \n\nFEATURES:\n- Now connected with Facebook and Game Center.\n- Daily free chips.\n- Give out Extend Play chips when you are running low.\n- Chat with your friends and family around the world in any international languages (Emoji supported).\n- Earning achievements while maintains ratings and levels to help you improve your poker skills.\n- Provides three different types of Hold'Em games: No-Limit, Pot-Limit and Fixed-Limit.\n- True random card shuffle (with hardware's seeds).\n- Highly secured, performance and stability.\n\nSUPPORT:\nmegapoker@combay.com",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Social Networking"
  ],
  "contentRating": "17+",
  "released": "2009-02-09T22:16:16Z",
  "updated": "2015-09-19T23:27:02Z",
  "releaseNotes": "- Fix layout issues on iOS9.",
  "version": "3.6.7",
  "price": 0,
  "developer": "Combay Inc.",
  "score": 3.77778,
  "reviews": 18,
  "currentVersionScore": 3.77778,
  "currentVersionReviews": 18,
  "searchTerms": "poker"
 },
 {
  "appId": "com.grosvenor.livecasino",
  "title": "Grosvenor Live Casino Online",
  "description": "The UK’s premier Live Casino mobile experience with a £20 Welcome Bonus for all New Customers*\n\nOr if you’re a member of any of the Grosvenor Casinos across the UK, join today and get up to £200 in welcome bonuses*\n\nEnjoy the thrill of playing Live Casino games with the UK’s biggest casino brand, Grosvenor Casinos, on your phone or tablet.\n \nTake a seat at our Live Roulette, Blackjack, Baccarat, 3 Card Poker or Hold’em tables and enjoy top quality gaming provided by friendly, professional, and experienced dealers in an app that puts the power of the casino in the palm of your hand.\n \nWith HD quality video streaming\n \nImmerse yourself in the full casino experience and never miss a moment of the action thanks to crystal clear video, streamed straight to your device in stunning HD. \n \nAvailable where you want, when you want\n \nThe action never stops in our mobile Live Casino with games available to play 24/7 with a dedicated helpline to provide you with comprehensive support if you need it. Download the app today and you’ll be able to access our full range of features and games wherever you go.\n \nGames currently available\n- Live Roulette \n- Live Lightening Roulette \n- Live Blackjack \n- Live Hold’em \n- Live Baccarat \n- Live 3 Card Poker \n- Live Ultimate Texas Holdem \n- Live Caribbean Stud Poker \n- Live Dream Catcher \n \nGetting started\n \nIf you’re new to Grosvenor Casinos, you can sign up quickly and easily through the app. Or, if you already play online, simply log in with your account details and start playing immediately, with fast Face ID login. \n\n\nSafety and security\n \nGrosvenor Casinos has been a trusted and respected operator of casinos in the UK for over 40 years and remains so today. As the largest land-based casino operator in the UK, we understand that the safety and security of your personal information is of vital importance. That’s why we’ve made every effort to protect your data and ensure that you can play with peace of mind and enjoy the games in our app.\n\t\n*Terms and Conditions apply, see grosvenorcasinos.com for further details.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-05-30T08:09:00Z",
  "updated": "2019-10-22T11:16:10Z",
  "releaseNotes": "In this version: \n• Bug fixes and performance improvements",
  "version": "3.12.1",
  "price": 0,
  "developer": "Grosvenor Casinos Ltd",
  "score": 4.3348,
  "reviews": 911,
  "currentVersionScore": 4.3348,
  "currentVersionReviews": 911,
  "searchTerms": "poker"
 },
 {
  "appId": "com.betfair.poker",
  "title": "Betfair Poker Games",
  "description": "New customers only: 100 TWISTER TOKENS plus €15 in bonuses | T&C's apply – details below.\nThe Betfair Poker App brings you all the excitement of playing real money Poker on your iPhone, iPad and iPod Touch, offering an intuitive and secure gaming experience.\nSign up directly within the app to claim your fantastic welcome package full of free games, or simply use your existing Betfair account details to log in and play. The app offers a full range of Texas Hold ‘em cash games including our Speed Poker tables, so there’s no waiting around for your next hand while you’re on the move. The app also allows you to manage your account anytime, including depositing and withdrawing funds via a choice of payment options.\n\nKey Features:\n- Cash and Speed Poker games 24/7\n- Welcome pack and promos\n- Spin a Wheel for random rewards\n- VIP Club\n- Win up to 1000 times your buy in with Twister Poker\n- Safe and secure play with Betfair\n- Trusted brand offering real money online poker since 2004\n\n100 TWISTER TOKENS plus €15 in bonuses T&Cs:\nNew customers only, over 18 years old. Login to Betfair Poker, create a nickname and transfer or deposit into your Poker wallet to receive:\n-200% deposit bonus up to €1,000\n-Earn up to 100 wild twister tokens in your first 90 days.\n-€5 Multi Table Tournament token\n-€10 Playable Casino Slots bonus\n-Betfair Exclusive Welcome Missions\nYou will receive 200% of your first deposit or transfer into the Poker wallet as bonus funds. The maximum available First Deposit Bonus is €1,000, earned by making a first deposit or transfer to your Poker wallet of €500.\n-Your bonus funds can be redeemed into cash by earning Status Points. The bonus is released in €10 chunks for every 1,250 Status Points earned. You have 90 days from your first deposit or transfer into the Poker Wallet to redeem all your bonus. For every €1 paid in tournament fees or cash game rake, you will earn 25 status points.\n-Check in the “My account” section for details on your bonus.\n-1 x €5 Multi Table Tournament token will be released automatically once you make your first deposit into your poker wallet. The €5 Multi Table Tournament token can be used to enter a €5 buy-in multi table tournament. Tokens not used within 90 days will expire.\n-You will start earning Twister Tokens once you make your first deposit into your poker wallet and have opted in.\n-For every 25 status points earned in this period, you’ll be credited with a Wild Twister token.\n-These tokens can be used on the Wild Twister Poker game with the Twister section of the app or Poker software.\n-If you do not use your Wild Twister tokens within 90 days, they will expire. Wild Twister tokens pay out in regular Twister tokens, which also expire in 90 days. \n-When you make your first deposit you will receive a €10 casino bonus.\n-The €10 Casino Games playable bonus is for wagering purposes and will be deducted upon completion of the 40 times wagering requirement.\n-Once you have wagered the full €10 playable bonus, any winnings will be released as cash to your balance.\n-If you do not use the €10 playable bonus within 7 days, the bonus and any winnings will expire.\n-When you make your first deposit or transfer to your Poker wallet, you will see two welcome missions in the mission section of the Poker client/app.\nWelcome Mission 1 - Play on 2 separate days in your first week for a €1 Twister token.\nWelcome Mission 2 - Play on 10 separate days in your first month and get a €5 Twister Token.\n\nPlaying Poker means earning at least 1 status point.\nFor every €1 paid in tournament fees or cash game rake, you will earn 25 status points. This promotion replaces any previous welcome pack, sign up offer or first deposit bonus and it’s limited to one account per customer.\nUnused tokens will expire after 90 days and will not be redeemed except in the applicable tournaments within the promotional period.\n \nFull T&C’s apply: https://promos.betfair.com/promotion?promoCode=WELCOMEPACKPOKER\nBetfair Standard T&C’s apply.",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-04-11T08:32:09Z",
  "updated": "2018-11-06T08:35:13Z",
  "releaseNotes": "• New look and feel optimised for mobile \n• Improved navigation \n• Spin a Wheel feature",
  "version": "18.5.06015",
  "price": 0,
  "developer": "Betfair",
  "score": 3.3,
  "reviews": 20,
  "currentVersionScore": 3.3,
  "currentVersionReviews": 20,
  "searchTerms": "poker"
 },
 {
  "appId": "com.idle-games.eldorado",
  "title": "Fresh Deck Poker – Live Holdem",
  "description": "Poker like you've never seen it before!\n\nIf you crave the nightlife, risk, and thrill of playing poker in an ultra realistic experience that will make you feel like you’re sitting at a table in Vegas, then you will LOVE Fresh Deck Poker! Come play the best free Texas Hold'em poker game with THOUSANDS of people online every day!\n\nFresh Deck Poker has all the right sit-n-go tournaments and ring games for you. The numerous rooms to explore, ability to play with friends online, and the interesting non-playable characters you can interact with adds a little spice to the game while you make your poker skills shine.\n\nPlay on your iPhone and continue your SAME GAME on your iPad or from any mobile device!\n\nFresh Deck Poker is the FIRST free mobile poker game to offer an immersive experience in matches that take place in locations all over the world. Choose your avatar, show off, and dominate the poker tables!\n\nFRESH DECK POKER FEATURES INCLUDE:\n\n\t•\tCHALLENGES: Complete daily and weekly \"gigs\" to collect tons of rewards.\n\t•\tAVATARS: Choose from many gorgeous avatars that come alongside custom table themes for each of them.\n\t•\tTABLES: Put the turbo speed for a No Limit Texas Hold'em Sit-n-Go's. Up to 9 handed Ring Game tables.\n\t•\tLEADERBOARDS: See how you stack up against other players or your friends in the Leaderboards.\n\t•\tBONUSES: Suit up for Millionaire Machine, GSN's most exciting jackpot ever!\n\t•\tLEVELS: Keep on levelling up to get rewards!\n\nPlay for FREE today!\n\n...and don't forget to...\nLike Us on Facebook: http://www.facebook.com/FreshDeckPoker",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-12-01T16:20:29Z",
  "updated": "2020-03-30T11:05:45Z",
  "releaseNotes": "We keep working to make Fresh Deck Poker better. Thank you for all the feedback!\nMany of you experiencing SnG problems should see a big improvement with this update.\nAlso, events will be back and extra bonuses for all of you. Thank you for the trust!",
  "version": "2.85.0",
  "price": 0,
  "developer": "Game Show Network",
  "score": 4.35365,
  "reviews": 82,
  "currentVersionScore": 4.35365,
  "currentVersionReviews": 82,
  "searchTerms": "poker"
 },
 {
  "appId": "stax.SlashPoker.nosebleed",
  "title": "Poker Analytics 5 - Tracker",
  "description": "Poker Analytics 5 is the brand new version of the poker tracker used by tens of thousands of players!\n\nPoker Analytics follows you in your poker life - whether you're a casual player or a pro - and lets you track and analyze your results, record your hands and manage your bankroll.\n\n\n* Statistics:\nThe app shows you all the key statistics from your cash games or tournament. You can use the unlimited capabilities of filters to get all the answers you are looking for.\n\n* Reports:\nGet a full understanding of your performance with a whole range of reports. See how your game evolves, compare your results by stakes, by game or any parameter you want to learn about your strengths and weaknesses.\n\n* Cash game stop notifications:\nBased on your game history, the app notifies you when you’re getting tired and tells you to stop! The app keeps you fresh and away from tilt for the long run.\n\n* Hands recording:\nRecord all your hands for later review with the super fast hand recorder. Share your hand histories in GIF, video or text to discuss your moves!\n\n* Bankroll management:\nPrecisely track all your expenses, bonuses and tips, or create your own types of transaction to match your own needs. Define bankrolls with specific currencies and rates for your sessions abroad. Get your risk of ruin and never get broke again!\n\n* Player management:\nManage the result of all the players for your home games with dedicated graphs and take notes on any opponent you play with.\n\n* There is more:\nPoker Analytics lets you create custom fields, comes with an M-factor calculator, uses iCloud to backup your data, and the list goes on!\n\nThe app offers three different yearly subscriptions to track your sessions. \n- 1 session per month: free\n- 1 session per week: $14.99 per year (USA)\n- Unlimited sessions: $29.99 per year (USA)\n\nBefore choosing a plan, you get 25 sessions to test the app. All other features are free of charge.\n\nThe app works on your iPhone and iPad, and comes with an Apple Watch extension that allows you to simply manage your sessions on your wrist.\n\nYou can learn more on our website. If you have any questions, please contact us!\nHave fun at the table!\n\n\n« I've tested it and I must say I am blown away » - Poker Bastards\n\n« The best interface and support, perfect multi-table tracking as well as feature updates requested by users; very reliable and the best bankroll tracking app ever » - Brian, Australia\n\n« I bought every app and no one compares to Poker Analytics » - Jeff, USA\n\n« The best poker app for live play » - Alex, Brazil\n\n\nSubscription terms of use:\n- Payment will be charged to iTunes Account at confirmation of purchase.\n- The subscription is auto-renewed, unless turned off at least 24-hours before the end of the current period.\n- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.\n- Account will be charged for renewal within 24-hours prior to the end of the current period.\n- No cancellation of the current subscription is allowed during active subscription period.\n- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.\n\nYou can learn more about our terms of use by following this link: http://www.poker-analytics.net/terms.html",
  "genres": [
   "Utilities",
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2016-02-10T08:50:37Z",
  "updated": "2020-04-16T18:44:00Z",
  "releaseNotes": "- New stat added: Estimated hands played!\n- Feed > Sessions > Export: you get to choose between CSV and the existing HTML report\n- Transactions: It's now finally possible to delete a transation in its own screen\n- Transactions bankroll automatically selected when only one exists",
  "version": "5.2",
  "price": 0,
  "developer": "Stax River",
  "score": 4.71429,
  "reviews": 35,
  "currentVersionScore": 4.71429,
  "currentVersionReviews": 35,
  "searchTerms": "poker"
 },
 {
  "appId": "com.murka.poker",
  "title": "TX Poker - Texas Holdem Online",
  "description": "If you love gambling, TX Poker is the only game you’ll want! Our game will make your poker experience more real than it really are and even better... \nReady to handle it? \"Get\" button is here for you \nYou think you kind of tough? Prove your strength here with high stakes and Poker Pros from all over the world! \nThe best free Texas Holdem games are here - try your hand at Dash Poker, Sit-N-Go tournaments, Golden Tournament, join the table and stakes you want. Enter free tournaments now and show the world’s best poker players who’s boss.\n\nBy the way, if you just a \"rookie\" don't hesitate you'll also find some people like you somewhere here which help you sharpen your Poker skills.\nBuckle up and set off at full speed to the world of gambling!\nBattle your way through poker tournaments or wild challenges and win millions of chips!\nPerhaps, you are guessing where is the catch? And probably answer will amaze you, this app is absolutely \"FREE to play\". \n\nWhat is HOT here: \n• Texas Holdem, a classy way to have fun \n• Sit-N-Go tournaments, 9 sharks, fixed buy-in and only Big Wins! \n• Jackpot Slot, love to gamble? Spin and win chips in between hands with the slot machine.\n• Dash Poker, no need to wait anymore, so play as fast as you can \n• Prove your strength in Golden Tournament with high stakes and poker sharks! \n• Earn Free Chips, easier than ever. Casino playing for fun - anywhere, anytime with free  chips rewards!\n• Lots of achievements, increase your chances to win \n• Casino Buddies, feeling lonely with tons of chips? Add some friends! \n• Stars Journey, а fan of challenges and quests? Get started right away!\n• Sales, everyone enjoys buying with benefits, so don't be shy\n• Play non-stop with feature! Extra chips, VIP tables, exclusive look and a lot more await.\n\n\nHundreds of thousands of players play TX Poker every day – can you beat them?\nSo what are you waiting for? A seat just opened up just for you!",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-11-27T15:15:14Z",
  "updated": "2017-12-01T14:16:17Z",
  "releaseNotes": "Bug fix",
  "version": "2.35.0",
  "price": 0,
  "developer": "Murka Games Limited",
  "score": 4.23214,
  "reviews": 56,
  "currentVersionScore": 4.23214,
  "currentVersionReviews": 56,
  "searchTerms": "poker"
 },
 {
  "appId": "com.sports.basketballgames",
  "title": "Score King-Basketball Games 3D",
  "description": "Swipe up, aim at the basket, throw basketball, hit the basket, get rewards and scores.\nShoot basket race with players around the world\n\nGame features:\n-Easy to play\n-Challenge mode and race mode\n-Rich scenes",
  "genres": [
   "Games",
   "Sports"
  ],
  "contentRating": "4+",
  "released": "2019-07-23T07:00:00Z",
  "updated": "2020-02-14T14:10:46Z",
  "releaseNotes": "-Level difficulty adjustment",
  "version": "1.4",
  "price": 0,
  "developer": "Jelly Candy",
  "score": 4.60996,
  "reviews": 2551,
  "currentVersionScore": 4.60996,
  "currentVersionReviews": 2551,
  "searchTerms": "poker"
 },
 {
  "appId": "com.Eberhard.EasyPoker",
  "title": "EasyPoker - Poker with Friends",
  "description": "Poker time? EasyPoker lets you play social multiplayer poker with up to 12 friends - anytime, anywhere. Online poker with friends have never been easier!\n\nThe app is free to play with unlimited amount of games and you don’t buy virtual chips, play money, gold etc.\n\nEasyPoker is different, meant as a digital version of a physical poker set - for the true live poker experience.\n\nNo deck of cards? No poker chips? No problem.\n\nAll you need are your phones! \n\n\n1) Easily create a game\n2) Tell your friends the game code\n3) Play poker - free of charge \n\nSometimes you just wanna play some poker with your friends. \nBut what if you don't have a deck of playing cards or chips with you? Maybe you're out camping, at your neighbors cat's birthday party or on a train ride to a certain school of witchcraft and wizardry? \n\nOur app brings together the best of digital poker and traditional live face to face poker. Now you can play F2F poker with your friends, without having to bring a poker set with you at all times. Imagine playing a game of multiplayer poker around the campfire, at the beach, the bar, the park, in the train, while waiting for food in the restaurant, when skydiving - Really, it’s only limited by your imagination. You and your friends just need the free EasyPoker app on your phone and we’ll take care of the rest.\n\nWhy choose between the social experience of real life live poker and the convenience of digital hold’em poker? We’ve combined the two! \n\n- Multiplayer Texas Hold’em Poker\n- Designed for live F2F poker\n- No wifi or bluetooth needed\n- Cross platform capability\n- Connect instantly with a game code\n- Provides both cards and chips\n- Free to play\n- Intuitive design\n- No credit card registration \n\nA DIFFERENT POKER APP\n\nEasyPoker is not your classic texas hold’em app. We are not a betting platform or an online casino. We don’t facilitate betting of real money. In fact we don’t use play money or chips. Just create a game and you're ready.\nWe think of EasyPoker as “just” a digital poker set - one that fits your pocket. EasyPoker is designed to simulate the experience of live poker. This means that you don’t have to compromise - even if you don’t have a physical poker set with you. \n\nEasyPoker’s mission is not to replace the physical poker set - if you have a deck of playing cards and poker chips, then by all means, use them. We would. \nInstead our purpose is to facilitate the same social experience of face to face poker, when you’re not around your classic poker set.\n\nEasyPoker is meant to be played live, and in the presence of good friends. \nAt its core, poker has always been a social experience, and we think it is best played face to face. Reading your opponents face is a big part of the classic game and we think this part is often lost with traditional online poker. After all, it’s called a “poker face”, and not a “poker avatar”. \n\nLET'S DO THIS TOGETHER\n\nEasyPoker is a relative small but fast moving team. We’re constantly testing and trying to improve our app and the experience of digital face to face poker. \nTherefore we’d love to hear any suggestions and wishes you might have. \nYou’ll find a neat suggestion box on our website https://easy.poker/. \n\nEASYPOKER+\n\nWith a Plus+ subscription you can play up to 12 people at a table, edit stacks, blinds, increasing blinds and accept rebuys.\n\nPlease notice that EasyPoker does not include any kind of real money gambling features.\n\n__________________________________________\n\nIf you choose to purchase EasyPoker Premium, payment will be charged to your iTunes account, and your account will be charged for renewal within 24-hours prior to the end of the current period. Auto-renewal may be turned off at any time by going to your settings in the iTunes Store after purchase. Current EasyPoker+ subscription price starts at $5.99 USD/month, and one-month, 6-month and 12-month packages are available.\n\nTerms of use: https://easy.poker/terms-conditions/",
  "genres": [
   "Games",
   "Utilities",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-08-04T02:48:09Z",
  "updated": "2020-05-06T07:12:06Z",
  "releaseNotes": "You asked, and we listened! Introducing a new, and more stable update.\n\n- Optimized backend for more stable connection.\n- Updated UI showing player actions.\n- Fixed issue with stacks looking weird.\n- Removed limit for rebuy amount.\n- Introduced native UI alerts for better UX.\n- Fixed issue with 'Quit Game'.\n- Fixed other small bugs and updated logic.\n\nWe wanna thank all users for providing feedback and suggesting features. For this update, we focused on fixing connection related issues and bugs - This means your favorite digital poker set just made online poker with friends even easier.",
  "version": "0.9.21",
  "price": 0,
  "developer": "Appex IVS",
  "score": 3,
  "reviews": 2,
  "currentVersionScore": 3,
  "currentVersionReviews": 2,
  "searchTerms": "poker"
 },
 {
  "appId": "com.okduk.poker",
  "title": "Poker!",
  "description": "Just like the classic Video Poker - It's simple to play, Jacks or Better video poker with high or low gamble. \n\n• Classic Video Poker\n• Real vegas style game play and payout\n• High or Low Gamble feature\n\nPoker! has loads of features\n\n• Loads of daily coins with daily feature\n• Simple and easy to play!\n• Complete with high scores and leader board\n• Rich high quality interface & fast game play!\n• Real sound effects\n• Device Sync gameplay with Facebook\n\nPoker! is a great game to play for fun as is intended for fun purposes only",
  "genres": [
   "Games",
   "Board",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-07-26T17:35:08Z",
  "updated": "2018-09-23T02:23:17Z",
  "releaseNotes": "+ Support for iPhone X, iPhone XS and iPhone XS Max\n+ Minor and Bug Fixes",
  "version": "2.2",
  "price": 0,
  "developer": "OKD Limited",
  "score": 3,
  "reviews": 2,
  "currentVersionScore": 3,
  "currentVersionReviews": 2,
  "searchTerms": "poker"
 },
 {
  "appId": "uk.pokerstarscasino.www",
  "title": "PokerStars Casino Games Online",
  "description": "Play exclusive Slots, popular Blackjack games and enjoy the best Roulette action (including double ball and live dealer tables) at the fastest-growing online casino.\n\nTOP 2 REASONS TO DOWNLOAD POKERSTARS CASINO\n\n1. WE HAVE IT ALL! Play a great variety of new and innovative games: From Multi-Player Blackjack and Roulette to Live Casino and our exclusive Slot game, Millionaires’ Island, you’ll find all your favourite games.\n\n2. REAL MONEY! Enjoy real money and free-to-play mobile casino games, available across a wide range of limits and formats. \n\nPokerStars Casino is brought to you by the world’s largest online gaming company – trusted by over 100m players worldwide.\n\nPOKERSTARS CASINO GAMES:\n\nA HUGE SELECTION OF SLOTS\n- Classic and themed Slot games\n- Special features that give you more chances to win cash prizes\n\nPLENTY OF DIFFERENT BLACKJACK FORMATS\n- Variety of Blackjack games – popular formats include Classic, Atlantic City, European and more!\n- Play online Blackjack in Single Player or Multiplayer mode.\n\nTHE THRILL OF ROULETTE\n- European roulette available, including standard and Double Ball tables.\n- Play Live Roulette games, including the award-winning Immersive Roulette.\n\nDownload PokerStars Casino today and make sure you accept push notifications, to ensure you don’t miss out on any of our great promotions.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-09-22T22:43:59Z",
  "updated": "2020-04-14T16:49:29Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "3.27.1",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.34567,
  "reviews": 1594,
  "currentVersionScore": 4.34567,
  "currentVersionReviews": 1594,
  "searchTerms": "poker"
 },
 {
  "appId": "br.com.pokerpro.mobile",
  "title": "Poker MegaJogos",
  "description": "Poker Five Card Draw Online or Poker Texas Hold'em Online with tournaments, rankings, achievements and a lot of players.\n\nFind fun and competitiveness in the app:\n\n• 4 modes to play with real people or robots\n• Excellent game graphics and superior gameplay\n• Lounges for all kinds of players\n• Tables with 2 to 8 players\n\nDownload now and start this great game!\nFind thousands of people playing online.\n\n\nIF YOU ARE COMPETITIVE:\n\n• Join tournaments and win trophies\n• Compete in the Poker Ranking\n• Play and bet with virtual coins\n• Game Achievements\n• Track your stats of the matches\n\n\nOR PLAY FOR FUN:\n\n• Casual Games online\n• Training mode with robots\n• Chat in the game or privately with your friends!\n• Use search filters to find players\n• Meet people from around the world and make friends!\n\nPoker Texas Holdem Online is a complete app for amateurs and professionals card players! Download now and enjoy!",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "12+",
  "released": "2019-09-19T07:00:00Z",
  "updated": "2020-03-21T15:41:48Z",
  "releaseNotes": "- New statistic screen;\n- New profile screen;\n- New avatar editor itens;\n- Now nick change can be purchased;",
  "version": "97.1.58",
  "price": 0,
  "developer": "Megajogos Entretenimento Ltda",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "poker"
 },
 {
  "appId": "com.igg.poker",
  "title": "Texas HoldEm Poker Deluxe",
  "description": "Get $30,000 chips FREE for your first time playing.\nTop-rated Poker App on Facebook! \nFASTEST growing Poker App on Store!\n\nTexas Hold'Em Poker Deluxe offers classic gameplay, full Facebook compatibility and an active community. Compete against over 8 million other players on \n\nFacebook, iPad, iPhone. It's exciting Las Vegas style poker on the go! \n\nJoin now and receive $30,000 in chips for FREE!\n\nGame Features:\n* FREE daily gifts and chip bonuses \n* 1-click access to 100's of tables \n* 5 to 9 person Poker tables \n* Sit-n-Go Tournaments\n* Shootout Tournaments \n* Beautiful graphics and luxurious casinos\n* Simple interface that's easy to navigate\n* Personalized profile and buddy lists\n* Fast registration via Facebook Connect (optional)\n* Live in-game chat and animated emoticons\n* Plenty of gifts, snacks, and drinks to share with others\n* Unlock special prizes in the Facebook App (English, Turkish, Thai and Spanish only)\n\nAnd more is coming soon....!\n\nTexas Hold'Em Poker Deluxe is a great way to meet new Poker pals and connect with Facebook friends! And we're more global than ever now, offering our game in different languages: English, Français, Deutsch, Español, Português, ภาษาไทย, Türkçe, 日本语, 繁体中文! \n\nFor more information or to tell us what you think, visit our fanpage: https://www.facebook.com/bzbeepoker \n\n********************************************** \nIGG is one of the largest social game developers in the world. Our titles include: Galaxy Online II, GodsWar, Age of Titans, 100 Years' War and many others.\n\n**********************************************",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2011-12-21T17:09:58Z",
  "updated": "2018-12-11T22:38:26Z",
  "releaseNotes": "Various game improvements and bug fixes.\nNeeds more help? Email help.poker.apple@igg.com with your IGG ID.",
  "version": "1.6.1",
  "price": 0,
  "developer": "IGG.COM",
  "score": 4.54237,
  "reviews": 59,
  "currentVersionScore": 4.54237,
  "currentVersionReviews": 59,
  "searchTerms": "poker"
 },
 {
  "appId": "com.bskyb.SkyVegas",
  "title": "Sky Vegas: Casino Games",
  "description": "Sky Vegas is the ultimate destination for new, exclusive and exciting online slots. Download the Sky Vegas app to enjoy exclusive games, head-turning bonuses and offers, and the thrill of the unexpected, wherever you choose to play.\n\nEvery spin at Sky Vegas is another chance for a bonus game to kick in, a line to win or a jackpot to hit – the best bit is it could happen at any moment.\n\nSigning up is quick and easy. If you already have an account with Sky Vegas, Sky Bet, Sky Casino, Sky Poker or Sky Bingo, you can log in with your existing account details and discover all that Sky Vegas has to offer!\n\nPlay your way… \nOur app gives you complete control over your gameplay as you can…\n\nManage your account within the app\nRegister and log in\nRecover login details\nAdd payment details \nDeposit and withdraw funds \nView your account history\nAccess help & support\nUse Apple Pay to deposit quicker and easier than ever before\n\nSee this link for details on how to set up Apple Pay on your device: https://support.apple.com/en-gb/HT204506\n\nLike us on Facebook at: https://www.facebook.com/SkyVegas/\n\nFollow us on Twitter at: @skyvegas\n\n18+, BEGABLEAWARE.ORG\n\nPlease note all app images / previews shown here are for illustrative purposes only. Live promotions and offers on Sky Vegas may differ to those shown. See skyvegas.com for full details.\n\nResponsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support in the United Kingdom please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/ and in Ireland please contact Gamble Aware at 1800 753 753 or visit http://www.gambleaware.ie/\n\nThe Sky Vegas app is brought to you by Bonne Terre Limited, an Alderney registered company, and member of a group of companies known as “The Stars Interactive Group”.  Bonne Terre Limited is licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Vegas is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group of products. The Sky trademarks used in the app are owned by the Sky UK Group and are used under license. To place a bet with Sky Vegas you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Vegas. Customers located outside of the UK or Ireland will be prohibited from using this app.\n\nPlease Note: Apple Inc. is in no way linked or associated with this or any other competition / contents run in this app.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-01-11T10:07:40Z",
  "updated": "2019-08-05T09:42:19Z",
  "releaseNotes": "Maintenance release with bug fixes to keep Sky Vegas running as smoothly as possible for you.",
  "version": "2.9.0",
  "price": 0,
  "developer": "Sky Betting & Gaming",
  "score": 4.62579,
  "reviews": 3319,
  "currentVersionScore": 4.62579,
  "currentVersionReviews": 3319,
  "searchTerms": "poker"
 },
 {
  "appId": "com.tapinator.videopokerclassic",
  "title": "Video Poker Classic - 39 Games",
  "description": "* 39 Authentic Video Poker Games. Most Anywhere! *\n* EXCLUSIVE: Skills Trainer for every one of our 39 game types! *\n* Progressive Jackpot! Win a Mega Jackpot when you hit a Royal Flush! *\n\nVideo Poker Classic features your favorite video poker games with real card shuffling, casino paytables, real dealing, skills trainers, and the full Las Vegas experience. \n\nWith the MOST NUMBER of video poker games, the MOST REALISTIC casino experience, and the BEST FEATURES, Video Poker Classic is a must download! \n\n“Hands down, the most realistic video poker games on mobile. I’ve played the casino machines for decades and can finally win on the go!” – JT, top casino Video Poker player\n\nFeatures:\n* FREE to play with FREE Credits every two hours\n* Thirty-nine (39) different, authentic Video Poker casino games\n* Just like Vegas Casino Video Poker – REAL shuffling, REAL paytables, REAL dealing\n* Top paytable payouts on all 39 games\n* Sequential Royal mega payout in Joker Poker & Double Joker Poker\n* Double or Nothing option after each winning hand\n* Hold multiple cards at once – just slide your finger across\n* Authentic ambient, dealing, and winning sound effects\n* Offline support – play anytime, anywhere \n* Need more credits? Bigger coin pack bonuses than any other game\n* Skills Trainer for every one of our 39 game types\n* Multi-Hand mode for each game type\n* Triple Play, Five Play, & Ten Play\n* Progressive Jackpot! Win a Mega Jackpot when you hit a Royal Flush\n* NEW: Daily Goals & Rewards + Awesome Stats\n\n39 Video Poker Games, More Than Anyone!\n* - Double Double VPC\n* - Deuces Wild\n* - Jacks Or Better\n* - Bonus Deuces Wild\n* - Bonus VPC\n* - Triple Double VPC\n* - Super Double Double Bonus Poker\n* - Triple Double Draw Poker\n* - Double Bonus Deuces Wild\n* - Double Bonus VPC\n* - Deuces & Joker Poker\n* - Joker Poker\n* - Super Bonus Deuces Wild\n* - Double Double Draw Poker\n* - Bonus Poker Deluxe\n* - Double Double Bonus Poker Plus\n* - Double Jackpot Poker\n* - White Hot Aces\n* - Triple Deuces Wild\n* - Double Double Aces & Faces\n* - Aces & Faces\n* - Triple Bonus Poker Plus\n* - Tens Or Better\n* - Super Double Bonus\n* - Joker Poker (Aces Or Better)\n* - Bonus Draw Poker\n* - Loose Deuces\n* - Royal Aces Bonus Poker\n* - Double Deuces Wild\n* - Super Aces Bonus Poker\n* - Triple Bonus Poker\n* - Ultra Bonus Poker\n* - Double Bonus Draw Poker\n* - 2 Ways Royal\n* - All American\n* - Aces & Eights\n* - Double Joker Poker\n* - Double Aces & Faces\n* - Black Jack Bonus Poker\n\nGET the #1 Video Poker Game in the App Store and start playing NOW!\n______________________\n\nSubscription Details:\nThe VIP Club subscription is a monthly subscription at a cost of $4.99. It includes our Skills Trainer, 60,000 Coins Monthly, an Ad Free Experience, and Preferred Customer Service. \n\nPayment of $4.99 will be charged to your iTunes Account at confirmation of purchase. The subscription automatically renews on a monthly basis, at cost of $4.99/month, unless it is turned off at least 24 hours before the end of the current period. Your account will be charged $4.99 for renewal within 24 hours prior to the end of the current period. \n\nSubscriptions may be managed by you and auto-renewal may be turned off by going to your iTunes Account Settings after purchase. \n\nIf applicable, any unused portion of your free-trial period will be forfeited when you purchase our subscription.\n\nOur Terms & Conditions: http://tapinator.com/terms\nOur Privacy Policy: http://tapinator.com/privacy",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-04-09T20:46:39Z",
  "updated": "2020-05-02T17:55:29Z",
  "releaseNotes": "-Daily Goals & Rewards!\n-Stamp Card!\n-Awesome Stats!",
  "version": "2.7",
  "price": 0,
  "developer": "Tapinator, Inc.",
  "score": 4.76159,
  "reviews": 151,
  "currentVersionScore": 4.76159,
  "currentVersionReviews": 151,
  "searchTerms": "poker"
 },
 {
  "appId": "com.byterun.ginrummy",
  "title": "Gin Rummy",
  "description": "Gin Rummy is the popular rummy card game. Get one card, discard another and collect the best set for the victory. \n\nGame features:\n- clean big cards\n- auto-sort current hand\n- card animation\n- auto-save when exit",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Family"
  ],
  "contentRating": "4+",
  "released": "2009-11-11T22:42:43Z",
  "updated": "2018-11-15T16:42:59Z",
  "releaseNotes": "Support for 11-inch iPad Pro and new 12.9-inch iPad Pro.",
  "version": "4.1",
  "price": 0,
  "developer": "Mahjong",
  "score": 4.69121,
  "reviews": 10716,
  "currentVersionScore": 4.69121,
  "currentVersionReviews": 10716,
  "searchTerms": "poker"
 },
 {
  "appId": "com.zentertain.solitaire.basic",
  "title": "Solitaire Ⓞ",
  "description": "Play the #1 FREE SOLITAIRE (or Klondike Solitaire / Patience) card game on iPhone!\n\nClassic Solitaire, also known as Patience Solitaire, is the most popular solitaire card game in the world. Try our BEST FREE SOLITAIRE card game, which is beautiful and fun like classic Windows Solitaire.\n\nFeatures:\n\n- Beautiful graphics\n- Klondike gameplay\n- Unlimited free undo\n- Unlimited free hints\n- Option for All Winning deals\n- Timed mode\n- Draw 1 or 3 cards\n- Auto complete for solved game\n- Statistics\n- Personal records\n- Choose your card style\n- Left-handed mode\n- Tablet support\n- Portrait\n- Landscape\n\nSimple and addicting, Solitaire is sure to bring back old memories of the days when Windows Solitaire reigned supreme. We’ve taken the quintessential solitaire experience and revamped it for the new century.\n\nUnlike some solitaire games that lack polish and others that add too many bells and whistles, distracting from the core solitaire experience, Solitaire strikes the perfect balance both in terms of vintage solitaire gameplay and practical modern design, giving you just the right amount of options for all your solitaire needs!\n\nWhat are you waiting for? This simple gem is the ultimate solitaire challenge - play Solitaire now for FREE!\n\nOur official website: www.me2zen.com\nPrivacy Policy: \nhttp://www.me2zen.com/privacypolicy.html\n\nTerms of Service:\nhttp://www.me2zen.com/termsofservice.html",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "4+",
  "released": "2015-12-16T20:09:58Z",
  "updated": "2020-03-10T02:05:41Z",
  "releaseNotes": "• Optimized game performance and overall fun of player experience.\n• General fixes and improvements.",
  "version": "2.416.0",
  "price": 0,
  "developer": "ME2ZEN Limited",
  "score": 4.69943,
  "reviews": 6867,
  "currentVersionScore": 4.69943,
  "currentVersionReviews": 6867,
  "searchTerms": "poker"
 },
 {
  "appId": "com.dragonplay.liveholdem",
  "title": "Live Hold'em Pro - Poker Game",
  "description": "Ante up! Texas Hold’em poker games come to life with Live Hold’em Pro by Dragonplay™ - the #1 Poker Game on iOS! The best FREE Texas Hold’em games are here – Live Poker Pro invites you to join free poker tournaments or single-hands, place your bets and put on your poker face! Playing with Texas Holdem live poker has never been so intense!\n\nFast & Free Poker Tournaments - Play Texas Holdem Pro with Friends and Foes!\nReady to play free Texas Holdem games against the world’s top poker fanatics? Enter free poker tournaments now and show the world’s best poker players who’s boss as you climb the leaderboard. \n\nPlay Poker with Amazing Gameplay & Quick Poker Action!\nLive Holdem Pro has all the real-life Texas Holdem Poker Games for free! Live Holdem Pro’s  poker games bring playing for fun to your fingertips. No need for a casino or high-roller poker room - you’ve got the most intense, LIVE poker gameplay with Live Holdem Pro!\n\nFun features include:\n*Multiplayer Live Chat & Virtual Gifts: Online Poker comes alive! Meet poker stars online and chat in-game to learn poker tips and improve poker skills. Get social with multiplayer poker, where you can send 200+ virtual poker gifts to congratulate your opponents. Meet new friends and hit the jackpot together!\n\n*Fast-Fold Poker Hands & Texas Poker Shootout Tournaments: Play quick Texas Holdem card games at our Fast-Fold Poker Tables. Whether you’re a poker star or beginner player, everyone wins in these quick, free poker hands. Live Holdem offers free Texas Holdem online poker with all the high-speed poker action\n\n*Free Poker Tournaments: Live Texas Holdem offers single poker hands AND free poker tournaments – you choose! Play simple Poker Ring games or all-out Poker tournaments for the jackpot. \n\n*Vegas-Style Multiplayer Poker Ring Games: Love the Vegas casino poker rooms? Capture the Las Vegas casino buzz with free Holdem poker games in amazing HD quality\n\n*Free Poker Rewards: Play Holdem each day and collect free poker chips! Casino playing for fun - anywhere, anytime with free daily rewards!\n\n*Jackpot Poker Lottery Draw: Live Holdem Pro games have THE biggest jackpot for you! Hit the poker jackpot in our massive lottery draw and fill your in-game money stash!\n\nLive Holdem Pro awaits your bet! Install now to play Texas Holdem LIVE with the World’s #1 Poker Game!\n\nLive Holdem Poker Pro does not offer “real money gambling” or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at “real money gambling”. Game is intended for an adult audience (Aged 21 or older).\nMore Casino Games from Scientific Games:\n-Dragonplay Slots - https://itunes.apple.com/us/app/slot-city/id524624575?ls=1&mt=8\n-Jackpot Party Casino Slots\n-Gold Fish Casino Slots\n-Star Track Slots\n-Quick Hit Slots",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-07-09T19:32:52Z",
  "updated": "2017-11-08T13:12:28Z",
  "releaseNotes": "Upgrade your poker sense with our latest version! \nCheck out our new exciting bonus; new bonus awaits EVERY 4 HOURS! \nIf you like our work please take a moment to rate our app and let us know!\n\nSee you at the tables, \nLive Hold'em Pro Team",
  "version": "3.3",
  "price": 0,
  "developer": "Appchi Media Ltd",
  "score": 3.83333,
  "reviews": 18,
  "currentVersionScore": 3.83333,
  "currentVersionReviews": 18,
  "searchTerms": "poker"
 },
 {
  "appId": "com.rsuh.yatzy",
  "title": "Yatzy Addict",
  "description": "Yatzy Addict! If you are a TRUE LOVER of Yatzy, this is your game! as Featured on http://freeBeeApps.com !!!\nYatzy Addict is the famous poker dice game, played all around the world! WORLD WIDE NETWORK MULTIPLAYER IS LIVE!\n\nYou get 13 rounds, with 3 rolls each round to create POKER HANDS, such as 3 of a kind, 4 of a kind, straights, etc.\n\nThere are 13 scoring categories, which can only be scored ONCE per game! this is what makes the game so challenging! How to maximize your points!\n\nif i missed your custom scoring home town ruleset, email me! ill add it!\nim cool like that!\n\nHOW TO SCORE MULTIPLE YATZY's!\n\nSome people are confused on how to score multiple YATZY's! heres how!\n\nIf you get another YATZY, you MUST select an empty score slot.\nYou get the score for the score slot, PLUS 100 extra points for your extra Yatzy!\n\nI understand that some of you play a bit differently! Im going to add that way too!!\nBe sure to email me, so i can get ALL your custom rule sets in for the next update!\n\ngoto http://robertsuh.com for more info on playing this fabulous game!\n\nAll my games are SUPER FEATURE Rich and COMPLETELY CUSTOMIZABLE!\n\n* single player solo or against the computer\n* pass n play mode for up to 8 players, human or computer\n* background ipod music support,\n* HD retina and full size IPAD graphic support! \n* awesome sounds, and graphics!\n* just awesome FAST FUN!\n* GLOWING hint dice! shows you what you need to hit! turn it off, if you want\n* Computer speed from SUPER slow to SUPER SONIC FAST!\n\nYatzy Addict is FULLY CUSTOMIZABLE.\n\n* Change the number of rolls per turn\n* Change the scoring on all categories\n* change the points needed for a BONUS\n* enable multiple 5 of a Kind Yatzys! or turn them off!\n* small straights.. 4 or 5 dice? YOUR CHOICE! and choose the scoring! \n* or do you like 1-5 vs 2-6? again, YOUR CHOICE!\n\n* play single player, 13 rounds\n* play against the COMPUTER, head to head\n* pass N play up to 8 players, both human and computer.\n* World Wide Network Multiplayer - Play against friends and strangers ALL OVER THE WORLD!\n\nIf you enjoy dice games, be sure to check out our WORLD FAMOUS Farkle Addict! Play Farkle dice with people ALL around the world, head to head, in real-time.\n\nEMAIL ME: robertsuh@gmail.com\ni read and reply to ALL emails, usually with in 5 minutes. \nI strive for \"KNOCK YOUR SOCKS OFF\" support!\nAsk my Farkle Addict players! i support my players 110%!!!!\n\nhttp://robertsuh.com for more games, how to play YATZY, and RULES!\n\nDAILY FREE IPHONE and IPAD games at http://FreeBeeApps.com !\nOnly the GOOD ONES!",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "12+",
  "released": "2011-11-22T04:04:16Z",
  "updated": "2014-10-17T21:55:44Z",
  "releaseNotes": "More iOS8 fixes!\nScoring Fixes! The extra 100 points error has been fixed.\na Five of a Kind can be placed in a Full House slot\nGame Center network stability to prevent false disconnects",
  "version": "1.4",
  "price": 0,
  "developer": "ROBERT SUH LLC",
  "score": 4.40468,
  "reviews": 598,
  "currentVersionScore": 4.40468,
  "currentVersionReviews": 598,
  "searchTerms": "poker"
 },
 {
  "appId": "com.grosvenor.pokerlive",
  "title": "Grosvenor Poker Live",
  "description": "Grosvenor Casinos are launching their second iPhone app, providing live information on poker tournaments and cash games.\n\nFind your nearest Casino based on your current location (requires Location Services) or view and select Casinos by area. View current and upcoming poker tournaments as well as the results of previous tournaments.\n\nFeatures:\n• Near Me – find the nearest Grosvenor casino running poker games based on your current location.\n• Favourites – save your preferred Grosvenor casinos to a list for quick access.\n• Tournaments - view a list of current and upcoming poker tournaments at each venue.\n• Results – see a list of prize winners from previous poker tournaments.\n• Cash Games - see live cash game information at sites including active and waiting players.\n• Venue Details – casino information including contact details and location mapping.",
  "genres": [
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-01-08T23:17:21Z",
  "updated": "2020-04-24T22:29:49Z",
  "releaseNotes": "Enhancements to include grosvenorpoker.com tournament and cash game information which relates to casinos",
  "version": "2.1.4",
  "price": 0,
  "developer": "Grosvenor Casinos Ltd",
  "score": 3.53846,
  "reviews": 13,
  "currentVersionScore": 3.53846,
  "currentVersionReviews": 13,
  "searchTerms": "poker"
 },
 {
  "appId": "com.netherfire.HarvestSlots",
  "title": "Harvest Slots - FREE Casino",
  "description": "***Now the #1 Free Farm Style Casino Game in the App Store***\n\nFun, cute, and exciting! Welcome to Harvest Slots!\n\nEveryone has a farm dream, even slots players! In Harvest Slots, play slots to:\n* Grow and customize your farm\n* Fulfill orders to collect coins\n* Produce goods using machines\n* Experience the endless possibilities of living off the land\n\nGorgeous graphics, smooth animations, fantastic bonuses and atmospheric sounds guarantee a premium slots experience. \n\nHarvest Slots is especially designed to give you the experience of Vegas slots on your iPhone/iPad.\n\nIf you LOVE slots, there's no doubt you'll love Harvest Slots. \nHARVEST SLOTS—IT’S 100% FREE-RANGE FUN!",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2015-04-02T18:58:06Z",
  "updated": "2016-04-14T01:12:28Z",
  "releaseNotes": "1. A mysterious Tree Portal has appeared on the Farm (unlock at level 11). Are you ready for a new adventure?\n2. New machine - Chinatown - added in Town, can be unlocked at level 170.\n3. New machine - Cinderella - added in the Tree Portal. Now playable with Coins!\n4. Added a new machine in the tree portal - Angel's Kiss - available to all levels.\n5. Added our new Easter promotion.\n6. Max level increased to 179.",
  "version": "3.0",
  "price": 0,
  "developer": "Netherfire Entertainment, Inc.",
  "score": 4.52941,
  "reviews": 68,
  "currentVersionScore": 4.52941,
  "currentVersionReviews": 68,
  "searchTerms": "poker"
 },
 {
  "appId": "com.tombola.arcade",
  "title": "tombola arcade - Casino Games",
  "description": "We thought, what would traditional slots look like if we did them the tombola way?\n\nThey’d look like tombola arcade, a magical world of unique games starting at 5p... actually it’s not magical it’s REAL! We have it all here at your fingertips.\n\nYou heard us right games start at just 5p up to a maximum of £1, what’s more if you’re already a member of tombola bingo you can simply download and log in to tombola arcade with your current details!\n\nBrand new to tombola? Register and deposit £25 real money and we’ll give you £50 extra absolutely FREE to play with, or deposit £10 and we’ll give you £20 FREE* Unlike other sites there are no play-through or wagering requirements so any winnings are all yours.\n\nSo, what slot games do you have, we hear you cry? Well for a start we’re not like any other online casino, not only are our stakes low but we also have exclusive games that you won’t find anywhere else, including a FREE game which could see you win up to £30,000!\n\nStars\n\nOur completely FREE game; pop on daily and match 25 Stars Mon-Sun and you’ll win a share of a £30,000 jackpot! Did we mention it’s completely FREE? And you can win £30,000? Oh, we did…\n\nGo\n\nVenture to the orient in go, our tantalising tiled game. You can win spot prizes, be transported to the bonus round and win Top Prizes up to £500, what are you waiting for 3-2-1 GO!\n\nBubble\n\nThere’s nothing more satisfying than popping bubble wrap and we’ve brought that poppin’ feeling to the virtual world, to make things even better you could get your hands on a Top Prize of £500.\n\nPick\n\nOnly good things come from picking your own - including winning up to £200. Head on over to our Aztec and Spellbound themes to work your magic.\n\nSpin\n\nWe’ve taken traditional slots and sent them through a process of tombolaification – now you can play slots the tombola way - take it for a spin to win. Watch out for those bonus rounds.\n\nFlip\n\nFlip the counters and connect the rows, with a chance to multiply your winnings in the bonus round and win Top Prizes of up to £500.\n\nScratch\n\nItching to have some fun? Then scratch away the 9 panels to reveal the hidden symbols - match 3 to win! Choose from Jungle, Space and Treasure themes, we have a few cheeky bonus rounds for you too.\n\nGlow\n\nYou can “glow your own way” or you can head to glow to try your hand at winning Top Prizes in the enchanted forest or jellyfish themes. You can’t glow wrong. See what we did there?\n\nWe’re a gambling app and we want you to enjoy playing our games but we want to make sure you’re not only having fun but gambling responsibly. We’ve got a number of responsible gambling features to help you do so – from setting a deposit limit (you get £1 bonus for doing this), freezing a game, cooling off and much more. Be sure to check out the “play responsibly” section in your account.\n\nGet in touch:\n\nIf you need any help our Customer Service team are available 24/7 live chat, \ntelephone: 0800 29 888 73\nemail support@tombola.com\n\nWe’d love to hear how you think we could improve our app, send your comments or suggestions to feedback@tombola.com or leave a review.\n\nOver 18s only\n\nThis is a real money gambling app.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/\n\n* Deposit £10-£25 and get 200% bonus money. First deposit only. Terms apply.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2016-07-28T21:38:55Z",
  "updated": "2020-02-26T13:02:32Z",
  "releaseNotes": "Fixes to pick when moving between skins, chat lobby updates and error message timing improvements",
  "version": "1.5.25",
  "price": 0,
  "developer": "tombola",
  "score": 4.46767,
  "reviews": 3558,
  "currentVersionScore": 4.46767,
  "currentVersionReviews": 3558,
  "searchTerms": "poker"
 },
 {
  "appId": "com.coderedman.wilddreampoker",
  "title": "Wild Dream Poker - Deuces Wild",
  "description": "Wild Dream Poker is fast addictive video poker with great animation and three wildcard poker games. It's free to download so enjoy and good luck! \n\n\"Excellent Game, I love it.... (5 STARS)\" - Lynda Snead\n\nDeuces and Joker, Deuces Wild and One Eyed Jacks games! \nDouble or nothing bonus game! \nFast play with multi-touch and swipe card holding! \nLarge animated realistic playing cards! \nCustomise the game with user options.\n\nHave fun and good luck!",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2011-10-24T21:26:10Z",
  "updated": "2018-04-12T17:12:35Z",
  "releaseNotes": "This fixes the mute sound effect issue on iOS 11.3.",
  "version": "5.6.1",
  "price": 0,
  "developer": "Code Redman Ltd",
  "score": 5,
  "reviews": 5,
  "currentVersionScore": 5,
  "currentVersionReviews": 5,
  "searchTerms": "poker"
 },
 {
  "appId": "com.iphonesoft3g.roulette",
  "title": "Casino Roulette: Roulettist",
  "description": "Play the best free roulette game with millions of players from all over the world! \nA realistic roulette table with 3D graphics, featuring all varieties of roulette: three-sector European, \"double zero\" American and French with additional betting on sectors. \nPlace bets, take risks, improve your skills, and gain experience! Experiment and win to become the best online roulette player!\n\nGame features:\n• FREE CHIPS – Play the game every day to get free chips!\n• 3 VERSIONS OF ROULETTE – Try European, French and American roulette and choose the best for you.\n• ROULETTE TOURNAMENTS – Compete against lots of worthy opponents and try your luck!\n• GET REWARDS – Up the stakes, win games, take risks and unlock achievements.\n• QUESTS - Complete daily quests to get free chips!\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level-up. See how many roulette games you've won and achievements you've completed. Get unique properties and display them on your profile! View other players' profiles to see how you compare! \n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other roulette players!\n• FAIR PLAY GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest roulette experience.\n• LEARN TO PLAY – Are you new to roulette but always wanted to try it?\nOur simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about roulette, from the rules of the game to betting combinations.\n• 3D GRAPHICS – An absolutely free roulette game with stunningly realistic 3D graphics.\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\n• SINGLE ACCOUNT – Start playing free roulette on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.\n\nWant more than roulette?\nTry our other games for an unforgettable 3D experience: \n• TEXAS HOLD'EM POKER – The most popular casino game among professional gamblers! Test your skills in our amazing weekly poker tournaments!\n• SLOTS – Explore our themed slots with lots of unique features!\n• BLACKJACK – A simple game of \"21\". An exciting 3D game that any blackjack fan is sure to enjoy.\n• OMAHA POKER – A more dynamic version of poker, with 4 cards in your hand. Have more fun with amazing combinations!\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\n\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!\nhttps://facebook.com/Pokerist\n\nFollow us on Twitter and get free chips!\nhttps://twitter.com/KamaCasino\n\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-04-22T17:29:17Z",
  "updated": "2020-05-05T09:02:18Z",
  "releaseNotes": "Stay home. Be safe!\nWe've planned a lot of new features for you to enjoy!\n\nNew VIP System\nVIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!\n\nWeekly Rankings\nCompete against other players and see how you rank each week!\n\nNow MTT starts every 40 minutes!\n\nQuicker Betting\nTry raising a bet and you'll find a new option to bet 1/2 or the full pot! Raise faster!\n\nImproved navigation in the lobby—now you can view playing tables in a chart.",
  "version": "32.6",
  "price": 0,
  "developer": "KamaGames",
  "score": 4.60354,
  "reviews": 903,
  "currentVersionScore": 4.60354,
  "currentVersionReviews": 903,
  "searchTerms": "poker"
 },
 {
  "appId": "com.kineticbytes.poolbreaklite",
  "title": "Pool Break Lite 3D Billiards 8 Ball Snooker Carrom",
  "description": "Pool Break Lite is a free suite of games featuring several variations of 3D Pool, Billiards, Snooker, and the popular Crokinole and Carrom board games. The 3D graphics are spectacular and the physics are realistic and accurate. Whether you play against the computer or against other players online, the action is smooth and fast paced!\n\nReady for some realistic pool experience? With a ton of games and lots of fast paced action, Pool Break will keep the most seasoned pro playing well into the night. Its crisp 3D graphics, accurate physics and linear shot guides help you line up your shot, modify the shooting angle, and see where your shot is going to land, making it easy to position yourself up for your next move.\n\nPool Break Lite Features Include:\n• Almost two dozen games packed into one app\n• Universal iPhone, iPod Touch and iPad app \n• Multiple Languages Supported\n• English, French, German, Italian, Russian, Dutch, Polish, Spanish\n• Portuguese (Brazil), Japanese, Korean (South), Chinese (Simplified)\n• Supports Online Cross-Platform Multiplayer Gaming\n• Supports online chat\n• Play against the computer with four difficulty levels\n• Pass-n-Play mode\n• Very Realistic Pool Physics\n• Pan and Zoom and Slow Motion modes\n• Swipe-to-Shoot mode\n• Free View and First Person View\n• Regular, Circular or Hexagonal billiard tables\n• Allows Curve and Masse shots and full English\n• Intuitive User Interface\n• Many different sceneries\n• Multiple fancy ball and cue stick designs (textures)\n• Portrait and Landscape modes\n• Built-in Help Manuals explain how to play\n• Recent Games option for single-click start\n• Hours of fun\n\nIf you've ever thought about playing pool on a real table, Pool Break is the perfect way to try a variety of games and pick your favorite. Use Pool Break as a recreational game, or use its dead-on, real life rendering and geometry to help improve your skills for league night. With place-and-shoot and pool drill games, this is the perfect app for tweaking your game, and practicing those tricky shots that require nerves of steel. \n\nSo what do you get with this app? Over a dozen Pool, Billiard and Snooker games, as well as two popular board games Carrom and Crokinole that are played with discs. In other words - enough cue-games to keep you busy for a long time.\n\nPool Break Lite Games Include:\n• US 8-Ball Pool\n• UK 8-Ball Pool\n• 9-Ball Pool\n• 10-Ball Pool\n• 6-Ball Pool\n• 3-Ball Billiard\n• 7-Ball Pool\n• Rotation Pool\n• 4-Ball Billiards\n• One Pocket Pool\n• Straight or 14.1 Continuous Pool\n• 3-cushion Billiards\n• 1-cushion Billiards\n• Karambol\n• Pool Drills\n• Place-n-Shoot Pool and Snooker\n• Snooker (15, 6 or 10 Reds)\n• Carrom (three board styles)\n• Crokinole board game\n\nFeeling competitive? Choose head to head action with the pass-n-play feature, even more intense competition against the computer, or go online for some cross-platform action with other players. With 4 different difficulty levels to choose from, you'll go from a novice to a seasoned professional in no time. Don't get Snookered! Download Pool Break Lite now rack up some serious fun! It's your break!",
  "genres": [
   "Games",
   "Sports",
   "Sports",
   "Simulation"
  ],
  "contentRating": "9+",
  "released": "2011-03-09T00:58:07Z",
  "updated": "2017-04-07T00:24:27Z",
  "releaseNotes": "• New ball textures\n• Chat dialog latency issue fixed\n• Better swipe-to-shoot sensitivity\n• Minor bug fixes",
  "version": "2.7.2",
  "price": 0,
  "developer": "Kinetic Bytes",
  "score": 4.35714,
  "reviews": 98,
  "currentVersionScore": 4.35714,
  "currentVersionReviews": 98,
  "searchTerms": "poker"
 },
 {
  "appId": "com.tw.tycoon.casino",
  "title": "Tycoon Casino - Vegas Slots",
  "description": "Tycoon Casino Slots is a new slot game to attract everyone’s attention. Different styles of games, huge prizes, big jackpots, and so on, everything you want in the slots game can be found here. Come and seek your luck here- Play Tycoon Casino Slots and Win huge prizes! \n\nStart your spins and enjoy the game, Tycoon Casino Slots can make you forget all the bad things and boring days, because we want to provide slots lovers and beginners with best slot machines and massive grand wins.\n\n►Get 100,000,000 free coins instantly as Welcome Bonus.\n►Every 12 minutes you will receive a store gift,and every 8 hours you can spin bonus wheel for one time. Keep spinning! \n►Interesting graphic, smooth animations and vivid sound offer you the best casino atmosphere.\n►Different feature games, huge prize and bonus, winning symbols like Scatter & expanding WILD.\n►Enjoy our gorgeous Slots Games like being in Vegas heart.\n►Authentic slot machines designed by casino professionals.\n►Hold on to Autospin and listen to the sweet casino melody. Plenty wins will tell you how time flies. \n\n►Enough free coins to bet large in a spin and win more back.\n►Lots of free spins, respin, hold&spin, bonus games.\n►Finish daily goals and get big reward!\n►Participate in different kinds of activities to win extra prizes in special slot machines.\n\n►Get five scatters in Dragon Spin and win free games.\n►Spin and get specific wolves in special reels to multiply your prizes. \n►Come to see the Star Panda and win big prizes.\n►Spin to get plenty respin chances in 88 Riches. \n►Make a big fortune in the volcano Riches, wins never ends.\n\nThe Tycoon Casino Slots can give you an incredible gambling feeling with its attractive appearance and the sound. Don't miss this opportunity to experience different styles of slots games! Come and download the game right now. Huge prizes and bonus are waiting for you!\n\nThis product is intended for use by those 21 or older for amusement purposes only. \nPractice or success at social casino gaming does not imply future success at real money gambling. \n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-10-21T10:44:15Z",
  "updated": "2020-04-30T01:53:04Z",
  "releaseNotes": "Hey Tycoon Lovers! Here's our new updates with:\n• New Slot: Legend Ages\n• New Event: Card Album \n• Great promotion and deals\nWe are always working hard to make Tycoon Casino the best casino slots game out there. Come and seek your luck here!",
  "version": "1.5.2",
  "price": 0,
  "developer": "Triwin Inc.",
  "score": 4.83474,
  "reviews": 3292,
  "currentVersionScore": 4.83474,
  "currentVersionReviews": 3292,
  "searchTerms": "poker"
 },
 {
  "appId": "eu.ganymede.GameDesirePokerHD",
  "title": "Poker Texas Holdem Live Pro",
  "description": "Play Free Texas Holdem Poker Game at Poker Live Pro – the latest poker app by GameDesire!\n\nEnter the world of free, online poker! Join Poker Live Pro to feel the thrill of real entertainment! Advance with your poker chips and buy into high-stakes poker tables. Compete against the best poker players and prove you’re a true poker star!  Poker Live Pro invites you to join adrenaline-filled poker tournaments and single-hand battles as you bluff, bet and win with your poker hand.\n\nFeatures to Enhance your Poker Experience:\n***Professional: Extensive poker stats, poker table variety, true multiplayer experience.\n***Reliable: Similar high-level poker game experience on all platforms and devices.\n***Progressive: Very generous poker tournament offerings with a supportive bonus system.\n***Incredible Design: Top-of-the-line visual interface, creating a very slick poker game design.\n\nStep into the Poker ring with the masters! Whether you just started to play or you’re already a poker combinations superstar, Poker Live Pro suits all levels. In this Texas Holdem poker game, you will be able to start your poker journey at the stake level of your choice.  \n\nUse our Happy Hour Bonus and cash in on your poker-winning hands. Put on your Poker Face and start playing!\n\nPlay like the pros with a large variety of poker rooms and top-of-the-line poker tournaments. Get ready to play anytime with thousands of online poker players. With our Welcome Poker Bonus and Free Daily poker chips, you will never wait to play! Poker Live Pro is full of special bonuses and achievements – so you can start-off small and gradually improve your Texas Holdem poker rankings!\n\n***Cash-in on Poker Bonuses!***\n\nTrue Multiplayer Texas Holdem Poker card game\nChallenge your friends to a card game or play against any of the thousands of worldwide poker stars. You can invite other poker players to your poker table, chat with them and exchange poker game strategies. With cash tables in a range of amounts and daily poker tournaments, you will feel the exciting rush of going All-In!\n\nTexas Hold’em Poker game come to life with Poker Live Pro by GameDesire™ - the most professional poker app you’ve ever played!\n\n***Play Poker Live Pro –  The BEST FREE POKER experience on all devices!***\n\nThe game is intended for an adult audience.\nThe game does not offer \"real money gambling\" or an opportunity to win real money or prizes.\nPractice or success at online poker or social casino gaming does not imply future success at cash poker games or real money gambling.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-01-16T08:00:00Z",
  "updated": "2019-03-11T13:22:07Z",
  "releaseNotes": "* occasional offers for Gold are available!\n* various improvements and bug fixes",
  "version": "4.2.1",
  "price": 0,
  "developer": "GameDesire Limited",
  "score": 4.5438,
  "reviews": 274,
  "currentVersionScore": 4.5438,
  "currentVersionReviews": 274,
  "searchTerms": "poker"
 },
 {
  "appId": "com.iphonesoft3g.blackjack",
  "title": "Blackjack 21: Blackjackist",
  "description": "Play the best blackjack 21 free game with millions of players from all over the world!\nBlackjack is an exciting game that any player is sure to enjoy. Place your bet, get more points than the dealer and win chips. Feel the risk as you dive into the casino atmosphere and hit the big time!\nPlay now to improve your skills, gain experience, make new friends and become the best blackjack player ever!\n\nGame features:\n• FREE CHIPS – Play the game every day to get free chips!\n• GET REWARDS – Up the stakes, win games against the dealer, take risks to get to 21 and unlock achievements.\n• QUESTS – Complete daily quests to get free chips!\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level up. See how many blackjack tournaments you've won and achievements you've completed. Get unique properties and display them on your profile. View other players' profiles to see how you compare!\n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other blackjack players.\n• FAIR PLAY GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest blackjack experience!\n• LEARN TO PLAY – Are you new to blackjack but always wanted to try it? \nOur simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about blackjack, from the rules of the game to winning combinations.\n• 3D GRAPHICS – An absolutely free blackjack game with stunningly realistic 3D graphics.\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\n• SINGLE ACCOUNT – Start playing free blackjack on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.\n\nWant more than blackjack?\nTry our other games for an unforgettable 3D experience: \n• TEXAS HOLD'EM POKER – The most popular casino game among professional gamblers! Test your skills in amazing poker tournaments!\n• SLOTS – Explore our themed slots with lots of unique features!\n• ROULETTE – Featuring stunning 3D graphics and three varieties of table: French, American, and European.\n• OMAHA POKER – A more dynamic version of poker with 4 cards in a hand. Have more fun with amazing combinations!\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\n\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!\nhttps://facebook.com/Pokerist\n\nFollow us on Twitter and get free chips!\nhttps://twitter.com/KamaCasino\n\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2015-01-29T12:12:02Z",
  "updated": "2020-05-04T07:50:11Z",
  "releaseNotes": "Stay home. Be safe!\nWe've planned a lot of new features for you to enjoy!\n\nNew VIP System\nVIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!\n\nWeekly Rankings\nCompete against other players and see how you rank each week!\n\nNow MTT starts every 40 minutes!\n\nQuicker Betting\nTry raising a bet and you'll find a new option to bet 1/2 or the full pot! Raise faster!\n\nImproved navigation in the lobby—now you can view playing tables in a chart.",
  "version": "32.6",
  "price": 0,
  "developer": "KamaGames",
  "score": 4.67534,
  "reviews": 2997,
  "currentVersionScore": 4.67534,
  "currentVersionReviews": 2997,
  "searchTerms": "poker"
 },
 {
  "appId": "com.murka.scatterholdem",
  "title": "Scatter Holdem Poker",
  "description": "Scatter Poker is a new online Texas Holdem game set in a vivid fantasy realm. Explore the mysterious worlds filled with magic, skittish fairies, blazing elementals and other fantasy creatures. Find hidden treasures, complete dangerous quests, and dwell deep into ancient ruins to find its secrets and the source of ancient sorcery. Scatter Poker provides a breathtaking combination of a classic casino card game and a picturesque fantasy world that seduces a player with unique, spectacular experience.\n\nWhat makes Scatter Poker worth checking out:\n\n- Highlighting winning poker combinations;\n- Each level brings new and exciting challenges;\n- The game is living and breathing - bringing you new updates, features, characters and stunning worlds to explore. You won't get bored with us! ;)\n- Customize your avatar and deck with a variety of different options, and if you don't like avatars - you can always place your own picture!\n- Cool Bonus game Video Poker will help you acquire chips every hour;\n- Invite your friends and family to play poker together - we provide the best dealers :)\n- Simple statistic display to help you keep the track on your wins and improve your strategy!\n- Casino slots minigame is for those players who want to think about their Holdem strategy while taking a rest from poker;\n- Standard Mode for those players who are tired of game challenges and quests;\n- Help your friends to pass missions with elixirs and receive such help yourself;\n- You don't like your opponent? Throw a fireball at his face! It won't do much, but hey! It's fun!\n- Massive bonuses and epic special events on a regular basis!\n\nAre you new to Texas Holdem Poker?\nFrom highlighting winning combinations to the simple and informative tutorial, our game will help you to take the first steps into the wonderful world of poker. You will learn when it is the right time to raise the bet and when you have to fold. But the most important - you will learn to bluff! Feel the uncontrollable thrill of an upcoming win when you have a demolishing Royal Flush in your hand or when you have nothing, but your unequaled bluff skills proving that an opponent is wrong, leading him to his demise!\n\nThis game will suit both new players willing to learn how to play and poker sharks looking for a change of pace and new challenges. Mysterious Lady Femida, eccentric Genie, cunning Thief, sinister Vampire Hunter and other fantasy characters are waiting for you in Scatter Poker fantasy realm. Stunning graphics, detailed characters, and bewitching music will keep you satisfied with the captivating atmosphere of the exciting new world. Become the hero for whom Fate itself will cheer for and have fun :)\n\nDownload now and get 6,000,000 Chips as a casino welcome bonus!\n\nBest of luck to you!\n\nVisit our website:\nhttps://murka.com/\n\nJoin us on:\n\nFacebook\nhttps://www.facebook.com/scatterpoker/\n\nTwitter\nhttps://twitter.com/ScatterHoldem\n\nInstagram\nhttps://www.instagram.com/scatter_holdem/\n\nFROM THE MAKERS OF SCATTER HOLDEM POKER: This game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling. Use of this application is governed by Murka's Terms of Service. Collection and use of personal data are subject to Murka's Privacy Policy. Both policies are available at https://murka.com/",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-11-10T21:41:02Z",
  "updated": "2020-03-28T08:40:52Z",
  "releaseNotes": "Dear players!\n\nSpring has brought not only warm days but also the new update in your favorite game. To make things even better, we are going to introduce several interesting features and mini-events with generous rewards.\nAnd that's just the beginning! Everyone's favorite High Roller Club will now be available forever!\nMoreover, we've fixed a few bugs with UI and smoothed out a lot of animations. Stay with us, and you will get the most valuable prizes!\n\nThe Scatter Poker Team",
  "version": "1.32.0",
  "price": 0,
  "developer": "Murka Games Limited",
  "score": 4.68473,
  "reviews": 1421,
  "currentVersionScore": 4.68473,
  "currentVersionReviews": 1421,
  "searchTerms": "poker"
 },
 {
  "appId": "com.realcasino",
  "title": "Real Casino: Play for Real",
  "description": "Take advantage of our exclusive Real Money offers. Experience the ambiance of a real casino with our never seen before graphics and sound. This app is a must for anyone who enjoys casino games, either for fun or for the thrills of real money.\n\nEnjoy exclusive REAL MONEY bonuses and promotions, such as:\n* Free Spins: Start playing your favorite slots machines for real money without depositing one cent.\n* No Deposit Bonus: Play any casino games for real money just by signing up.\n* Welcome Bonus: Take advantage of our incredible match bonus offers. Any deposit you make will add up to 400% to your balance.\n\nReady to play online casino games for real money and win BIG? Well, this is the most complete tool for online gambling!\n\nGet free coins every 10 minutes for FUN play!",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-12-15T02:03:12Z",
  "updated": "2018-12-15T02:03:12Z",
  "version": "1.0",
  "price": 0,
  "developer": "Slots Games Apps SL",
  "score": 4.56522,
  "reviews": 92,
  "currentVersionScore": 4.56522,
  "currentVersionReviews": 92,
  "searchTerms": "poker"
 },
 {
  "appId": "com.ignite.igniteslots",
  "title": "Ignite Classic Slots",
  "description": "Real slots at Ignite Classic Slots - the BEST 777 Classic Online SLOTS Game ever! \nPLAY NOW to receive a FREE Welcome Bonus Package!\n\nWorld class gambling game design brings real 777 slot games from the casinos to mobile App! New Features and Surprising Bonuses on All New Slots!\n\nIgnite Slots is the best 777 classic slots game offers the most stunning graphics and a realistic casino experience. Enjoy every benefit you can possibly have on a real slot machine! Progressive Jackpot, Stacked Symbols and Locked WILDs! PLAY NOW and get the best slot experience today!\n\nWhat is special at Ignite Slots?\n• Tournament Day, Quest Day, and Challenge Day bring you Extra bonus every day of the week!\n• All levels All slots 100% FREE to play! New Updates online every week!\n• Multiply your winnings to maximize the benefits with Bonus Games!\n• 1,000,000 FREE Coins for starter bonus, plus Hourly bonus, Daily Bonus, Store Bonus, Holiday Bonus, Friends Bonus, Fan Page Bonus and many more FREE coins available everyday!\n• A variety of WILD, Free Spins, Bonus Games, Jackpots and more interesting ways to play!\nPlay Ignite Slots, the BEST 777 Classic Online SLOTS Game ever!\n\nPlay free slots, slot machine games & online casino. Make a fortune with huge jackpots, free daily games on Ignite Slots! Ding Ding Ding! Jackpots!\n\nIgnite Slots is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling. Use of this application is governed by Ignite Game Studio's Terms of Service.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-07-10T04:36:28Z",
  "updated": "2020-04-24T08:48:41Z",
  "releaseNotes": "What's New?\n\n-Overall upgraded, fixed bugs.\n-Improved stability and compatibility.\n\nPLAY NOW!\nGold luck & Happy spinning!",
  "version": "2.1.11",
  "price": 0,
  "developer": "Mobee Co., Ltd.",
  "score": 4.70587,
  "reviews": 102,
  "currentVersionScore": 4.70587,
  "currentVersionReviews": 102,
  "searchTerms": "poker"
 },
 {
  "appId": "com.vegas.now.slots",
  "title": "Slots Vegas Now™ Heart Classic",
  "description": "Welcome to Slots Vegas Now™ Jackpot Heart! This fruit machine game takes you straight to the heart of Las Vegas casino slots. Play slots to win spins, amazing jackpots and daily bonuses, all from the comfort of your home. Or office. We are all fans of classic slots of Vegas, so join us. Play classic 777 slots online & WIN BIG.\n\nDOWNLOAD AND WIN 10,000,000 WELCOME BONUS + BONUS SPINS + DAILY BONUS + WHEEL OF FORTUNE BONUS. Play Slots Vegas Now™ Jackpot Heart now!\n\nWith over 100 FRUIT MACHINES, you will always find a new fruit machine game that you’ll love to play! Slots Vegas Now™ Jackpot Heart is ready & waiting for you to spin for.\n\nSLOTS VEGAS NOW™ JACKPOT HEART PRESENTS:\n\n  + A real, slots experience of classic slots of Vegas. \n+ 100+ hot classic fruit machines. Stunning graphics and authentic themes! \n+ Loose slots – these classic Vegas fruit machines provide favorable odds that let you maximize your wins\n + Endless COINS - Daily BONUS Coins with Wheel of Luck Lottery, Hourly BONUS Coins \n+ Huge bonuses for those who play fruit machine games daily\n+ Double Win / Gamble Feature available – Double, Triple and even Quadruple your wins\n + Mega Jackpots on Selected Casino fruit machines\n\nPLAY LAS VEGAS CASINO SLOTS FOR FUN! \n\nIf you feel like you're out of luck, join the slot mania and win big time with the quick hit spins! This real casino fruit machine game will make you feel like you're in the heart of Las Vegas, playing the real classic Vegas slots!\n\nThat's right! Classic Las Vegas casino slot games are back. Play Slots Vegas Now™ Jackpot Heart, unlock new fruit machines daily, win jackpots and have fun, because Slots Vegas Now™ is one of the best casino slot games for fun out there. \n\nIf you love Slots Vegas Now™ slots, then PLEASE share this slots app with your friends. Also please rate and leave your review.  \n\nNOTE: Slots Vegas Now™ Jackpot Heart is intended for an adult audience. The game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at real money gambling.\nSupport Email: contact@simuslots.net\nFeel to email us if you have any issues or suggestions for improvement.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-11-06T08:00:00Z",
  "updated": "2020-03-23T08:38:19Z",
  "releaseNotes": "Hey Simu Slots Fans!\nWe are always trying to improve your experience.\n- Improved leaderboard performance\nEnjoy playing Slots Vegas Now™ ? Please consider taking a few minutes to review this game.",
  "version": "1.45.9",
  "price": 0,
  "developer": "Simu Slots Ltd",
  "score": 4.62132,
  "reviews": 713,
  "currentVersionScore": 4.62132,
  "currentVersionReviews": 713,
  "searchTerms": "poker"
 },
 {
  "appId": "com.luckios.buffaloslots",
  "title": "Slots: Royal Casino Slot Games",
  "description": "Play the greatest slot machines for FREE! 20,000,000 FREE coins to get you started! \n\nPlay Royal Slots, the FREE slots with impressive graphics and sounds will give you the best slot machine gaming experience you have ever had. Join party fever and let beauty show you the way to get Mega Bonus and Big Jackpot! And We have all the best gambling games and unique slots. Welcome to play! \n\nGame Features\n\n- Get started with 20,000,000 FREE coins!\n- Free coins every hour so you can play your favorite slots anytime. \n- Cumulative wheel spin rewards enable you to get more Free Coins and Gems.\n- Kinds of gameplay, including classic slot machines style and some new one.\n\nThe game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Any success in social casino gaming is not indicative of future success at real money gambling.\n\nQuestions?\nE-mail us at: support@luckios.com",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-06-07T18:40:28Z",
  "updated": "2019-04-20T01:36:18Z",
  "releaseNotes": "Happy Easter Day, dear Royal Slots fans! \n\n- Optimize several slots gaming experiences for you! \n- Squash bugs and improve royal casino slot game performance.\n\nUpdate now and enjoy fantastic slots! Happy spinning!",
  "version": "1.4.4",
  "price": 0,
  "developer": "Luckios Game Co., Ltd.",
  "score": 4.70607,
  "reviews": 2157,
  "currentVersionScore": 4.70607,
  "currentVersionReviews": 2157,
  "searchTerms": "poker"
 },
 {
  "appId": "com.iphonepokerincome.PokerIncomeLite",
  "title": "Poker Income Ultimate",
  "description": "\"The Best Poker App!\" -- Michael \"The Grinder\" Mizrachi\n\nPoker Income can help you win more in poker by answering these questions:\n\n* What is my hourly rate for playing poker?\n* Am I better at Texas Holdem, Black Jack or Omaha? Cash games or tournaments? Limit or No Limit?\n* Do I make more money in Casinos or home games? Which casinos?\n* Are there more fish on Friday or Saturday?\n* Am I better at short handed or full table?\n* ...\n\nUnique features include:\n1. Poker Income is the first graphical live HUD tracker with post flop in the world! You can take pictures and notes on your opponents and track games played against a particular player. You can easily track every hand you played in the past and your opponents' statistics such as VPIP, C-Bet, Check-Raise and Aggression Factor. You can profit from the history of their styles and tells, which gives you a huge edge over your opponents.\n2. Backup and restore your data in the cloud at pokerincome.com. Access from any computer or smartphone. Your data are safe even if you lost or switch phones.\n3. Track and post sessions and hands to facebook, twitter or email.\n\nYou won't find these feature in other clones!\n\nWith Poker Income, you can\n\n1. Find the most profitable games, opponents, time and locations\n2. Quickly look up your opponents' styles, tells and even previous games you played with them\n3. Track earnings and withdrawals\n4. Improve your skills\n5. Look at each possible angle of your games from charts\n\nOther features include:\n\n* Track all aspects of cash games and tournaments (game format, stake, location, time, profit, notes etc)\n* Sift through all poker logs to find the most profitable game, opponents, time and location\n* A timer for live games to conveniently track game hours, break-times, and rebuys\n* Export data in a tab separated format to your favorite spreadsheet program\n* Bankroll and withdrawal management\n* Fully customizable: Texas Holdem, Stud, Omaha, Black Jack, Razz, HORSE and your own games!\n\nPoker Income will turn beginners into winners, amateurs into professionals and professionals into superstars!\n\nPlease contact support@pokerincome.com for questions/comments/ideas. Also check out free web version at pokerincome.com from any computer or smartphone.\n\n\n=================\nAbout Developer\n=================\nChang is a big fan of discipline bankroll management rule. From 2007 to 2009, Chang has built his live bankroll from zero to twenty thousands in 20 months. In 2007, he started his poker career by playing freeroll cash games and tournaments in local poker clubs in Seattle, Washington, USA. Then he gradually moved up stakes. In the summer of 2009, after building up enough bankroll, Chang took his first stab at World Series of Poker. He successfully cashed in his first two WSOP events back to back.\n\nFinally, Chang has turned all this expertise and experience into the development of Poker Income. He is also working diligently on a few new ideas. Keep an eye on future releases! Don't forget to email him if you have ideas to improve Poker Income.",
  "genres": [
   "Finance",
   "Utilities"
  ],
  "contentRating": "17+",
  "released": "2009-06-04T01:45:59Z",
  "updated": "2018-03-08T17:54:32Z",
  "releaseNotes": "* Add monthly report by year.\n* Support large font.\n* Fixed rebuy screen.\n* Fixed iPhone X screen.\n* Fixed note screen.",
  "version": "14.3",
  "price": 0,
  "developer": "Poker Chang Ltd",
  "score": 4.65766,
  "reviews": 111,
  "currentVersionScore": 4.65766,
  "currentVersionReviews": 111,
  "searchTerms": "poker"
 },
 {
  "appId": "com.happenlabs.videopoker",
  "title": "Video Poker Deluxe Casino",
  "description": "\"Video Poker Deluxe by Happen Labs is one of the most addictive video poker apps you’ll find in the App Store.\" -- Apppicker\n\nWith over 15 different video poker games, real card shuffling, and real paytables, you'll have Las Vegas with you anywhere, anytime. \n\nExperience the BIG WIN excitement of Las Vegas Video Poker in the best FREE Video Poker Casino!\n\n＊FREE to Play with Free Credits every four hours! More free than any other Video Poker game!\n＊Sixteen (16) different Video Poker games! More Video Poker games than any other!\n＊Exactly like Vegas Casino Video Poker! Real Vegas card shuffler, real paytable!\n＊Top Payouts on all Video Poker games!\n＊Play Double or Nothing after you win to DOUBLE your winnings!\n＊Royal Flush Mega-Jackpots on fifth coin bets! Win Big!\n＊Not enough credits? Go to the credits store to buy more! \n\nMORE Video Poker games than any other!\n＊ - Jacks or Better - ＊ \n＊ - Deuces Wild - ＊ \n＊ - Joker Poker - ＊ \n＊ - Bonus Video Poker - ＊ \n＊ - Double Bonus - ＊ \n＊ - White Hot Aces - ＊ \n＊ - Tens or Better - ＊ \n＊ - Double Deuces Wild - ＊ \n＊ - Double Joker Poker - ＊ \n＊ - Triple Bonus - ＊ \n＊ - Ultra Bonus - ＊ \n＊ - All American - ＊ \n＊ - Super Bonus Deuces Wild - ＊ \n＊ - Double Bonus Deuces Wild - ＊ \n＊ - Double Double Bonus - ＊ \n＊ - Triple Double Bonus - ＊ \n\nNew games added all the time! Get in on the action and play now!",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-02-25T09:29:25Z",
  "updated": "2020-02-11T16:47:53Z",
  "releaseNotes": "Our newest version! We are always trying to make Video Poker Deluxe the best free casino video poker out there!\n- More updates for iOS 13!\n- More bugs have been eliminated.",
  "version": "1.3.27",
  "price": 0,
  "developer": "Happen Labs",
  "score": 4.78571,
  "reviews": 14,
  "currentVersionScore": 4.78571,
  "currentVersionReviews": 14,
  "searchTerms": "poker"
 },
 {
  "appId": "com.mildright.retroslots",
  "title": "Retro Slots: free online casino game",
  "description": "Want more wins? Want to win more with doubling? Then you’ve come to the right place!\nWe’ve tried our best to keep the game atmosphere: open safes with Stirlitz, help the bear to find honey, play caps in the bar, search for crystals with Gnome and more!",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-04-10T18:17:10Z",
  "updated": "2016-09-19T12:45:05Z",
  "releaseNotes": "Performance improvement.",
  "version": "1.7.3",
  "price": 0,
  "developer": "Tristenblake",
  "score": 3.78947,
  "reviews": 19,
  "currentVersionScore": 3.78947,
  "currentVersionReviews": 19,
  "searchTerms": "poker"
 },
 {
  "appId": "com.iphonesoft3g.omahapoker",
  "title": "Omaha Poker: Pokerist",
  "description": "Play Omaha poker for free with millions of players from all over the world!\nImmerse yourself in the world of Omaha poker excitement, challenges and victories to prove that you're a true winner.\nBluff and raise, improve your skills, gain experience, make new friends and become the best Omaha poker player ever!\n\nGame features:\n• FREE CHIPS – Play the game every day to get free chips!\n• GET REWARDS – Up the stakes, win hands, go all-in and unlock achievements.\n• QUESTS – Complete daily quests to get free chips!\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level up. See how many poker tournaments you've won and achievements you've completed. Get unique property and display it on your profile. View other players' profiles to see how you compare!\n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other Omaha poker players.\n• FAIR PLAY GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest online Omaha poker experience!\n• LEARN TO PLAY – Are you new to Omaha poker, Texas hold’em poker, blackjack or roulette but always wanted to try it? \nOur simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about Omaha poker, from the rules of the game to winning combinations.\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\n• SINGLE ACCOUNT – Start playing free Omaha poker on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.\n\nWant more than Omaha poker?\nTry our other games for an unforgettable 3D experience:\n• SLOTS – Explore our themed slots with lots of unique features!\n• TEXAS HOLD'EM POKER – A classic version of poker with 2 cards in hand.\n• BLACKJACK – A simple game of \"21\". An exciting 3D game that any blackjack fan is sure to enjoy.\n• ROULETTE – Featuring stunning 3D graphics and three table varieties: French, American, and European.\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\n\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!\nhttps://facebook.com/Pokerist\n\nFollow us on Twitter and get free chips!\nhttps://twitter.com/KamaCasino\n\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-09-05T10:09:59Z",
  "updated": "2020-05-12T07:03:17Z",
  "releaseNotes": "Stay home. Be safe!\nWe've planned a lot of new features for you to enjoy!\n\nNew VIP System\nVIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!\n\nWeekly Rankings\nCompete against other players and see how you rank each week!\n\nNow MTT starts every 40 minutes!\n\nQuicker Betting\nTry raising a bet and you'll find a new option to bet 1/2 or the full pot! Raise faster!\n\nImproved navigation in the lobby—now you can view playing tables in a chart.",
  "version": "32.6",
  "price": 0,
  "developer": "KamaGames",
  "score": 4.3871,
  "reviews": 31,
  "currentVersionScore": 4.3871,
  "currentVersionReviews": 31,
  "searchTerms": "poker"
 },
 {
  "appId": "com.youdagames.texasholdempokerpro",
  "title": "TEXAS HOLDEM POKER PRO - OFFLINE",
  "description": "** Play Poker without an internet connection and use your chips to travel through Texas ** \n\nBeat all your opponents in Amarillo, become the owner of the Coal Mine and conquer all other 18 cities in Texas. \n\nTexas Holdem Poker Pro takes you back to the wild west, straight to the roots of this very exciting card game. You can play Texas Holdem against the old western pros. Now it’s time to use your poker skills to start small, win big, buy houses, claim industrial assets, collect rent and finally take over Texas! The main goal is: To get a hold of Texas! \nThis is not just a sequel… it’s a brand new game, loaded with tons of new features! \n\n*** Amazing Poker Engine *** \nA completely new poker engine will challenge beginners and pro's alike. Refine your tactics to match the countless playing styles of your opponents and watch them go \"Steamy\" after showing off your outrageous bluffs! \n\n*** Intriguing Story *** \nA new Dallas government decided to put a ban on all poker games and now considers the game to be illegal. Time to take matters in your own hands and prove them wrong! \n\n*** Play Always and Everywhere *** \nBecause there is no live internet connection needed to play this thrilling game of Texas hold'em poker, you can just play Texas Holdem Poker Pro anywhere you want! \n\n*** Customizable characters *** \nProve you are a bigshot by customizing your style to fit your status? Be sure to visit one of the many great hat shops across Texas and get yourself the hat of your dreams! \n\n*** Get ready for hours of gameplay *** \nOver 80 challenging opponents to beat \n27 stunning saloons in 19 amazing cities \nGet a hold of the 5 big industrial assets \n\nTravel by Train, Casino Boat or Stage Coach and play poker whilst on your way to the next city \nEvery city has lots of exciting cash games and big tournaments with even bigger prizes. You’ll experience more checks, calls, raises, folds and all-ins than you can imagine! \nsit-n-go tournaments \nShootout tournaments \n\nHave you always been a Texas hold'em poker fanatic? And you love Governor of Poker 2! You'll have to download Texas Holdem Poker Pro! What are you waiting for partner? Click download and prove you're worthy of the prestigious title of: Texas Holdem Poker Pro!",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-08-21T07:48:37Z",
  "updated": "2016-05-19T00:13:07Z",
  "releaseNotes": "Changed in Texas Holdem poker update 2.3.4\n- bug fixes in poker\n- fixed bug with transport\n- award missing certificates\n\nThanks for playing Texas Holdem Poker and please send any issues to support@youdagames.com",
  "version": "2.3.4",
  "price": 0,
  "developer": "Youda Games Holding B.V.",
  "score": 3.32,
  "reviews": 25,
  "currentVersionScore": 3.32,
  "currentVersionReviews": 25,
  "searchTerms": "poker"
 },
 {
  "appId": "com.coral.gvc.poker",
  "title": "Coral Poker - Real Money Poker",
  "description": "Play poker on the go, whenever and wherever you are with the new Coral Poker app.  At Coral Poker, you can play for FREE or choose the thrill of REAL MONEY poker action!  Choose from Sit & Go’s, multi-table tournaments, cash games or our very own SPINS, where players can turn a $5 buy-in into $1 MILLION. \n\nGET THE BEST POKER ACTION:\n•\tThe app features all of your favourite poker games like No Limit, Pot Limit, Fixed Limit Hold’em or Pot Limit Omaha.\n\n•\tCASH GAMES – play Short Deck and Texas Hold’em from as little as $0.01/$0.02.\n\n•\tMULTI-TABLE TOURNAMENTS – we have over $2.5 million in guaranteed daily and weekly prizes in our Power Series, Gladiator, Bounty Hunters, Daily Majors and Daily PLO tournaments.\n\n•\tLIVE Events qualifiers – qualify for partypoker MILLIONS or World Poker Tour and WSOP circuit events, where you can play in some of the most glamorous locations across the globe.\n\n•\tSIT & GO'S – choose from hundreds of Texas Hold’em tables with buy-ins from as little as $1.10. \n\n•\tFREEROLLS – practise for free and win real prizes.\n\nPOKER FEATURES:\n•\tSPINS:  Experience the excitement of three-handed Sit & Go tournaments where the size of the prize pool is randomly multiplied between 2 and 240,000 before the first card is dealt.  Players can turn a $5 buy-in into $1 MILLION!\n\n•\tfastforward poker:  Don’t like your draw or the hand you’ve been dealt?  Didn’t make that flush you were looking for?  Fold instantly and get dealt new cards at a different table.\n\n•\tShort Deck:  A variation of poker which uses just 36 cards. The game plays similarly to Texas Hold’em, while the reduced deck opens up a whole new level of strategy!\n\n•\tCasino side games: Play roulette or blackjack side games directly from your poker table  \n\nTake a look at our Loyalty scheme.\n• Earn a minimum of 5 points to start getting CASH BACK on your rake.\n• Receive 1 point for every $1 of rake you generate on the tables.\n• Cash paid directly into your Coral Poker account.\n• Opt in to start getting cash back.\n\nSo what are you waiting for? Download the all new Coral Poker app today for the best poker experience on your mobile or tablet device.\n\nResponsible Gambling\n18+. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org.  For users in the Republic of Ireland, please contact telephone 1800 753 753 or visit www.problemgambling.ie. \n\nLicensing \nCoral Poker operates under licence and in accordance with applicable laws and regulations.  For further licence information, please visit our website at https://gaming.coral.co.uk/poker",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2020-01-14T08:00:00Z",
  "updated": "2020-05-04T16:53:16Z",
  "releaseNotes": "We are always updating our app to deliver the best online poker experience. Minor issues have also been ironed out, making gameplay ultra-smooth.",
  "version": "6.3.0",
  "price": 0,
  "developer": "Coral Interactive",
  "score": 1.21053,
  "reviews": 19,
  "currentVersionScore": 1.21053,
  "currentVersionReviews": 19,
  "searchTerms": "poker"
 },
 {
  "appId": "com.betway.casino",
  "title": "Betway - Casino Slots & Games",
  "description": "Step into the Betway Casino! Discover a huge range of real money games; from slots and poker to roulette, blackjack & more.\n\nPlay for your chance to win! And if you’re new to Betway Casino, you get 100% Welcome Bonus, up to £250*! You can even claim your winnings early - simply tap whenever you see the Cash Out button.\n\nDiscover our top games:\n\n• Evolution - Dream Catcher\n• Mega Moolah\n• Tarzan\n• Evolution - Roulette\n• Evolution - Blackjack\n• Goliath\n• European Blackjack Gold\n\n...and many more!\n\nJackpots & huge cash prizes are waiting to be won! Take a spin on Mega Moolah or Starburst, join a multiplayer Poker table or take on the dealer with Live Blackjack. What would you do with your winnings?\n\nREAL MONEY SLOTS\n\n• Play for your chance to WIN BIG with Progressive Jackpot Slots\n• Choose from top Slot machines including Mega Moolah, Starburst & many more!\n• Ready, steady, spin! There’s Slot games to suit any player & any bankroll\n\n\nLIVE ROULETTE\n\n• Simple rules, big payouts - find your Roulette game in Betway’s luxury casino\n• Play favourites like European Gold & Evolution Roulette\n• Put the wheel in motion for your chance to win\n\n\nBLACKJACK\n\n• Step right into Vegas with this casino classic - it’s all about beating the dealer’s hand\n• Play Live Casino for the ultimate Table Game faceoff\n• Take your place at the premium online Blackjack tables\n\nLIVE HD CASINO\n\n• Get the Vegas vibe streamed straight to your mobile from our studios, live in HD\n• Multiplayer casino games including Video Poker, Live Baccarat and other card games\n• Double Betway Plus points on newly released games. Redeem your points straight from your mobile to keep the good times rolling!\n\nPlay your cards right & place your bets! Whether you’re a seasoned slot machine pro or new to the game, there’s something for everyone at Betway. Download now!\n-------------------------------------------\n\n*New customers only. Opt-in required. 100% Match Bonus up to £250 on 1st deposit of £20+.50x bonus wagering applies as do weighting requirements. Debit Card & PayPal deposits only. Advantage Play may invalidate your bonus. Full Terms apply.\n\nhttp://casino.betway.com/terms-welcome-bonus/ for Welcome Bonus T&Cs and http://casino.betway.com/terms-and-conditions/ for full T&Cs.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-09-18T13:31:37Z",
  "updated": "2020-05-05T10:12:58Z",
  "releaseNotes": "We’re constantly updating and improving our app. We’ve fixed bugs and added brand new features designed to make our app easier to use!\n\n• Players experience improvements\n• Updated branding and theme\n• Performance and stability improvements\n• Bug fixes\n\nTake a seat at your favorite casino game, we’ll take care of the rest. From slots to blackjack and roulette, we’ve got all the top games for you to choose from, including:\n\n• Slots: Starburst, Mega Moolah \n• Roulette: European Roulette Gold, Evolution Roulette & Live Roulette HD\n• Blackjack: European Blackjack Gold, Evolution Blackjack & HD Live Blackjack\n• Wheel of Fortune: Evolution Dream Catcher\n\nAre we your favorite casino app or could we do better? Let us know & leave a review.",
  "version": "7.5.4",
  "price": 0,
  "developer": "Betway",
  "score": 4.71917,
  "reviews": 876,
  "currentVersionScore": 4.71917,
  "currentVersionReviews": 876,
  "searchTerms": "poker"
 },
 {
  "appId": "com.tombola.compendium",
  "title": "tombola bingo - UK Bingo Games",
  "description": "Come join the fun at tombola, Britain's biggest bingo app. We've got all of the games you know and love like bingo90 and bingo80 as well as some of our own unique bingo and casino games.\n\nWhat’s more new players can get their hands on our welcome offer; if you deposit £25 we’ll give you a £50 BONUS or deposit £10 and get £20 extra to play with*\n\n…and remember if you win and want to withdraw any real money, there are no wagering requirements at all. So if you win money in any game you're able to withdraw the full amount.\n\nAlready a tombola player? Then simply download the app and login using your usual details and you can play all of the games you know and love on the move, in front of the TV or even on the loo if you so wish…you can't do that with a desktop computer.\n\nOur games start from just 2p in bingo Lite and we have unique bingo games that you'll not find anywhere else. If that still doesn't tickle your fancy how about jackpots up to £20,000?!\n\nCommunity is at the heart of tombola bingo, all of our online bingo games have chat rooms attached to them so you can have a natter with other players and our friendly bunch of Chat Moderators, who you'll see from time to time. Our Chat Mods are happy to answer all of your tombola questions and you can also win money in their chat games throughout the day.\n\nWe're a gambling website but we want you to gamble responsibly, we want you to have fun while you play whilst making sure you stay in control of your spending. We've got a number of responsible gambling features to help you do so - from setting a deposit limit (don't forget you get £1 bonus for doing this), freezing a game, cooling off and much more. Be sure to check out the \"play responsibly\" section in your account.\n\nThis is just another reason we've won Bingo Operator of the year (2018, 2017, 2016, 2014, 2013, and 2012) and Best Overall Bingo Operator (2012)\n\nGet in touch:\n\nIf you need any help our Customer Service team are available 24/7 live chat,\ntelephone: 0800 29 888 73\nemail support@tombola.com\n\nWe'd love to hear how you think we could improve our bingo app, send your comments or suggestions to feedback@tombola.com or leave a review.\n\nOver 18s only. This is a real money gambling app.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/\n\n*Deposit £10-£25 and get 200% bonus money. First deposit only. Terms Apply.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-09-09T07:00:00Z",
  "updated": "2020-03-30T09:09:30Z",
  "releaseNotes": "New safe play options to help our players stay in control of their spending.",
  "version": "5.11.1",
  "price": 0,
  "developer": "tombola",
  "score": 4.36885,
  "reviews": 3088,
  "currentVersionScore": 4.36885,
  "currentVersionReviews": 3088,
  "searchTerms": "poker"
 },
 {
  "appId": "com.williamsinteractive.jackpotparty",
  "title": "Jackpot Party - Casino Games",
  "description": "There ain't no party like a Jackpot Party! You and your favorite Vegas slot machine games are invited to join the party. Spin slots by top casino game brands to win BIG!\n \nWhat happens at the Vegas slots party, stays at the Vegas slots party! Enjoy an authentic, fun, and thrilling fruit machine experience that embraces all the hot Vegas slots! Visit the world’s biggest casinos and spin the best slots from your home. Find everything you LOVE about the neon capital of the world right here and spin the best fruit machines for iPhone and iPad devices. Celebrate life in the biggest, boldest way possible with every slot machine you love! \n \nYou’re on the guest list, and so are the casino slots from the heart of Vegas or even the local pub fruit machine! Have a blast spinning famous fruit machine games like Planet Moolah, Ruby Link, Kronos Unleashed, Dragon Spin, fruit slots, Raging Rhino, Great Eagle, Zeus slots, Buffalo Slots, and many other casino slot games we all adore. With over 200 free slots games for iPad, plus many fun new slots that are added all the time, this is the best party bash in town!\n \nFun casino slots game features are waiting for you at the lucky slots party! Enjoy special progressive casino slot machines, spin free slot machines that offer HUGE bonuses, collect daily bonus rewards, play new slots and challenges, and a whole lot more! This free pokies party never ends, with every feature available for you around the clock and from anywhere in the world. \n \nParty time is bingo time! The Jackpot Party casino slots app also includes awesome free online bingo games that allow you to collect bingo balls, join leagues and live bingo tournaments, and win massive prizes and gifts playing free slot machine games. Don’t forget to throw the confetti in the air as you yell out “BINGO!”. \n \nTurn on the magic party lights and join the Jackpot Party casino Lightning Leagues! Take your favorite slot machines for a spin, advance in the slots game, spin the wheel, and earn league coins. Spin free casino slot games and compete in challenges to win HUGE slots prizes and bonuses every day! Reach the top pokie games league by spinning hot slots, and discover mega party prizes!   \n \nThis party is for winners only! Spin our festive fruit machines bonus wheel and play Jackpot Party casino games to win big prizes every hour. You can win mini, minor, and MAJOR online pokies rewards, and even double them to win coins, bonus slots and Jackpot slots! The biggest prize of all is the thrill of this party, but the prizes and gifts sure add slots of fun!\n \nDid we mention that entrance to the casino slot party is FREE?!? It’s a slots mania!!! You’ll find all the free slots for iPad on this app. No cash is needed to start playing free slots casino games and spinning your favorite free slots. Just hit download and you’ll immediately find yourself at the hottest party EVER, with free casino slot machines as far as the eye can see. Play slots machines free of charge and join the pokie winner's circle of this slots casino: free slots game!\n \nPokies fans, what are you waiting for? Download the best pokies app now, play pokies and put the Vegas jackpot in your pocket. Play this fruit machine game at home with all your favorite pokies games. It’s a house party full of free fruit machines! Become the life of the party NOW and download the app to start celebrating the madness of winning slots! Join the Vegas casino slots frenzy and play casino slots FREE to become the master of the game! \n \nNote: Guest account does NOT merge with Facebook account.\nThe games are intended for an adult audience. (i.e.,intended for use by those 21 or older).\nThe games do not offer real money gambling games or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Social Networking"
  ],
  "contentRating": "17+",
  "released": "2012-12-12T23:33:11Z",
  "updated": "2020-04-29T18:45:26Z",
  "releaseNotes": "Hey, Jackpot Partiers!\n\nIn our latest release, we’ve introduced some new and exciting updates to Tournaments!\n\nPlus, we’ve added several new slots for you to enjoy, including:\n\n-  Undying Beauty\n\n- Zen Chan\n\nMake sure to check them out!\n\nAlso including bug fixes and game improvements!\n\nDon’t miss out on BONUS COINS, contests, and tons of FUN! Join the JPSC Community today:\n\nhttps://www.facebook.com/JackpotPartyCasinoCommunity\n\nhttps://www.instagram.com/jackpotparty",
  "version": "5014.01",
  "price": 0,
  "developer": "Phantom EFX, Inc.",
  "score": 4.58423,
  "reviews": 1205,
  "currentVersionScore": 4.58423,
  "currentVersionReviews": 1205,
  "searchTerms": "poker"
 },
 {
  "appId": "com.vegas.casino.slots.game",
  "title": "Vegas Casino Slots - Big Win",
  "description": "The most popular slot machine game in 2020! Spin in real Vegas Casino and Win Big with more than 30 slot machines. Lots of bonus and jackpots, just enjoy Vegas Casino Slots!\n\nNow you can play real Vegas casino slots on your phone instead of going to Vegas. Whenever and wherever FREE! What you need to do is just a single tap to download and spin! Then you can enjoy the excitement and win the jackpot. This slot game must be the best casino slots you have ever played. Huge jackpots, wild patterns, mysterious themes, and amazing graphics… This pop slot game is on FIRE! \n\nWhen you first login to Vegas Casino Slots, you could get 2,000,000 welcome bonuses. It helps you to play in your favorite slot machines and win big. Slot machines such as QUAKE FLASH ZEUS, CORNUCOPIA GOLD, PANDORA’S BOX, ALL SAINTS’ GIFTS, HAPPY HAPPY, GOLD MINER, GOLD OF WEALTH, BUFFALO BATTLE, RHINO RUSH, TROVE OF PEARL, PANDA, PAPER CUTTING, PRINCESS OF JAGUAR, BEER CARNIVAL, NIGHT OF THE WOLF, DESERT TREASURE, WILD GREEN, SEASCAPE DIVING, CHILI CHILI, FLAME TO HEAVEN, MYSTERY OF MAYA are waiting for you! Play this slot game and enjoy a real Las Vegas style casino slot! \n\nGame Features\n2,000,000 Free coins as welcome bonus for you.\nGrand jackpot in every slot machine waiting for you to win!\nFree coins in every 1 hour and each time level up in Vegas Casino Slots!\nHigh payout with lots of feature games such as FREE SPIN, HOLD & RESPIN, RESPIN, BONUS GAMES.\nAll slot machines unlocked. Just choose your favorite slots.\nConnect to Facebook to collect 500,000 free coins.\nSpin the wheel of fortune every day to get bonus.\nSpecial challenge for you every week. Enjoy it and get a big prize!\n\nThis product is intended for use by those 21 or older for amusement purposes only. Practice or success at social casino gaming does not imply future success at real money gambling. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n\nCONTACT US\nFacebook:\nhttps://www.facebook.com/vegascasinofreeslots\nContact Support: contact@triwingames.com\nFind out more at: http://www.triwingames.com/",
  "genres": [
   "Games",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2018-09-28T00:44:44Z",
  "updated": "2020-04-24T08:44:31Z",
  "releaseNotes": "New slot machine coming soon!\n-Minor bug fixed",
  "version": "1.0.42",
  "price": 0,
  "developer": "Triwin Inc.",
  "score": 4.79751,
  "reviews": 242,
  "currentVersionScore": 4.79751,
  "currentVersionReviews": 242,
  "searchTerms": "poker"
 },
 {
  "appId": "com.paddypower.casino",
  "title": "Paddy Power Casino & Roulette",
  "description": "Deposit £/€10, Play with £/€50 + 20 FREE SPINS FOR BERRY BERRY BONANZA FOR NEW CASINO CUSTOMERS | T&Cs Apply\n\nOur new Paddy Power Casino app comes complete with Blackjack, Roulette, Slots and more, so you can now enjoy the Paddy Power Casino experience in the palm of your hand, on either iPhone or iPad.\n\nFEATURES\n- Play 150+ of your favourite Paddy Power Casino games for real money. This includes Roulette, Blackjack, Slots, Frankie Dettori’s Magic Seven, Jackpot Slots, and a hell of a lot more.\n- Our Casino app features games designed especially for iPhone, iPad.\n- Quick to load and easy to navigate.\n- Free play and real money, cash play.\n- Players can use the same login credentials as on online Casino, or Paddy Power Sports betting.\n- Deposit directly through the Casino app. \n- Register and deposit securely in 5 minutes. \n- Works just as well on 3G/4G as it does on WiFi.\n\nPaddy Power Casino is a product of the Paddy Power PLC, one of Europe’s largest gaming groups listed on the UK and Irish stock exchanges. We’re fully licensed and regulated by the Alderney Gaming Control Commission. Paddy Power Casino is only available to customers over the age of 18.\n\nT&C’s Deposit £/€10, Play with £/€50 offer:\n\n•Only new players from UK and Ireland who have never before played Paddy Power Casino\n•Deposits made with e-wallets (Paypal, Neteller, Moneybookers etc.) are not valid \n•Claim with a minimum of £/€10. The maximum bonus you can receive is £/€40 (400% of your deposited amount) \n•Once your bonus has been redeemed or lost, 10 free spins will become available to you.\n•All winnings from the initial bonus are capped at £/€500.\n•If you choose to ‘claim’ this bonus, you’ll need to wager the amount of the bonus 35 times.\n•Stakes on some of our games don't count in full towards the wagering requirement. Instead they have a percentage contribution:\n-Slots (Excluding double options)\t100%\n-Arcade, Scratchcards, Fixed Odds Games (Excluding Spin A Win/Lucky Wheel) 100%\n-Roulette (Excluding Zero Roulette and 3D) 50%\n-Card Games (Excluding Red Dog, Casino Hold'em, Casino War & Wild Vikings) 25%\n-Blackjack (Excluding Pontoon, Blackjack Surrender, Blackjack Switch, Zero Blackjack and Stravaganza) 25%\n-Sic Bo, Craps, Video Poker (All varieties), Pontoon, Blackjack Switch, Red Dog, Spin A Win/Lucky Wheel, Casino War, Casino Hold'em, Wild Vikings and Stravaganza, Zero Games, Blackjack Surrender and all double options on slots and on Video Poker (All varieties), 3D Roulette and any other games not in the eligible games list 0%\n•Once you complete the wagering requirements or lose your bonus, the free spins will appear on the casino promotion page. Accept your free spins and play them on Berry Berry Bonanza. Unused free spins expire in 24 h. Free spins have no wagering requirements. \n•If you cancel your bonus you also forfeit any pending winnings you have accrued. Cancelled bonuses and winnings cannot be refunded.\n•When a player chooses to participate in buy-in/match deposits, the combined value of their real cash buy-in amount is combined with a specified bonus. This is referred to as the Casino Promotional Balance. \n•You will only be able to qualify for one casino sign-up bonus. If you trigger any other promotional bonus while another is still active, the bonuses will queue in your bonus balance. \n•We reserve the right to govern how bonuses are used before a player is allowed to cash them in. As such we deem it necessary to restrict certain types of wagering from contributing to the wagering/turnover requirements.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-11-21T11:58:40Z",
  "updated": "2018-11-28T12:49:19Z",
  "releaseNotes": "We have been busy making sure our customers get the best possible casino experience. This version has improvements to load times along with bug fixes and we have updated our sign up offer for all you new customers - sign up now, deposit £/€10 and play with £/€50, T&C's Apply.",
  "version": "5.0.5",
  "price": 0,
  "developer": "Paddy Power PLC",
  "score": 3.19048,
  "reviews": 42,
  "currentVersionScore": 3.19048,
  "currentVersionReviews": 42,
  "searchTerms": "poker"
 },
 {
  "appId": "com.card.games.solitaire",
  "title": "Solitaire Classic!!",
  "description": "Solitaire by Flying Pan is the #1 classic solitaire you know and love for your iPhone and iPad. If you like windows solitaire, you're going to LOVE this app!! \n\nEach day you’ll receive a unique Daily Challenge. Solve the Daily Challenge and receive a crown for that day. Earn trophies each month by winning more crowns! Your Daily Challenges, crowns, and current trophy status are available to view any time. Play the current day’s deal and replay it as many times as you’d like on that day. \n\nSolitaire Free Highlights:\n•  Daily Challenges\n•  Winning Deals\n•  Draw 1 card (Easy Mode)\n•  Draw 3 cards (Hard Mode)\n•  Standard klondike scoring \n•  Vegas scoring\n•  Unlimited undos\n•  Smart hints show potentially useful moves\n•  Auto complete option to finish a solved game\n•  Left handed & Right handed support\n•  Portrait & Landscape mode\n•  Interruption friendly with auto-save and resume\n•  Statistics tracker records your play style and history\n•  Universal app for iPhone, iPad, and iPod Touch\n•  Fun and stunning win animations\n•  Beautifully crafted and curated themes\n•  Live Backgrounds provide wonderfully relaxing ambient animations\n\nIf you've ever played solitaire (also known as Patience or Klondike) or any of its variants such as Tri Peaks, FreeCell, Spider Solitaire, Blackjack, Video Poker and other poker card games, then you are going to love fairway solitaire! Play solitaire classic for free today!!\n\nSubscription Options:\n• Payment will be charged to iTunes Account at confirmation of purchase\n• You can available for subscription for $2.99 per month and remove ads.\n• Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period\n• You can turn off auto-renewal by going to your Account Settings after purchase. \n• No cancellation of your subscription is allowed during the active subscription period.\n\nPrivacy Policy:\nhttp://hhsdaily.azurewebsites.net/\n\nTerms of Service:\nhttp://hhsdailyterms.azurewebsites.net/",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Lifestyle"
  ],
  "contentRating": "4+",
  "released": "2017-04-21T22:07:07Z",
  "updated": "2020-03-02T16:08:54Z",
  "releaseNotes": "- General bug fixes and game improvements. \nWe hope you enjoy Solitaire! Keep it update so you've always got the latest and greatest.",
  "version": "2.0.20",
  "price": 0,
  "developer": "HHS Daily",
  "score": 4.45699,
  "reviews": 186,
  "currentVersionScore": 4.45699,
  "currentVersionReviews": 186,
  "searchTerms": "poker"
 },
 {
  "appId": "com.activision.videopokerjackpot",
  "title": "Video Poker Jackpot!",
  "description": "Video Poker Jackpot! brings exciting Vegas Casino style Video Poker to your fingertips anytime anywhere! The games are easy to learn, simple to navigate and most importantly, hours of fun! Simply select a game of your choice, choose a bet and start drawing cards! -\n\n***Top 10 Casino Games in over 10 Countries\n***Top 50 Casino Games in over 50 Countries\n\n5/5 Stars*****\n\"Love it Love it Love it. It's the only game I play now\"\n\n5/5 Stars*****\n\"I love the speedy recover of free play, the games are great, the machines are loose enough to keep my interest. Don't change anything\"\n\n5/5 Stars*****\n\"Great Fun App, Enjoy playing it on breaks at work\"\n\n- FREE FREE FREE! - Keep the chips flowing with FREE Bonus Chips multiple times a day! \n- HIT THE JACKPOT!  - Win up to 1 MILLION FREE Chips every for hitting the Jackpot!\n- UNIQUE MACHINES - Play Joker Poker, Jacks or Better, Deuces Wild!, High Stakes, and Bonus Poker. Many more games to come!\n- BIG BIG BIG CARDS - Large, vibrant cards optimized for your eyes on both your iPhone and iPad! \n- DOUBLE, QUADRUPLE or OCTUPLE your winnings - Try your luck with the “Double or Nothing” mini-games\n- UNLOCK ACHIEVEMENTS - Discover even more gameplay as you complete achievements through the game.\n- COMPETE AGAINST FRIENDS - Beat your friends highest scores through Game Center\n\nDownload now and HIT THE JACKPOT!",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-11-12T22:31:49Z",
  "updated": "2019-11-23T09:18:19Z",
  "releaseNotes": "We’ve fixed some bugs including one that caused the first card in a hand to appear out of place after a double or nothing.",
  "version": "3.4.1",
  "price": 0,
  "developer": "Code Redman Ltd",
  "score": 4.77778,
  "reviews": 72,
  "currentVersionScore": 4.77778,
  "currentVersionReviews": 72,
  "searchTerms": "poker"
 },
 {
  "appId": "com.greenpanda.blackjack",
  "title": "Blackjack ∙",
  "description": "Welcome to the #1 Blackjack! Play as in real casinos and beat the dealer to win tons of dollars!Blackjack, also known as twenty-one, is the most widely played casino banking game in the world.\n\nRULES AND OPTIONS\n\nBlackjack is a card game between a player competing against the dealer. It is played with two or more decks of 52 cards.\nThe object of the game is to beat the dealer in one of the following ways:\n\n- Get a BlackJack on the player's first two cards (21 points), without a dealer blackjack.\n- Reach a final score higher than the dealer without exceeding 21\n- Let the dealer draw additional cards until his or her hand exceeds 21.\n\nCASINOS\n\nTravel all around the world and play in the most popular casinos: \n- Casino of Las Vegas\n- Casino of Paris\n- Casino of Macau\n- Casino of London\n- Casino of Monte Carlo\n- Casino of The Bahamas\n\nFEATURES\n\n- Blackjack pays 3:2 \n- Dealer must stand on a 17 and draw to 16\n- Insurance pays 2:1\n- Hit, Stand, Double Down, Split or Surrender\n\nIMPORTANT NOTICE\n\nThis game contains an algorithm that strictly respects Blackjack rules. Cards are shuffled and dealt in the exact casino way to ensure a 100% fair gameplay.\nIn-app purchases cost real money - be responsible when playing games including money. \nThis Blackjack game is a gambling simulation game, it neither involves real money gambling, nor provides any means to win real money or prize.\n\nCONTACT\n\nPlease feel free to contact us at support@greenpandagames.com if you encounter any problem regarding this app.\nFor the latest news and updates on Green Panda Games:\n\nLIKE us on Facebook\nhttps://www.facebook.com/Green-Panda-Games-1696022237280275/\n\nFollow us on Twitter\n@greenpandagames\n\nVisit us at:\nhttp://www.greenpandagames.com",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-06-08T07:32:10Z",
  "updated": "2018-07-16T13:11:18Z",
  "releaseNotes": "- GDPR update\n- Minor bugs fix\n\nIf you encounter any problem regarding this app, please feel free to contact us at support@greenpandagames.com",
  "version": "2.1",
  "price": 0,
  "developer": "Solitaire Games Studio",
  "score": 4.65751,
  "reviews": 946,
  "currentVersionScore": 4.65751,
  "currentVersionReviews": 946,
  "searchTerms": "poker"
 },
 {
  "appId": "com.DesignWorksGaming.DiamondSky",
  "title": "Diamond Sky: Slots & Lottery",
  "description": "Welcome to the world of Diamond Sky Casino games, the fastest growing app for sloto games and  scratch off games! If you want one source for the best free to play classic slot games, scratch off games, VIP slots, 777 slots and free daily lottery, then look no further than Diamond Sky! Our casino is filled with amazing slot machine games from real casinos (both video slots and classic stepper slots) and free lottery ticket games to give you the graphics and sounds you love from classic Vegas casinos! With more games and more features than ever, you’ll enjoy bonus slots, jackpots, wilds, free spins, progressives, immersive videos and bonuses galore!\n\nDIAMOND SKY SLOTS FEATURES:\n• 175+ free to play classic slots, video slots and scratcher games! \n• New sloto games added every two weeks \n• Scratch off games - scratch and win coins!\n• Free Daily Lottery - play the lottery every day for a chance to win billions!\n• Up to 10,000,000 coins daily and even more for VIP Slot Players.\n• More ways to win: Daily Wheel Spins, Daily Bonus, Friends Bonus, 4-hour Bonuses, Free Daily Lottery, Gifting, Scratch Off Games and more!\n• VIP Slot Games with better bonuses, bigger wins and exclusive games!\n\nCLASSIC SLOTS - THE BEST 777 SLOTS:\n• Star Spangled Stacks\n• Triple Crown\n• Wild Shift\n• And more!\n\nTRIPLE DIAMOND FAN FAVORITES - OUR BEST SLOTO GAMES:\n• Diamonds Sapphires and Rubies\n• Cabaret Cash\n• Golden Grand\n• Petsburgh\n• Armadillo Artie\n• And more!\n\nSCRATCH OFF GAMES!\n• On the Hook\n• Golden Grand\n• 3X a Lady\n• JaXPot 7s\n• Fire Company 5\n• Blitz Bucks\n• Groundhog Pays\n\nVIP SLOTS - FOR THE HIGH ROLLERS\n• Komodo Dragon\n• Shifting Hearts\n• Ocean Riches\n• Golden Cheetah\n\nFREE DAILY LOTTERY\n• Get 10 chances each day in our free lottery!\n• Daily lottery drawings \n\nDownload our sloto game app today start enjoying the best free to play classic slots, scratch off games and free daily lottery right from your own phone or tablet! \n\nThis game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money prizes. Practice or success at social gambling does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-06-02T22:45:40Z",
  "updated": "2020-01-17T16:30:37Z",
  "releaseNotes": "Our first table game, Baccarat, is here for a limited time (starting 1/21) Download the latest version so you can access the latest games, features and deals! \nJOIN OUR COMMUNITY FOR SPECIAL OFFERS AND THE LATEST INFO! \nLike us on Facebook: www.facebook.com/DiamondSkyCasino",
  "version": "2.4.9",
  "price": 0,
  "developer": "Design Works Gaming",
  "score": 4.66308,
  "reviews": 279,
  "currentVersionScore": 4.66308,
  "currentVersionReviews": 279,
  "searchTerms": "poker"
 },
 {
  "appId": "com.grlgames.fulldecksolios",
  "title": "Full Deck Solitaire",
  "description": "Designed by a Solitaire loving Mom and Daughter, Full Deck Solitaire is a beautiful card game with an easy to use user interface. Seventy one uniquely different variations of Solitaire not seen in many other games keep even the most seasoned guru occupied. Statistics for each game let you know how many hours you have played, games you have won and your highest score for that game. A uniquely smart three level hint system lets you know if there are moves to play and will even shake the cards if you can’t quite see that elusive move. Smart badges on decks show you how many cards are left to be dealt from that deck. This latest update adds Daily Challenges, three guaranteed solvable games of solitaire for you to bend your mind over. Can you get all nine stars every day?\n\n\"Clearly the best solitaire game available.\" \"Most excellent solitaire game ever!\" \"Excellent graphics. Realistic cards.\" \"Love this app.\" \"Excellent graphics and a huge selection of games makes the app feel fresh every time I play.\" \"I love this app and all the games\" \"Wonderful game, great time waster!\" \"One of the best editions I've ever played! Excellent!\" \"This is a wonderful app.\" - Just some of the reviews for the current version! Thank you, we are really humbled by your love for the game!\n\nThe game has an option of a classic background, your own wallpaper, or a gorgeous moving video of the ocean under the Moon. \n\nGames include Klondike 3 Card, Klondike 1 Card, Vegas Solitaire, Freecell, Thieves Of Egypt, Forty Thieves, Red And Black, Royal Parade, Demon, Canfield, Canfield 1 Card Turn, Double Canfield, Spider 1 Suit, Spider 2 Suit, Spider 3 Suit, Spider 4 Suit, Pyramid, Tri Peaks Solitaire, Golf, Golf Around Corner, Gaps, Montana, Beleaguered Castle, Bisley, Mrs. Mop, Clock Patience, Grandfather's Clock, German Clock, Captive Queens, Scorpion, Scorpion 2, Wasp, Three Blind Mice, Osmosis, Yukon, Russian Solitaire, Chinese Solitaire, Australian Patience, Fortress, Pyramid Golf, Aces Up, Miss Milligan, Demons and Thieves, La Belle Lucie, Trefoil, The Fan, Super Flower Garden, Storehouse, Cruel Solitaire, Baker's Dozen, Spanish Patience, Castles in Spain, Portuguese Solitaire, Good Measure, Baker's Game, Eight Off, Penguin Solitaire, Seahaven Towers, Rank And File, Number Ten, Lady Jane,  Zerline, Double Klondike, Double Klondike 1 Card, Osmosis By The Book, Eagle Wing, Texas Fury and Texas Patience. A few of these classic games are unique to Full Deck Solitaire! \n\nAnd now with daily challenges, unique solvable puzzles that will challenge you every day.\n\nPlease write or visit our support page if you are having any problems at all. We want you to love this game!",
  "genres": [
   "Games",
   "Entertainment",
   "Strategy",
   "Card"
  ],
  "contentRating": "4+",
  "released": "2011-02-11T00:56:23Z",
  "updated": "2020-03-11T22:36:42Z",
  "releaseNotes": "- New game from player request \"Eagle Wing\"\n- removed holiday theme",
  "version": "1.96",
  "price": 0,
  "developer": "GRL Games",
  "score": 4.61353,
  "reviews": 1242,
  "currentVersionScore": 4.61353,
  "currentVersionReviews": 1242,
  "searchTerms": "poker"
 },
 {
  "appId": "uk.betstars.www",
  "title": "PokerStars Sports Betting",
  "description": "Get the PokerStars Sports app for the best mobile betting experience!\n\n==ALL THE BEST FEATURES AND PROMOTIONS==\n\nCASH OUT\n\nGone are the days when you had to wait for an event to finish before you could start counting your winnings. If your bet is coming in but you notice the momentum swinging in a match (or if your bet isn’t going to plan and you want to claim some of your stake back) you can use Cash Out to your advantage and lock in your profits.\n\nSPIN & BET\n\nSpin & Bet is the game-changing feature exclusive to PokerStars Sports where you can enhance your potential winnings by up to 10x. PokerStars Sports have just enhanced this feature to cover all Pre-Match football markets on all games.\n\n==MORE SPORTS AND GAMES==\n\nSPORTS -- Bet on over 30 different sports available\n\nLEAGUES -- Great odds on leagues from around the world\n\n==AMAZING CUSTOMER EXPERIENCE==\n\nBETSLIP -- Quick and easy way to check on all your bets\n\nIN-PLAY BETTING -- Place your bet during the game and follow the action with scoreboards.\n\nMake sure you accept push notifications when you download our betting app, to ensure that you don’t miss out on any of our great promotions.\n\nThis is a real money gambling app. You must be 18 years of age or of legal age of majority in your jurisdiction, whichever is greater, to create a Stars Account.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.",
  "genres": [
   "Sports",
   "Casino",
   "Games",
   "Sports"
  ],
  "contentRating": "17+",
  "released": "2015-12-14T17:03:40Z",
  "updated": "2020-05-02T17:41:39Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "3.28.3",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.32903,
  "reviews": 775,
  "currentVersionScore": 4.32903,
  "currentVersionReviews": 775,
  "searchTerms": "poker"
 },
 {
  "appId": "com.gosub60.solfree",
  "title": "Solitaire Deluxe® 16 Pack",
  "description": "Not just solitaire… Solitaire Deluxe®!\n16 Solitaires in one!  \n\nClassic (Klondike Solitaire), Spider Solitaire, TriPeaks Solitaire, Pyramid Solitaire, FreeCell and ALL of the most popular types of solitaire in the world, in one beautiful app.\n\n***** “This has to be the best solitaire collection in existence!”  -J. Strother\n\n***** “Best.Card.Game.EVER.!  Love this!! Best free solitaire app EVER.!!!!!!!”  -AngelSezRawr\n\n*****  “The best solitaire game I’ve ever found!” –Mcheadache\n\n*****  “Lots of fun.  It goes beyond Klondike because it gives different games of Solitaire.  I looove it” –DanielaM1323\n\n*****  “Totally addicted!  Love this game!” –Damom53\n\n***** “Best suite of Solitaire games I’ve seen – great crisp shapes making it easy to distinguish between suits.”  -Purplnth\n\nTHANK YOU to everyone for all of the great Solitaire Deluxe reviews!  And from the App Review Sites:\n\n*****  “Five Stars! All kinds of extra features that make the game even more fun…most importantly you are getting a full game for free.” – The Apple Clan \n\n*****  “The only game in town…there is value in such packages when they go the extra mile.” – PocketGamer \n\n*****  “The cream of the crop. Workers of the world, commence shuffling!” – LA Daily News \n\n\nThe most feature-rich Solitaire in the App Store: Classic, Spider, Tri-Peaks, FreeCell and more, all in one convenient app!\n\nThe original: Solitaire Deluxe has been the leading solitaire game for your mobile device since 2003. With its simple controls, exclusive EasyRead Cards, and new winnable deals every day, Solitaire Deluxe is your premium choice… and it’s all free.\n\n16 GAMES, INCLUDING ORIGINAL SOLITAIRE\nKlondike (Classic Windows Solitaire), FreeCell, Spider, Pyramid, Tri-Peaks, Chinese Solitaire, Scorpion, Yukon, Golf, Canfield, Kings Corner, Vanishing Cross, Spiderette, Poker, Russian Solitaire and The Harp. \n\nFEATURES \nDaily Winnable Deals – deals have guaranteed winnable solutions that are updated every day!\nPlay with friends or play alone\nPick-up and play anywhere – no internet connection required\nBest-in-class tutorials for all 16 games  \nLandscape or portrait modes  \nExclusive Easy Read™ cards \nHD Display \nCustomizable cards & backgrounds \nOptimized for iPhone, iPod Touch, and iPad \nShare scores with friends using Facebook Connect\nTweet and view your Twitter feed without even leaving the app \nLeading customer care for any of your questions\n\nGAME UPDATES & TIPS \nwww.facebook.com/solitairedeluxe \n\nFrom Mobile Deluxe, the makers of Big Win Slots™, Solitaire Deluxe® Social, Sudoku Deluxe® Social, and 3 Reel Slots Deluxe™!",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "4+",
  "released": "2010-12-07T23:39:59Z",
  "updated": "2019-12-23T01:12:29Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "22.6.1",
  "price": 0,
  "developer": "Mobile Deluxe",
  "score": 4.66146,
  "reviews": 641,
  "currentVersionScore": 4.66146,
  "currentVersionReviews": 641,
  "searchTerms": "poker"
 },
 {
  "appId": "com.bananaandco.solitaireFree",
  "title": "Solitaire Classic ◆",
  "description": "The best CLASSIC Solitaire! Polished, intuitive, and fun! \n\n- 40 beautiful HD themes to customize your look.\n- Over 50,000 winnable games.\n- Draw one or draw three gameplay. \n- Easy to play.\n- No fluff, no confusing menus, just good old classic Solitaire.\n- Auto-move or manual drag & drop controls. \n- Landscape and portrait orientation. \n- Left or right handed play. \n- Universal iPhone and iPad support.\n- Free updates including more theme packs. \n- Slick interface and animations. \n- Statistics tracking. \n\nDon't take our word for it, see what our awesome users have to say!\n\n\"This his been an old favorite of mine for a long time. Great Solitaire.\"\n\n\"The themes provide something for everyone.\"\n\n\"Love it! Five stars!\"\n\n\"The best Solitaire\"\n\nPlease be sure to check out other apps by Banana & Co. including Spider Solitaire & FreeCell.\n\nThanks for playing!",
  "genres": [
   "Games",
   "Board",
   "Card",
   "Entertainment"
  ],
  "contentRating": "4+",
  "released": "2012-02-29T02:23:50Z",
  "updated": "2017-12-09T17:33:07Z",
  "releaseNotes": "- minor bug fixes",
  "version": "1.29.1",
  "price": 0,
  "developer": "Banana & Co.",
  "score": 4.50228,
  "reviews": 219,
  "currentVersionScore": 4.50228,
  "currentVersionReviews": 219,
  "searchTerms": "poker"
 },
 {
  "appId": "com.12gigs.vpoker",
  "title": "Video Poker Casino Card Games",
  "description": "THE BEST POKER GAMES on iOS!\n\nVideo Poker - Jacks or Better and Deuces Wild Card Game is the top poker game for iPad and iPhone! If you want casino style poker games, poker that you can play offline or online, with or without WiFi download poker in Video Poker: Poker Games with Jacks or Better and Deuces Wild! Video Poker is updated all the time! Be a poker WINNER anywhere with Video Poker’s Best card game app by Super Lucky Casino - makers of top rated casino games and apps!\n\nThis premium game comes with incredible poker and slots features:\nOriginal slot machines to help you earn poker chips!\nStart with 400 poker chips to play as long as you want!\nPlay Jacks or Better OR Deuces Wild style video poker!\nBonus games like Double Up card flips and huge poker jackpots!\nVideo Poker clubs features for more bonuses!\n\nDownload the Video Poker - Poker Games app TODAY for HUGE Poker WINS!\n\nThis game is intended for adult audiences and does not offer real money gambling or any opportunities to win real money or prizes. Success within this game does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2012-12-10T11:19:07Z",
  "updated": "2019-09-19T14:35:55Z",
  "releaseNotes": "HUGE UPDATE! Enjoy new VIDEO POKER Gameplay modes! \n- Jacks or Better!\n- Deuces Wild!\n- More bonus chips and games every day!",
  "version": "1.132",
  "price": 0,
  "developer": "Super Lucky Casino Inc.",
  "score": 4.51515,
  "reviews": 33,
  "currentVersionScore": 4.51515,
  "currentVersionReviews": 33,
  "searchTerms": "poker"
 },
 {
  "appId": "com.sharkparty.poker",
  "title": "Poker™",
  "description": "The fastest poker game - play 50 HANDS A MINUTE!! Also included popular Texas Holdem tables. Play FREE forever! \n\nThe excitement of Vegas now on your phone to play whenever you want. \n\n- Quick Poker - No more waiting. Fold and start a new table immediately! \n- Fastest play - No registration required! \n- FREE daily chips \n- Fast tables \n- 5 or 9 person tables \n- Play with other Facebook users \n- Play on Wi Fi or 3G \n- Personal Avatars \n- Tournaments! \n\nTop notch performance on your iPhone, iPad, or iPod Touch!\n\nPlease note: Poker is an online only game. Your device must have an active internet connection to play.\n\n\nPlease note that Poker™ is free to play, but you can purchase in-app items with real money. To delete this feature, on your device go to Settings Menu -> General -> Restrictions option. You can then simply turn off In-App Purchases under \"Allowed Content\". In addition, Poker™ may link to social media services, such as Facebook, and Storm8 Studios will have access to your information through such services.\n\nFollow Storm8 Studios\nwww.storm8-studios.com\nfacebook.com/storm8\ntwitter.com/storm8",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-05-30T00:18:44Z",
  "updated": "2015-05-26T22:36:54Z",
  "releaseNotes": "- Performance Updates and Optimizations",
  "version": "1.0.8",
  "price": 0,
  "developer": "Storm8 Studios",
  "score": 3.97059,
  "reviews": 68,
  "currentVersionScore": 3.97059,
  "currentVersionReviews": 68,
  "searchTerms": "poker"
 }
]