[
 {
  "appId": "com.bpgamesltd.vegasslots",
  "title": "Vegas Slots UK",
  "description": "Welcome to Vegas Slots, the Premier destination for Real Money Slots and Table Games.\n\nWe have all your favourite games from the biggest Casino suppliers including Blueprint, Big Time Gaming, Evolution, Netent and Playtech. Play Slots, Blackjack, Roulette or Face-off against Real Dealers at our exclusive Live Casino.\n\nBig stakes or Small we cater for all! We have games to suit everyone's appetite. With dozens of themes including Egyptian, Megaways, Mythical and Classic, you'll be spoilt for choice!\n\nLike a Bonus? Then good news, there's plenty to choose from. Just check out the app for the latest offerings. But please remember T&Cs apply, so make sure you take the time to read through the terms within the app.\n\nTo install and use this casino app, you must be 18 or over and a resident of the UK.\n\nNote: Vegas Slots is not a free-to-play Casino app. You are required to make real money deposits. You should only gamble what you can afford to lose. If you feel your gambling is getting out of control, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org. Please Gamble Responsibly.",
  "genres": [
   "Games"
  ],
  "contentRating": "17+",
  "released": "2020-02-22T08:00:00Z",
  "updated": "2020-02-22T17:31:49Z",
  "version": "1.0.5",
  "price": 0,
  "developer": "SolveIT LLC",
  "score": 4.72414,
  "reviews": 29,
  "currentVersionScore": 4.72414,
  "currentVersionReviews": 29,
  "searchTerms": "slots"
 },
 {
  "appId": "com.vegas.casino.slots.game",
  "title": "Vegas Casino Slots - Big Win",
  "description": "The most popular slot machine game in 2020! Spin in real Vegas Casino and Win Big with more than 30 slot machines. Lots of bonus and jackpots, just enjoy Vegas Casino Slots!\n\nNow you can play real Vegas casino slots on your phone instead of going to Vegas. Whenever and wherever FREE! What you need to do is just a single tap to download and spin! Then you can enjoy the excitement and win the jackpot. This slot game must be the best casino slots you have ever played. Huge jackpots, wild patterns, mysterious themes, and amazing graphics… This pop slot game is on FIRE! \n\nWhen you first login to Vegas Casino Slots, you could get 2,000,000 welcome bonuses. It helps you to play in your favorite slot machines and win big. Slot machines such as QUAKE FLASH ZEUS, CORNUCOPIA GOLD, PANDORA’S BOX, ALL SAINTS’ GIFTS, HAPPY HAPPY, GOLD MINER, GOLD OF WEALTH, BUFFALO BATTLE, RHINO RUSH, TROVE OF PEARL, PANDA, PAPER CUTTING, PRINCESS OF JAGUAR, BEER CARNIVAL, NIGHT OF THE WOLF, DESERT TREASURE, WILD GREEN, SEASCAPE DIVING, CHILI CHILI, FLAME TO HEAVEN, MYSTERY OF MAYA are waiting for you! Play this slot game and enjoy a real Las Vegas style casino slot! \n\nGame Features\n2,000,000 Free coins as welcome bonus for you.\nGrand jackpot in every slot machine waiting for you to win!\nFree coins in every 1 hour and each time level up in Vegas Casino Slots!\nHigh payout with lots of feature games such as FREE SPIN, HOLD & RESPIN, RESPIN, BONUS GAMES.\nAll slot machines unlocked. Just choose your favorite slots.\nConnect to Facebook to collect 500,000 free coins.\nSpin the wheel of fortune every day to get bonus.\nSpecial challenge for you every week. Enjoy it and get a big prize!\n\nThis product is intended for use by those 21 or older for amusement purposes only. Practice or success at social casino gaming does not imply future success at real money gambling. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n\nCONTACT US\nFacebook:\nhttps://www.facebook.com/vegascasinofreeslots\nContact Support: contact@triwingames.com\nFind out more at: http://www.triwingames.com/",
  "genres": [
   "Games",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2018-09-28T00:44:44Z",
  "updated": "2020-04-24T08:44:31Z",
  "releaseNotes": "New slot machine coming soon!\n-Minor bug fixed",
  "version": "1.0.42",
  "price": 0,
  "developer": "Triwin Inc.",
  "score": 4.79751,
  "reviews": 242,
  "currentVersionScore": 4.79751,
  "currentVersionReviews": 242,
  "searchTerms": "slots"
 },
 {
  "appId": "com.tw.tycoon.casino",
  "title": "Tycoon Casino - Vegas Slots",
  "description": "Tycoon Casino Slots is a new slot game to attract everyone’s attention. Different styles of games, huge prizes, big jackpots, and so on, everything you want in the slots game can be found here. Come and seek your luck here- Play Tycoon Casino Slots and Win huge prizes! \n\nStart your spins and enjoy the game, Tycoon Casino Slots can make you forget all the bad things and boring days, because we want to provide slots lovers and beginners with best slot machines and massive grand wins.\n\n►Get 100,000,000 free coins instantly as Welcome Bonus.\n►Every 12 minutes you will receive a store gift,and every 8 hours you can spin bonus wheel for one time. Keep spinning! \n►Interesting graphic, smooth animations and vivid sound offer you the best casino atmosphere.\n►Different feature games, huge prize and bonus, winning symbols like Scatter & expanding WILD.\n►Enjoy our gorgeous Slots Games like being in Vegas heart.\n►Authentic slot machines designed by casino professionals.\n►Hold on to Autospin and listen to the sweet casino melody. Plenty wins will tell you how time flies. \n\n►Enough free coins to bet large in a spin and win more back.\n►Lots of free spins, respin, hold&spin, bonus games.\n►Finish daily goals and get big reward!\n►Participate in different kinds of activities to win extra prizes in special slot machines.\n\n►Get five scatters in Dragon Spin and win free games.\n►Spin and get specific wolves in special reels to multiply your prizes. \n►Come to see the Star Panda and win big prizes.\n►Spin to get plenty respin chances in 88 Riches. \n►Make a big fortune in the volcano Riches, wins never ends.\n\nThe Tycoon Casino Slots can give you an incredible gambling feeling with its attractive appearance and the sound. Don't miss this opportunity to experience different styles of slots games! Come and download the game right now. Huge prizes and bonus are waiting for you!\n\nThis product is intended for use by those 21 or older for amusement purposes only. \nPractice or success at social casino gaming does not imply future success at real money gambling. \n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-10-21T10:44:15Z",
  "updated": "2020-04-30T01:53:04Z",
  "releaseNotes": "Hey Tycoon Lovers! Here's our new updates with:\n• New Slot: Legend Ages\n• New Event: Card Album \n• Great promotion and deals\nWe are always working hard to make Tycoon Casino the best casino slots game out there. Come and seek your luck here!",
  "version": "1.5.2",
  "price": 0,
  "developer": "Triwin Inc.",
  "score": 4.83474,
  "reviews": 3292,
  "currentVersionScore": 4.83474,
  "currentVersionReviews": 3292,
  "searchTerms": "slots"
 },
 {
  "appId": "com.lottomart.lottery.bet",
  "title": "Lottomart: Games & Lottery App",
  "description": "Lottomart is the UK’s favourite games and lottery destination. It’s no wonder we are creating such a buzz - Lottomart creates winners! Here are a few of our recent winners:\n\n \n‣ Daniel B. of Stoke-on-Trent won £137k with a Boosted lotto bet on Irish Lotto\n‣ Desiree D. of London won £31k with a Boosted lotto bet on Great British Jackpot\n‣ Danny O. of New Town won £16k with a Boosted lotto bet on Mini Lotto\n‣ Rachael T. of Bradford won £30k on a Cleoscratcha scratchcard\n‣ John D of Glasgow won £100k on Europe Millions Scratch \n\n \nLottomart is the home of Boost - the most exciting new way to bet the lottery where you “slide to decide” between bigger jackpots or more chances of winning. Our biggest lottery winners won because they Boosted their bets! Will you be next?\n \n6 Reasons you should join the thousands who play at Lottomart:\n \n‣ MASSIVE SELECTION OF CASINO GAMES - With over 100 video slots and the most popular table games you won’t be disappointed.\n‣ LOTTO JACKPOTS - Bet on the biggest jackpots worldwide for chances to win hundreds of millions in lotto jackpots every week!\n‣ EXCLUSIVE SCRATCH GAMES - Win up to £150,000 on our unique selection of BIG prize scratch cards.\n‣ SIMPLE, FUN, and EASY - The quickest and easiest app to use on the market. If you like lotto, scratch cards or casino games you’ll love Lottomart.\n‣ BOOST for more chances to win - This unique feature allows you to choose between bigger jackpots or more winning chances on any lotto draw.\n‣ INSTANT REWARDS - Earn diamonds with every purchase and use them to pay for lotto bets or play scratchcards.\n \nTry our casino games tab which includes:\n \n‣ LIVE Deal or No Deal\n‣ LIVE Monopoly\n‣ LIVE Blackjack & Roulette\n \n‣ European Blackjack\n‣ Roulette\n‣ American Roulette\n‣ Queen of the Crystal Rays\n‣ Lara Croft - Temples and Tombs\n‣ Thunderstruck II\n‣ Mega Moolah\n‣ Lucky Leprechaun\n‣ Immortal Romance\n‣ Medusa\n‣ Wild Cats\n‣ Royal Gems\n‣ Gold'orado\n‣ Jackpot Quest\n‣ Hot & Heavy\n‣ Wild Thirst\n‣ Agent Jane Blonde Returns\n‣ Gallantry\n‣ Flower Fortunes\n \nCheck out all our US, UK and Euro lotto jackpots:\n \n‣ Irish Lotto\n‣ Mega Millions\n‣ US Powerball\n‣ Europe Millions*\n‣ EuroJackpot\n‣ Cash4Life\n‣ Superenalotto & More...\n\nTry our instant win lottery scratch cards and win up to £150k. Scratchcard tickets price range from 10p to £3 per ticket.\n \n*Only The National Lottery app can sell tickets on the Euromillions. If you like the Euro Millions you will love this similar draw.\n \nDefault Welcome Offers (See promotions section in app for full promo eligibility)\n \n‣ Welcome offers are available only on your first purchase:\n---Casino match bonus up to £100 - 100% Deposit bonus\n---Lotto buy 1 get 1 free Offer + 10 additional games spins on purchase of either a lotto bet\n---10 free 5k scratchcards Offer + 10 additional games spins on purchase of any scratchcards.\n‣ Minimum purchase required to qualify for welcome offers. \n‣ Stake limits and game contribution limits apply \n‣ Consult terms within the app for full promotion terms and general terms.\n \nPromotional Terms and Conditions apply and we reserve the right to modify, extend, or suspend a promotion at any time. Please see the Promotions area within the app for current offers and details.\n \nYou must be 18 years of age or older to play at Lottomart.\n \nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact BeGambleAware.org at 0808 8020 133 or visit www.begambleaware.org.\n \nWe are licensed by the UK Gambling Commission (UKGC), license 000-051833-R-329042-001, issued 20 July 2018. Our jackpot prize payouts are covered by leading insurers to guarantee the payment of your jackpot winnings.",
  "genres": [
   "Entertainment",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2018-11-28T08:21:28Z",
  "updated": "2020-04-28T14:04:35Z",
  "releaseNotes": "- 14 New Red Tiger Daily Jackpot Games!\n- Bug Fixes",
  "version": "2.52",
  "price": 0,
  "developer": "Lottomart",
  "score": 4.38204,
  "reviews": 780,
  "currentVersionScore": 4.38204,
  "currentVersionReviews": 780,
  "searchTerms": "slots"
 },
 {
  "appId": "com.vegascasino.app",
  "title": "Vegas Casino",
  "description": "Welcome to Vegas… Where Premium Real Money Gaming is just a fingertip away!\n\nInstall now and gain access to Hundreds of the most Exciting Casino Games including Live Casino, Video Slots, Blackjack and Roulette.\n\nPacked full of Fantastic Features, customers are spoilt for choice. Including:\n\n• NetEnt, Microgaming and Red Tiger Slots\n• Evolution Live Casino\n• Massive Progressive Jackpots\n• Huge “Must Fall” Jackpots\n• Super-Fast App\n• VIP Program\n• Excellent Customer Support Team\n\nOn top of this, customers are treated to Amazing Welcome Bonuses, Multiple Weekly Promotions and for those VIPs out there, plenty of Perks! Check out the App for all the latest Promotions on offer!\n\nTerms and conditions apply when taking bonuses, please take the time to read the bonus terms and conditions when accepting an offer.\n\nDon’t delay, visit VEGAS today!\n\nThis casino app requires a real money deposit to access the games. Customers must be 18+ to use this app. Underage gambling is a criminal offence. Please gamble responsibly and within your means. If you know or feel you have a gambling problem you can contact Gamble Aware at www.begambleaware.org or by phone: 0808 802 0133.",
  "genres": [
   "Games"
  ],
  "contentRating": "17+",
  "released": "2020-04-30T07:00:00Z",
  "updated": "2020-04-30T12:32:19Z",
  "version": "1.0.8",
  "price": 0,
  "developer": "Agile, LLC",
  "score": 4.80769,
  "reviews": 26,
  "currentVersionScore": 4.80769,
  "currentVersionReviews": 26,
  "searchTerms": "slots"
 },
 {
  "appId": "com.vegascash.slots",
  "title": "Billion Cash Slots-Casino Game",
  "description": "Welcome to enjoy the BEST REAL VEGAS Casino slot machine game RIGHT NOW!!\nBillion Cash Casino Slots invites you to experience the MOST POPULAR CASINO SLOTS GAMES all over the world. Download this best social casino slots game and enjoy the thrilling of winnings just in the palm of your hand! Spin the wheel to win BILLION CASH!\nSpecial Feature:\n-Grab your 100,000,000 WELCOME BONUS form the FIRST INSTALL REWARD!\nThat’s far from enough-SPECIAL BONUS OFFERS for your EVERY LEVEL UP! Play our casino slots machines with endless rewards!!!!\n-Want more bonus coins? Daily prizes & wheel bonus EVERY 4 Hours created JUST FOR YOU to boost your account!\n-Spin 20+ HOT CASINO SLOTS MACHINES around the world, Win the Epic Jackpot Anytime & Anywhere!\n-KEEP PLAYING & KEEP WINNING! Mega win, super win, grand jackpot are EASILY to be HITTED! It doesn’t matter how many casino slots machines you have played, it’s just a matter how many jackpots you’ve won! \n-Playing only casino slots is boring? Don’t worry! Different events and challenged quest offers HUGE EXTRA CREDITS EVERYDAY!!!\n- Fantastic feature bring huge fortune. The luck is always on your side!\n-HIT THE GRAND JACKPOTS EVERYTIME YOU SPINNING!!\nDive into something exciting at CASH STORM! \nPlay our social casino slots game NOW and experience the excitement!\nWe bet you will love it!\n\nTips：\nThis product is intended for use by those 21 or older for amusement purposes only. \nPractice or success at social casino gaming does not imply future success at real money gambling. \nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n\nTerms & Services: http://www.triwingames.com/terms_of_service.html\nPrivacy Policy: http://www.triwingames.com/privacy_policy.html",
  "genres": [
   "Games",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2020-01-14T08:00:00Z",
  "updated": "2020-04-23T09:43:26Z",
  "releaseNotes": "Here's a new update with Billion Cash! The update includes:\n- Improved game performance & fixes bugs\nDownload & Update now to immerse yourself in our exciting slots!",
  "version": "1.2.3",
  "price": 0,
  "developer": "Triwin Inc.",
  "score": 4.81149,
  "reviews": 313,
  "currentVersionScore": 4.81149,
  "currentVersionReviews": 313,
  "searchTerms": "slots"
 },
 {
  "appId": "com.jx.slots",
  "title": "Cash Fever Slots™-Vegas Casino",
  "description": "CASH FEVER SLOTS is the #1 exciting Vegas slots game online in 2020! Huge Bonus! Free Spins! Jackpot! Everything you ever wanted of an online casino game. Get spinning with our casino slots machines and win BIG!\n\nCASH FEVER SLOTS is the most authentic Vegas slots and the most generous casino slots game online. We have created ton’s of special themes updating weekly with huge prizes and jackpots. Install now to experience the epic thrill of the newest and most popular casino slots machines in Vegas casino, all for Free! You will be starting with 10,000,000 free coins as the welcome bonus! Claim the bonus, feel the excitement of EPIC WINS in your favorite slot machines. Come and get your free casino coins today and enjoy real casino experience in the palm of your hands. \n\nWant to cut the fluff and focus on winning like in a casino? Start your spins now and play most slot games, variations and themes all for free. Get a Vegas experience with our top slots. CASH FEVER SLOTS provide you chances of big wins on our awesome slots machines. Our free casino app is just like the real machines you play in Las Vegas’ Casinos. You are promised with a true and the best free Las Vegas casino slots experience. CASH FEVER SLOTS offers awesome selection of slots casino machines and non-stop fun. Spin the best casino slots machines online and everywhere you go, Play authentic slot machine games, which to many are the best slots of all casinos! You will receive huge payouts for free spins and huge jackpots everyday. \n\nCASH FEVER SLOTS is the best slot games of the new decade. We provide casino slots game lovers and beginners with the best casino slot machines and massive grand wins. Prepare to enter the world of the best mega wins casinos in Vegas. If you are looking for a friendly and generous casino slots game, your choice of CASH FEVER SLOTS is the BEST. Play our exciting new casino games and watch the spinning reels reveal your BIG WIN as you hit the 777 casino JACKPOT! will have you coming back for more of our exclusive slot machines! Install CASH FEVER SLOTS game today, choose your free casino slots games and let the thrilling casino winning begin!\n\nSpecial Game Features:\n*Up to 100,000,000 Free coins as welcome bonus to play the best Vegas slots machine. \n*Various bonus games feature vivid animation and exciting sound effects.\n*Generous daily welcome bonus. Free gifted coins and spins every day for you to keep your exciting spinnings and winnings!\n*Goals and daily events for bonus coins and more free spins to find fun slots game!\n*50+ popular slot machines-- even more hot vegas slot machines added with every update!\n*Spin the Wheel of Fortune to multiply your super mega win.\n*Special jackpot prize to win on every slot machine.\n*Participate in slots tournaments for huge prizes\n\nSpin to win epic Jackpots in CASH FEVER SLOTS! Download CASH FEVER SLOTS now and experience the real thrill of Las Vegas Casino! With more slots machine added with every update! Plus, FREE COINS for new players and more FREE casino bonuses daily, what are you waiting for? Lots of free bonus games with Special slot machines bonus to play the best slot games with casino slots free.\n\nCASH FEVER SLOTS game is for entertainment only. All points in our social casino game stay in the game and have no cash value. Although in-game currency can be purchased for real money or won during gameplay, none of the items in the game have any cash value. Our casino slots games are intended for adult audiences only. It is a free casino game that does not offer real money gambling or an opportunity to win real money or real prizes. Wins made while gambling in social casino games can't be exchanged into real money or real rewards. Past success at social casino gambling has no relationship to future success in real money gambling.\n\nMore info: https://www.facebook.com/cashfeverslots/",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-09-23T20:20:00Z",
  "updated": "2020-05-06T06:37:23Z",
  "releaseNotes": "Hi Cash Fever Fans! An exciting update is ready for you!\n\nWith this update we bring you:\n-A New Slot Machine Has Been Added: Triple Wheel Fever\n-Minor Bug fixed\n\nWish you all have a great time spinning in CASH FEVER SLOTS!",
  "version": "1.5.1",
  "price": 0,
  "developer": "MIRROR GAMES LIMITED",
  "score": 4.51538,
  "reviews": 130,
  "currentVersionScore": 4.51538,
  "currentVersionReviews": 130,
  "searchTerms": "slots"
 },
 {
  "appId": "com.yaohua.vegasnights",
  "title": "Vegas Nights Slots",
  "description": "Real slots at Vegas Nights - The Best Free online social Casino Slots Game ! \nPLAY NOW to receive a FREE Welcome Bonus Package!\n\nWorld class gambling game design brings real slot games from the casinos to mobile App! New Features and Surprising Bonuses on All New Slots!\n\nVegas Nights Slots is the best slots game there is, offers the most stunning graphics and a realistic casino experience. Enjoy every benefit you can possibly have on a real slot machine! Progressive Jackpot, Stacked Symbols and Locked WILDs! PLAY NOW and get the best slot experience today!\n\nWhat is special at Vegas Nights Slots?\n• Tournament Day, Quest Day, and Challenge Day bring you Extra bonus every day of the week!\n• All levels All slots 100% FREE to play! New Updates online every week!\n• Multiply your winnings to maximize the benefits with Double Ups and Bonus Games!\n• 2,000,000 FREE Coins for starter bonus, plus Hourly bonus, Daily Bonus, Store Bonus, Holiday Bonus, Friends Bonus, Fan Page Bonus and many more FREE coins available everyday!\n• A variety of WILD, Free Spins, Bonus Games, Jackpots and more interesting ways to play!\nPlay Vegas Nights Slots, the BEST Online SLOTS Game ever!\n\nPlay free slots, slot machine games & online casino. Make a fortune with huge jackpots, free daily games on Vegas Night Slots! Ding Ding Ding! Jackpots!\n\nVegas Nights Slots is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling. Use of this application is governed by Mobee's Terms of Service.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-06-03T10:52:15Z",
  "updated": "2020-01-10T03:28:44Z",
  "releaseNotes": "Real Slots at Vegas Nights!\n\n-Fixed Bugs.\n-Overall upgraded.\n-Improved stability and compatibility.\n\nPLAY NOW!\nGold luck & Happy spinning!\n\nFollow us on Facebook at: \nhttps://www.facebook.com/vegasnights.slots\nIf you run into a bug or have a question, you can contact us at support@mobeegaming.com",
  "version": "2.0.8",
  "price": 0,
  "developer": "Mobee Co., Ltd.",
  "score": 4.88889,
  "reviews": 873,
  "currentVersionScore": 4.88889,
  "currentVersionReviews": 873,
  "searchTerms": "slots"
 },
 {
  "appId": "uk.pokerstarscasino.www",
  "title": "PokerStars Casino Games Online",
  "description": "Play exclusive Slots, popular Blackjack games and enjoy the best Roulette action (including double ball and live dealer tables) at the fastest-growing online casino.\n\nTOP 2 REASONS TO DOWNLOAD POKERSTARS CASINO\n\n1. WE HAVE IT ALL! Play a great variety of new and innovative games: From Multi-Player Blackjack and Roulette to Live Casino and our exclusive Slot game, Millionaires’ Island, you’ll find all your favourite games.\n\n2. REAL MONEY! Enjoy real money and free-to-play mobile casino games, available across a wide range of limits and formats. \n\nPokerStars Casino is brought to you by the world’s largest online gaming company – trusted by over 100m players worldwide.\n\nPOKERSTARS CASINO GAMES:\n\nA HUGE SELECTION OF SLOTS\n- Classic and themed Slot games\n- Special features that give you more chances to win cash prizes\n\nPLENTY OF DIFFERENT BLACKJACK FORMATS\n- Variety of Blackjack games – popular formats include Classic, Atlantic City, European and more!\n- Play online Blackjack in Single Player or Multiplayer mode.\n\nTHE THRILL OF ROULETTE\n- European roulette available, including standard and Double Ball tables.\n- Play Live Roulette games, including the award-winning Immersive Roulette.\n\nDownload PokerStars Casino today and make sure you accept push notifications, to ensure you don’t miss out on any of our great promotions.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-09-22T22:43:59Z",
  "updated": "2020-04-14T16:49:29Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "3.27.1",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.34567,
  "reviews": 1594,
  "currentVersionScore": 4.34567,
  "currentVersionReviews": 1594,
  "searchTerms": "slots"
 },
 {
  "appId": "com.idorweb.fma",
  "title": "Fruity Cashino Fruit Machines",
  "description": "Fruity Cashino lands on the iPhone and iPad in glorious free to play 3D. A collection of real pub and arcade fruit machines including Jackpot Genie, Luck O’ The Irish, Bar-X, 5 Star Roulette, and other familiar names such as Double up the Diamond, iFruitBomb Revolution and VIZ Showtime. With a raft of trophies to be won, you’re gonna love this compilation.\n\nJackpot Genie\nAn all new pub fruit machine, packed with features such as Ali Grabba, Aladdin Riches, Golden Wonders, Dream Maker, and plenty more.\n\nBar-X Classic Deluxe\nThe most popular fruit machine in the UK for many years, Bar-X has been in constant production since 1981. With over 100,000 machines sold to arcades, clubs and bingo halls, Bar-X now lands on your iPhone and iPad in glorious free to play 3D.\n\nLuck O’ The Irish\nThe hilarious tongue in cheek, Irish themed fruit machine. Packed with features such as Lotta Luck, On the Fiddle, Clover Cash, The Little Fella, In the Money, Make a Wish, and a whole lot more.\n\nAlice in Bonusland\nAn all new slots game, based around a well known theme, packed with fun features.\n\niFruitBomb Revolution\nThe iFruitBomb games have been available on the iPhone and iPad since 2009. The first in the series was originally launched as a 2D game, being transformed with the introduction of 3D gameplay very early in its evolution. iFruitBomb Revolution is a real machine arcade prototype based around these existing games.\n\nDouble up the Diamond\nBased on a real pub fruit machine, packed with features such as Reel Roulette, Diamond Scatter, Rise and Fall, Filthy Rich, Diamond Dash, and plenty more.\n\nKingdom of Wealth\nBased on the real machine of the same name, head into battle as the Queen, Monk and Barbarian attempt to take control of the kingdom.\n\n5 Star Roulette\nBased on the pub roulette game of the same name, 5 Star Roulette brings the high stakes world of the roulette table to your fingertips. Featuring bonus in-game scratch cards when you grab your winnings.\n\nVIZ Showtime\nRoger Mellie, the Man on the Telly presents his gameshow themed fruit machine, VIZ Showtime, on the iPhone and iPad in glorious free to play 3D. Based on the real pub fruit machine of the same name, it packs a punch with a stack of features including Morning Glory, Cash Convoy, Razzle Dazzle, Mellie’s Money, Roger’s Big Deal and plenty more.\n\nFree Gameplay Credit - Run out of credit? You’ll get free virtual scratch cards to play with every hour (Requires an online connection) to try your luck and grab free credit awards.\n\nHighscores - On the Bank Run you have 10 minutes to cash out with as much virtual cash as possible\n\nPlease note: All wins are simulated with the award of virtual credits for use within this game compilation. An internet connection is required in order to download the games within this compilation.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2016-01-27T01:55:54Z",
  "updated": "2018-03-31T16:16:12Z",
  "releaseNotes": "Head into battle with our exciting new game, Kingdom of Wealth.\nAlso contains updates and full screen support for the latest devices.",
  "version": "1.20",
  "price": 0,
  "developer": "Idor Interactive Ltd.",
  "score": 4.09837,
  "reviews": 1047,
  "currentVersionScore": 4.09837,
  "currentVersionReviews": 1047,
  "searchTerms": "slots"
 },
 {
  "appId": "com.scientificgames.monopolyslots",
  "title": "MONOPOLY Slots: Fruit Machines",
  "description": "NOW’S YOUR CHANCE TO BECOME A MONOPOLY MILLIONAIRE!\nJOIN THE FREE MONOPOLY SLOTS FUN!\n\nWe took the classic MONOPOLY board game and combined it with top Las Vegas slots to form the best slots game – MONOPOLY Slots!! This MONOPOLY game features free slots for iPad and iPhone in a city-building adventure. MONOPOLY Slots will win the heart of every gamer! This is one slot machine game that redefines entertainment and brings Vegas into your home. You’ll find all the beloved MONOPOLY tokens from the Hasbro game, so get ready to roll the dice, win free coins, and help MR. MONOPOLY restore the aging metropolis of MONOPOLY City to its former grandeur!\n \nMONOPOLY Slots allows players to design and build MONOPOLY City, including fancy houses and the MONOPOLY Super Grand Hotel, all by completing exciting Quests to earn tons of MONOPOLY Bucks. The MONOPOLY Party Train is here, so get on board because the fans of Monopoly go all the way! Build your handmade city in your best free social casino game.\n \nTake the most beloved board game, add the best slot games for iPad and iPhone, and start spinning your favorite slot machines for free!\n \nLet the city building games begin! \n•\tEarn MONOPOLY Bucks by completing exciting missions and quests every single day. Advance in the game by buying properties and becoming a tycoon city builder! You’re the designer.\n•\tDiscover your fortune with Chance cards, just like you did in the classic board game!  \n•\tPlay CLUE Confidential with a mystery-solving bonus game that packs even more fun and hidden secrets! \n•\tBoost your luck with YAHTZEE dice-rolling! \n•\tWin special bonuses (the spin wheel is here!) to become a MONOPOLY hotel tycoon with a dream mansion! Spin free slots, solve puzzles, hit the Jackpot, then hit the town boardwalk and buy it all to feel like a billionaire! \n \nThe slot mania is in the house! The game’s different winning slots are themed based on famous board games like CLUE and YAHTZEE. They include new free games such as: CLUE: Orchid's Mystery, Colossal BATTLESHIP, and others. MONOPOLY Slots is a free social casino game combined with a relaxing puzzle game. The game offers the classic Vegas slot games experience combined with games like Kronos, Ultimate Fire Link, and Lock-It-Link slot machines.\n\nThese relaxing games brought to you by SciPlay bring the thrill of the casino floor to your mobile phone and make sure that your favorite casino slots will fit in your pocket. Within this online building game, you’ll find top video slots like Pirate's Quest, Frozen Inferno, Dragon of the North (yes, there’s a dragon slot!), Diamonds & Dames, and many others! If you love to spin & win, get into the MONOPOLY Money Zone and play for free!\n\nINSTALL NOW to join the community, and like us on Facebook at: https://www.facebook.com/MONOPOLYSlots/\n\nThe MONOPOLY name and logo, the distinctive design of the game board, the four corner squares, the MR. MONOPOLY name and character, as well as each of the distinctive elements of the board and playing pieces are trademarks of Hasbro for its property trading game and game equipment. © 1935, 2018 Hasbro. All Rights Reserved.\nBATTLESHIP, CLUE, OUIJA and YAHTZEE are trademarks of Hasbro and are used with permission © 2018 Hasbro. All Rights Reserved.\n\nMONOPOLY Slots is a Play-For-Fun casino that is intended for amusement only.\nThe games are intended for an adult audience (i.e. intended for use by those 21 or older). The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "genres": [
   "Games",
   "Social Networking",
   "Casino",
   "Board"
  ],
  "contentRating": "17+",
  "released": "2017-11-28T22:54:25Z",
  "updated": "2020-04-28T16:00:39Z",
  "releaseNotes": "Great news for MONOPOLY Slots fans! NEW content awaits! This AWESOME update includes:\n\n- Brand new HOUSES & HOTELS feature! Your tasks will be worth EVEN MORE BUCKS!\n- Exciting new SLOTS like LOCK IT LINK: GOLD GEARS & CRYSTAL SPIDER!\n- Improved LEVEL UP experience - spend more time spinning and less time waiting!\n- Bug fixes, improved game performance, & more!\n\nGet ready to SPIN & WIN with streamlined gameplay features & even more MONOPOLY Bucks than before!",
  "version": "2.1.1",
  "price": 0,
  "developer": "Phantom EFX, Inc.",
  "score": 4.86817,
  "reviews": 5067,
  "currentVersionScore": 4.86817,
  "currentVersionReviews": 5067,
  "searchTerms": "slots"
 },
 {
  "appId": "com.madovergames.BuffaloSlots",
  "title": "Buffalo Slots Vegas",
  "description": "The Hottest Casino Game \n\nBuffalo Slot Machine - the hottest free Vegas Casino Slots game ! Your $99,000,000 welcome bonus is waiting – Claim your bonus, spin your favorite casino slots , and get ready to experience the excitement of Las Vegas from the comfort of your own home or take it anywhere on your device! Play authentic casino slots as you have never seen them before!\n\nTake a journey down into Vegas with some of the best casino games free slot machines bonus! The sounds and lights from our free casino game will remind you of the thrills and slot machine mania from being in Vegas\n\n►  Explore the classic and the most loved Buffalo slots !\n►  Travel through the lush green Mayan jungles for an Adventure hunt !\n►  Meet your secret Santa in your Christmas Slots !\n►  Relive the royal history like an Ancient King !\n►  Try your luck in the vast expanse of the Underwater world !\n►  You could bet and win in the famous Vegas experience !\n\nTake your earnings and set out on a quest to become the richest slot machine player the world has known by connecting your game progress with Facebook. Compare and play with your friends and see who comes out on top !\n\nSlots - Buffalo slots Vegas features:\n\n►  Experience the most happening slot machines of Vegas right here on your device :  Buffalo slots, White Tiger, Adventure Hunt, Underwater, Majestic Kings, Las Vegas Casino and more slot machines added every two weeks !!!\n►  Top new free slot casino games!.\n►  Place your bets, spin and win awesome rewards.\n►  Daily login rewards and bonuses.\n►  Daily goals which you can complete and claim rewards for\n►  Play your favorite Deal or No Deal Game.\n►  Double up your slots wins every time by playing extra roulette \n      and card games.\n►  Spin the lucky wheel and win awesome rewards.\n►  Play with your friends and see who is up the leader-board.\n►  Play more to stand a chance to win the JACKPOT !!\n\nNever a dull moment when there are awesome Mini-Games to keep you always engaged :\nHammer smash : Smash the moles and win coins.\n *Memory game : Tap and match cards to win coins.\n *Locker challenge : Open the locker to win coins.\n *Box tap : Open boxes to win your luck reward.\n *Find the queen : Find you lucky queen trapped between two kings\n\n\n\nThis free slot game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money slot gambling.\n\n\n-------------------------------------------------------\n\nBuffalo Slots:\nhttp://Buffaloslots.madovergames.com\nMadOverGames - http://madovergames.com\nFacebook - https://www.facebook.com/madovergames\nTwitter - https://twitter.com/madovergames\nYoutube - https://www.youtube.com/user/MadovergamesWoW\nGoogle+ - https://google.com/+MadovergamesWoW",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2019-10-04T07:00:00Z",
  "updated": "2020-04-25T18:41:45Z",
  "releaseNotes": "Play it like in Vegas - Buffalo Slots with $99,000,000 welcome bonus !!",
  "version": "1.5",
  "price": 0,
  "developer": "MadOverGames",
  "score": 4.66879,
  "reviews": 157,
  "currentVersionScore": 4.66879,
  "currentVersionReviews": 157,
  "searchTerms": "slots"
 },
 {
  "appId": "slots.secretsauce.casino.games.free.ios",
  "title": "Cash Frenzy™ - Slots Casino",
  "description": "Enjoy ultimate Cash Frenzy Casino slots experience! True Casino thrills are at your fingertips—and fun to play! Download the world’s biggest & best online casino games. Feel the excitement of big wins in your favorite hit slot machines, mega jackpots, high limits machines and more!\n\n- Get 1,000,000 WELCOME BONUS as on first install!\nIf you love win big, Wild Jackpots, multipliers, mystery slot machine gift and thrilling casino games. At Cash Frenzy Casino slot machines and enjoy over $1,000,000 Welcome Bonus! For all the sloto maniacs out there who absolutely love the Las Vegas thrills, we have lots of events, mystery slots casino games and Wheel of Cash that you can collect and claim prizes for!\n\n- Play Vegas- Favorite slot machines at your fingertips!\nCash Frenzy Casino features the most popular collection of Vegas best hit slot machines, straight from the slots casino you love, such as Elephant Fortune and Aisan themed casino slot games like Lucky Drums, Long Teng & Hu Yue! Download now and start enjoying the breathtaking Las Vegas slot machines exclusively from Cash Frenzy Casino. \n\n- Cash Frenzy Top Features\n- Hot slot games featured with exclusive Progressive Jackpots & exciting bonus games.\n- Claim welcome bonus from Instant Reward; Turbo Reward and Wheel of Cash every day.\n- Best slot machines – Elephant Fortune, Lucky Drums and more.\n- Real casino slot machines designed by REAL Casino experts.\n- Special slot machines bonus reward when you level up.\n- Massive casino slots jackpot in all slot machines.\n- All slots unlocked for ALL and new slot machine games added frequently.\n- Grab your chance to multiply  bonus every time you spin here.\n- Exclusive and exciting slot machine games, only available in Las Vegas, and here.\n- Chance to win 10,000,000,000+ of world casino slots Jackpots in all slot games.\n- Fun and exciting bonuses all of most popular slot games.\n- Play Best casino slot games & win your games bonus anytime.\n- Stock Up coins into Piggy Bank with every spin.\n\n- Larger-than-life jackpot wins & Multiplier\nLove real casino slot games? Well, look no further! The BEST Vegas slot machine are here! Play exciting Vegas-style casino slots and watch the spinning reels reveal your BIG WIN as you hit the 777 casino JACKPOT! Cash Frenzy Casino exclusive slot machines are the most thrilling Las Vegas casino video slots that will have you coming back for more! Install Cash Frenzy slot machines today, choose your casino slots and let the winning begin!\n\n- Claim Generous Bonus every 15 minutes\nAt Cash Frenzy Casino, there is always an opportunity to win more Bonus CHIPS. Shoot for the mega PROGRESSIVE JACKPOTS on slots and collect bonus every 15 mins for more freebies. Keep playing, keep winning and keep the fun going!\n\nCash Frenzy Casino is intended for an adult audience for entertainment purposes only. Success at social casino slot gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-08-16T09:33:26Z",
  "updated": "2020-05-01T00:42:40Z",
  "releaseNotes": "~~New UI \n~~New Slot Games \nEnjoy a better experience!",
  "version": "1.60",
  "price": 0,
  "developer": "GRANDE GAMES LIMITED",
  "score": 4.66707,
  "reviews": 12318,
  "currentVersionScore": 4.66707,
  "currentVersionReviews": 12318,
  "searchTerms": "slots"
 },
 {
  "appId": "com.banditmovie.slotsofvegas",
  "title": "Slots of Vegas",
  "description": "Try the best slots games in our Vegas style online casino! BEST selection of casino slot machines, HUGE payouts for free spins and  MASSIVE Jackpots. Play Blackjack, Texas Hold'em Poker, Video Poker, Roulette, and more, live with your friends. Enjoy all the thrill of a Las Vegas casino! \n\nEnjoy the best casino slot games, just for you:\n ⁃ Get a 50,000,000 COINS Welcome Bonus!\n ⁃ HOURLY BONUSES and MILLIONS of FREE casino coins DAILY\n ⁃ TOP Las Vegas Slots you know and love!\n ⁃ Experience a thrill of Free Spins, Respins, Bursting Wilds, Progressive Jackpots & BIG WINS!\n ⁃ Exciting slot machines with FREE SPINS, and Bonus Games you won’t find anywhere else!\n ⁃ Fill your Piggy Bank with extra coins to break when you’re ready for more\n ⁃ Special events to keep things fresh and fun. Every month we prepare surprise for you!\n ⁃ MORE slot machines added with every update and hundreds of jackpots await you!\n\nFrom the heart of Vegas to you: experience the thrill of slot machines directly from the Strip's most renowned slots casinos: Caesars, Rio, Flamingo, Harrah's, Bally, Horseshoe, Planet Hollywood, The Mirage, MGM Grand, Bellagio, and more awaiting you in Slots of Vegas!\n\nSpin your favorite slot machines free in this casino slots free game.\n ⁃ Reel in the cash with LUXURY LADY.\n ⁃ Hit diamond for multiple jackpot levels in DIAMOND 777, one of the most popular Vegas casino classic slots!\n ⁃ Win a full-screen sun symbols in HOT CHILLI slots casino game. Lucky Respins & Grand Jackpot await you!\n ⁃ Find the secret ancient Chinese key to unlock the four progressive cash jackpots on DUO FU DUO SHOU. Good Luck!\n ⁃ Watch the endless wilds & big wins erupt in WILD LEPRECHAUNS.\n ⁃ More BIG WINS on free slot games from Las Vegas casinos in the palm of your hand!\n\nThis game is intended for an adult audience (18+) and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling or any gamble-related venture, online or offline.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-02-20T18:34:57Z",
  "updated": "2020-04-22T06:49:02Z",
  "releaseNotes": "Hi, Slots Fans! Check out our new update for amazing new slots and features.\n- Brand new slot machine: Lucky Nutcracker, Secret of Medusa\n- Special promotions and holiday sales!\n- Bug fixes, performance improvements and more",
  "version": "1.2.14",
  "price": 0,
  "developer": "Casino Games Limited",
  "score": 4.81362,
  "reviews": 279,
  "currentVersionScore": 4.81362,
  "currentVersionReviews": 279,
  "searchTerms": "slots"
 },
 {
  "appId": "com.funstage.gta.ma.reelking",
  "title": "Reel King™ Slot",
  "description": "Spinning reels has never been this much fun! Play Reel King™ and you’ll feel like royalty, especially when the colourful winning symbols light up the reels.\n\nNot only will the cool design of this hit slot put a smile on your face - it’s also easy to play and offers you great chances to win!\n\nKeep your eyes peeled for the Gold Coins symbol, for it has a particularly high win value. And there’s nothing quite like seeing a little extra sparkle on the reels, right?\n\nMoreover, Reel King™ comes complete with an extra special feature that could leave you lost for words. But we don’t want to spoil the surprise here...\n\nReel King™ at a glance: \n-\t5 reels\n-\tUp to 20 win lines\n-\tWILD symbols (Jokers)\n-\tSpecial Reel King feature\n-\tChance to land winnings of up to 500x your stake\n\nHow do I get spinning at Reel King™? \nIt couldn’t be simpler: Get the app, register at GameTwist, and away you go. What’s more, a wide variety of further awesome games is waiting for you at GameTwist!\n\nReel King™ Slot app is a free online game of chance for entertainment purposes only. It is not possible to win real money or real items/services/gifts or goods in kind by playing our slot machines. The virtual currency used in this game is called ‘Twists’ and can be purchased in the ‘Shop’ using real money. ‘Twists’ cannot be exchanged for cash or be paid out in any form. ‘Twists’ can only be used to play these games. The games are intended solely for an adult audience which is 18+ years.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-12-17T10:33:32Z",
  "updated": "2020-03-06T07:38:31Z",
  "releaseNotes": "NEW: Video Bonus!\n\nAttention slot fans: This is your chance to bag even more free Twists and fill the tank so that you have plenty of energy to play our newest slot machines! \n\nHow? Go to the app, watch a video and collect massive video bonuses! Super easy! \n\nAnd we’re pulling out all the stops for our VIPs! The higher your VIP status, the more videos and bonuses you can look forward too!",
  "version": "5.18.0",
  "price": 0,
  "developer": "Funstage Spielewebseiten Betriebsges.m.b.H.",
  "score": 4.43979,
  "reviews": 191,
  "currentVersionScore": 4.43979,
  "currentVersionReviews": 191,
  "searchTerms": "slots"
 },
 {
  "appId": "com.idorweb.Luck-O-the-Irish",
  "title": "Luck O' The Irish - The Real Pub Fruit Machine",
  "description": "Luck O’ The Irish, the hilarious tongue in cheek, Irish themed fruit machine lands on the iPhone and iPad in glorious free to play 3D. Based on Blueprint Gaming's real pub fruit machine of the same name, it packs a punch with a multitude of features. If you like your slots games/fruit machines, you’re gonna love this.\n\nFeatures include:\nThe skill based features are piled high with Lotta Luck, On the Fiddle, Clover Cash, The Little Fella, In the Money, Make a Wish, and a load more besides.\nSuperboard games include Pathway Picks, Super Streaks, and Rainbow Strikes amongst others, topped off with the Luck O’ The Irish big money feature.\nBonus Squares, Mystery Squares, Feature Shots, Cash Shots and more await.\nHead for the Big Prizes in Rainbow Fortunes, a decision based game where only the canny hit the jackpot.\nA Unique Game Design - Has you playing the feature board on every spin.\nOnline/Offline Trophies - A bucket full of in-game achievements are there for the taking.\nOnline/Offline Highscores - On the Bank Run you have 10 minutes to cash out with as much virtual cash as possible.\nFree Gameplay Credit - Run out of credit? You’ll get a tenner of free virtual cash to play with every day! (Requires an online connection)\n\nPlease note: All wins are simulated with the award of virtual credits for use within the game.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2013-12-30T00:03:54Z",
  "updated": "2014-10-06T16:47:25Z",
  "releaseNotes": "Fixes a number of issues on both iPhone and iPad running iOS8.",
  "version": "1.13",
  "price": 0,
  "developer": "Idor Interactive Ltd.",
  "score": 3.70982,
  "reviews": 672,
  "currentVersionScore": 3.70982,
  "currentVersionReviews": 672,
  "searchTerms": "slots"
 },
 {
  "appId": "com.huge.slots.casino.vegas.ios.avidly",
  "title": "Double Win Casino Slots Game",
  "description": "Double Win Slots for free! Install Double Win Slots now to embrace the real thrill of true Las Vegas casino experience. best selection of casino slot machines, and huge payouts for free spins and jackpots.\nDouble Win Slots brings you the best slot machine gaming experience you have ever had with tons of fun!\nSpin this casino slots with gorgeous graphics, smooth animations and fantastic bonuses, collect daily FREE COINS and hourly FREE GIFTS! \nYou are starting an awesome casino journey in this best online casino Double Win Slots.\n\nGet ready to have fun?\nINSTALL NOW and make a fortune with excitement and entertainment!\n*******************************************************\nInstall Double Win Slots and Enjoy:\n► Huge payouts, incredible big wins, mega wins and super mega wins;\n► FREE daily login bonus, FREE mega wheel bonus and FREE coins every 3 hours;\n► Amazing new beautiful free slots games added on a weekly basis ;\n► WIN BIG with amazing jackpots, scatter slots and more\n► Lots of high quality slots with diverse thems and variety of gameplays;\n► Wild multipiers, free spins, expanding wilds makes you a fortune;\n► Wonderful quests will set you on the path to riches!\n► Install now to start having real slots fun!\n*******************************************************\nGo and install Double Win Slots now! You will discover an incredible world of Slots and Casino games. Wherever you are, you can open the Double Win Slots app to experience the wonderful night in real Vegas!\n*******************************************************\nFollow Double Win Slots on Facebook for free offers and exclusive coin packages.\nFacebook：www.facebook.com/DoubleWinSlotsGames",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-10-19T20:44:00Z",
  "updated": "2020-03-18T09:03:24Z",
  "releaseNotes": "Dear players：\n\nFixed some bugs in the game.\n\nMore rewards and more surprises in Double Win!\n\nGOOD LUCK!",
  "version": "1.71",
  "price": 0,
  "developer": "FG Games",
  "score": 4.89462,
  "reviews": 6339,
  "currentVersionScore": 4.89462,
  "currentVersionReviews": 6339,
  "searchTerms": "slots"
 },
 {
  "appId": "com.platogo.pmp",
  "title": "Slotpark Casino & Slots Online",
  "description": "The best Novoline games! \nWelcome to the Slotpark game universe!\n\nThe Slotpark App is your ticket to the best casino entertainment for mobile devices. Thrilling promotions and frequent Bonus chances enhance your gaming experience - and many visitors of our Online Casino have already celebrated huge winnings! \n\nWhat’s more, in addition to WORLDWIDE SLOT HITS like Book of Ra Deluxe or Sizzling Hot Deluxe we offer a great many more Novoline bestsellers: \n-\tLord of the Ocean\n-\tLucky Lady’s Charm\n-\tDolphin’s Pearl Deluxe\n-\tFaust\n-\tBook of Ra 6\n-\tAmazing Stars\n-\tGolden Ark\n-\tGolden Sevens\n-\tMystic Secrets\n-\tAlways Hot Deluxe\n-\tMermaid’s Pearl\n-\tMega Joker\n... and our range of slot machines is always expanding!\n\nFeatures at a glance:\n- Welcome Bonus: simply redeem and play\n- VIP system: very loyal customers receive great benefits in the App!\n- Daily and Time Bonus\n- Level-up system - the higher the level, the higher the stakes and winnings\n- Extra Bonuses and top promotions on special occasions\n- Huge community & popular Facebook fan page\n- Complete missions as a team together with friends\n- Exciting special promotions with sensational winning chances (amongst others slot tournaments)\n\nYou are looking for sizzling Las Vegas vibes, groundbreaking slots and stunning winning chances all wrapped up in an App? Then look no further because all this and much more is available on Slotpark! \n\nEmbark on your adventure now in the #1 Casino for online slots and enjoy gaming fun 24 hours a day, 7 days a week wherever you are! \n\nPlease note that\n- Slotpark is a platform for online gambling, created for entertainment purposes only.\n- It is not possible to win cash or items/services/presents or other goods on our slot machines.\n- The virtual currency used in the games is called ‘Slotpark Dollar’. It can be purchased in the shop using real money.\n- Slotpark Dollar cannot be converted back into real money or withdrawn in any way. \n- Slotpark Dollar can only be used for playing games on Slotpark.\n- The games are intended exclusively for users aged 18 years or older.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-12-01T14:57:52Z",
  "updated": "2020-05-04T09:29:03Z",
  "releaseNotes": "Get event more timed bonus by watching video rewarded ads.",
  "version": "3.14.0",
  "price": 0,
  "developer": "Funstage Spielewebseiten Betriebsges.m.b.H.",
  "score": 4.44198,
  "reviews": 543,
  "currentVersionScore": 4.44198,
  "currentVersionReviews": 543,
  "searchTerms": "slots"
 },
 {
  "appId": "com.slotbotics.vegas.slots.casino",
  "title": "Vegas Slots Casino ™ Slot Game",
  "description": "Play Vegas Slots Casino with 6 Million Coin Starter Bonus! \nINSTALL NOW!\n\n\nGame Features:\n-Get started with 6,000,000 BONUS coins!\n-Coins rewarded every hour when you play!\n-Bet Max to be eligible for jackpot!\n-Enjoy the game whenever you want. No internet required after installation!\n\n\nThis game is intended for an adult audience (18+) and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2019-09-10T07:00:00Z",
  "updated": "2020-03-19T04:11:55Z",
  "releaseNotes": "In this update we fixed a critical issue related to player progress. We recommend all users update to this version of the game.\n\nPlease let us know on support@slotbotics.com If you have any issues or suggestions for improvements.",
  "version": "1.45.8",
  "price": 0,
  "developer": "Slot Botics Ltd",
  "score": 4.64016,
  "reviews": 2062,
  "currentVersionScore": 4.64016,
  "currentVersionReviews": 2062,
  "searchTerms": "slots"
 },
 {
  "appId": "com.reflex.arcade",
  "title": "Pub Fruit & Roulette by Reflex",
  "description": "Ever wanted to take your favourite fruit machine with you? Now you can! Play all the great fruit machines you see in pubs, clubs, arcades and bingo halls up and down the UK in one fantastic app!\n\n* 500 free credits collectable every 90 minutes, boost this to *1000* credits when purchasing credit!\n\n* Free credit for telling your Twitter and Facebook friends about the app!\n\n* All fruit machines now support portrait and landscape modes on both iPad and iPhone!\n\n* Pinch to zoom anywhere on the screen to get a closer view of the action!\n\n* Double-tap on important gameplay areas to quickly zoom in! \n\nLoads of fantastic games covering our entire fruit machine product range available right now, with more coming soon, along with some great new features that we're really excited about... stay tuned!\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nAlthough the games can be played without a network connection, you need to be connected to the internet to be able to receive free credit.\n\nEach game included in this app is for amusement only and does not replicate the odds of winning or the payouts of it or similar games from Reflex Gaming.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2013-11-01T07:42:31Z",
  "updated": "2019-02-21T10:19:36Z",
  "releaseNotes": "Fixed audio issue on Crazy Crowns",
  "version": "1.38.3",
  "price": 0,
  "developer": "Reflex Gaming",
  "score": 4.3724,
  "reviews": 2978,
  "currentVersionScore": 4.3724,
  "currentVersionReviews": 2978,
  "searchTerms": "slots"
 },
 {
  "appId": "com.luckios.buffaloslots",
  "title": "Slots: Royal Casino Slot Games",
  "description": "Play the greatest slot machines for FREE! 20,000,000 FREE coins to get you started! \n\nPlay Royal Slots, the FREE slots with impressive graphics and sounds will give you the best slot machine gaming experience you have ever had. Join party fever and let beauty show you the way to get Mega Bonus and Big Jackpot! And We have all the best gambling games and unique slots. Welcome to play! \n\nGame Features\n\n- Get started with 20,000,000 FREE coins!\n- Free coins every hour so you can play your favorite slots anytime. \n- Cumulative wheel spin rewards enable you to get more Free Coins and Gems.\n- Kinds of gameplay, including classic slot machines style and some new one.\n\nThe game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Any success in social casino gaming is not indicative of future success at real money gambling.\n\nQuestions?\nE-mail us at: support@luckios.com",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-06-07T18:40:28Z",
  "updated": "2019-04-20T01:36:18Z",
  "releaseNotes": "Happy Easter Day, dear Royal Slots fans! \n\n- Optimize several slots gaming experiences for you! \n- Squash bugs and improve royal casino slot game performance.\n\nUpdate now and enjoy fantastic slots! Happy spinning!",
  "version": "1.4.4",
  "price": 0,
  "developer": "Luckios Game Co., Ltd.",
  "score": 4.70607,
  "reviews": 2157,
  "currentVersionScore": 4.70607,
  "currentVersionReviews": 2157,
  "searchTerms": "slots"
 },
 {
  "appId": "com.aaagame.goldencasino",
  "title": "Golden Casino - Vegas Slots",
  "description": "Play Golden Casino for a FREE chance at Big Payouts, tons of Free Spins, and Gigantic jackpots just like in a real Vegas casino! \n\nJoin now and to get 200,000s of free coins right away! Get more on top of that with Daily Bonuses, Tournaments, Friend Bonuses and more!\n\nPlay the best slots straight from Vega Casinos all for FREE! The graphics are so good you’ll think you’re in a real casino! Pick from our huge selection of slot games, with new ones added all the time!\n\nInstall Golden Casino now to get:\n- Dozens of FREE slot machines & multiple FREE coin bonuses every day!\n- Big Welcome Bonus and Free Hammers to break open your always growing Piggy Bank!\n- Access to the classic Vegas casino games you know and love, with Dragons, Cherries, Piggy and many more\n- Play with friends for extra bonuses and compete in huge tournaments with amazing prizes!\n- Join the VIP Club for even bigger bonuses every day!\n- Play on the go, with or without internet!\n\n\nINSTALL NOW AND WIN BIG NOW!\n\n\"Golden Casino\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-03-29T20:28:07Z",
  "updated": "2020-05-11T21:58:31Z",
  "releaseNotes": "New and improved Blackbeard's Treasure! \nLots of fun new games!\nBug fixes\nImproved user experience",
  "version": "1.0.84",
  "price": 0,
  "developer": "Slots Limited",
  "score": 4.94484,
  "reviews": 2556,
  "currentVersionScore": 4.94484,
  "currentVersionReviews": 2556,
  "searchTerms": "slots"
 },
 {
  "appId": "com.murka.slotsera",
  "title": "Slot Machines 777 - Slots Era",
  "description": "Slots Era is a brand new horizon in the world of Vegas Slot Machines. Try one of the best casino games for FREE.\n\nOur game features many familiar faces as well as new guests from the world of Free 777 Slot Machine Games. The Lord of Olympus, Cleopatra, Cowboys, Dragons, Buffalos, Lions and many more are featured among our Casino Games and Jackpot Slots. Install now for a huge welcome Bonus of 12,000,000 Free Coins.\n\nPlay Slots Era and enjoy:\n\n• Over 60 777 HD slot machines. New slots games are added every month!\n• No network? You can play Slots Era Offline!\n• Jackpots, Free Spins and Bonus Games every step of the way. Experience the thrill of a BIG Win!\n• An endless slots journey with Epic Quests. Pick a mission and receive rewards for finishing it!\n• Our Status System rewards long-time players with bigger bonuses.\n• Free Mode feature - play any slot game you want without missions!\n• Highest stakes for the best of players in the Jackpot Room. Highest Bets and Huge Wins! \n• Regular updates bring new slots with new mechanics and more levels for you to beat.\n• Special events to keep things fresh and fun. Bingo, Pachinko machines, Card collections and plenty more!\n• Connect to your Social Media accounts to get Special Bonuses and share your BIG Wins with friends.\n• Free Coins in our Hourly Bonus Game! The faster you spin - the more coins you get!\n\nYou will meet many famous characters straight from the worlds of History, Culture, and Nature. We’ll give you a glimpse of only a few of our amazing slots here:\n\n- Fairy Spirit. This slot machine has a Bonus Game with 4 JACKPOTS! And, if that wasn't enough, Free Spins is also a feature here ;-)\n\n- Buffalo Rush. The ground shakes as this force of nature approaches. It is one of the most fun buffalo slots out there! Best of luck!\n\n- Lord of Olympus. Those endless Free Spins will make you feel like a Greek God. So make sure you try one of the best free online slot machines.\n\n- Sakura's Blossom. Free Spins, Re-Spins, and 3 Jackpots. All done in a beautiful Japanese setting! Need we say more?\n\n- Cleopatra and Caesar. Discover an incredible casino slot game and be like a Great Pharaoh - the Lord of the Egyptian lands. Play one of the best video slot machines and have fun. Veni, Vidi, Vici!\n\n- Thief Of Hearts. This jackpot slot helps you to find the hidden treasure in an endless desert. And the Prince of Thieves will be your guide in your search for it.\n\nDo you like your casino slots free? Then Slots Era is an epic adventure you don't want to miss. The stakes have never been higher in free slots games!\n\nWe have also made two other popular slots games that you might find interesting! Scatter Slots is an engaging slot journey through the realms of Fantasy. Infinity Slots is a great game where you can get a taste of Las Vegas luxury!\n\nHave fun and best of luck to you!\n\nFROM THE CREATORS OF SLOTS ERA:\nThis game is intended for an adult audience and does not offer \"real money gambling\". Practice or success at social gaming does not imply future success at \"real money gambling\". Use of this application is governed by Murka's Terms of Service. Collection and use of personal data are subject to Murka's Privacy Policy.\nBy downloading this application, you are accepting Terms of Service & updated Privacy Policy:\nhttp://murka.com/#terms-of-service\nhttp://murka.com/#privacy-policy",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-10-01T17:46:38Z",
  "updated": "2020-05-05T16:13:14Z",
  "releaseNotes": "Dear players!\n\nGood news for fans of Albums. A new season with cool characters is on the way! What about conquering Olympus and becoming rich?\n\nSpring is in full swing, so pretty soon we'll celebrate Cinco de Mayo. Next, you will meet a new slot! An unforgettable adventure in snowy Alaska with your favorite hero – nothing can be better than huge winnings!\n\nAnd last but not least, we fixed some bugs and added a few nice improvements – enjoy the game!\n\nStay at home and play slots!\n\nThe Slots Era Team",
  "version": "1.58.0",
  "price": 0,
  "developer": "Murka Games Limited",
  "score": 4.62026,
  "reviews": 9496,
  "currentVersionScore": 4.62026,
  "currentVersionReviews": 9496,
  "searchTerms": "slots"
 },
 {
  "appId": "com.igs.fafafa",
  "title": "Golden HoYeah Slots Casino",
  "description": "Here you'll find many slot games based on real machines from casinos all around Asia—including Taiwan, Hong Kong, Macau, Malaysia, and more!\n\nMultiple realistic themes like [Fortune Tree], [Rooster 88], [Gong Xi Fa Cai], [Hello Doggy], [SAYURI], and [Fortune Panda] and designed to make Players feel like they're in a real casino! The slot machine lover in you can't miss this classic game! Beside that you can play this fun games  with a multiplayer gamers from all over the world!\n\nThe most popular fishing game in casinos throughout Asia, [Ocean King 2] is here. Platforms with cool designs, numerous types of fish, with rebound and fall-free gameplay, enjoy being King of the Oceans and experience the thrill of winning super coin rewards\n\n- Authorized reproductions of real-life [IGS] slot machines and fishing games\n- Download and receive 200,000 free coins, log in everyday to receive more free coins\n- Multiple games with big rewards, become a millionaire in seconds\n- Ranked global competitions are held daily, become number one in the world\n- Level up and receive free coins\n\n● This game is designed for adults aged 21 and above. There are no functions for actual gambling or winning real currency or prizes by chance. Experiencing success in this game does not guarantee that you will also succeed in a real-world casino.\n\n● This game does not provide Cash Gambling, and there is no chance of winning real currency or prizes.",
  "genres": [
   "Games",
   "Casual",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-10-17T03:58:04Z",
  "updated": "2020-04-30T15:43:11Z",
  "releaseNotes": "‧New Slot: Mayan Empire \n　Let's reveal the ancient civilization!\n‧Warm Carnations Hunt\n　Happy all the time!\n‧Meow Race\n　Accumulate Scores to Win the Reward!\n‧Ocean King 2 DINO Gacha Machine\n　Challenge your LUCK\n‧Ocean King 2 Mother's Day Celebrations\n　Have fun with the special fish, cannon and Gacha! \n‧Game Optimization",
  "version": "2.4.5",
  "price": 0,
  "developer": "International Games System Co., Ltd.",
  "score": 4.99587,
  "reviews": 50812,
  "currentVersionScore": 4.99587,
  "currentVersionReviews": 50812,
  "searchTerms": "slots"
 },
 {
  "appId": "com.GalaInteractive.GalaSpins",
  "title": "Gala Spins:  Real Money Slots",
  "description": "Gala Spins is a dedicated slots app that offers players easy and effortless fun!   Become SPINCREDIBLE with a super Slots offering of over 100 top EXCLUSIVE games and jackpots totalling over £5 Million!   Enjoy exclusive PRIZE GAMES and game achievements that awards BONUS rounds just for playing! \n\nWhy choose Gala Spins?\n\n● Play all of your FAVOURITE slots and games like Slingo Rainbow Riches, Starburst, Fishin Frenzy Megaways & Twin Spin.\n\n● Enjoy all new exclusive Gala Spins PROMOTIONS like Mission Possible, which offers six ways to win six brand-new prizes!  Complete each Vault's set of challenges and win either FREE SPINS or Cash!\n\n● Play guaranteed DAILY JACKPOT games like Mystery Reels Megaways, Jack In A Pot & The Greatest Train Robbery.\n\n● Receive Daily Rewards – play Daily Mystery Bonus & Mission Possible\n\n● All of your favourite slot games  - Rainbow Riches, Starburst, The Goonies and more….\n\nThe app combines an easy-on-the-eye, user-friendly interface optimised for iPhone & iPad that offers…\n\n● NEW & exclusive games like Scarab, Laser Lock, Megaways Medusa and Mega Pyramid\n● EXCLUSIVE games – Banks of Gold, Regal Jewels & Big Banker and many more…\n● Progressive BIG MONEY JACKPOT slots like the Irish-themed, Irish Riches Megaways, the amazing Wish upon a Jackpot King and exclusive jackpot slots like Pirates Plenty, Gold Frenzy & Mars Attacks\n●  SLINGO slots – Slingo Deal or No Deal, Slingo The Chase, Slingo Rainbow Riches, Slingo Extreme and Slingo XXXtreme\n● Enhanced game search\n\nSo get ready to join Gala Spins for fun that goes around and around and around! \n\nWelcome offer:\n18+. New customers only. Min deposit and spend £10 = £20 bonus. 20 x wagering reqs apply. 30 Free Spins on The Goonies. Spin value £0.20. 10 x wagering on free spins. Bonus & Free Spins valid for 7 days. T&Cs apply. \n\nMission Possible:\n18+. Missions reset monthly.  Player must complete 3 challenges to move on to next set. Vaults are unlockable between 6pm-12pm daily. Prizes vary from Cash to Free spins. T&Cs apply.\n\nFollow us on social for the latest offers:\nFacebook page - facebook.com/galaspins\nTwitter - twitter.com/galaspins\nInstagram - instagram.com/galaspins\n\nResponsible Gambling\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org.\n\nGala Spins is operated by Gala Interactive (Gibraltar) Limited and is licensed and regulated by the UK Gambling Commission",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-03-02T09:30:06Z",
  "updated": "2019-05-28T14:09:18Z",
  "releaseNotes": "This update focuses on under-the-hood improvements, including:\n- Faster load times\n- Smoother browsing",
  "version": "19.05.03",
  "price": 0,
  "developer": "Gala",
  "score": 4.67485,
  "reviews": 2239,
  "currentVersionScore": 4.67485,
  "currentVersionReviews": 2239,
  "searchTerms": "slots"
 },
 {
  "appId": "com.superant.doublehitcasino",
  "title": "Double Hit Casino: Vegas Slots",
  "description": "Double the payouts, double the thrill in DoubleHit Casino! Enjoy ultimate casino experiences in the top free mobile slot machines game for iPhone & iPad! Start to spin the reels anytime and anywhere with the biggest welcome bonus 2,000,000 FREE coins!\n\nExplore the real Vegas styled slot machines and play to win! Time to invite all your Facebook friends to join for a fun social casino video slots adventure like you never have before.\n\nChoose your favorite slot games varies from Classic to the latest unique one! \n• Spin over 40 FREE machines\n• Constantly delivery new contents and new machines\n• All slots unlocked! No level-based restriction in our game\n• STUNNING Slots graphics and animations!\n\nHIt the biggest wins with: \n• Incredible PAYOUTS for the most addictive Casino Slot Machine Games! \n• HOURLY and DAILY bonuses are rewarded frequently! \n• Exclusive weekly DEALS and GIFTS! \n• Interesting festival themed Events and BONUSES!\n\nGet social for a better online casino game experience \n• Invite all your friends on Facebook to play free slots together. \n• Participate in tournaments with your FRIENDS! \n• Earn and exchange FREE casino coins with our vibrant community!\n\nGet more FREE coins, latest events, and bonuses from our facebook social media at https://www.facebook.com/doublehitcasino/ \n\nWhat’s the hold-up? Double the fun and winnings NOW! \n\n--------------------------------\nOur official website: http://www.me2zen.com/\n\nPrivacy Policy: \nhttp://www.me2zen.com/privacypolicy.html\n\nTerms of Service:\nhttp://www.me2zen.com/termsofservice.html\n\nDoubleHit Casino is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-11-18T17:03:59Z",
  "updated": "2020-04-07T03:46:34Z",
  "releaseNotes": "Easter is coming! We have various Easter events waiting for you!\nAlso, we brought you the newest slot game: Big Money Cash!\nIf you love our game, please leave us a review.",
  "version": "1.5.8",
  "price": 0,
  "developer": "ME2ZEN Limited",
  "score": 4.4188,
  "reviews": 117,
  "currentVersionScore": 4.4188,
  "currentVersionReviews": 117,
  "searchTerms": "slots"
 },
 {
  "appId": "uk.fulltilt.www",
  "title": "Full Tilt Casino & Poker Games",
  "description": "AN AMAZING POKER AND CASINO EXPERIENCE\n\nThe great thing about the Full Tilt mobile app is that it allows you to enjoy your favourite poker and casino games anytime, anywhere. Download the Full Tilt app now and jump into the game of your choice!\n\nTHE BEST ONLINE POKER EXPERIENCE\n\n• Hit No Limit Texas Hold’em and Pot Limit Omaha tables\n• Sit&Go and Multi-table tournaments with huge prizes\n• Play Spin&Go, Zoom or any other special poker game\n• Sit at real-money or play-money poker tables\n• Take advantage of the best poker promotions\n\nALL THE BEST CASINO GAMES\n\n• Play the world’s most popular casino games, such as blackjack, roulette and slots\n• Play Live Casino games on your mobile device with a real dealer\n• All the best Slots available, with huge real money Jackpots\n• Try Multi-Player mode and catch-up with friends at the tables\n\nGREAT FEATURES\n\n Multi-table functionality\n• ‘Find your seat’ feature\n• Table chat\n• Lobby filters\n• Built-in Contact Support Form, with our Support team available 24/7!\n\nVisit our website for more information on what we have to offer. Join our poker community on social media and connect with poker players from around the world.\n\nhttps://www.facebook.com/Fulltiltpoker\nhttps://twitter.com/FullTiltPoker\n\nPlay anytime, anywhere – download the Full Tilt mobile app now.\n\nThis is a real money gambling app. You must be at least 18 years old, and of the legal age of majority in your jurisdiction, to create a Stars Account.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.\n\n************************\n\n£20 Free Play Promotion Terms and Conditions\n\n- Offer only available to players who have never made a real money deposit of £10 or more\n- The £20 Free Play will be credited daily from deposit date: Day 1 = 5 x $1 S&G (Spin & Go) tickets, Day 2 = 5 x $1 S&G tickets, Day 3 = 5 x $1 S&G tickets, Day 4 = $5 cash bonus, Day 5 =5 x $1 S&G tickets, Day 6 = $5 cash bonus\n- We reserve the right to withhold rewards if there is reason to suspect that a deposit is fraudulent, or that it has not been made with the intention of using it to play real money games\n- All Spin & Go tickets issued as part of the £20 Free Play promotion expire 21 days from issue\n- Any unused tickets issued as part of this promotion will be forfeited\n- Tickets cannot be redeemed for cash or any other value, or be transferred\n- A cashout at any time during the bonus period will leave you ineligible to claim this bonus",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-05-17T07:12:23Z",
  "updated": "2020-04-09T11:07:04Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "1.119.0",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.41836,
  "reviews": 1035,
  "currentVersionScore": 4.41836,
  "currentVersionReviews": 1035,
  "searchTerms": "slots"
 },
 {
  "appId": "com.rl.iphone.dino",
  "title": "888 Casino: Real Money Games",
  "description": "Sign up & Get £88 Free Play - NO DEPOSIT BONUS \nTERMS & CONDITIONS\nNew players only • £88 is granted as FreePlay (FP) • FP must be claimed within 48 hrs of & expires within 14 days • FP wins are credited as bonus and capped at £15, exc. JP win • Bonus wins are capped at £500 • To withdraw bonus & related wins, wager bonus x30 within 90 days • Wagering req. vary by game • Deposit balance is available for withdrawal at any time • General withdrawal restrictions & full T&Cs apply - https://www.888casino.com/terms/88freeplay/\n\nPlay with 50 Real Spins - NO DEPOSIT BONUS \nTERMS & CONDITIONS\nNew players only • Real Spins (RS) must be claimed within 48 hours and expire in 14 days • RS valid for selected games only • Eligibility is limited only to players that are directed via specific marketing channels • RS wins credited as real money & are capped at £7, exc. JP wins • RS winnings granted once all RS have been used or once max winnings cap has been reached • Deposit balance is available for withdrawal at any time. General withdrawal restrictions & full T&Cs apply - https://www.888casino.com/terms/50-realspins/\n\nJoin 888 casino today & get £88 FREE PLAY, No Deposit Needed! Get the top online casino app and enjoy a huge selection of Live Casino games, hundreds of Slot machines and multiple Blackjack, Baccarat & Roulette tables. We have over 20 years of gaming excellence, so you’ve come to the right place!\n\nWhether you’re playing from the comfort of your own home or on-the-go, 888 casino is your ultimate ticket to Las Vegas-style casino entertainment. With millions of registered players from all around the world, you too could join the premier online casino app.\n\n888casino Top App Features:\n\nMobile Casino Games\n• Play Slot, Roulette and Blackjack games on-the-go, on your iPad and iPhone.\n• Wherever you are, you’re at the Live Casino! Feel the thrill of real Las Vegas anywhere, as a real dealer spins the Roulette wheel.\n\nReal Money Online Slots\n• There’s never a dull moment with over 900 of the most popular Slots.\n• With just a tap, you can choose from our selection of top-tier Slot games and unique slot games, exclusive to 888casino.\n• Go back in time to ancient Rome & Egypt in historical slots, search for the Leprechaun’s pot o’ gold or just keep it classic. Whatever theme you’re into, be sure to find your favorite game!\n• Enjoy a wide variety of features such as Bonus Games, Expanding Wilds, Free Spins and Huge progressive Jackpots galore.\n• Play our top slot games including: Millionaire Genie, Gonzo, Rise of the Pharaohs, Jack’s Pot, Spartacus, and Guns N’ Roses.\n\nLive Blackjack, Roulette & More\n• Experience a real life casino while you play at our Live Casino lounge and meet the most charming dealers under the sun.\n\nVegas-style Fun at Your Fingertips\n• Get lucky with the hottest Slot games under the sun!\n• These casino games have funky themes, dazzling audio-visuals and humungous progressive jackpots that are dropping all the time!\n\nBig Bonuses, Fantastic FreePlay & Fabulous Free Spins, there’s always a sizzling hot promotion waiting for you at 888casino.\n\nDownload 888 casino now and enjoy real money casino games at the tap of a button.\n18+\n\nhttps://www.888casino.com/security-and-privacy/responsible-gaming/\nBeGambleAware:\n\nhttps://www.begambleaware.org/\n888responsible\n\nhttp://www.888responsible.com/",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-12-21T19:23:40Z",
  "updated": "2020-02-20T08:09:40Z",
  "releaseNotes": "Bug fixes and performance improvements",
  "version": "2.6.86",
  "price": 0,
  "developer": "Virtual IP Assets Limited",
  "score": 4.44072,
  "reviews": 5820,
  "currentVersionScore": 4.44072,
  "currentVersionReviews": 5820,
  "searchTerms": "slots"
 },
 {
  "appId": "com.superluckycasino.hotvegas.slots.vegas.ios.free",
  "title": "Slots: Hot Vegas Casino Pokies",
  "description": "* 100,000,000 Bonus Coins! Play 70+ Pokies and Slot Machines in Hot Vegas Slots! *\n\nPlay online or offline, with or without wifi, any place, any time! REAL VEGAS ODDS ON EVERY POKIE!\n\nWin Big with HOT VEGAS SLOTS POKER MACHINES CASINO & SLOT GAMES!!! New Slots Added every month! Don't miss out on the greatest new Slot Game App: Play Hot Vegas Slots Casino TODAY!\n\nThese slot games are intended for adult audiences and do not offer real money gambling or any opportunities to win real money or prizes. Success within this slots game does not imply future success at real money gambling.\n\nQuestions/Problems? \nE-mail us at: HOTi@12gigs.com",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-05-16T04:44:12Z",
  "updated": "2020-02-03T17:38:36Z",
  "releaseNotes": "HOT VEGAS SLOTS ARE BETTER THAN EVER! \n- Start with 100,000,000 Bonus Coins and Collect MORE Free Coins Every Day! \n- Play over 70+ Real Vegas Casino Pokie Machines Free! \n- New Vegas Pokie Machines unlocked every month! \n- All new LEAGUES lets you win more Bonus Coins with your friends! \n- Bigger Jackpots on every Vegas pokie games! \n- Play Quests for a Special Bonus! \n... And MORE!",
  "version": "1.203",
  "price": 0,
  "developer": "Super Lucky Casino Inc.",
  "score": 4.91083,
  "reviews": 3970,
  "currentVersionScore": 4.91083,
  "currentVersionReviews": 3970,
  "searchTerms": "slots"
 },
 {
  "appId": "com.idorweb.copthelot",
  "title": "Cop The Lot Slots",
  "description": "Flee the cops in Cop The Lot Slots as you guide a group of cash hungry robbers to riches in glorious free to play 3D. Based on the real arcade/casino game of the same name, there’s plenty going on with a host of features and mini-games. If you like your slots games and your fruit machines, you’re gonna love this.\nFeatures include:\nMini-games including Cops and Robbers, The Usual Suspects, Safe Cracker, and more.\nBuild up a small virtual fortune by gambling all wins up to 500X your stake.\n25 levels to progress giving up stacks of free bonus credits, spins, and bonus features.\n1200 Credits a day in free play (Requires an online connection) with extra free credits for level-ups and highscore achievements.\nSmash the bank in Smash and Grab with Bronze, Silver and Gold jackpots there for the taking.\nHead for the big money on the Millionaire’s Row with mega multipliers up for grabs.\nOnline/Offline Trophies - A whole load of in-game achievements are there for the taking.\nOnline/Offline Highscores - On the Bank Run you have 10 minutes to cash out with as much virtual cash as possible.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-10-27T07:11:33Z",
  "updated": "2014-11-12T23:40:10Z",
  "releaseNotes": "The daily free credit awards have been boosted up to a whopping 1200 credits a day.\nRemoved the banner adverts in the Cop Shop.\nMinor changes to the game engine.\nVisual Improvements.\nBug fixes.",
  "version": "1.1",
  "price": 0,
  "developer": "Idor Interactive Ltd.",
  "score": 3.24841,
  "reviews": 157,
  "currentVersionScore": 3.24841,
  "currentVersionReviews": 157,
  "searchTerms": "slots"
 },
 {
  "appId": "com.playojo.skillonnet",
  "title": "Play Casino Games at PlayOJO",
  "description": "The PlayOJO casino app brings over 3,000 of the best REAL MONEY CASINO GAMES to your fingertips so you can win JACKPOT PRIZES wherever you are. Play VEGAS style, LIVE CASINO table games like BLACKJACK, ROULETTE and BACCARAT, or leading casino slots like STARBURST, RAGING RHINO, MEGA FORTUNE and MEGA MOOLAH where players can win jackpots worth millions in seconds! \n\nPlay at OJO today and get 50 FREE SPINS on your first deposit on our casino slot machines. At PlayOJO, there are no wagering requirements to withdraw and with OJO Plus, players earn MONEY BACK on every bet - win or lose. What’s more, OJO has no withdrawal limits!\n\nSo, what are you waiting for? Download the UK's favourite mobile casino today!\n\nWhy PlayOJO? \n\nMONEY BACK on every bet - win or lose with no restrictions\nHUGE JACKPOTS ready to be won!\nAll rewards paid in CASH - with ZERO WAGERING REQUIREMENTS ever!\nKickers – rewards offered every day to give you more playtime!\nReel Spinoffs – daily slot tournaments with big FREE SPIN packages to win.\nThe OJO Wheel – win FREE SPINS and get paid in cash!\nNo withdrawal limits!\n\nWith OJO’s innovative search function, players can search for their favourite game by category, what’s new, most popular, jackpot size, rating or by minimum/maximum bet size. \n\nAt PlayOJO, we want all our customers to enjoy:\n\n• The MOST POPULAR SLOT GAMES – like Rainbow Riches, Starburst, Slots of Gold and Fortunes of the Amazons \n• Huge PROGRESSIVE JACKPOT SLOTS like Mega Moolah and Mega Fortune. \n• All of the LATEST SLOTS like Vikings Go Berzerk, Valley of the Gods, The Reel Deal, Jewell Quest Riches and Orient Express\n• A top LIVE DEALER CASINO from Evolution Gaming that offers Roulette, Blackjack and Baccarat.\n• Fast withdrawals from 12 leading payment providers - each offering 24/7 support. \n• A high performance gaming platform that offers both real money and play money modes.\n• The safety and protection of PlayOJO's Gaming Commission of Great Britain license\n\n2017 Awards \n'Rising Star of the Year' - eGaming Review Operator Awards \n'Casino of the Year' - Malta iGaming Awards \n\nEvery time you play, you’ll move through the OJO Levels, picking up regular rewards like a spin on the OJO Wheel game where you can pick a prize wheel based on risk and reward. Win from a free spin and GET PAID IN CASH! \n\nEnjoy plenty of casino action with OJO’s Reel Spinoff tournaments in the form of FREEROLL and BUY-IN  SLOT TOURNAMENTS throughout the day. Simply enter, spin the selected slot and all wins will convert to points on a leader-board. You can win yourself a generous FREE SPINS package with no absolutely ZERO WAGERING RESTRICTIONS on wins.\n\nBut, it’s our PROGRESSIVE JACKPOT SLOTS where the BIG wins are. These slot games have jackpots that increase incrementally as players (from all around the world) play. The jackpot amount keeps progressing until the right symbols are aligned and the jackpot is triggered. There are many progressive jackpot games to play, with big and small jackpots. The top progressive jackpot slots are MEGA MOOLAH (which paid out the highest jackpot ever – £13.2 million) and MEGA FORTUNE.\n\nWith the Play OJO app you can enjoy all the excitement of the desktop casino straight from your mobile device. Enjoy OJO’s brilliant rewards and player-friendly platform through your touchscreen and get a fully interactive experience whether you’re on the commute, a work break or simply lounging at home!\n\nPlay OJO Casino is completely safe to play with all deposits protected with state-of-the-art security software.\n\nSo, what are you waiting for? Download today and enjoy all the fun of your favourite casinos the OJO way. \n\nConnect with OJO on Social!\nWebsite: www.playOJO.com\nTwitter: www.twitter.com/playOJO\nFacebook: www.facebook.com/playOJO\nInstagram: www.instagram.com/playOJO\n\n18+ only. www.BeGambleAware.org",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2017-03-20T19:23:21Z",
  "updated": "2019-10-16T20:01:49Z",
  "releaseNotes": "We’ve added performance improvements as well as new games for you to enjoy!",
  "version": "iOS APP 2.6",
  "price": 0,
  "developer": "Skill On Net Ltd",
  "score": 4.56968,
  "reviews": 5754,
  "currentVersionScore": 4.56968,
  "currentVersionReviews": 5754,
  "searchTerms": "slots"
 },
 {
  "appId": "com.lobby.enlobby",
  "title": "Texas Casino",
  "description": "Texas Casin contains the hottest and most popular games at the moment, including Casino Bonus Game, Texas Poker, Slot Game, Sic Bo, Baccarat and Teep Patti.\n\nIn this Casino game lobby, you can play mainstream Texas Poker games. We have already opened Teep Patti, Baccarat, Texas Poker, various Slots and Sic Bo games, especially Black Jack and Five Card Stud, which are going to be exciting and fun.\n\nNo matter when and where you are, you can invite friends to play Texas Poker and various games. You will be very happy whenever and wherever you are. Hurry up and win the jackpot.\n\nFeatures:\nVery complete !! Teep Patti, Baccarat, Texas Poker, Slots and Sic Bo are now available. Many other games will be launched in the next plan.\n\nAll online! !! Play with offline players and see who the game is!\n\nSuper bonus! !! In addition to the list of prizes, there are many chips and free prizes waiting for you to pick up every day.\n\n Get a chance to transfer prizes every two hours!\n\n1.A large number of daily tasks are waiting for you to challenge, you can get a lot of rewards after completing!\n\n2. Participate in the game every day, upgrade quickly, and get a lot of chips immediately!\n\n3. Chat whatever you want! !! !! The chat function is online now, let's chat with friends while playing.\n\nplay with friends! !! After successfully becoming friends, you can track your friends in the game and play with them.\n\nSuper cute! !! Many interactive tools and cute expressions to choose from.\n\nvery cool! !! A variety of interesting and unique photo frames are online and more will be opened in the future!\n\nPlayers can log in to their Facebook account, store in-game progress, and more cross-platform logins, so that you can enjoy exciting exciting Las Vegas-style games on different phones or tablets!\nLog in to the game with Facebook and get more rewards!\n\nSuper easy! !! Most of the games in this category are very classic and popular games, no further learning is required. Download and play.\n\nLook and feel comfortable! Beautiful icon layout and beautiful cute dealer\n\nSo what are you waiting for? Hurry up and play with friends. Your leisure time will be more happy and comfortable. If you become a top player, you will have the opportunity to make friends with the game customer service.\n\nCome on and act!\n\nFind our keywords: Teep Patti, Baccarat, Texas Poker, Slot, Sic Bo, Slots, poker, blackjack, casino, games, Texas，Texas Poker, solitaire, pokemon, WSOP, game, card games, card, wwe\n\nIf you still have questions, please contact us through the FB fan page:\nhttps://www.facebook.com/Texas-Casino-112572000227959/?modal=admin_todo_tour",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "12+",
  "released": "2020-01-02T08:00:00Z",
  "updated": "2020-01-10T16:12:07Z",
  "releaseNotes": "1. Optimize the gaming experience,\n2. Fix game issues\n3. Open mall discount activities",
  "version": "1.0.2",
  "price": 0,
  "developer": "palmplay",
  "score": 5,
  "reviews": 2220,
  "currentVersionScore": 5,
  "currentVersionReviews": 2220,
  "searchTerms": "slots"
 },
 {
  "appId": "com.murka.scatterslots",
  "title": "Scatter Slots - Vegas Casino",
  "description": "Greetings, Winner! The luckiest Slot Machines welcome you! Experience the stunning beauty of Scatter Slots!\n\nOver 20 MILLION players already discovered this 777 Vegas Casino Game and gave it their highest praise. Over 100 Free 777 Slots Adventures in Vegas Slot Machine Games and JACKPOT Slots already await with even MORE coming your way. If you're looking for the very best Social Casino genre can offer - Look No Further! Start your Journey with 12,000,000 Free Coins Welcome Bonus!\n\nDownload Scatter Slots NOW and enjoy:\n\n• Spin over 100 innovative 777 slots and even more are coming.\n\n• Play offline, even in the airplane or subway.\n\n• Endless free spins, re-spins, bonus games, wild jackpots as well as hourly and daily bonuses\n\n• Quest system allows you to choose your own way of beating each and every level on your Path To Glory!\n\n• A Status System to reward the most loyal of players. The longer you play - the bigger the bonuses.\n\n• Tournament mode for those who desire to prove their worth to The World!\n\n• Enjoy the benefits of jackpots room with high stakes.\n\n• New updates, features, characters and stunning worlds to explore are coming your way!\n\n• Win massive coins packages and enjoy extra benefits in Bingo, Pachinko, Tabletops, and more kinds of premium events!\n\n• You'll be under 777 lucky spell playing our magic slot casino masterpiece\n\n• Mozart, Beethoven, Bach and many more are here to bring the lucky sounds of vegas to your ears\n\nThere are so many ways to win in featured Scatter Slots Machines, just chose your luckiest one:\n\n* Hooting Owl - a Slot Game as classic as they get. Featuring Old School Reels, Generous Bonus Game and Plenty of Free Spins, the atmosphere of Las Vegas is strong with this one ;-)\n* The Passion - Jackpot Slot with the Highest Stakes Out there! With 3 HUGE Jackpots to win, Free Spins to fill your bank to the brim, and Re-Spins to give you an extra edge, you’ll see your wins reach brand NEW heights!\n* Lady Femida -  Test your luck and spin The Wheel in the Land of Fortune in the Bonus Game. Get enough Re-Spins and you’ll activate Free Spins. Can you resist the allure of great riches? Do you want to? ;-)\n* Fairy Tale - follow this playful fairy to the treasures! Search for your win in the Bonus Game. Re-Spins and Free Spins will keep you swimming in coins. Your Happily Ever After waits for you in this Slot Machine!\n* Thief - This one is rightfully considered one of the best Slot Machines ever created. Stacked with features too! Frequent Re-Spins, Free Spins that are triggered by them, Bonus Game with generosity to spare and, if that wasn’t enough, a cumulative JACKPOT! Strap in for a WILD ride, Slot Fans!\n\nYour Epic Adventure starts Here and NOW! Grab your 12,000,000 Welcome Bonus and strap-in for the very best Slots Game the world can offer you! Best of luck to you and have fun with Scatter Slots!\n\nBe sure to check out our other games ;-) Infinity Slots will give you a taste of Las Vegas luxurious casinos for FREE. Slots Era is an exciting slots journey through the worlds of Culture, History, and Nature!\n\nThank you and stay awesome!\n\nFROM THE MAKERS OF SCATTER SLOTS: \nThis game is intended for an adult audience and does not offer \"real money gambling\". Practice or success at social gaming does not imply future success at \"real money gambling\". Use of this application is governed by Murka's Terms of Service. Collection and use of personal data are subject to Murka's Privacy Policy.\nBy downloading this application, you are accepting Terms of Service & Privacy Policy: \nhttp://murka.com/#terms-of-service\nhttp://murka.com/#privacy-policy",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-01-02T22:32:40Z",
  "updated": "2020-05-06T07:40:36Z",
  "releaseNotes": "Dear players!\n\nWe are happy to launch some new spring events that will surely bring you glory and wealth! Conquer the Scatter Tower for the main prize and collect generous rewards in the Forest Rush!\n\nDon't forget to play the game daily, as the new season of Scatter Legends and long-awaited collections with your favorite characters await you soon! As they say, there is no such thing as 'too many prizes'!\n\nStay home, stay awesome, play slots, and catch the Luck!\n\n \n\nThe Scatter Slots Team",
  "version": "3.57.0",
  "price": 0,
  "developer": "Murka Games Limited",
  "score": 4.63206,
  "reviews": 10306,
  "currentVersionScore": 4.63206,
  "currentVersionReviews": 10306,
  "searchTerms": "slots"
 },
 {
  "appId": "slots.diamondlife.casino.games.ios",
  "title": "Lotsa Slots: Casino SLOTS",
  "description": "Download Lotsa Slots, one of the best casino apps made especially for slots lovers. Lotsa Slots Casino gives you the chance to WIN BIG in Slots, including EXCITING bonus games, big wins & thrilling progressive JACKPOTS. Enjoy all the thrill of Las Vegas on your iPhone or iPad!\n\nTake a break from your daily routine and escape into the glitzy fantasies of Vegas games! Head into the wild with Bonus & the Beast, enjoy endless cash re-spin features with Lava Loot, smash up the reels with Pearl Cash, become a slots legend with Cash Respins! With over 30+ free Vegas slots games adventures and jackpot featured slot machines, excitement is always just a tap away!\n\nLotsa Slots featured with:\n\n- Hot slot machines including, Lava Loot, Legend of Oz, Triple Tiki & more! \n\n- Most exciting Jackpots and the biggest Wins just for you!\n\n- Vegas style slots machines designed by casino professionals.\n\n- 300,000 Free slots WELCOME BONUS. \n\n- Bonus coins to collect every 2 hours!\n\n- Experience Quest Challenge, daily tasks & more events coming up!\n\n- Enjoy realistic Vegas Casino in the palm of your hands!\n\n- New slots machines added every week.\n\nLotsa Slots is intended for adult audience for entertainment purposes only. YOU CANNOT WIN REAL MONEY. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-03-09T23:36:04Z",
  "updated": "2020-04-17T18:23:36Z",
  "releaseNotes": "Hi Lotsa fans! \nDownload this update NOW to enjoy MORE BONUS COINS, new exciting features and a much smoother spinning experience!\nSee you soon on the reels :)",
  "version": "3.84",
  "price": 0,
  "developer": "GRANDE GAMES LIMITED",
  "score": 4.68778,
  "reviews": 3709,
  "currentVersionScore": 4.68778,
  "currentVersionReviews": 3709,
  "searchTerms": "slots"
 },
 {
  "appId": "com.ipocket.vegasslots",
  "title": "Classic Vegas Slots ©",
  "description": "Welcome to the Lucky Classic Slots  Machine !\n\nJoin the  biggest casino community with Lucky Calssic Slots. enjoy the classic slot game like Alladin, Zeus and hundreds of other slot games. What you need to do is just a single tap to download and spin! Then you can enjoy the excitement and win the Billionaire  Casino.\n\nLucky Calssic Slots bring you the best slot gaming experience and you will enjoy the features：\n\n1. Free coins hourly and wheel bonus can be collected in an easy way.\n2. All kinds of challenges in slots are offered and players just choose the favorite one to start spinning. \n3. Magnificent animated effect and high quality graphics as if you were gambling in real Las Vegas casino.\n4. arious topics and  the slot game will be updated regularly.\n5. All kinds of popular slot machines are free to play.\n6. Tons of free spins, respins, jackpots rapidly multiplied wins will make you a billionaire.\n\nNow,it's time to join the  Lucky Calssic Slots that is being widely talked about !\n\nWith Lucky Calssic Slots, you don't have to head to Vegas to enjoy the excitement and glamour of casino games. You can play anytime, anywhere from your mobile casino app. You'll never miss out on a spin on the slot machines ! So, what are you waiting for? Download Lucky Casino today, start spinning those 777 reels and keep Vegas in your pocket !\n\nStill have some questions ?\n\nContact us at ：https://www.facebook.com/LuckyClassicSlots\n\nNote：\n1. This game is intended for an adult audience.\n2.This game does not offer real money gambling or an opportunity to win real money or prizes. \n3. Practice or success at social gaming does not imply future success at real money gambling. \n4. Playing  Lucky Calssic Slots does not imply future success at “real money gambling”",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-12-15T05:33:53Z",
  "updated": "2019-09-06T19:12:44Z",
  "releaseNotes": "Hi there!\nHere's a new update with a brand new slot TARZEN BINGO GRAND and fixes to improve your game experience!\nHave fun & good luck!",
  "version": "2.0.0",
  "price": 0,
  "developer": "IPOCKET",
  "score": 1,
  "reviews": 1,
  "currentVersionScore": 1,
  "currentVersionReviews": 1,
  "searchTerms": "slots"
 },
 {
  "appId": "com.cervomedia.slots.freeslot1",
  "title": "Slots - Pharaoh's Way",
  "description": "••• Download the best multi-slot experience for free today! •••\n\nFun, excitement and entertainment! Welcome to Slots - Pharaoh's Way!\n\nThese slots play just like a dream - Easy to understand, big wins and amazing bonuses!\n\nGorgeous graphics, smooth animations, fantastic bonuses and atmospherical sounds guarantee a premium slot experience. \n\nDOWNLOAD NOW IF YOU LIKE SLOTS! YOU WILL LOVE SLOTS - PHARAOH'S WAY!\n\nFeatures: \n\n- The first multi slot experience with REALLY GOOD SLOTS!\n\n- Discover incredible games: 5 reels-4 symbols, 3 reels-3 symbols, 25 lines, 50 lines, 10 lines, consecutive symbols, 243 win-ways and many more - All in all, 35 slots and 5 tournaments are available now! WOW! And we add more content constantly!\n\n- State of the art math/game design designed by casino professionals\n\n- Easy to play with multiple convenient features: \n• Fast reel stop \n• Individual reel stop \n• Auto play \n\n- Discover lots of amazing bonuses \n\n- Gorgeous presentation/authentic sounds \n\n- Double up/Gamble (50:50 and 75:25) \n\n- Game Center High Scores and Achievements \n\n- Slots - Pharaoh's Way is THE premium slot experience for the iPhone and iPad \n\n--> Please note:\n\n• This app is for entertainment purposes only!\n\n• No real money or any other real world goods and/or services can be won in this game!\nThis game uses virtual units called \"Credits\" (visualized by a coin with an egyptian eye on it) to play the game. You can purchase additional credit-packs for real money via the \"Buy\" popup (with the payment method selected in your iTunes account). These credits bought or won cannot be changed back to real money and cashed out, transferred, redeemed or collected in any other way or changed back to any other real world goods and/or services. Once purchased or won, the credits can only be used to play this game.  \n\n• This app does not reflect the actual game play of any casino-, online- or other electronic gaming machine. The payout percentages, odds, payout methods and other features on our for-fun, entertainment only slots are higher/better/different than slot machines in regular/online casinos. You should not expect similar results!\n\n• The developer of this app takes no responsibility or liability with regards to the legal requirements to use this app in the relevant jurisdiction the player is resident and plays the game, and therefore the use of this app is the sole responsibility of the player.\n\n• The player agrees that he/she will comply fully with all applicable laws, regulations, statutes and ordinances which are applicable to use this app.\n\n• Only play this game if you have reached the respective legal age required in your country of residence. If so, play responsibly!",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-06-10T11:16:12Z",
  "updated": "2018-07-24T08:34:01Z",
  "releaseNotes": "• A new amazing slot: Brave Defender!\n• An exciting new map: Sacred Mountain!\n• Find a new gift at level 830!\n• Thanks for downloading, we really appreciate your loyalty!\n• If you encounter any problems, please contact our friendly support staff: support@cervomedia.com",
  "version": "8.0.3",
  "price": 0,
  "developer": "Funstage Spielewebseiten Betriebsges.m.b.H.",
  "score": 4.42731,
  "reviews": 227,
  "currentVersionScore": 4.42731,
  "currentVersionReviews": 227,
  "searchTerms": "slots"
 },
 {
  "appId": "com.megarama.slotswow",
  "title": "Slots WOW Fun Slot Machines",
  "description": "Get ready to be WOWed with Slots WOW! ™  - Slot Machines Casino & Pokies.\n\n40+ Unique Slot Machines are waiting for you with NEW slot machines being added EVERY WEEK!\n\nBe warned: the games are very (very!) addictive slots games! Prepare yourself to win loads of coins & plenty of bonuses!\n\nIf you’re looking for a super fun slot game to help you pass time, this is it! Who said Being a billionaire ain't fun?\n\nThis is most likely the BEST slots game going around.... Give it a crack and you won’t be disappointed!\n\nQuestions? Comments? Feedback? Contact our support gurus on support@megarama.net \n\nLike our game?  Help a small indie developer out by leaving a nice review!\n\nTerms of Use: https://megarama.net/terms-conditions/\nPrivacy Policy: https://megarama.net/privacy/\n\nDisclaimer:\nThe games are intended for an adult audience.\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes.  All references to money, coins, cash or winnings imply virtual currency only.\nPractice or success at social casino gaming does not imply future success at \"real money gambling.\"\n\nDOWNLOAD & SPIN NOW!",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Board"
  ],
  "contentRating": "17+",
  "released": "2017-10-19T06:52:49Z",
  "updated": "2020-04-09T09:35:39Z",
  "releaseNotes": "Hey Slots WOW ™ Game Lovers!\n\nThis update we have added couple of new features and improvements\n- Compete with Facebook friends on leaderboard\n- Added new world with subscription\n- Global Leaderboard optimisations\n\nEnjoy and have fun! As always, if you have any issues or suggestions for improvement, please send to support@megarama.net !",
  "version": "1.46.0",
  "price": 0,
  "developer": "Megarama Games Ltd",
  "score": 4.68224,
  "reviews": 642,
  "currentVersionScore": 4.68224,
  "currentVersionReviews": 642,
  "searchTerms": "slots"
 },
 {
  "appId": "com.funstage.gta",
  "title": "GameTwist Online Casino Games",
  "description": "Play some of the most legendary slots in the ultimate casino for Novoline slot machines! Enjoy Book of Ra, Sizzling Hot, Lucky Lady's Charm and many more popular slots & casino games in the GameTwist online casino! Play these exciting games whenever you want and wherever you are on your smartphone and tablet. In addition to slot machines, you can also play real casino classics such as roulette or blackjack! \n\nThe GameTwist app also provides you with a wealth of exciting Challenges to enjoy your favourite casino games and earn exciting rewards. From Spin Challenges to Stake Challenges and much more, spinning the reels is extremely rewarding on GameTwist! \n\nOne of the most popular features on GameTwist are our Leaderboard games that allow you to compete against other players in our community and fight for top positions and huge rewards! \nOr how about linked jackpots or promotions with Free Spins? There are many ways to have fun at GameTwist Casino!\n\nHere are just a few of our top titles:\n- Book of Ra™ \n- Faust™ \n- Lucky Lady’s Charm™ deluxe \n- Sizzling Hot™ deluxe\n- Roaring Forties™\n- Reel King™\n- Book of Ra™ deluxe\n- Dolphin’s Pearl™\n- Fruit Sensation™\n- Just Jewels™ deluxe\n- Dolphin’s Pearl™ deluxe\n- Ultra Hot™ deluxe\n- Lord of the Ocean™\n- Mystic Secrets™\n- Pharaoh’s Tomb™\n- Fruits’n Royals™\n- Golden Sevens\n- Fruits’n Sevens™\n- Golden Ark\n- Gorilla™\n- African Simba™\n- Katana™ \n\nAlso included in our gaming universe: \n\n+++ Legendary table games from Poker to Roulette to Blackjack +++ Hugely popular skill games like Pool and Solitaire +++ Bingo in a range of exciting variations +++\n\nAnd then there are our extra features: Daily Bonus (Wheel of Fortune game), Time Bonus, level system, VIP Club, special holiday promotions, leaderboard games, slot battles and much more! \n\nReady to become part of a vast community and take your gaming fun to the next level? \nThen get the GameTwist app now!\n\nPlease note: \nGameTwist is a free online game of chance for entertainment purposes only. It is not possible to win real money or real items/services/gifts or goods in kind by playing our slot machines. The virtual currency used in this game is called ‘Twists’ and can be purchased in the ‘Shop’ using real money. ‘Twists’ cannot be exchanged for cash or be paid out in any form. ‘Twists’ can only be used to play these games. The games are intended solely for an adult audience which is 18+ years.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2011-12-12T11:07:15Z",
  "updated": "2020-04-28T09:14:30Z",
  "releaseNotes": "Hi GameTwist Fans!\nHere's a new update with fixes to improve your game experience!\nEnjoy playing the GameTwist App? Then please consider rating us. Your feedback counts!",
  "version": "5.20.1",
  "price": 0,
  "developer": "Funstage Spielewebseiten Betriebsges.m.b.H.",
  "score": 4.58424,
  "reviews": 1751,
  "currentVersionScore": 4.58424,
  "currentVersionReviews": 1751,
  "searchTerms": "slots"
 },
 {
  "appId": "com.winkslots",
  "title": "Wink Slots: Real Money Games",
  "description": "REGISTER & GET UP TO 30 FREE SPINS!\nNew players. Register & get up to 30 Free Spins [FS]. 10 FS per day upon login, over 3 days (day 1: 99Time, day 2: White Wizard Deluxe, day 3: Sugar Train). FS must be claimed by 23:59 on day of grant & valid for 7 days once claimed. FS wins granted in bonus & capped at £4 per 10 FS (min win £1). Reg bonus wins capped at £100 exc. PJP wins. To withdraw games bonus & related wins, wager x30 the amount of the bonus. Wagering req. vary by game. Deposit balance can be withdrawn at any time. General withdrawal restrictions and full T&C's apply.\n\nSpin to win REAL MONEY with Wink Slots, the UK’s #1 home for live mobile slot games! Discover HUNDREDS of popular Slots and classic Casino Games with huge jackpots & generous offers. \n\nOption to win Real Money on your favourite games!\n- Enjoy a selection of over 700 Slot games \n- Get access to weekly promos and exclusive offers\n\nMobile Casino Games:\n- Whatever Casino game you like playing, we provide all your favorite Casino classics in one mobile app!\n- Casino lovers can enjoy a classic Casino Game or try their chances winning cash with Table Games. \n- Play live Casino Games like Roulette or Blackjack to continue your winning streak!\n\n18+: https://www.winkslots.com/legal-content/responsible-gaming\nBeGambleAware: https://www.begambleaware.org/\n\nSafer. Better. Together. Play responsibly within limits.",
  "genres": [
   "Games",
   "Board",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-02-11T12:07:09Z",
  "updated": "2020-04-20T13:39:22Z",
  "releaseNotes": "Bug fixes and performance improvements",
  "version": "1.0.23",
  "price": 0,
  "developer": "888",
  "score": 4.19502,
  "reviews": 241,
  "currentVersionScore": 4.19502,
  "currentVersionReviews": 241,
  "searchTerms": "slots"
 },
 {
  "appId": "com.xinxiangyin.zhijin",
  "title": "Slots Mega Win Casino Game",
  "description": "Play & enjoy Free Slot machine games! The wonderful slot game app on iPhone with large amount of welcome bonus 10,000,000 Free coins. Experience soul of Las Vegas slots with daily free coins, jackpots, and big wins.\nGet now and spin the AMAZING slots PAYOUTS with fantastic features – anywhere, anytime!\nFEATURES\n- Best online Casino slot machines: Ares legend, Diamond Super Wilds, Lightning Fortune of Zeus, Super Big Wheel and many more the Best Slots Games\n- 10,000,000 FREE Welcome Bonus Money!\n- Millions of FREE bonus coins delivered every hour!\n- Exciting Daily Wheel Bonus every day!\n- NEW and Super Hot slot games added regularly!\n- Attractive Designs, breath-taking animations, and Las Vegas Ambiance Sounds deliver Vegas Slots & Casino Experience anywhere",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-09-21T23:57:25Z",
  "updated": "2020-05-01T13:18:01Z",
  "releaseNotes": "A new update is here!\nThis update make our players have a better gaming experience!\n\nRemember to rate our Slots. We love to hear from our fans. Your enthusiasm is what keeps us going!",
  "version": "1.3",
  "price": 0,
  "developer": "Slots LLC",
  "score": 4.49157,
  "reviews": 830,
  "currentVersionScore": 4.49157,
  "currentVersionReviews": 830,
  "searchTerms": "slots"
 },
 {
  "appId": "uk.co.mrspin.slots",
  "title": "Mr Spin Slots",
  "description": "If you’re looking for exclusive mobile slots, multiplier mini-games, and huge progressive Jackpots you can’t find anywhere else, then the only place you need to look is here – the Mr Spin Slots App!\n\nDownload today on your iPhone or iPad, and unlock a world of colourful, exciting and magical mobile slots. This bumper app is home to all of your favourite Mr Spin classics such as Crocopot Slots, Platypult Prizes and Frankenstein Monster-Mash Up.\n\nSign up to Mr Spin Casino today, and you’ll receive up to 50 FREE SPINS* with NO deposit required! PLUS when you do make a deposit, Mr Spin will match it 100% up to £100!* \n\n•\tPlay Mr Spin’s exclusive mobile slots games all in one place\n•\tExciting mini-game and gamble features included in many games\n•\tHUGE progressive Jackpots waiting to be won\n•\tBet from 2p a line or play for free in demo mode\n•\tExclusive slots games you can’t play anywhere else\n•\tColourful mobile slots games that are easy to play \n•\t24/7 UK based customer support team\n•\tUp to 50 free spins and 100% deposit match welcome bonus for new players*\n\n\n**NEW FOR MARCH 2018**\n\nMr Spin has added SEVEN new games to the Mr Spin slots app for spring 2018!\n\nYou can now play Wild FunLand, Reel Royalty, Double Wild Wins, Hollywood Wins, Sweet Spinning Stuff, Jurassic Wins and Woodstock Slots! Download and play today, and get these – plus many more! – exclusive mobile slots from Mr Spin at your fingertips.\n\nIf a download bonus is available on this app, it is valid only once per person, device and registered household.\n\nPlayers must be 18 years or older and have a valid Mr Spin account to be able to place a bet with this app. Mr Spin Casino is a UK operated Casino owned by Intouch Games Ltd. It is licensed and regulated by the UK Gambling Commission.\n\n* 18+. New players only. Up to 50 locked free spins available to win via the New Player Bonus, usable on Reel Royalty only. Free spins locked to 2p bet over 10 win lines with winnings paid as bonus credit. This Bonus expires 14 days after player registration. 100% deposit match of first deposit, up to £100 and paid as bonus credit with a 1x wagering requirement. Bonus credit transferrable between games but is not withdrawable. T&Cs apply.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-06-29T11:48:59Z",
  "updated": "2018-10-01T11:14:49Z",
  "releaseNotes": "Improved layout and user experience.",
  "version": "1.0.7",
  "price": 0,
  "developer": "Mr Spin Limited",
  "score": 3.15902,
  "reviews": 654,
  "currentVersionScore": 3.15902,
  "currentVersionReviews": 654,
  "searchTerms": "slots"
 },
 {
  "appId": "com.gamesys.virgingamesslots",
  "title": "Virgin Games: Casino Slots",
  "description": "Everyone likes free stuff, so we’re giving you 30 Free Spins on our Double Bubble Slot when you play £10* at Virgin Games.\n\nDiscover the best Casino games, Poker tournaments and Slot machines, plus games you won’t find anywhere else. There’s also unmissable offers from the Virgin family, making Virgin Games the best online casino in the market.\n\nWhether you want the thrill of winning big money or just a bit of fun, you’re guaranteed to find a casino slot game or roulette table for you.\n\n- Enjoy POPULAR SLOTS like Rainbow Riches, Cleopatra, Da Vinci Diamonds, Pharaoh’s Fortune, Family Guy and Super MONOPOLY Money.\n\n- Play DAILY FREE GAMES like Search for the Phoenix or Doubly Bubbly to pick up CASH PRIZES or FREE SPINS. You just need your first deposit to be £10 or more.\n\n- Get the excitement of Vegas and win more with action-packed BONUS SLOT GAMES, Wild Symbols, Multipliers and FREE SPINS features.\n\n- Try all our MULTI-LINE slot machine games for FREE in Demo mode.\n\n- You could win a fortune playing PROGRESSIVE JACKPOT SLOTS.\n\n- Master classic table games like EUROPEAN ROULETTE, Roulette Streets of Gold, single deck BLACKJACK or Multiplayer Blackjack. There’s also Vegas Down Town Blackjack and Vegas Strip Blackjack for our thrill-seeking players.\n\n- Play INSTANT WIN games like Scratchcard Shop and Pillars of Fortune. \n\nPromotions\n - Buy into any Poker game to get a ticket into our exclusive ‘Chip and a Chair’ daily tournaments.\n\n- Discover exclusive offers from across the Virgin family, from holidays, to experience days, discounted train tickets, Virgin Media deals and much more.\n\nVirgin Games is a real money gambling app, featuring Roulette, Blackjack, table and Slot Machine games. \n\nAll customers enjoy 24/7 Customer Support and FAST withdrawals.\n\nAlready a member? Just download the app and log in with your existing details \n\nLike us on Facebook, Twitter or Instagram @virgingames\n\n18+ Please play responsibly. BeGambleAware.org\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits. \n\n*Welcome Offer\n1.\t30 Free Spins (1p coin size, maximum lines) for the game Double Bubble for new members only who: a) register; b) opt in to this promotion on first deposit of at least £10 (no retrospective opt in); and c) wager at least £10 in cash (“Qualifying Requirements”).\n2.\t30 days from when you make your first deposit and opt in to complete the Qualifying Requirements and play any Free Spins before they expire. Allow up to 72 hours for credit of Free Spins.\n3.\tOne promotion entry per member – no multiple accounts.\n4.\tYour deposit balance (if any) and any winnings related to either your deposit balance or the Free Spins are withdrawable at any time during this promotion.\n5.\tFull Welcome Offer Rules: www.virgingames.com/terms#welcomebonus",
  "genres": [
   "Games",
   "Casino",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2014-12-17T18:33:03Z",
  "updated": "2020-03-11T11:39:09Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.56012,
  "reviews": 9232,
  "currentVersionScore": 4.56012,
  "currentVersionReviews": 9232,
  "searchTerms": "slots"
 },
 {
  "appId": "slots.maniagames.jackpot.casino.magic.party.ios",
  "title": "Slots Casino - Jackpot Mania",
  "description": "Play casino games and enjoy casino slot games for fun – right at your fingertips! Time to enjoy real las vegas casino slots with bonus in this world favorite online casino slots.You can play Jackpot Mania slot games with bonus and play Vegas slot games offline. With exciting list of casino games straight from the casino, spin casino games online and win casino games slot machines bonus and more. Vegas fun never stops! Choose among our thrilling bonus slots and play those slot games with bonus spins to win even more!\n \n- Get 100 MILLION WELCOME COINS on first install!\nIf you love win big, Wild Jackpots, multipliers, mystery slot casino games then play Jackpot juegos de casino gratis 2020 and enjoy over $100,000,000 slots casino games welcome coins! And for all the slot maniacs out there who absolutely love juegos de casino gratis sin internet, this is the place you are looking for! Play mystery slots with bonus casinos games and achieve daily goals and win biggest quest jackpot in your favorite slot games with bonuses.\n\n- Top Features\n- No wifi games 2020 – Jackpot Mania is the games that don’t need wifi!\n- DOUBLE UP your online slots WINS every time by taking the chance and flipping the cards.\n- Best Vegas game collections - Glorious Buffalo, Forest of Pixies, Tiger Eclipse, Olympus and more \n- All slots unlocked for ALL and new slot machine casino games added every month!\n- Daily Goals for you to complete and get HUGE casino games bonus!\n- Exclusive and exciting slots only available in slotsvegas, and here!\n- Chance to win 10,000,000,000+ of world casino Jackpots in juegos de casino gratis tragamonedas 777 \n- Real casino games online designed by REAL Casino experts!\n- Special slots vegas casino bonus reward when you level up!\n\nExclusive slot machine casino games featuring beloved stars & bonuses\nWelcome to the BEST online casino slots game! A variety of high-quality slot games from Vegas exclusives to the latest unique one give you ultimate fun you may have never experienced! Like no other online casino, every slots games in Jackpot Mania Casino has its own jackpot like the all slots casino in land-based Las Vegas Casinos. Let us SPOIL you with massive casino slots bonuses! You’ll find the best slot machines to play and reap the  slots rewards with Slots of Vegas slot machines\n\nLarger-than-life jackpot wins\nLove real casino slots with bonus? Well, look no further! The BEST offline games are here! Play exciting Vegas-style slot machine games online or offline and watch the spinning reels reveal your BIG WIN as you hit the 777 slots JACKPOT! Jackpot Mania offers most thrilling Las Vegas casino slots that will have you coming back for more! Download Jackpot Mania slot games play offline today, choose your favorite slots  and let the winning begin!\n\nJackpot Mania is intended for adult audience for entertainment purposes only. Success at social casino slot gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-10-27T17:24:18Z",
  "updated": "2020-05-07T13:46:18Z",
  "releaseNotes": "1. New and exciting game and event!\n2. Improve performance!\n3. Fix bugs!",
  "version": "1.54",
  "price": 0,
  "developer": "GRANDE GAMES LIMITED",
  "score": 4.70465,
  "reviews": 1825,
  "currentVersionScore": 4.70465,
  "currentVersionReviews": 1825,
  "searchTerms": "slots"
 },
 {
  "appId": ".com.iwin.dealornodeal",
  "title": "Deal or No Deal",
  "description": "Try your luck in finding the $1,000,000 briefcase in the only officially licensed app based on the hit TV game show! The app now awards players with the opportunity to win BIG PRIZES daily. If you beat the Banker, your winnings will be entered into the sweepstakes of your choice which includes prizes like a TV or an iPad.\n \nDo you have what it takes to make the right deal or will you be left with nothing? Test your skills now. One question: Deal or No Deal?\n \n \n*****by Grams8  \n“Game is just like the TV game. Makes me just as nervous playing this game as it did when I watched it on tv. Love it!”\n \n*****by Lee Lee C09\n“FACT: This game is AWESOME!! Totally freaks me out every time I play and I love it!!!!”\n \n*****by Deedle03 \n“Very addictive game and fun to play. My kids also love it.”\n \n*****by Pink0413\n“I think this game is by far the best game I have ever played on a phone.”\n\nTHESE SWEEPSTAKES ARE DEVISED AS NON-GAMBLING PROMOTIONS and are intended solely for entertainment purposes.\n\nAPP AVAILABLE IN ALL 50 STATES: Alabama\nAlaska, Arizona, Arkansas, California, Colorado, Connecticut, Delaware, Florida, Georgia, Hawaii, Idaho, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Montana, Nebraska, Nevada, New Hampshire, New Jersey, New Mexico, New York, North Carolina, North Dakota, Ohio, Oklahoma, Oregon, Pennsylvania, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Utah, Vermont, Virginia, Washington, West Virginia, Wisconsin, Wyoming\n\nAPPLE, INC. IS NOT A SPONSOR NOR IS INVOLVED IN ANY WAY WITH THIS APP, NOR DO THEY ENDORSE THIS SERVICE OR SPONSOR, ANY PRIZE REDEMPTIONS.\n\nAlso note that this game optionally offers a subscription to join ALL ACCESS, which turns off ads and allows unlimited gameplay. If you opt to join the club, a $9.99 purchase will be applied to your iTunes account  on confirmation. You can try the pass out for 7 days for free.\n \nSubscriptions will automatically renew each month unless canceled within 24-hours before the end of the current period. You can cancel anytime with your iTunes account settings.\nFor more information, see our Terms (https://m.iwin.com/terms-of-service) and Privacy Policy (https://m.iwin.com/privacy-policy).",
  "genres": [
   "Games",
   "Family",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-12-18T20:22:36Z",
  "updated": "2020-05-11T17:38:38Z",
  "releaseNotes": "Minor stability fixes.",
  "version": "5.5",
  "price": 0,
  "developer": "iwin, Inc.",
  "score": 4.62906,
  "reviews": 709,
  "currentVersionScore": 4.62906,
  "currentVersionReviews": 709,
  "searchTerms": "slots"
 },
 {
  "appId": "com.bigfishgames.bfcasinouniversalfreemium",
  "title": "Big Fish Casino: Slots & Games",
  "description": "You must be 18+ to access this game.  This game does not offer gambling or an opportunity to win real money or prizes.  Practice or success at social gaming does not imply future success at gambling.\n\n------------------\n\nDownload now! New players get 100,000 FREE BONUS CHIPS in the #1 FREE to play Casino app in the world! Over 65,000 5-star reviews!\n\nBig Fish Casino gives you the chance to WIN BIG in Slots, Blackjack, Texas Hold'em Poker, Roulette, and more! Play live with your friends, with all the thrill of Las Vegas! Sit down, relax, have a drink & some chips – on us. We've got gorgeous games and millions of friendly people to play with for FREE!\n\nMake a fortune with HUGE Jackpots, Free Daily Games, Slots Bonus Games, and more! Will you play it safe and hold your cards, or double down and get a lucky ace? Over 16 BILLION chips in Jackpots given out each day!\n\nHave an adventure like no other in our original Slot Machines! Hit Flaming 7's for multiple jackpot levels in Jackpot City! Hunt for clues to uncover a huge win in Sherlock Mysteries! Fortune awaits those brave enough to enter the Enchanted Cavern…\n\nTOP FEATURES: \n• Exciting slot machines with FREE SPINS and Bonus Games you won't find anywhere else!\n• Everybody wins together in our unique Social Scatter™ Slots Games!\n• Win up to 1 MILLION chips in our Reward Center games!\n• Daily FREE game and bonuses could win you up to 65k FREE Chips just for logging in!\n• Play LIVE with your friends! Beat the house in Blackjack or test your skills in Poker! \n• Customize and strut your stuff with free pets, gifts, and power ups! \n\n--------------------- \n\nQuestions? Suggestions? Contact us at www.bigfishcasinosupport.com!",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-12-17T20:03:18Z",
  "updated": "2020-03-23T17:03:04Z",
  "releaseNotes": "•Minor bug fixes. \n•Don’t miss out on the upcoming Easter Treasure Rush!",
  "version": "12.2.8",
  "price": 0,
  "developer": "Big Fish Games, Inc",
  "score": 4.573,
  "reviews": 8972,
  "currentVersionScore": 4.573,
  "currentVersionReviews": 8972,
  "searchTerms": "slots"
 },
 {
  "appId": "com.paddypower.vegas",
  "title": "Paddy Power Vegas | Slots",
  "description": "Say Hello to our spanking new Paddy Power Vegas App!  \nNew Customer Offer – 50 Free Spins to Try our new Vegas Tournaments Slots! T&C’s Apply\nPaddy Power Vegas app brings together all your favorite online slots in one place. In true Vegas style we have made these slots bigger and better than ever before –  by creating action packed Vegas Slots Tournaments just for you! \nFeel the adrenaline of playing Rainbow Jackpots or Dragon’s Luck against your peers in the race to reach the top of the leaderboard. Free spins and cash prizes up for grabs in each Tournament and we have multiple tournaments taking place daily!\nIf that wasn’t enough we also have Vegas Daily Jackpots, exclusive Vegas Slots, Vegas Online Roulette, and Vegas Blackjack!  \nHow do I start playing Paddy Power Vegas Tournaments?\n1.\tDownload the Paddy Power Vegas App\n2.\tBrowse the Tournaments and choose what Tournament you would like to enter\n3.\tClick join and wait until the start time, don’t worry we will remind you!\n4.\tPlay until your spins or time runs out\n5.\tKeep an eye on the leaderboard to see your position\n6.\tRedeem any prizes you may have won\n7.\tIt’s as simple as that\n*Terms and Conditions apply for each Tournament*\nFeatures:\n•\tWhether you’re a slots expert or novice our Tournaments are easy to use, on the go or at home and are a lot of fun!\n•\tYou can play on iPhone and iPad  \n•\tExisting and new players can play anytime, anywhere with their Paddy Power username and password\n•\tQuick to load and easy to navigate \n•\tDeposits can be made securely through the app\n•\tWorks with 3G/4G connection as well as Wi-Fi \n•\tAward winning customer service, available 24 hours per day 7 days a week\n\n50 Free Spins T&C’s\nYou will receive 50 Free Spins for use on eligible Paddy Power Vegas Tournament Slots. The free spins each have a value of £/€0.20.\n\nOpt in on our Paddy Power Vegas site and supply a valid telephone number that is capable of receiving an SMS. You will then be sent a validation code to that phone, which you must enter on site to redeem the free spins. Offer available to new PP customers in the UK & Ireland who have a valid mobile number. Once you have completed using the bonus, you will begin staking real cash. Offer is strictly one per customer.\nOnce you accept the offer, your free spins will be added to your account and will remain there until you complete it or it expires, which will be 10 days from receipt of the offer.\n•\tWe reserve the right to withhold any withdrawals and/ or confiscate all winnings for irregular play\n•\tOnly one bonus is available per customer\n•\tIf a Player is ineligible, PP reserves the right to withhold payment of the prize\n•\tEntry will be forfeited if players are found to have multiple accounts\n•\tWe reserve the right to modify, alter, discontinue or terminate this promotion at any time for any reason without notice to players\n•\tIn the event of any dispute, our decision will be considered final.\nSome Points to note:\nPlease note this app is available to play for customers in the UK and Ireland only and you must be over 18 years of age.\nPaddy Power Vegas is a product of the Paddy Power PLC, one of Europe’s largest gaming groups listed on the UK and Irish stock exchanges. We’re fully licensed and regulated by Alderney Gaming Control Commission. \nStandard Terms and Conditions apply.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-12-10T13:29:24Z",
  "updated": "2018-12-10T13:29:24Z",
  "version": "5.0.5",
  "price": 0,
  "developer": "Paddy Power PLC",
  "score": 2.625,
  "reviews": 8,
  "currentVersionScore": 2.625,
  "currentVersionReviews": 8,
  "searchTerms": "slots"
 },
 {
  "appId": "com.ftxgames.twdslots",
  "title": "The Walking Dead Casino Slots",
  "description": "Grab your survival tools and suit up for battle alongside legendary survivors from AMC’s The Walking\nDead in this official mobile slots game. The Walking Dead: Casino Slots will throw you headlong into an immersive, post-apocalyptic world with deep gameplay and stunning graphics. Your objective is to win all of the money… and survive long enough to spend it!\n\nSpin your way to riches on multiple, Las Vegas-style slot machines with mini-games, limited-time events,\n hourly and daily bonuses, endless ways to win credits, and FREE spins galore! Score DAILY CREDIT BONUSES just for logging in, and get a FREE Resource Chest after collecting 5 daily login bonuses!\n\nOn top of the monstrous amounts of loot to rack up, ongoing Heroic Seasons give players the opportunity to win a staggering number of collectible heroes ranked from Common to Epic. Heroes include Michonne, Glenn, Ezekiel, Carl, Jesus, Morgan, Carol, and many more. Send your heroes on supply runs to collect valuable resources, and use Resource Chests to level up each hero for the ultimate credit payout!\n\nEach top-quality slot machine immerses you in classic moments from the series like Rick and Negan’s epic battle in “Showdown”! Relive other iconic moments on machines including:\n\n\nThe Hospital\n● Go back to where it all started and help Sheriff Rick Grimes break free from the hospital where he was left for dead.\n\n● Match Wild “Don’t Open, Dead Inside” doors to rack up huge wins, BONUS SPINS, and fill up Rick’s health bar.\n\n● Fill Rick’s health bar all the way to escape the hospital, triggering a bonus pick-game that lets you loot your way out of the hospital collecting gigantic payouts along the way.\n\nThe Prison\n● Featuring fan-favorites Glenn, Carl, Michonne, and Rick.\n● Collect Sheriff Badges to trigger the progressive mini-game “Clear the Yard”, where you’ll fight your way through The Yard and three cell blocks with increasing multiplier bonuses and millions of credits to be won!\n\n● Includes an additional “Go Wild” bonus game that lets you choose one of two ways to win big.\n● Fill the entire board with Sheriff Badges for the GRAND JACKPOT!\n\nSurvivors\n● Choose your survivor to go against the walker horde: Michonne, Daryl, Morgan, or Carol.\n● Fill the first column with your chosen hero to trigger FREE RESPINS!\n● Collect bullets to fill up your clip, triggering a unique mini-game where you’ll team up with the rest of the survivors to spin your way to enormous payouts with multiplier bonuses.\n\n\nDon’t let your guard down, because there’s always a walker—and a new way to win—right around the corner:\n\n.\n● Limited-Time Events: Be prepared to take on the challenge of limited-time events for the ultimate payouts.\n\n● Mini-Games: Spin to win on multiple levels, with mini-games that open up new bonuses and endless ways to win big.\n\n● PvP Tournaments: Compete in timed spin-offs to see who will survive, and who will thrive.\n● Collectible Heroes: Ongoing heroic seasons will give players the chance to win up to 8 iconic heroes from The Walking Dead each season.\n\n● Resource Chests: Complete special objectives to win Resource Chests loaded with XP bonuses to level up your heroes.\n\n● Level Up: Gain experience to level up each collectible hero for bonus loot, including a huge coin  onus when you max them out at level 5.\n\n● Supply Runs: Send your Heroes out on scouting runs to collect valuable resources.\n● New Slot Machines: Stay tuned for more ways to play, because new slot machines, mini-games, and bonus events are constantly on the way!\n\n\nDisclaimer:\n- This game is intended for an adult audience.\n- This game does not offer “real money gambling” or any opportunity to win real money or prizes.\n- Practice and success at social casino games does not imply future success at “real money gambling”.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2018-12-06T18:42:18Z",
  "updated": "2020-04-22T21:23:40Z",
  "releaseNotes": "New Machine: Farm\nCome on down and help out the survivors on Hershel's Farm! This vibrant and colorful machine is filled to the brim with TRAVELING WILDS that cause chain reactions for HUGE WINS! Or Reveal your reward with upgraded FREE SPIN MULTIPLIERS or WILD MULTIPLIERS! Last but not least win up to 100X your bet on the Watch Wheel!\"\n\nNew Mega Event: FACTIONS Card Album Complete each scene from the television show and win GIGANTIC JACKPOTS! The event is only here for a limited time!",
  "version": "200",
  "price": 0,
  "developer": "FTX Games Ltd",
  "score": 4.7619,
  "reviews": 378,
  "currentVersionScore": 4.7619,
  "currentVersionReviews": 378,
  "searchTerms": "slots"
 },
 {
  "appId": "com.jawahar.CrazySlot",
  "title": "Lucky Slots©",
  "description": "Enjoy a relaxing day at the beach with our newly-updated \"Lucky\" themed Slots game. You'll spin on fun reels that incorporate loose algorithms that ensure that you win! Regular bonuses throughout the day provide credits to the player so that they can continue their session. We've also added a 2x Multiplier bet for players who wish to double their winnings! Here are a few of the additional changes we made to this version:\n\n-A new user-interface with bigger, easier to use buttons.\n-Two new Slots games, \"Sea Dreams\" and \"Fun Deluxe\".\n-Fewer ads for a smoother game play experience.\n-Loosened reels to ensure players receive a fun experience.\n-New art content throughout the app to immerse the player in the rooms!",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2011-06-11T04:49:31Z",
  "updated": "2020-01-27T23:07:41Z",
  "releaseNotes": "Updates to improve app performance.",
  "version": "4.0",
  "price": 0,
  "developer": "Slots Win",
  "score": 5,
  "reviews": 4,
  "currentVersionScore": 5,
  "currentVersionReviews": 4,
  "searchTerms": "slots"
 },
 {
  "appId": "HoF-Slots",
  "title": "House of Fun™ - Slots Casino",
  "description": "** The Hottest Casino Game of 2020 **\nGrab 100 FREE SPINS: Experience House of Fun\n\nFROM THE CREATORS of Slotomania slots casino, House of Fun is full of 777 slots just waiting for you to get playing and get rewarded!\n\n100 FREE SPINS waiting for you with even MORE 777 casino slots rewards, bonuses, and prizes! \n\nEXPERIENCE the thrill of slot machines directly from the Strip’s most renowned slots casinos: Caesars, Rio, Flamingo, Harrah’s, Bally, Horseshoe, Planet Hollywood, The Mirage, MGM Grand, Bellagio, and more.\n\nSPIN the hottest Vegas casino fruit machines and collect legendary chests! It’s non-stop fun!\n\nHouse of fun is bringing back its Album, but this time it's bigger and better! \nComplete the new 2nd edition HOF Album collection and enjoy amazing bonuses.\n\nWith 20+ million players worldwide and counting - step right up and experience House of Fun casino slots - even MORE slot machines added with every update and hundreds of jackpots await you! \n\nFrom the heart of Vegas to you: experience the thrill of slot machines directly from the Strip’s most renowned slots casinos: Caesars, Rio, Flamingo, Harrah’s, Bally, Horseshoe, Planet Hollywood, The Mirage, MGM Grand, Bellagio, and more await you in House of Fun! \n\nNew Casino Slots 777 Tournaments and HOT Slot Games\nHouse of Fun just got even more AWESOME fun slots: check out the monstrous new Monsterpedia  - an epic rewarding collection of 4 linked slots games with an exciting bonus card collection! \n\n100 FREE spins waiting for you with even MORE 777 casino slots rewards, bonuses, and prizes!\n\nSpin the WHEEL OF FUN every day and get your DAILY FREE COIN BONUS ….and don't forget to check your HoF mailbox for even more fun surprises and other slots gifts! \n\nFor a fully immersive casino experience, play HoF anytime anywhere at https://www.houseoffun.com/\n\nMake sure you grab your Playtika Rewards, formerly known as Total Rewards, available across all epic Playtika games!\n\nEven MORE Fun Awaits You on Facebook: be a Funster!\nFollow us on Facebook and Twitter for exclusive coins offers and bonuses: http://www.facebook.com/houseoffungames | http://twitter.com/houseoffungames\n\nVisit https://www.playtikarewards.com to learn more about our very own Playtika Rewards (formerly known as Total Rewards and Slotomania Rewards).\n\nEnjoy playing our free casino games? Please rate us, your feedback counts!\n\nThis game is intended for an adult audience (21+) for amusement purposes only and does not offer ‘real money’ gambling, or an opportunity to gamble or win real money, cash or prizes based on game play. Playing or success in this game does not imply future success at ‘real money’ gambling or any gamble-related venture, online or offline.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-02-18T19:48:37Z",
  "updated": "2020-05-05T15:39:54Z",
  "releaseNotes": "We’ve just added more FUN to HOUSE OF FUN with new games, amazing features, and updates to bring your HoF experience to another level! \nV 3.57\n- New slot machines: Guardian of Fire\n- Play our new, exclusive challenges for a great casino experience and huge coin fortunes up for grabs \n- Bug fixes, performance improvements and more surprises to enhance your House of Fun experience \nUpdate now and keep spinning! \nLike us? Please rate us! Your feedback is important!",
  "version": "3.57",
  "price": 0,
  "developer": "PLAYTIKA UK - HOUSE OF FUN LIMITED",
  "score": 4.61811,
  "reviews": 13056,
  "currentVersionScore": 4.61811,
  "currentVersionReviews": 13056,
  "searchTerms": "slots"
 },
 {
  "appId": "com.topultragame.slotlasvega",
  "title": "Cash Tornado Slots - Casino",
  "description": "Cash-in on a splendid casino fantasy and the most innovative Vegas slots game to-date – Cash Tornado Slots! Grab 5,000,000 FREE COINS to enjoy incredible fun slot machines, explosive JACKPOT payouts, exciting in-game features and thrilling casino community events. Spin away to marvel in huge winnings beyond your wildest imagination! \n\nWith Cash Tornado Slots, experience authentic casino slots from world-class casino. Earn amazing Free Spins and Scatter Features to experience massive fantastic bonus rounds. Unlock brand new and entertaining game play, such as Lock & Spin or Vegas Lightning, to revel in even more winning styles, and spin your way to a Wild slots paradise with endless free coin rewards and countless slots mini-games! Accept the invitation of Cash Tornado Slots to start cashing-in on golden prizes, each day, every day! \n\nCash-in and spin with multiple exciting free bonuses and hours of fun!\n▶Fabulous daily, hourly and quarterly coin bonuses. \n▶Endless stacks of WILD multipliers to increase total winnings.\n▶Premium selections of the hottest slot themes on the Las Vegas Strip.\n▶Addicting seasonal quest collections and daily power challenges.\n▶Authentic in-game music and sounds for immersive casino game experiences.\n▶Striking graphics, dynamic effects and realistic slots gameplay. \n▶Adventurous slots journeys to partake you in a trip around the world. Keep Spinning! \n\nSneak a peek at the huge varieties of slots collection and  larger-than-life jackpot from Cash Tornado Casino!\n▶ Full of lucky spinning and epic wins, catch up with your Magic Gold hidden at the end of rainbow in free games, up to 20 bonuses! \n▶Enter into Tarzan Battle slots and wreath in a jungle of fortune and wealth.\n▶Play peekaboo with our lovely baby panda at Panda Riches slots! The maximum coin value of bonus here can be up to 200x!\n▶Become the deep sea’s protector in The King of Atlantis slot machine! Lock & Respin, clench your golden gaff and fight for the massive win! \n▶Enter the heaven of fortune and hold back your breathe for collecting countless coins at Panda Bless slot game!\n▶Spend the endless bright nights with wolf pack! Press the Howling Moon and get the reward coins ranging up to 50x the total bet at Howling Moon slot machine!\n▶Want something juicy to cash-in on? Spin and lock away a fortune of millions in Cherry Splash slot game.\n\nCash Tornado slots is just getting started! Tune in each week to experience the newest slot games and features! \n\nQuestions or comments? \nFeel free to contact our support team through the “Contact Us” tab in Game Settings\n\nDisclaimer:\n- The slots game is intended for adult audiences over the age of 21 and is for entertainment purposes only.\n- The casino game does not offer real money gambling or an opportunity to win real money or prizes.\n- Any success in social casino gambling is not indicative of future success at real money gambling.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2020-03-28T07:00:00Z",
  "updated": "2020-04-25T21:01:58Z",
  "releaseNotes": "Friends of Cash Tornado! Ready for new update with:\nFix game bugs and game improvements!\nExperience the thrill of REAL Vegas casino slot machines! \nPlay authentic slot machines, the most popular casino games in the world!",
  "version": "1.0.7",
  "price": 0,
  "developer": "Madness Limited",
  "score": 4.93506,
  "reviews": 154,
  "currentVersionScore": 4.93506,
  "currentVersionReviews": 154,
  "searchTerms": "slots"
 },
 {
  "appId": "com.playtika.caesars.videoslots",
  "title": "Caesars® Casino Vegas Slots",
  "description": "** The Best Free Slot Machines Vegas has to Offer **\n\nFrom Las Vegas casinos, straight to you: experience the thrill of slot machines directly from the Strip’s most renowned slots casinos.\n\n•\t100 free spins when you start playing! \n•\tFREE daily coin bonuses\n•\tHOURLY extra bonuses!\n\nAnd so much more. Experience all the best casino slot machines in Caesar’s Palace!\n\n** The NEW Legend of the 4 Kingdoms Album! **\n\nThe players have voted and The Legend of the 4 Kingdoms is back by popular demand! Isabelle needs your help to restore the crown jewels from her evil sister Tayanna! Do so by finding Gryphixes to help defeat the guardian and successfully unlock all four kingdoms! Be sure to collect items along the way! \n\n** Official Slot Games from Caesar Casino - And More! **\n\nEnjoy all the thrills of Vegas’ casino floors in one official app! Be instantly transported thanks to the look and feel of actual Caesar Casino slot machines! \n\n•\tOver 100 slot machines, including popular casino games from the likes of Harrahs Casino, Ballys Casino, Horseshoe Casino, Planet Hollywood Casino and Flamingo Casino!\n•\tEven MORE casino games added with every update! \n•\tEnjoy fun Legacy Rewards - spin the bonus wheel, guess the Vegas trivia and win big bonuses! \n•\tEarn Playtika Rewards for playing each Playtika 777 casino slots (including Slotomania Casino) and casino game (House of Fun and more)! \n\n** Play Free Slots in a Luxurious Free Casino Experience **\n\n•\tPlay the highly popular AZTEC JUNGLE slots game with endless JACKPOTS!\n•\tBe enchanted with BIG WINS on the Vegas casino Cleopatra slots game.\n•\tHowl for the win in WILD HOWL, the slots that keeps on giving.\n•\tClaim the casino slots throne with endless wilds on the KING’S THRONE slot machine!\n•\tMore than just casino slots! Play the new Pachinko Machine - Ultra Zone!\n\n** Make Your Slots Game Social with Caesar Slots! **\n\nFollow Caesar Free Slots & casino games on Facebook & Twitter for free offers and exclusive coin packages\nFacebook: https://www.facebook.com/caesars\nTwitter: https://twitter.com/caesarsgames\n*Contact us whenever you want, about whatever need. Playtika has an award winning support team, available to help you hit the Vegas 777 jackpot and WIN BIG! \n\nThis game is intended for an adult audience (21+) and does not offer ‘real money’ gambling’ or an opportunity to win real money or prizes. Practice at social gaming does not imply future success at ‘real money’ gambling.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-06-13T07:00:00Z",
  "updated": "2020-05-09T12:24:28Z",
  "releaseNotes": "Bug fixes and performance improvements",
  "version": "3.54.1",
  "price": 0,
  "developer": "Playtika LTD",
  "score": 4.66363,
  "reviews": 2411,
  "currentVersionScore": 4.66363,
  "currentVersionReviews": 2411,
  "searchTerms": "slots"
 },
 {
  "appId": "com.idorweb.viz-showtime",
  "title": "VIZ Showtime - The Real Pub Fruit Machine",
  "description": "Roger Mellie, the Man on the Telly lands with his gameshow themed fruit machine, VIZ Showtime, on the iPhone and iPad in glorious free to play 3D. Based on the real pub fruit machine of the same name, it packs a punch with a stack of features. If you like your slots games and your fruit machines, you’re gonna love this.\n\nFeatures include:\nThe skill based features are piled high with TV Trumps, On The Box, Chain Reaction, Stella Vision, Golden Nuggits and a load more besides.\nHot features include Morning Glory, Cash Convoy, Razzle Dazzle, Mellie’s Money amongst others, topped off with Roger’s Big Deal, the big money feature.\nBonus Squares, Mystery Squares, Feature Trails, Cash Trails and more await.\nHead for the Big Prizes in Roger’s Big Deal, a decision based game where only the canny hit the jackpot.\nFree to play multiplayer games are there for you to test your skill against friends and other players online (Requires a free to register Game Center account).\nOnline/Offline Trophies - A whole load of in-game achievements are there for the taking.\nOnline/Offline Highscores - On the Bank Run you have 10 minutes to cash out with as much virtual cash as possible.\nFree Gameplay Credit - Run out of credit? You’ll get free virtual credits to play with every day (Requires an online connection) and extra free virtual credits every day via the online multiplayer games!",
  "genres": [
   "Games",
   "Entertainment",
   "Casual",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-04-14T15:40:44Z",
  "updated": "2015-01-29T04:00:29Z",
  "releaseNotes": "Fixes an issue on iOS8 with the local/online multiplayer games, which resulted in the invitation screen not being displayed.",
  "version": "1.32",
  "price": 0,
  "developer": "Idor Interactive Ltd.",
  "score": 4.02572,
  "reviews": 311,
  "currentVersionScore": 4.02572,
  "currentVersionReviews": 311,
  "searchTerms": "slots"
 },
 {
  "appId": "com.gamesys.sunbingo",
  "title": "Sun Bingo",
  "description": "The Sun Bingo app brings you the very best games straight to your tablet or mobile phone. We offer an exciting variety of games, including 90 ball, 80 ball and 75 ball bingo, Slot Games, Instant Win Games and favourites such as Winning Headlines, Mystic Meg, Clover Rollover and more.  Choose your game, chat with fellow players and enjoy a huge variety of games 24/7.\n\nDownload the app now to check out our great offers, or enter one of our regular giveaways where you could bag a fantastic prize! \n\nAt Sun Bingo we’re really proud of our amazing community of players, and we’re always updating and improving our offering to make us the best bingo site around. Download the app and not only will you be part of a very special bingo community but you’ll get to enjoy all of these games: \n\n-  90, 80, 75 ball bingo games every day \n-  1TG and 2TG games which award a share of a prize pot to all players with either 1tg or 2tg bingo tickets when house is called, creating more winners every day. \n-  Roll on Bingo creating up to 20 more winners, this feature means that once house is called the game keeps playing until all Roll On prizes have been won. \n-  BOGOF ‘You buy one, you get one free’. It does exactly what it says on the tin! Buy one bingo ticket and get another bingo ticket free. Available every day. \n-  Superbooks: a really special game that allows you to either play for free or trade up, at a small cost, for the chance to win much bigger prizes.\n-  Last Chance Saloon: a free scratch card that is given to all players that purchased 6 tickets or more and didn’t win a prize in the game. With this scratchcard you could win a bingo bonus to play on any bingo game. \n-  50+ Slot Games including Winning Headlines, Mystic Meg, Clover Rollover, Dynamite Digger and other player favourites\n-  Chat Hosts 24 hours a day \n\nSo what are you waiting for? Play our fantastic games in The Sun Bingo app, all delivered to your fingertips by the nation’s favourite daily newspaper, Sun Bingo is fun Bingo.\n\nTerms & Conditions\nNew customers who successfully register and verify a SunBingo.co.uk account through this APP, validate account via SMS, and enter the unique bonus code will receive a £10 Bingo Bonus Players are required to wager their £10 bingo bonus amount 4 (four) times. You must wager in total £10 x 4 wagering = £40 to meet the wagering requirements. the £10 bingo bonus is for the Jewels bingo room. Games play from 06:00 – 02:00 daily. 10 games per hour. Players that qualify for the free £10 bingo bonus can win the following cash prizes in the Jewels bingo room, per game:\n90 ball games: 1 Line: 50p, 2 Line: £1, FH: £1.50.\n75 ball games: £1 per line – 5 lines\n\nThe bonus shall expire 7 days after issue time. If wagering has not been completed by then, the entire bonus balance (bonus + pending winnings) shall be removed. 1 bonus per player only.\n\nT&Cs apply. 18+ Begambleaware.org  Full promotional terms apply: https://www.sunbingo.co.uk/promotions/10freebingo/",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2014-05-09T09:04:15Z",
  "updated": "2019-07-24T12:25:44Z",
  "releaseNotes": "Minor bug fixes.",
  "version": "4.21.0",
  "price": 0,
  "developer": "Playtech Bingo",
  "score": 4.25641,
  "reviews": 273,
  "currentVersionScore": 4.25641,
  "currentVersionReviews": 273,
  "searchTerms": "slots"
 },
 {
  "appId": "net.flysher.rockncash",
  "title": "Rock N' Cash Casino Slots",
  "description": "Join the hippest slot game app, Rock N' Cash Casino. Experience the joy of WINNING Huuuuge with amazing Vegas Slots. Play Unique and Authentic CASINO SLOT games for free, Experience TRENDING Vegas casino features with crazy PAYOUTS. Get FREE Chips daily, Attend a tournament and Celebrate your Big Wins with friends.\nIndulge in the pleasure of playing the most Spin-tastic online slot machines, From Classic Vegas Casino games to trending video slots. Match 777, scatter symbols, Spin a high score and win a progressive jackpot.\n\nThe Best online slot machines in the world!\n•Fiery 7 - Try your Luck with the Good old Vegas 777 Slots!\n•Wheel of Jackpot - Spin Wheels for biggest Jackpot of your life!\n•Super Ball Keno - Top Vegas Classic Slots you know and love!\n•Wild Wild Buffalo - Go Wild with an epic rewarding Buffalo slots games with FREE SPINS!\n•Fortune Diamond- Rekindle timeless thrills with Pot Game X Diamond Match.\n\nFree coins daily\n•Spin the Daily Wheel for daily Coin Bonuses\n•The Ever-stacking Piggy Bonus\n•Stamp you way to Day 7 for a huge Coin Bonus Everyday!\n\nBecome a VIP and enjoy great rewards!\n•All Purchases are boosted by a multiplier\n•More Free coins from daily Bonuses\n•More value from friend gifts\n•Daily VIP Exclusive Coin gifts\n•Access the EXCLUSIVE VIP Lounge\n\nIt's never late to play the best casino game, JACKPOT & MEGA WIN every moment!\nStay Social! Celebrate your Big Wins with friends. NEVER BE ALONE! Join our SUPER\nEXCITING SLOT TOURNAMENT cash race everyday! Win and collect huge prize winnings!\n\n1,000,000 FREE COINS Welcome Bonus on first install!\nPlay anytime anywhere, variety of bonus games and features - Become a Winner!\n\nDownload Rock N' Cash Casino app today!\nYou’ll discover an incredible world of Slots and casino games!\n\nJoin a community of Rock N' Cash Casino at our Fan Page (www.facebook.com/rockncash) and at our Instagram page (www.instagram.com/RockNCash)\nTell all your friends about what’s hot! You’ll be in the know when you play Rock N' Cash and be the envy of them all when you hit that winning JACKPOT!\n\n*ROCK N’ CASH CASINO is intended for use by those 21 or older for amusement purposes only.\n*ROCK N’ CASH CASINO does not offer real money gambling or an opportunity to win real money or prizes.\n*Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-03-14T16:43:50Z",
  "updated": "2020-04-29T09:35:55Z",
  "releaseNotes": "Hi RNC Fans,\nCome check out on RNC's Brand New Slots, Bigger Prizes and HUGE FUN!\nA newer, better, and richer Rock N' Cash is now available. Happy Spinning & Good Luck!",
  "version": "1.38.6",
  "price": 0,
  "developer": "Flysher Inc.",
  "score": 4.65292,
  "reviews": 461,
  "currentVersionScore": 4.65292,
  "currentVersionReviews": 461,
  "searchTerms": "slots"
 },
 {
  "appId": "com.longmen.nova",
  "title": "Slots Casino-Casino Slots Game",
  "description": "Here is the most interesting online entertainment Casino with excellent value and free spin.We provide massive free entertainment and unforgettable gambling experience.Make a fortune overnight,be a millionaire,what are you waiting for?Download it right now!\n\nDownload Nova Casino right now,and enjoy the benefit below\n\t-Get extra coins every 2 hours\n\t-Each slot machine provide free spins to increase revenue\n\t-Daily spin would win millions of casino rewards\n\t-Each spin may give you the real experience as in a gambling house\n\t-The more chip in,the higher the odds,huge win slot machines with special features.\n\nRe-raise or not,hold on to the last or just give it a try? Go for bigger adventure or slide off when you are in good luck,depending on your intelligent judgement.\n\nThere are massive slot machine with different features and enormous rewards.Just roll the spin and get excellent rewards,infinite expectation,endless stimulus.Come on!Play and win big rewards in the funniest casino of this century -- Nova Casino!\n\n\"nova casino\" is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not \nreward real money prizes, nor does it guarantee success at real money gambling.\n\nJoin the conversation! Find us on Facebook: https://www.facebook.com/Nova-Casino-Community-1981184685429363/",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2017-08-25T01:40:35Z",
  "updated": "2019-02-26T03:42:30Z",
  "releaseNotes": "Fix bug",
  "version": "1.0.14",
  "price": 0,
  "developer": "DRAGON GATE GLOBAL CO., LTD",
  "score": 4.96486,
  "reviews": 683,
  "currentVersionScore": 4.96486,
  "currentVersionReviews": 683,
  "searchTerms": "slots"
 },
 {
  "appId": "com.partycasino.casino",
  "title": "PartyCasino: Play Casino Games",
  "description": "Play all of your favourite REAL MONEY CASINO GAMES at PartyCasino, including SLOTS, BLACKJACK, ROULETTE, baccarat and INSTANT WIN games. Slick and easy to use, play anywhere, anytime using your iPhone or iPad.\n\nLOVE SLOTS?\nPlay over 1,500 slots and jackpot slot games including BUFFALO BLITZ, STARBURST, THUNDERSTUCK, ALIENS, CLEOPATRA, SOUTH PARK, WOLF RUN, BOOK OF DEAD and RAINBOW RICHES, or any of our many progressive jackpot slots like MELON MADNESS, BOOK OF MYTHS and MEGA FORTUNE WHEEL. All jackpots increase daily, with some reaching over £2 MILLION.\n\nLIVE CASINO\nGet even closer to the thrill of an authentic casino by playing a wide selection of table games in our LIVE CASINO suite. Powered by live casino specialists, Evolution Gaming, we have titles like Speed Live Roulette, Blackjack, Casino Hold’em and Baccarat.\n\nPLAY TABLE GAMES\nAre you a BLACKJACK whizz? Play one of a dozen blackjack variations, including Pro, Hi Lo, Charlie 7 or a live dealer version in our LIVE CASINO. We also have a choice of ROULETTE games to play on the go, from American to European and LIVE ROULETTE.\n\nINSTANT WIN GAMES\nLove INSTANT WIN games? Download the app to play over 50 different instant win games, from SLINGO, SUPER CASH BUSTER and BREAKING BAD to CLEOPATRA, GHOST BUSTERS and WHEEL OF FORTUNE.\n\nBONUSES AND PROMOTIONS\nAt PartyCasino, you can look forward to a personalised selection of easy-to-understand promotions, including WELCOME BONUSES, RELOAD BONUSES and FREE SPINS.\n\nBECOME A VIP\nHere at PartyCasino, we believe that our most valued players deserve the best possible rewards. That’s why we’ve set up an exclusive VIP SCHEME to bring them all of these personalised benefits and more:\n• bespoke bonuses\n• gifts and rewards\n• exclusive VIP events\n• personal account manager\n• dedicated 24/7 support\n• tailored cashier service\n\nGET CASHBACK\nOur new and improved CASBACK SCHEME provides instant, easy to claim REWARDS that build up every time you place a real money wager.\n\nSo what are you waiting for? Download the all new PartyCasino app for the ultimate casino experience.\n\nFor the best offers, follow us on social media;\n\nFacebook: facebook.com/partycasinouk/\nBlog: casino.partycasino.com/en/blog/\nTwitter: twitter.com/partycasino\nInstagram: Instagram.com/partycasino\n\nCUSTOMER SERVICE\nAt PartyCasino, we pride ourselves on our friendly and responsive customer service team, who are on hand 24/7 to answer any questions or issues you may have. Making a deposit is super quick and easy and if you win, cash outs are super-fast, so you will receive your winnings in no time at all.\n\nResponsible Gambling\n18+ T&Cs apply. begambleaware.org. Play responsibly.\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org\n\nLicensing \nPartyCasino operates under licence and in accordance with applicable laws and regulations.  For further licence information, please visit our website at www.partycasino.com.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-06-29T02:22:27Z",
  "updated": "2020-05-05T06:48:08Z",
  "releaseNotes": "In this version of PartyCasino, we've fixed some bugs, made load times faster, and improved overall app performance. We hope you like it!",
  "version": "20.04.06",
  "price": 0,
  "developer": "ElectraWorks Limited",
  "score": 4.67997,
  "reviews": 1303,
  "currentVersionScore": 4.67997,
  "currentVersionReviews": 1303,
  "searchTerms": "slots"
 },
 {
  "appId": "com.royalslots.app",
  "title": "Royal Slots Casino",
  "description": "Welcome to Royal Slots, the online casino with a huge selection of fantastic games.\n\nRoyal Slots is fully licensed and regulated by the UK Gambling commission.\n\nRoyal Slots offers a massive selection of online casino slots and all your favourite live casino games – Blackjack, Roulette, Dream Catcher & More! We’re constantly adding the latest games & offer all your favourites including Fishin Frenzy, Eye of Horus and Rainbow Riches.\n\nPlayers can opt in to our exciting welcome bonus, where we will double your first deposit up to £200 followed by 3 further deposit bonuses*\n\n-Deposit bonus 1 100% up to £200*\n-Deposit bonus 2 50% up to £200*\n-Deposit bonus 3 25% up to £300*\n-Deposit bonus 4 25% up to £300*\n\n*New customers only. Opt-in required. 1st deposit bonus 100% up to £200. 2nd deposit bonus 50% up to £200, 3rd deposit bonus 25% up to £300, 4th deposit bonus 25% up to £300. Min deposit £10. 40x wagering, 30 days to complete wagering, game weighting and game restrictions apply. Max Bet with bonus funds £5. Max withdrawal from bonus funds is £2000. Eligibility restrictions apply, cash balance can be withdrawn at any time. See app for full terms and conditions.\n\nTo download and use this online casino app, you must be a UK resident and over 18.\n\nRoyal Slots is not a free to play app, you are playing with real money. You should only gamble what you can afford to lose and please gamble responsibly. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-10-25T07:00:00Z",
  "updated": "2020-04-22T15:39:05Z",
  "releaseNotes": "Updates for the latest iOS",
  "version": "1.0.33",
  "price": 0,
  "developer": "One Click Limited",
  "score": 4.58882,
  "reviews": 304,
  "currentVersionScore": 4.58882,
  "currentVersionReviews": 304,
  "searchTerms": "slots"
 },
 {
  "appId": "com.huuuge.casino.slots",
  "title": "Huuuge Casino Slots Vegas 777",
  "description": "Join the world’s biggest casino community with SLOT MACHINES HUUUGE CASINO. Play the best slot casino, compete in leagues, join clubs and have great fun - Las Vegas style. SLOT MACHINES HUUUGE CASINO is the ultimate slot casino experience! SLOT MACHINES HUUUGE CASINO lets you play over 130 TOP SLOT CASINO MACHINES, SIT’N’GO HOLD’EM, BACCARAT, ROULETTE, VIDEO POKER and many other casino games! Download Slot Machines Huuuge Casino now - The #1 slot casino on mobile!\n\n\nPlay the best Slots on the market!\n\n\nSLOTS™ HUUUGE CASINO offers the best Slots in the world, from retro classics to modern slot machines, you’re sure to find something to fit your fancy!\n\n\nHuuuge Diamond Wins – Spin the Wheel of Wins to win billions of Chips.\nAztec 2: Eclipse – Discover the secret wins hidden in the Sun and Moon temples.\nRespin Ranch – Check out the richest animals and hit massive wins!\nCash Madness – Hit Huuuge Jackpots in this classic hit!\nBlaster Cats vs Aliens – Get up to 130 Spins… IN SPACE!\nBuffalo Rush – Your screen will shake from the massive wins you will hit!\n\n\nThe biggest Jackpot of them all!\nPlay HUUUGE LINK – a set of four Slots that share a truly HUUUGE Grand Jackpot to see how easy it is to win massive Jackpots in no time! Prepare to be amazed with the wonders of Ancient Egypt and China in this amazing Slot adventure.\n\n\nJoin a Club and compete in the Billionaire League!\n\n\nThe Billionaire League is an amazing place where you can play with your friends in order to compete for the best prizes and earn your bragging rights against the top spinners in the world!\n\n\nJoin your friends in a Club, or create a Club of your own\nMeet awesome new people and spin together\nWin awesome rewards for your dedication\nSpin your Club to Masters League glory.\n\n\nIt’s not just Slots\nHuuuge Casino offers way more than Slots! If you’re not a slot maniac, we have other casino games that we’re sure will give you that same winning thrill!\nVideo Poker – Awesome, engaging, with multiple variants\nSit’n’Go Hold’em – Play thrilling tournaments!\nRoulette –  Place your bets and win big!\nBaccarat –  Get some old school wins!\n\n\nAwesome Bonuses\nHuuuge Casino offers many ways to win big on top of the Slots!\nGet the Betty Bonus in the Lobby every 15 minutes!\nVisit the Shop every day to collect an additional bonus!\nPlay the Lottery to win up to ONE BILLION CHIPS!\nParticipate in Daily Giveaways on our Facebook page and via Push Notifications!\n\n\nRead our Terms of Use (www.huuugegames.com/terms-of-use), Privacy Policy (www.huuugegames.com/privacy-policy) and other important information.\n\n\nOur games are for entertainment only. All points in the game stay in the game and all game points have no cash value. Although in-game currency can be purchased for real money or won during gameplay, none of the items in the game have any cash value. Our games are intended for adult audiences only.\n\n\nThe game is intended for a mature audience.\nThe game does not offer real money gambling or an opportunity to win real money or real prizes.\nWins made while gambling in social casino games can't be exchanged into real money or real rewards.\nPast success at social casino gambling has no relationship to future success in real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2015-09-11T12:39:43Z",
  "updated": "2020-04-27T09:00:34Z",
  "releaseNotes": "Hey, Spinners!\nWe've got a new update for Huuuge Casino.\nAs always, we're constantly working to improve the game experience for you. We've added minor tweaks and other bug fixes so you can feel even right at home while spinning!\nSee you at the Casino! Enjoy spinning and win big!\nLet's play together and #StayHuuuge!",
  "version": "5.3.1850",
  "price": 0,
  "developer": "Huuuge Global Ltd.",
  "score": 4.01511,
  "reviews": 1521,
  "currentVersionScore": 4.01511,
  "currentVersionReviews": 1521,
  "searchTerms": "slots"
 },
 {
  "appId": "com.mofunslots.richescasino",
  "title": "Slots Riches - Casino Slots",
  "description": "Finally you find Slots Riches, a free Vegas casino slots game just tailored for you! Reward yourself splendid casino slot time during the interval of daily routine, and splash out to embrace endless slots fun and amazing jackpot rain! 20 million slots welcome coins warming you up, daily and hourly bonus never missing your casino day and keeping filling up your slots energy bar. All left to you is spinning for the exciting slots events! LOCK and SPIN for multiplied payouts, progressive features for free spin and jackpot thrill, and various WILD linking paylines for huge wins! We know more about what you want than yourself! Come and play!\n \nSpin your favorite slot machines in Slots Riches Casino\n- Money Craze - Spin up the Cash in the vault, win huge bonuses and feel the billionaire life! \n- Howling Riches - Listen to the howl from werewolf in the deep wood and feel its lightning impact on your soul and your jackpots!\n- Pearl Riches - Dance with gorgeous mermaid and Lock the pearls to reveal a fortune secret in the mysterious alluring sea! Get more Respins and grand jackpot here.\n- JACKPOT TWINS - Feel the legendary power and trigger super Dragon or Tiger fortune wheel during the battle of dragon VS. tiger, and get stunning free spins, rapid symbols and Jackpots!\n- CHILLI FIRE - Cheer yourself up in the the exotic dessert with scarlet chilli and hot dances. Pile up the WILD for richful harvest! \n- Eagle Spirit - Fly with the eagle and seek for the all hidden jackpot treasure under the moon!    \n \nExcellence in user experience in Slots Riches Casino.\n- Selection of most popular slot games\n- Richful play model and winning gestures satisfying all your needs\n- Abundant rewards, winning events and exploding Jackpots\n- Constant updates of current fashionable slot machines and thrilling riches quests\n- Plenty of tournaments for extra prize\n- Authentic music and sound effects\n- Amazing graphics and animation \n- Off-line play supported\n \nCome for the delicious Jackpots for you! Experience the best slot machine without leaving the comfort of your home for free! Take trips for treasure hunt, in all the almost real scenes around the world. Enjoy the special offers beyond the experience of the real Vegas casino game! Feel lucky there and get ready for the golden coins prepared for you!\n \nThis game is intended for an adult audience for amusement purposes only and does not offer “real money” gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at “real money” gambling.\n \nContact Us\nIf you need help or support, please contact us at slotsrichesgame@outlook.com.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-12-14T12:30:39Z",
  "updated": "2020-01-15T17:24:16Z",
  "releaseNotes": "Looking forward to a new update and more fun? Here we go!\nUpdate now and grab thrilling Vegas slots experience:\n1. Fix minor bugs and optimize game performance.\n2. Upgrade slots machines for smoother spinning\nUpdate, open and spin more. Feel the passion and fun out of Slots Riches!",
  "version": "1.1.5",
  "price": 0,
  "developer": "Spark City Co., Limited",
  "score": 4.73621,
  "reviews": 417,
  "currentVersionScore": 4.73621,
  "currentVersionReviews": 417,
  "searchTerms": "slots"
 },
 {
  "appId": "com.smallscreencasinos.thephonecasino",
  "title": "Play Slots at The Phone Casino",
  "description": "At The Phone Casino, we don't believe in phoney cash bonuses, we believe in giving all players FREE SPINS that can be spun into CASH PRIZES and withdrawn with NO WAGERING REQUIREMENTS.\n\nThe Phone Casino brings you all of your favourite REAL MONEY CASINO games straight to your iPhone or iPad.\n\nPlay favourite Slots like;\n- Monopoly\n- Rainbow Riches\n- Foxin' Wins\n- Reels of Luck\n- Kings of Cash\n- Irish Eyes\n- Bingo Billions\n\nPlay classic casino table games like;  \n- Blackjack\n- Roulette\n- Bacarrat \n- Video Poker\n\nOr enter our LIVE CASINO to play; \n- Blackjack\n- Roulette\n- Bacarrat\n- Casino Hold'em\n\nLooking for an alternative to casino games?  How about our enormous range of INSTANT WIN Games like KENO, SCRATCH CARDS or SKILL GAMES?  \n\nDaily Slots Freeroll Tournament: \nEvery day, we give players one entry into our daily freeroll tournament.  Place in the top 20 to win cash you can either use on other games or withdraw with NO WAGERING REQUIREMENTS.  The choice is yours.  Players can also win prizes like iPhones, computers, TV’s, VIP holidays or the chance to win £1 million….that’s right £1 million.  Its that simple!\n\nWith 100's of games and new games added weekly, there's plenty to do at The Phone Casino.\n\nWe offer fast, secure, encrypted deposits and withdrawals and you can even top up using your mobile, debit card. credit card, Paysafe or Skrill.\n\nWhat are you waiting for? Download today!\n\nWe’d love to hear from you, so please rate us here in the App Store.  Or, if you’re not 100% satisfied feel free to email \nsupport@smallscreencasinos.com and we’ll happily help you. Or follow us on Social here\n\nwww.facebook.com/PhoneCasino/\nTwitter - @thephonecasino\nwww.instagram.com/thephonecasino\n\nThe Phone Casino is licensed by the UK Gambling Commission and the Alderney Gambling Control Commission. All communications are encrypted making The Phone Casino a safe, secure and trusted. UK Gambling Commission, licence number: 000-039397-R-319363-002.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-04-24T15:58:29Z",
  "updated": "2018-12-11T13:46:06Z",
  "releaseNotes": "We’ve updated our bonus system to enable users to cash out all bonuses with no wagering requirements. Plus, we’ve also added enhanced ID document security to keep players even more safe and secure.",
  "version": "3.0",
  "price": 0,
  "developer": "SmallScreenCasinos Ltd",
  "score": 2.35417,
  "reviews": 48,
  "currentVersionScore": 2.35417,
  "currentVersionReviews": 48,
  "searchTerms": "slots"
 },
 {
  "appId": "com.funstage.gta.ma.sizzlinghotdeluxe",
  "title": "Sizzling Hot™ Deluxe Slot",
  "description": "Play the cult fruit slot. If you’re a fan of simple gaming fun and great chances of winning, look no further than Sizzling Hot!\n\n777 across the reels will light up the eyes of any slot fan, for the lucky number 7 has the highest winning value in Sizzling Hot™ deluxe!\n\nPlus, make sure you keep a lookout for the Stars - they can trigger wins anywhere on the reels.\n\nSizzling Hot™ deluxe at a glance:\n-\t5 reels\n-\t5 win lines\n-\tThe Star is a special symbol (Scatter)\n\nHow do I get spinning at Sizzling Hot™ deluxe? \nIt couldn’t be simpler: Get the app, register at GameTwist, and away you go. What’s more, a wide variety of further awesome games is waiting for you at GameTwist!\n\nSizzling Hot Deluxe app is a free online game of chance for entertainment purposes only. It is not possible to win real money or real items/services/gifts or goods in kind by playing our slot machines. The virtual currency used in this game is called ‘Twists’ and can be purchased in the ‘Shop’ using real money. ‘Twists’ cannot be exchanged for cash or be paid out in any form. ‘Twists’ can only be used to play these games. The games are intended solely for an adult audience which is 18+ years.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-11-02T01:25:42Z",
  "updated": "2020-03-05T13:35:28Z",
  "releaseNotes": "NEW: Video Bonus!\n\nAttention slot fans: This is your chance to bag even more free Twists and fill the tank so that you have plenty of energy to play our newest slot machines! \n\nHow? Go to the app, watch a video and collect massive video bonuses! Super easy! \n\nAnd we’re pulling out all the stops for our VIPs! The higher your VIP status, the more videos and bonuses you can look forward too!",
  "version": "5.18.0",
  "price": 0,
  "developer": "Funstage Spielewebseiten Betriebsges.m.b.H.",
  "score": 4.49522,
  "reviews": 418,
  "currentVersionScore": 4.49522,
  "currentVersionReviews": 418,
  "searchTerms": "slots"
 },
 {
  "appId": "com.leovegas.leocasino",
  "title": "LeoVegas: Real Money Casino",
  "description": "Join millions of players on the virtual mobile casino floor when you download the multi-award winning LeoVegas Real Money Casino mobile gaming app. \nDiscover all your favourite casino games including blackjack, roulette, baccarat and all the greatest slots like Starburst, Book of Dead, Rainbow Riches and many more. Spin for the jackpot on our slot machines, take a seat at any live dealer table or place a bet with the best odds instantly on your favourite sports. Play your way then use the instant cash out feature to claim your winnings fast.\nStep inside a world of quality casino excitement with everything you want from the latest game releases to all-time favourites in the palm of your hand with LeoVegas, the King of Mobile Casino. The LeoVegas Real Money Casino app is one of the greatest real money gaming experiences and it’s all yours to play anytime, anywhere, on your iPhone and iPad.\n\nLeoVegas – King of Mobile Casino\nLightning-fast loading, deposits and withdrawals\nApple Pay: no credit card needed, secure and easy payment\n24/7 Customer service with agents from the UK \nLive dealers and a VIP experience fit for a king\nLeoVegas supports your responsible gameplay with LeoSafePlay\n\nMulti-Award Winning LeoVegas\n'Best Native App' EGR Marketing & Innovation Awards 2017\n'Online Casino of the Year' Global Gaming Awards 2018\n\nLeoVegas Casino\nPlay for real money with over 1000 slot machines, RNG and jackpot games\nFavourite UK casino games including Starburst, Book of Dead, Rainbow Riches, who wants to be a millionaire megaways, Extra Chilli, etc.\nBlackjack, roulette, baccarat and all the greatest table games\nFast game loading speeds and cash out payments \n\nLeoVegas Live Casino\nReal casino play with first-rate dealers \nThe latest exclusive tables with instant access to roulette, baccarat and blackjack\nHD quality streaming from dedicated studios and luxurious locations around the world\nBe the king of the casino with Bespoke LeoVegas tables in our Chambre Séparée\nA fast, immersive experience with live dealers and full-screen functionality \nAccess to seat availability, latest roulette numbers and gaming limits with dynamic data\n\nLeoVegas Sport\nBet in-play on all the popular sporting events \nInstant betting markets \nBoosted live and pre-match odds\nBet and watch live\nCash out feature to claim your winnings fast before the match ends\nOver 120, 000 live events with the widest range of betting markets on the top leagues\n\nWhen you sign up at LeoVegas choose from 3 different welcome bonuses - Casino, Sport or Live Casino. The promotions page within the app is filled with the latest offers for existing customers. \nIf you have an account with LeoVegas, simply use this app to login and then play for real cash instantly from the same account as if you were on LeoVegas.com. \nLeoVegas, the King of Casino: www.leovegas.com\n\n20 Free Spins No Deposit needed T&Cs\n\nAll new casino players from the UK who are 18 years and over will be eligible for 20 Free Spins on selected slot games when they create an account at LeoVegas.com, subject to the terms and conditions below. 20 Free Spins Registration Bonus \n1. This offer is available to all new UK players registering at LeoVegas.com from the 8th April 2019. \n2. Any winnings from the Free Spins must be wagered 35 times before they can be withdrawn. 3. Free Spins are worth £0.10 each and are valid for 7 days upon activation unless otherwise stated. \n4. The game on which Free Spins are awarded is subject to change from time to time. \n5. Currently, Free Spins can be used on the following slot games: Book of Dead\n6. Free spins must be claimed on ‘’My Offers’’ page within 14 days of sign-up.\n7. General Terms and Conditions of the LeoVegas website apply https://www.leovegas.com/en-gb/promotions/bonuses/c\n\nLicences\nLeoVegas Gaming Ltd is licensed and regulated. LeoVegas Gaming Ltd holds a UK licence issued by the Gambling Commission - UK Licence Number: 000-039198-R-319450-017.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2014-04-27T13:27:22Z",
  "updated": "2020-02-27T08:37:33Z",
  "releaseNotes": "We’ve made some great updates and released fantastic features to improve your experience. Our latest update brings with it a new sleeker look, making it easier to read and navigate getting you in the action quicker\n\nWelcome to LeoVegas - The King of Mobile!",
  "version": "1.8.19",
  "price": 0,
  "developer": "LeoVegas Gaming Ltd",
  "score": 4.51206,
  "reviews": 580,
  "currentVersionScore": 4.51206,
  "currentVersionReviews": 580,
  "searchTerms": "slots"
 },
 {
  "appId": "com.funstage.gta.ma.bookofradeluxe",
  "title": "Book of Ra™ Deluxe Slot",
  "description": "This game lights up the eyes of every slot fan. Book of Ra online is THE slot game - and the growth of its popularity is showing no signs of stopping.\n\nBut what makes Book of Ra™ deluxe so exciting? The adventure it takes you on!  \nExplore your way deeper and deeper into an Egyptian pyramid and try to locate the sparkling treasure of the pharaohs. \n\nWith a little luck, you’ll discover enough Book symbols to trigger the thrilling Free Games which feature special expanding symbols. Pure excitement guaranteed! \n\nWhat’s more, online Book of Ra is so popular that there’s now a whole series of sequels, including a jackpot and Bingo version. Where can you play them? In our online casino, of course! \n\nBook of Ra™ deluxe at a glance: \n-\t5 reels\n-\tUp to 10 win lines\n-\tThe Book of Ra is the special symbol (Scatter)\n-\tA chance to trigger 10 or more Free Games with a special expanding symbol\n\nHow do you get spinning at Book of Ra™ deluxe? \nIt couldn’t be simpler: Get the app, register at GameTwist, and away you go. What’s more, a wide variety of further awesome games is waiting for you at GameTwist!\n\nBook of Ra Deluxe App is a free online game of chance for entertainment purposes only. It is not possible to win real money or real items/services/gifts or goods in kind by playing our slot machines. The virtual currency used in this game is called ‘Twists’ and can be purchased in the ‘Shop’ using real money. ‘Twists’ cannot be exchanged for cash or be paid out in any form. ‘Twists’ can only be used to play these games. The games are intended solely for an adult audience which is 18+ years.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-02-26T09:36:28Z",
  "updated": "2020-03-06T07:39:05Z",
  "releaseNotes": "NEW: Video Bonus!\n\nAttention slot fans: This is your chance to bag even more free Twists and fill the tank so that you have plenty of energy to play our newest slot machines! \n\nHow? Go to the app, watch a video and collect massive video bonuses! Super easy! \n\nAnd we’re pulling out all the stops for our VIPs! The higher your VIP status, the more videos and bonuses you can look forward too!",
  "version": "5.18.0",
  "price": 0,
  "developer": "Funstage Spielewebseiten Betriebsges.m.b.H.",
  "score": 4.56111,
  "reviews": 180,
  "currentVersionScore": 4.56111,
  "currentVersionReviews": 180,
  "searchTerms": "slots"
 },
 {
  "appId": "com.williamsinteractive.hotshot",
  "title": "Hot Shot Casino - Vegas Slots",
  "description": "Hot Shot Casino slots is the real deal, and it doesn't get hotter than that! All of your favorite Las Vegas classics are right here, waiting for you to spin and win BIG! Step into the Hot Shot Casino every time you play the slot machine game, and you’ll immediately be surrounded with an authentic casino experience that’s right there in your pocket, wherever you go. Get the real slots thrill of a night at the casino floor by enjoying the same official slot machine brands you’ll find in the hottest places in Vegas.\n \nThis is your lucky day, and it’s full of luck machines! Enjoy the real and wild magic of the hottest slots around, hit the jackpot on your favorite slot machine games and start winning huge rewards! Double down on your gambling and your coins, and go from bored to riches. And the best part? This blazing app is full of FREE slots to download and fun to play!\n \nHot Shot Casino features world class gambling brands like WMS Gaming, Bally Slots, Shufflemaster, and many more. These leading casino brands come together in one sizzling slots app and offer a long, super impressive and unbelievably fun line of free slot machine games. These include all-time classic machines like YAHTZEE™, Aztec Dawn, Rise of Ra and MONOPOLY™, enchanting slot adventures like ‘Alice & the Enchanted Mirror’, crazy fun slots like The Dean Martin slot machine, KISS,  Betty Boop, Sizzling Hot Shot Blazing 7s, and so much more! It’s 777 all the way and your winning blitz begins now! \n \nBut wait, that’s not all! In addition to the dozens of casino slots games you’ll find on a regular basis, Hot Shot Casino creates unique, seasonal mini games that allow you to win massive coin rewards and other surprising gifts all year round. Celebrate holidays and special moments with our top fruit machines. This free slot machine game keeps things hot with special surprises and awesome game features that will allow you to win even more and double the fun. Every day brings new surprises, bonuses and entertaining moments like you’ve never experienced before.\n \nTo create the most realistic and entertaining online casino experience, our gambling-loving, creative minds invest great efforts in every part of each slots game. You’ll find the most vibrating, colorful graphics that pop and animation that will make the lights of the Las Vegas Sunset Strip come to life within the app, you’ll enjoy game sound of the highest quality (can you hear the progressive jackpot? Cha-ching!), and so much more. This game is at the top of the pyramid. HotShot Casino will bring the fun to every corner of the game and your world, letting you win not only huge rewards and bonuses, but also hours of fun and excitement. Play huge hits from the heart of Vegas, like Hot Shot Blazing Sevens, Rainbow Riches, Hot Shot Progressive, Wild Huskies, Lightning Jackpots, Cash Wizard, Hot Shot All About Money, and more!\n \nIf your day has been boring so far, it will turn into a non-stop thrill the moment you download the Hot Shot Casino app for FREE and become the slots mania master! Let the magic take over and turn every dull moment into a crazy, fun one instead. Hot Shot players enjoy the Bonus Wheel and other daily bonuses and surprises and would never replace this game for another. Join them and the fun right now! \n\n*The MONOPOLY name and logo, the distinctive design of the game board, the four corner squares, the MR. MONOPOLY name and character as well as each of the distinctive elements of the board and the playing pieces are trademarks of Hasbro for its property trading game and game equipment. © 1935, 2015 Hasbro. All rights reserved.\n\nYAHTZEE is a trademark of Hasbro. Used with permission. © 2016 Hasbro. All rights reserved.*\n\nThe games are intended for an adult audience. (Aged 21 or older).\n\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling”.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-05-16T20:32:36Z",
  "updated": "2020-03-23T08:47:50Z",
  "releaseNotes": "Hey there Hot Shot Players!\n\nWe've got a special surprise for you!\nCheck out our FRESH NEW LOOK with this update:\n\n++ Faster Loading Times\n++ Amazing graphics\n++ Bug Fixes and Performance improvements to enhance your gaming experience!\n\nDon't miss out & Download the Ultimate Vegas Experience Now!",
  "version": "3.00.42",
  "price": 0,
  "developer": "Phantom EFX, Inc.",
  "score": 4.53691,
  "reviews": 596,
  "currentVersionScore": 4.53691,
  "currentVersionReviews": 596,
  "searchTerms": "slots"
 },
 {
  "appId": "com.playtika.slotomania",
  "title": "Slotomania™ Vegas Slots Casino",
  "description": "Experience the mania with Slotomania! \n\nJoin over 100 million players to get spinning and winning on 200+ premium 777 Vegas slot machines, with more slots games added with every update! Plus, with FREE COINS for new players and more FREE casino bonuses daily, what are you waiting for?\n\nIt’s the hottest free slots online - download and play now!\n\nJOIN FORCES! WIN MORE!\nSlotomania introduces SLOTOCLANS! Join forces with fellow Slotomanians and spin your way to HUGE prizes! Each SlotoClan member's wins bring rewards to ALL Clan members. Enjoy weekly rewards, extra bonuses, and become a part of Slotomania's winning community!\n\nSpin Premium 777 Vegas Slots Games\nTake a break from your daily routine and escape into the fantasies of 777 Vegas casino games! With over 200 free Vegas slots adventures, 777 slot machine games and free casino games and JACKPOT slots, excitement is only a spin away!\n- Unleash the CASH LINK in the free to play slot machine, VEGAS CASH\n- Head into the wild in the DESPICABLE WOLF 2 free slots game\n- Whisper a 777 spell with a casino twist in the MAGIC TRIXIE slot machine.\n- Roar for the win in the brightest casino slot game of the jungle - SILVER LION\n- Become an online slot and casino legend with CHILI LOCO and so much more!\n\nWin Massive, Daily Free Gifts, Coins and Enjoy Extra Benefits!\nThere are so many ways to win with Slotomania free slots - you just have to experience them all for yourself! \n- Sloto Quests: Have you completed them all yet? Go on exciting slots adventures for huge, extra rewards. Check out the free slots 777 games on offer and get playing!  \n- Sloto Club: Join the free slots 777 club for the exclusive VIP treatment and slots rewards, including Cash Back, Linked Jackpots and other exclusive free slot machines! \n- Snakes and Ladders Mini-Game: This is casino at its best: just like you played when you were a kid, but upgraded and way more rewarding, with a fun slots twist! \n- Extra Bonuses: Get hourly casino and slots bonuses, generous coin boosters, gifts from friends and even more! Who said slot machines weren't rewarding? \n- Playtika Rewards: Keep playing Playtika’s other slots games to gain and redeem even more useful Playtika Rewards! Check out our other awesome free slots, such as Vegas Downtown, House of Fun, Bingo Blitz and other 777 slots, and reap Playtika Rewards across six of our most popular slot machines and free casino games! \n\nThis game is intended for an adult audience (21+) for amusement purposes only and does not offer ‘real money’ gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at ‘real money’ gambling.\nTerms of service: http://playtika.com/terms-of-service.html",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2011-09-20T19:08:21Z",
  "updated": "2020-05-01T10:20:42Z",
  "releaseNotes": "Hi Slotomania Fans!\n\nHere's a new update with fixes to improve your game experience!\n\nHave fun & good luck!",
  "version": "6.1.3",
  "price": 0,
  "developer": "Playtika LTD",
  "score": 4.40218,
  "reviews": 5505,
  "currentVersionScore": 4.40218,
  "currentVersionReviews": 5505,
  "searchTerms": "slots"
 },
 {
  "appId": "com.superluckycasino.viponly.slots.vegas.ios.free",
  "title": "VIP Deluxe Slots: Vegas Pokies",
  "description": "* Play over 55+ Slot Machines and Pokie Games in VIP Deluxe Slots! *\n\nPlay slot and poker games OFFLINE or ONLINE, with or without wifi: any place, any time! \n\nENJOY REAL VEGAS ODDS and DELUXE Slots Graphics!\n\nWin Big with SLOTS: VIP Deluxe Slot Machines - Pokie Games Casino!!! New Pokies Added every month! \n\nDon't miss out on the greatest new Slot Game App: Play VIP Deluxe Slots Casino TODAY!\n\nThese slot games are intended for adult audiences and do not offer real money gambling or any opportunities to win real money or prizes. Success within this slots game does not imply future success at real money gambling.\n\nQuestions/Problems? \nE-mail us at: VIPi@12gigs.com",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2016-06-17T23:19:51Z",
  "updated": "2019-11-18T15:39:33Z",
  "releaseNotes": "VIP DELUXE SLOTS & POKIES ARE BETTER THAN EVER! \n- Start with 100,000,000 Bonus Coins and Collect MORE Free Coins Every Day! \n- Play over 50+ Real Vegas Casino Pokies and Slot Machines Free!\n- New Vegas Slot Machines unlocked every month!\n- Bigger Jackpots on all Vegas slot games! \n... And MORE!",
  "version": "1.159",
  "price": 0,
  "developer": "Super Lucky Casino Inc.",
  "score": 4.89606,
  "reviews": 914,
  "currentVersionScore": 4.89606,
  "currentVersionReviews": 914,
  "searchTerms": "slots"
 },
 {
  "appId": "com.winner.slots",
  "title": "Winner Slots Casino Games",
  "description": "DOWNLOAD NOW! THE BEST SLOTS GAME ON MOBILE!\n\nClaim 20 MILLION Starting Coins when you download today.\n\nFun casino experience, featuring over thirty Asian-themed slots machines.\n\n\nDisclaimer:\nThis game is intended for an adult audience (21+) for amusement purposes only and does not offer ‘real money’ gambling, or an opportunity to gamble or win real money, cash or prizes based on game play. Playing or success in this game does not imply future success at ‘real money’ gambling or any gamble-related venture, online or offline.",
  "genres": [
   "Games",
   "Entertainment",
   "Board",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-10-03T07:00:00Z",
  "updated": "2019-11-24T11:31:46Z",
  "releaseNotes": "Thanks for playing Winner Slots! It is important for us to give you the best playing experience. In this update we have identified some crashes and issues affecting some users and have fixed these so that those of you who were affected will have uninterrupted play! Enjoy!",
  "version": "1.43.2",
  "price": 0,
  "developer": "Vegas Temptation Ltd",
  "score": 4.64789,
  "reviews": 142,
  "currentVersionScore": 4.64789,
  "currentVersionReviews": 142,
  "searchTerms": "slots"
 },
 {
  "appId": "com.betway.casino",
  "title": "Betway - Casino Slots & Games",
  "description": "Step into the Betway Casino! Discover a huge range of real money games; from slots and poker to roulette, blackjack & more.\n\nPlay for your chance to win! And if you’re new to Betway Casino, you get 100% Welcome Bonus, up to £250*! You can even claim your winnings early - simply tap whenever you see the Cash Out button.\n\nDiscover our top games:\n\n• Evolution - Dream Catcher\n• Mega Moolah\n• Tarzan\n• Evolution - Roulette\n• Evolution - Blackjack\n• Goliath\n• European Blackjack Gold\n\n...and many more!\n\nJackpots & huge cash prizes are waiting to be won! Take a spin on Mega Moolah or Starburst, join a multiplayer Poker table or take on the dealer with Live Blackjack. What would you do with your winnings?\n\nREAL MONEY SLOTS\n\n• Play for your chance to WIN BIG with Progressive Jackpot Slots\n• Choose from top Slot machines including Mega Moolah, Starburst & many more!\n• Ready, steady, spin! There’s Slot games to suit any player & any bankroll\n\n\nLIVE ROULETTE\n\n• Simple rules, big payouts - find your Roulette game in Betway’s luxury casino\n• Play favourites like European Gold & Evolution Roulette\n• Put the wheel in motion for your chance to win\n\n\nBLACKJACK\n\n• Step right into Vegas with this casino classic - it’s all about beating the dealer’s hand\n• Play Live Casino for the ultimate Table Game faceoff\n• Take your place at the premium online Blackjack tables\n\nLIVE HD CASINO\n\n• Get the Vegas vibe streamed straight to your mobile from our studios, live in HD\n• Multiplayer casino games including Video Poker, Live Baccarat and other card games\n• Double Betway Plus points on newly released games. Redeem your points straight from your mobile to keep the good times rolling!\n\nPlay your cards right & place your bets! Whether you’re a seasoned slot machine pro or new to the game, there’s something for everyone at Betway. Download now!\n-------------------------------------------\n\n*New customers only. Opt-in required. 100% Match Bonus up to £250 on 1st deposit of £20+.50x bonus wagering applies as do weighting requirements. Debit Card & PayPal deposits only. Advantage Play may invalidate your bonus. Full Terms apply.\n\nhttp://casino.betway.com/terms-welcome-bonus/ for Welcome Bonus T&Cs and http://casino.betway.com/terms-and-conditions/ for full T&Cs.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-09-18T13:31:37Z",
  "updated": "2020-05-05T10:12:58Z",
  "releaseNotes": "We’re constantly updating and improving our app. We’ve fixed bugs and added brand new features designed to make our app easier to use!\n\n• Players experience improvements\n• Updated branding and theme\n• Performance and stability improvements\n• Bug fixes\n\nTake a seat at your favorite casino game, we’ll take care of the rest. From slots to blackjack and roulette, we’ve got all the top games for you to choose from, including:\n\n• Slots: Starburst, Mega Moolah \n• Roulette: European Roulette Gold, Evolution Roulette & Live Roulette HD\n• Blackjack: European Blackjack Gold, Evolution Blackjack & HD Live Blackjack\n• Wheel of Fortune: Evolution Dream Catcher\n\nAre we your favorite casino app or could we do better? Let us know & leave a review.",
  "version": "7.5.4",
  "price": 0,
  "developer": "Betway",
  "score": 4.71917,
  "reviews": 876,
  "currentVersionScore": 4.71917,
  "currentVersionReviews": 876,
  "searchTerms": "slots"
 },
 {
  "appId": "com.doubleugames.DoubleUCasino",
  "title": "DoubleU Casino: Vegas Slots",
  "description": "Enjoy the ultimate casino experience! Experience the biggest wins in your life on DoubleU Casino!\n\nDoubleU Casino is a creative online casino, and we provide a number of engaging slots and video poker games.\nA variety of high-quality slot games from classic to state of the art releases, no one has a better selection than DoubleU!\nEvery one of DoubleU's slot machines has its own jackpot, just like the slot machines in land-based Las Vegas Casinos!\nExperience engaging social interactions supported by DoubleU mobile service and accompanied by a number of bonuses and benefits!\n\nSpecial Features at DoubleU:\n1. More than 100 slots and 3 video poker games, each with unique features.\n2. No level-based restriction in slot and video poker play.\n3. Every slot machine has its own jackpot.\n4. A variety of bonus features: Jackpot Tourneys, Live Slotourneys, Winner Club and more.\n5. Generous free chip giveaway policy.\n6. User-oriented development and updates.\n7. Prompt and interactive customer support.\n\n\n*Recommended: iPhone 5, iPad 4, and later devices with an iOS version of 9.0 or later\n\n*DoubleU Casino does not offer real money gambling or an opportunity to win real money or prizes.\n*Practice or success at social casino gaming does not imply future success at \"real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-09-23T06:34:35Z",
  "updated": "2020-04-28T01:10:40Z",
  "releaseNotes": "DUC Fans! You need to check out our hot new slots with a variety of hot bonus features!\n\nWishing you lots of luck!\n\n~Jiny & Kevin",
  "version": "6.26.2",
  "price": 0,
  "developer": "DoubleUGames Co., Ltd.",
  "score": 4.31246,
  "reviews": 1501,
  "currentVersionScore": 4.31246,
  "currentVersionReviews": 1501,
  "searchTerms": "slots"
 },
 {
  "appId": "com.bagelcode.slots1",
  "title": "Club Vegas - NEW Slots Games",
  "description": "Join Club Vegas and become a Las Vegas VIP anytime, anywhere! Experience a new slots casino game with endless bonuses, huge jackpots, and the best slots games inspired by Vegas casinos. Claim your 1,000,000 COINS WELCOME BONUS and start spinning the reels of all the online slots in this free casino game. Play with friends, compete in free slots casino tournaments, and win countless prizes and payouts! With new slots added weekly, the wins never stop!\n\n◆ BECOME A SLOTS CHAMPION WITH MULTIPLAYER GAMEPLAY ◆\nThe Club Vegas free online casino game brings you the best selection of online slots along with fun live casino multiplayer features so you can share the VIP experience with your friends! Share free coins and prizes with your friends and compete in online casino tournaments! Join EPIC WIN CLUB and share your EPIC wins to your club members! Chat LIVE with other players as you play casino slots free!\n\nFree spins on stunning video slots games from Las Vegas casinos\n• Collect wild symbols to enter the Party Bonus in Mystic Moon casino slot machine! Combine everyone’s wilds together to maximize your winnings!\n• Boom! Boom! Unstoppable wild explosions alerts in Dynamite Wild casino slot machine! \n• Spin Giant Wheel Bonus in Spin of Fortune, the casino slots game that will have you spinning all day!\n• Feel the buffalos stomp with big bonuses on Super Buffalo free online slot game! \n• More Vegas-inspired free slot machines, with new slot machines added every week.\n\nBONUSES FOR EVERYTHING!\nTired of running out of coins on other free casino games? Club Vegas casino slots games give you countless bonuses and mystery prizes, and new slots regularly so you can keep spinning and winning!\n\n• 1,000,000 free coins welcome bonus!\n• 1,000,000 for connecting to Facebook and more for inviting friends to play slots!\n• Up to 40,000 DAILY VIP bonus!\n• HUGE hourly and daily bonuses, including the Daily Prize Wheel with a 40 MILLION JACKPOT!\n• Earn bonus coins from EPIC WIN CLUB!\n• More mega bonuses as you play all our free casino slot machines!\n\n*This free slots game is intended for adult players 21 and up, and does not offer real money gambling or opportunity to win real money or prizes. Success on this app does not ensure future success at real money gambling.\n\nSign up for our Monthly Subscription Program to unlock the Early Access feature:\n- You can unlock new slots 10 days earlier.\n- You will receive 20 Bonus Spins everyday for the new Early Access slots.\n\nIf you want to preview our Monthly Subscription Program, you can start your free 1-Month trial directly in-game.\n\nSubscription payment will be charged to your iTunes account at the confirmation of purchase. Your subscription will automatically renew itself unless you turn off the auto-renew feature at least 24 hours before the end of the current period. Your account will be charged for renewal within 24 hours prior to the end of the current period. After your purchase, you may manage your subscription options and turn off the auto-renewal function by going to your user Account Settings. Please note that any unused portion of a free trial period will be forfeited when purchasing a subscription prior to the end of the free trial period.\n\nLike us on Facebook: https://www.facebook.com/ClubVegasSlots/\n\nTerms of Use - http://cdn.bagelcode.com/terms.html\nPrivacy Policy - http://cdn.bagelcode.com/policy.html\n\nDownload Club Vegas now and feel the Las Vegas casino experience!",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-06-29T07:49:08Z",
  "updated": "2020-05-08T19:06:55Z",
  "releaseNotes": "Hi Spinners!\nHere’s what’s new:\n- Minor bug fixes",
  "version": "46.1.7",
  "price": 0,
  "developer": "Bagelcode, Inc.",
  "score": 4.72363,
  "reviews": 626,
  "currentVersionScore": 4.72363,
  "currentVersionReviews": 626,
  "searchTerms": "slots"
 },
 {
  "appId": "com.gamesys.monopolycasino",
  "title": "MONOPOLY Casino",
  "description": "Welcome to the UK’s official MONOPOLY Casino – the home of the best Casino and Slot games. Download the free app now.\n\nGet 30 Free Spins on MONOPOLY Paradise Mansion when you spend £10*\n\nMONOPOLY Casino offers a wide range of themed Slots, including MONOPOLY Paradise Mansion as well as classic games Secrets of the Phoenix and Double Bubble. \n\nAny real money spin on one of our Slots could see you win one of four Community Chest Jackpots. You can also win a share of a Community payout if you are playing in the three minutes before another person wins a Community Chest Jackpot.\n\nA selection of Casino games are also available on the app, including your favourite classic casino game roulette.\n\nThere’s also MONOPOLY Daily Free Parking, the Daily Free Game that gives you the chance to win up to 50 Free Spins and £750 in real cash. You just need your first deposit to be £10 or more.\n\nNew MONOPOLY content and promotions are added to the app all the time, so keep an eye out for all of our latest releases.  \n\n18+ Please play responsibly. BeGambleAware.org.\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits. \n\n*Welcome Offer\n1.\t30 Free Spins (1p coin size, maximum lines) for the game MONOPOLY Paradise Mansion for new members only who: a) register; b) opt in to this promotion on first deposit of at least £10 (no retrospective opt in); and c) wager at least £10 in cash (“Qualifying Requirements”).\n2.\t30 days from when you make your first deposit and opt in to complete the Qualifying Requirements and play any Free Spins before they expire. Allow up to 72 hours for credit of Free Spins.\n3.\tOne promotion entry per member – no multiple accounts.\n4.\tYour deposit balance (if any) and any winnings related to either your deposit balance or the Free Spins are withdrawable at any time during this promotion.\n5.\tFull Welcome Offer Rules: https://play.monopolycasino.com/terms#welcomebonus\n\n\nThe MONOPOLY name and logos are trademarks of Hasbro. The distinctive design of the gameboard, the four corner squares, the MR. MONOPOLY name and character, as well as each of the distinctive elements of the board and playing pieces, are trademarks of Hasbro, Inc. for its property trading game and game equipment. ©1935, 2015 Hasbro, Pawtucket, RI 02862. All Rights Reserved",
  "genres": [
   "Games",
   "Simulation",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-10-20T15:46:20Z",
  "updated": "2020-03-11T11:41:54Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.59114,
  "reviews": 2348,
  "currentVersionScore": 4.59114,
  "currentVersionReviews": 2348,
  "searchTerms": "slots"
 },
 {
  "appId": "com.playstudios.myvegas",
  "title": "myVEGAS Slots – Casino Slots",
  "description": "Play the BEST fun free Las Vegas inspired slot games and slot machines for free and join more than ONE MILLION myVEGAS players who have enjoyed Las Vegas experiences!\n\nAt myVEGAS you play incredible mobile slot games for free, with tons of features and massive jackpots. Every new player is awarded 500,000 chips FREE!\n\nWant to enjoy Las Vegas inspired leisure and entertainment by playing a fun, free casino game? Download the app today and play our amazing slot games including **ALL NEW** KONG: THE 8th WONDER OF THE WORLD, BRIDESMAIDS, THE MUNSTERS, SHAQ, ELECTRO LINK, RAPID GOLD and many more!\n\n*** EVEN MORE REASONS TO PLAY ***\n\n*** Spin the DAILY BONUS WHEEL to claim free chips\n*** Claim an additional BONUS every two hours for even more free chips\n*** Earn VIP benefits for boosted bonuses and other perks\n*** Play exclusive Las Vegas branded slot machines like MGM Grand, Luxor, Mandalay Bay, Excalibur, and more!\n*** Play authentic casino inspired slot machines from KONAMI and AINSWORTH, including Lotus Land, Chili Chili Fire, Savage Eyes and Masked Ball Nights\n\nmyVEGAS Slots has over 3 MILLION fans and has earned more than 130,000 5-star ratings. \n\nNote:\n- myVEGAS Slots is intended for individuals 18 years and older.\n- myVEGAS Slots does not offer real money gambling.\n- PLAYSTUDIOS, the developer of myVEGAS Slots, is not affiliated in any direct or indirect way with any real-money gambling operations on other domains.\n- Virtual chips used in myVEGAS Slots have no real-world value and cannot be redeemed for anything of value.\n- Playing free-to-play slots games does not imply future success at real money gambling.\n- In-app purchases available.\n- PLAYSTUDIOS, the developer of myVEGAS Slots, is a member of the International Social Games Association (“ISGA”) and has adopted its “Best Practice Principles.”  See more about the ISGA at www.i-sga.org.  For information, guidance, tips, and advice on social gaming, visit “Smart Social Gamers” at www.smartsocialgamers.org.\n\n\nLike Us on Facebook: facebook.com/myvegas \nFollow Us on Twitter and Instagram: @myVEGAS",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-11-06T16:33:55Z",
  "updated": "2020-04-16T03:05:37Z",
  "releaseNotes": "Hello myVEGAS fans!\nThank you for playing myVEGAS Slots!\nVersion 3.2.4 contains many bug fixes and stability improvements.",
  "version": "3.2.4",
  "price": 0,
  "developer": "PlayStudios",
  "score": 4.73496,
  "reviews": 3641,
  "currentVersionScore": 4.73496,
  "currentVersionReviews": 3641,
  "searchTerms": "slots"
 },
 {
  "appId": "com.blastworks.slingoarcade",
  "title": "Slingo Arcade - Bingo & Slots",
  "description": "Play the best Slingo (Slots + Bingo) and slot games all in one app, plus a number of BRAND NEW games like SLINGO VALKYRIE.  Enjoy exciting arcade style gameplay, mega win jackpots, progressive jackpots, and daily bonus wheel spins. Come celebrate 20 years of Slingo - Play Slingo Arcade for FREE!\n\nSlingo is the classic combination of Slots + Bingo that has delighted millions of players for 20 years! Slingo Arcade is your new home for everything Slingo.\n\nReady? Let’s Slingo!\n• Receive 1,500 Credits to start.\n• Try your luck and spin the Daily Bonus Wheel for up to 1,200 Credits.\n• Find the best Slingo games all in one place: SLINGO RICHES, SLINGO EXTREME, SLINGO CLASSIC, SLINGO CARNIVAL BONUS, SLINGO OVERDRIVE, SLINGO FORTUNES, SLINGO SHOWDOWN and MORE!\n• Blackout your card and receive a FULL HOUSE JACKPOT!\n• Reveal 3 Jokers and receive a HUGE BONUS!\n• Get lucky and hit a PROGRESSIVE JACKPOT in Slingo Diamonds.\n• Play classic Vegas style slots 777: PROSPERITY DRAGON, ROAMING REELS, CASH CAVE and many more being added to the arcade floor.\n\nFind out why millions love Slingo's unique blend. It’s the best of Slots and Bingo… like peanut butter and jelly! Get it FREE and Start winning today with Slingo Arcade!\n\nThe games are intended for an adult audience. The games do not offer “real money gaming” or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at “real money gaming”.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-11-11T05:12:46Z",
  "updated": "2020-04-16T19:47:32Z",
  "releaseNotes": "Slingoers, you are Very Important Players…So check out our BRAND NEW VIP Loyalty Program and unlock HOT Rewards and Bonuses!",
  "version": "20.5",
  "price": 0,
  "developer": "Blastworks Limited",
  "score": 4.53023,
  "reviews": 215,
  "currentVersionScore": 4.53023,
  "currentVersionReviews": 215,
  "searchTerms": "slots"
 },
 {
  "appId": "com.GalaInteractive.GalaCasino",
  "title": "Gala Casino: Real Money Games",
  "description": "Play all of your favourite REAL MONEY CASINO GAMES at Gala Casino, including SLOTS, BLACKJACK, ROULETTE, baccarat and INSTANT WIN games.  Play anywhere, anytime using your iOS device.\n\nWhy Gala Casino? \n\nSLOTS \nPlay hundreds of slots and jackpot slot games including STARBURST, Big Banker Slot, The Goonies and Rainbow Riches or any of our many jackpot slots like DRAGON’S FIRE, Mystery Reels Megaways™ and Slot O Gold™.  \n\nLIVE CASINO\n\nGet even closer to the experience of an authentic casino by playing a wide selection of table games in our LIVE CASINO suite, from Blackjack, Roulette, Baccarat and Hi-Lo to Spin a Win, 3 Card Brag and Casino Hold’em.\n\nASIAN GAMES\nLove Macau Slots?  Download the app to play over a dozen Asian slot games like Astro Cat, Emperor’s Garden, Pai Gow Poker, Craps and Eastern Emeralds.\n\nBecome a Gala Casino VIP!\n\n•\tWelcome Bonus\n•\tWeekly Cashback \n•\tExclusive VIP Promotions & Events\n•\tDedicated Personal Account Manager\n•\t24 Hour VIPA Team Support\n•\tBespoke Offers & Bonuses\n•\tPriority Withdrawals\n•\tVIP Table Limits\n•\tExclusive VIP Promotions & Events\n\nFor a full list of VIP benefits, visit www.galacasino.com/vip\n\nFor the latest offers, follow us on Social Media \nwww.facebook.com/galacasinoofficial\nwww.twitter.com/GalaCasinocom\n\nFor Full Terms & Conditions on each bonus: \nhttps://www.galacasino.com/promotions/first-deposit-bonus\n\nResponsible Gambling \n18+.   This is a real money gambling app.  Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org.  \n\nFor users in the Republic of Ireland, please contact telephone 1800 753 753 or visit www.problemgambling.ie.\n\nGala Casino operates under licence and in accordance with applicable laws and regulations.  For further licence information, please visit our website at www.galacasino.com.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-10-08T22:35:05Z",
  "updated": "2020-01-06T10:51:41Z",
  "releaseNotes": "We regularly bring updates to the App Store for your enhanced Casino experience.This update includes:\nChanges to enhance the push updates \nBetter crashlytics tracking \n\nThe Gala Casino Team!",
  "version": "19.12.03",
  "price": 0,
  "developer": "Gala",
  "score": 4.60044,
  "reviews": 458,
  "currentVersionScore": 4.60044,
  "currentVersionReviews": 458,
  "searchTerms": "slots"
 },
 {
  "appId": "com.paddypower.hybridgames",
  "title": "Paddy Power Games",
  "description": "New Customer Offer – 60 Free Spins to Play Daily Jackpots! T&C’s Apply\nUK and Ireland's hottest new real money games app from Paddy Power is here! Our app offers the biggest and best selection of real money casino games in the Google Play Store. All of your Casino favourites including Online Roulette, Blackjack, Slots and Scratchcards! \n\nPlay classic slots including Cleopatra, Rainbow Riches, and Genie Jackpots. Other popular games: King Kong Cash, Top Cat, Starburst. \n-Over 200 games to choose from that can be played with real or fun money\n-Jackpot slot games including Rainbow Jackpots, Bomb the Jackpot and Dragon’s Luck\n-Share games with your friends through Twitter, Facebook, Email and SMS\n-Award winning customer service available 24 hours a day\n-Play over 3G, 4G or Wifi\n\nLogin with your existing Paddy Power account to play the games. Our games are fully certified and offer you the chance to win real cash. Questions? Email us at support@paddypowergames.com\nPlease note this app is available to play for customers in the UK and Ireland only and you must be over 18 years of age.\n\n60 FREE SPINS T&C’s\n1) To take part, you must register via the registration code PGCTV1 and opt in to this promotion. 2) Get SMS-verified by supplying a valid telephone number. 3) Enter the validation code received by SMS to redeem the free spins. 4) Free Spins are valid on any of our Daily Jackpot games. 5) Free Spins will expire in 10 days from receipt of the offer.\n\nAll Paddy Power Games NEW CUSTOMERS can receive 60 Free Spins on our Daily Jackpots Slots Collection once they Opt In and complete the steps outlined below.\nALSO, all NEW CUSTOMERS can also receive a €30 Bonus on our Daily Jackpots Slots Collection when they Opt In, deposit and stake €10 or more on Daily Jackpot games. \nYou will receive 60 Free Spins for use on all valid Daily Jackpot games. The free spins each have a value of €0.10.\nTo take part, you must register via the registration code PGCTV1, opt in on-site and supply a valid telephone number that is capable of receiving an SMS. You will then be sent a validation code to that phone, which you must enter on site to redeem the free spins.\nIf you have previously taken part in our 10 Free Spins on Daily Jackpot games promotion, as seen on TV, or our 30 Free Spin on Daily Jackpot games promotion, you are not eligible for this promotion.\nOnce verified, launch any of the eligible Daily Jackpot games to claim your spins.\nThe offer is available to new Paddy Power customers in the UK & Ireland who have a valid mobile number.\nOnce you have completed using the bonus, you will begin staking real cash.\nFree Spins expire 10 days from receipt of the offer.\n•\tBy participating in this offer, you agree with these standard Terms and Conditions:\n•\tPaddy Power reserves the right to withhold any withdrawals and / or confiscate all winnings for irregular play.\n•\tOnly one bonus is available per customer\n•\tIf a Player is ineligible, PP reserves the right to withhold payment of the prize.\n•\tEntry will be forfeited if players are found to have multiple accounts.\n•\tPP games reserves the right to modify, alter, discontinue or terminate this promotion at any time for any reason what so ever without notice to players.\n•\tIn the event of any dispute, the decision of paddypower.com will be considered final.\n•\tThis offer is only available to customers in the UK & Ireland.\n•\tIf any of term of the promotion is breached, or if there is evidence that a customer is using the promotion to guarantee profits regardless of the outcome (whether individually or as part of a group), we reserve the right to reclaim the bonus element, and any pending winnings from play generated using the bonus funds.\n•\tFull T&Cs apply https://promos.paddypower.com/promotion?promoCode=GASUO60FS10PSUO \n•\tPaddy Power Games terms and conditions apply https://www.paddypower.com/en/aboutUs/Terms.and.Conditions/#PartF",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-02-06T10:52:49Z",
  "updated": "2019-05-09T12:57:14Z",
  "releaseNotes": "We have listened your feedback and want to make sure that customers get the best experience with Paddy Power Games. This version has improvements along with bug fixes.",
  "version": "6.0.0",
  "price": 0,
  "developer": "Paddy Power PLC",
  "score": 2.4,
  "reviews": 20,
  "currentVersionScore": 2.4,
  "currentVersionReviews": 20,
  "searchTerms": "slots"
 },
 {
  "appId": "com.meccabingo.meccabingo",
  "title": "Mecca Bingo Online Slots Games",
  "description": "Calling all Bingo Lovers, Welcome to the Mecca Bingo App! \n\n\nPlay today all your favourite casino slot games like Cleopatra, Da Vinci Diamonds and Reel King mini games as well as explore our many Mecca-exclusive bingo rooms and discover daily wins huge real money jackpots with fun, prize-packed promotions.\n\n\nAlready a Mecca player? Just log into your Meccabingo.com account to start playing your favourite live Mecca bingo and Mecca slot games now. We run daily promotions and featured games, making it even easier for you to win real money prizes and jackpots.\n\n\nFeatures:\n\n• Get in the bingo shape of your life with Mis-Shapes, our Mecca-exclusive pattern bingo room – try your luck for daily wins with tickets from just 5p.\n\n• Supersonic, Deal or No Deal and the Best Odds Bingo rooms are just some of the rooms you can play in for the same jackpots and prizes as found on Meccabingo.com.\n\n• Emoji Bingo is the fun and fast bingo game you can only play exclusively at Mecca Bingo.\n\n• Our exclusive partnership with The X Factor means all you Mecca bingo lovers have the chance to shine too.\n\n• Flying to a full house or cracking the real money community jackpot - how will you win Britain’s Got Talent Bingo? Get the chance to win up to 6 cash prizes for the best in bingo talent.\n\n• BOB! The new name in bingo. Everyone has an equal chance at daily wins, in every game. BOB promises no more than 25 players in a room and everyone with the same number of tickets!\n\n• Mecca Slots! Each spin could win real cash! All your favourite casino slot games including classics such as Rainbow Riches, Balloonies, Cleopatra, Da Vinci Diamonds, Reel King Potty and Clover Rollover.\n\n• 75 Ball bingo games are now in the Lucky 7, Mis-Shapes and Deal Or No Deal rooms.\n\n• We’ve added the all-time club favourite Cashline bingo room, which features the finest pattern bingo around as well as all the fun you know from your local Mecca bingo club.\n\n• Great feature games like Roll on Bingo, Superbooks and 1TG & 2TG – plus lots more Mecca games for hours of fun.\n\n• Keep up to date on all of Mecca’s promo action on our dedicated promotions page, which is updated daily with more prize-packed real money offers.\n\n• Chat to your Roomies while playing live bingo. Online or on their mobile, you can chat to them on the Mecca Bingo app all the same.\n\n• Play live in up to 4 bingo rooms at the same time on our iPad app. Just use the + icon in the header of the bingo room to choose additional rooms for the mini lobby.\n\n• Find your nearest local Mecca club for the best in live bingo games with a real chance at daily wins!\n\n• Every time you play bingo games with Mecca you’ll earn Mecca PlayPoints. For every £1 you spend on bingo you’ll be awarded Play Points which can be exchanged for Bonus funds and to buy bingo tickets.\n\n• Never miss a bingo game again with a comprehensive schedule, get pre-buy tickets for upcoming live bingo games up to seven days in advance. It doesn’t matter if you’re not there when the game starts - your tickets will automatically count and any winnings paid into your account balance.\n\nMecca Bingo, Mecca Slots, Mecca Games, whatever fun you’re looking for, download the app now because each spin could bring you a cash win!\n\nwww.meccabingo.com\n\n\nThis is a real money gambling app. \n\nPlease gamble responsibly and only bet what you can afford. \n\nFor gambling addiction help and support:\n\nGamble Aware at https://www.begambleaware.org/ and 0808 8020 133.\n\n\nThe Mecca Bingo app is only available to customers over the age of 18. Customers must also be located in the UK or Republic of Ireland to access the app and will be blocked to those not located in these countries. GPS is used to determine the location of customers. Mecca Bingo is part of the Rank Group which is regulated and licensed by The Alderney Gambling Control Commission.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Board"
  ],
  "contentRating": "17+",
  "released": "2011-01-06T09:49:27Z",
  "updated": "2020-04-06T08:56:16Z",
  "releaseNotes": "Your favourite bingo app just got even better! Our clever techy wizards have made a few small tweaks to make your experience a whole lot better. Come check it out!",
  "version": "5.10.4",
  "price": 0,
  "developer": "Mecca Bingo Ltd",
  "score": 4.46081,
  "reviews": 16523,
  "currentVersionScore": 4.46081,
  "currentVersionReviews": 16523,
  "searchTerms": "slots"
 },
 {
  "appId": "com.winnersclub.e88s",
  "title": "Lucky Time: Best Casino Slots",
  "description": "Looking for the best free slots casino games on iPhone? Lucky Time Slots is a leading slot machine casino games app for slots players who crave a real casino experience on mobile.\n\nFeaturing top slots machine games, Lucky Time Slots is where real enthusiasts find slot machine titles that guarantee an authentic Vegas 777 experience.\n\nWith Lucky Time you’re FREE to play slots online and on mobile. Get a HUGE Slots Coins Welcome Bonus and spin the amazing selection of Las Vegas casino games and video slots from the get go.\n\nLucky Time players get MORE COINS from a wide selection of free slots bonus coins that can be claimed online or on your mobile\n\nCollect Slots Bonuses hourly and daily - Hourly Bonus is available to players every 3 hours. Every 5th hourly bonus is a spin of the amazing bonus multiplier machine, adding even more coins to your bonus\n\nLUCKY TIME OFFER - For the first time ever, you can buy coins and a time amount for unlimited spins!!! \n\nSLOTS TOURNAMENTS - Get a Free Coins Bonus for all Slots Tournaments played\n\nLUCKY WINS – a one-of-a-kind Slots bonus that grants players an extra 5% on ALL WINS for 2 minutes\n\nBOOMERANG BONUS - an exclusive cashback reward based on yesterday's total wager! \n\nVIP BONUS - Climb the VIP ranks and collect more free coins and bonuses along the way\n\nFRIENDS BONUS - invite your friends to play slots and earn more free coins for every friend that joins\n\nFACEBOOK CONNECT - Earn a whopping free coins prize with one click\n\nMORE NEW SLOTS GAMES MEANS MORE WAYS TO WIN\n\n*777 Heaven - New Slot Machine Games released every week for both mobile and online slots players \n*Firecash Slot Machines: INCA MOON, FU FESTIVAL & WICKED HEARTS featuring FIRECASH JACKPOTS\n\nPOPULAR CASINO SLOTS GAMES INCLUDE:\nINCA Moon\t\t\tLove Stacks\t\t Lucky Choy Sun\nRapid 7’s Riches\t\tPyramids of Gold\tSecrets of the Nile\nBig Rhino\t\t\tFlaming Tiki\t\tGypsy Spirit\n\nStart playing the best free selection of slots on mobile. It’s all here and more at Lucky Time Slots.\n\n\nDisclaimer: \n* These slots are intended for an adult audience\n* These slots do not offer \"real money gambling\" or an opportunity to win real money or prizes\n* Practice or success at social casino gaming does not imply future success at \"real money gambling\"\n* GLADIATOR and all related characters and elements are ©2017 DW Studios LLC. All Rights Reserved",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-02-10T10:29:37Z",
  "updated": "2020-05-06T06:17:52Z",
  "releaseNotes": "Ready for an Island Adventure? New slot Isle of Fire with Reel Activation and Flaming Re-spin features is burning up the reels! It’s the perfect getaway to make you feel like you’re on vacation. Select your active reels before you play and watch exotic wilds and rings of fire boost your balance to incredible highs.\n\nExotic V2.75 also features general slots improvements and fixes for a smoother spinning experience.\n\nLike us? Rate us. Your feedback counts.",
  "version": "2.75.2",
  "price": 0,
  "developer": "DGN Games, LLC",
  "score": 4.78538,
  "reviews": 438,
  "currentVersionScore": 4.78538,
  "currentVersionReviews": 438,
  "searchTerms": "slots"
 },
 {
  "appId": "com.bet365.bet365GamesApp",
  "title": "bet365 Games: Slots & Casino",
  "description": "Exciting slot games, brilliant table games and enjoyable virtual sports – all ready to play in the bet365 Games app. With all the top providers, exciting casino games like Blackjack & Roulette and jackpot slots to play, there really is something for everyone!\n\nJoin bet365 Games today and play straight away.\n\nPlay all the latest games on your device instantly with a huge selection of casino games such as Roulette, Blackjack and Baccarat. We have lots of traditional casino games, with multiple versions of Blackjack, Roulette and Baccarat for you to play and enjoy.\n\nSpin to win across a wide range of slots - classic slots, video slots, premium slots, video slots and of course jackpot slots, there are so many to choose from! Win with fantastic slot games with bonus games, free spins and massive progressive jackpots.\n\n•\tPlay the world’s best casino games, such as Blackjack, Roulette and Baccarat\n•\tAll the best slots available, with huge real money jackpots\n\nUse your existing bet365 account to log in, or sign up now.\n\nbet365 Games gives you:\n\n•\tAll your favourite games in one place\n•\tInnovative slots and regular new releases\n•\tHuge jackpots across a selection of games\n•\tCasino classics such as Blackjack and Roulette\n\nWhether you’re an aspiring spinner or a casino veteran, the bet365 Games app is the perfect games app for you.\n\nWe have a massive selection of slots, lots of different Blackjack versions, variations of Roulette and all the best online Casino games.\n\n•\tHuge selection of fun, fast-loading games\n•\tLots of offers\n•\tTable games such as Blackjack & Roulette\n•\tClassic slots\n•\tJackpot slots\n•\tNew games every week\n\nDownload the bet365 Games app and start playing today! \n\nOur customer support team is on hand 24/7 to help with any queries.\n\nYou must be 18 or over to have a bet365 account.\nThis is a real money gambling app. Please gamble responsibly.\n\nFor the full terms and conditions please follow the link to the Developer Website below.\nPlease read the bet365 Privacy Policy (see link below) before installing this application. By installing and opening the application you are accepting this policy.\n\nFor gambling help and support in the UK, users can contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org.\nFor gambling help and support in IE, users can contact Gamble Aware at 1800 753 753 or visit http://www.problemgambling.ie.",
  "genres": [
   "Games",
   "Sports",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-05-31T16:18:43Z",
  "updated": "2019-09-23T10:57:00Z",
  "releaseNotes": "We've fixed some minor bugs, please keep feeding back as we're always looking to make our app better.",
  "version": "1.8.2",
  "price": 0,
  "developer": "bet365",
  "score": 4.47726,
  "reviews": 4111,
  "currentVersionScore": 4.47726,
  "currentVersionReviews": 4111,
  "searchTerms": "slots"
 },
 {
  "appId": "uk.co.pocketwin.slots",
  "title": "PocketWin Slots",
  "description": "With the PocketWin Slots app on your phone or tablet, you can take all of your favourite mobile slots games with you wherever you go. With BIG bonuses, MIGHTY mini-games, thrilling FREE SPINS features and HUGE PROGRESSIVE JACKPOTS, there’s a lot of fun packed into PocketWin Slots.*\n\nTop reasons to try PocketWin Slots: \n\n1.\tA great selection of amazing slots games at your fingertips, with exciting NEW GAMES being added regularly \n\n2.\tEver-growing progressive JACKPOTS on all of our games and at least one multiplier mini-game in each slots title\n\n3.\tGet a feel for the games for free in demo mode or play for FREE SPINS and real money prizes* \n\n4.\tAttractive welcome bonuses when you join PocketWin for the first time, plus regular bonuses for existing players*\n\n5.\tAvailable to play anytime, anywhere on almost any mobile or tablet, with 24/7 customer support at the touch of a button\n\nFull of Fun and Freebies\n\nWe offer great free bonuses for new and existing players, including our amazing welcome bonus, refer-a-friend rewards, loyalty bonuses and even chances to win free bonuses in our Facebook competitions.* \n\nTop Games All in One Place\n\nDownload PocketWin Slots and discover player favourites like Cheese Chase, Pocket Fruits and Silver Shamrock Slots. Or, explore one of our more recent exclusives like Casino Nile, Golden Empress Slots, Super Big Wilds and Sherlock: To Scratch a Killer. \n\nWe design and develop all of our games in-house, so you won’t be able to enjoy them anywhere else! We aim to release a new mobile slots game each month, so there’s always something new and exciting to discover. Better still, they usually come with an amazing FREE SPINS bonus offer!* \n\nProgressive Jackpot Prizes\n\nAll of our exciting mobile slots games give you the chance to play for real-money prizes, whether that’s a win on the reels, a multiplier in a mini-game, or one of our impressive progressive Jackpots! \n\nIf you’re lucky enough to line up five matching Jackpot symbols on an active win line, you’ll win the progressive Jackpot for the game you’re playing! To see how high those progressive prize funds are right now, just take a peek at the Jackpot totals displayed alongside the games in your app. \n24/7 Customer Support Built In\n\nOur UK-based customer support team is here 24/7, 365 days a year to help with any questions you may have about games, bonuses or your account. With the PocketWin Slots app, getting in touch is easy! Just use the Support menu in your app and you’ll be chatting to someone in no time. Alternatively, call 0384 888100 or text SUPPORT to 88600 for a free call back. \n\n*18+. T&Cs and wagering requirements apply. Full details can be found at https://www.pocketwin.co.uk/our-terms/terms-and-conditions/ \n\nPlayers must be 18 years or older and have a valid PocketWin account to be able to place a bet with this app. PocketWin Casino is a UK operated casino owned by Intouch Games Ltd. It is licensed and regulated by the UK Gambling Commission.\n\nThis is a real-money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at (0808 8020 133) or visit (https://www.begambleaware.org/).",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-08-23T08:06:55Z",
  "updated": "2019-05-07T13:13:44Z",
  "releaseNotes": "Minor performance improvements and support for new titles.",
  "version": "1.0.5",
  "price": 0,
  "developer": "PocketWin",
  "score": 3.23898,
  "reviews": 431,
  "currentVersionScore": 3.23898,
  "currentVersionReviews": 431,
  "searchTerms": "slots"
 },
 {
  "appId": "com.meccabingo.slotsandgames",
  "title": "Mecca: Slots & Games online",
  "description": "Wishing you a Mecca Warm Welcome!\n\nMecca Bingo is excited to bring you a dedicated Slots & Games app for customers who don’t want a bingo ball in sight! The Slots & Games app has been optimised for both iPhone and iPad, giving customers the best real-money gaming experience on the move.\n\n\nThere are over 100 real-money slots and games to play including all time casino favourites Blackjack and Roulette, as well as the much-loved Rainbow Riches, Cleopatra and Da Vinci Diamonds. There’s loads to choose from, whether it’s scratchcards or jackpots that tickle your fancy.\n\n\nWhen you explore the Slots & Games app you’ll find:\n• Over 350 real-money slots and games to play\n• Over 20 jackpots with £100,000s to be won at any time\n• Mecca Bingo’s most popular jackpot scratchcards: Wintry Wonderland and Arabian Delights\n• All-time casino favourites: Blackjack, Roulette and Video Poker\n\n\nAlready a Mecca customer? Just log in with your Mecca Bingo account and play away! If not, new players can register an account in less than 2 minutes by following the simple registration process in the app.\n\n\nFeedback\nWe love to hear what our customers think of our apps, so if you have any suggestions or comments please email to support@meccabingo.com. For any queries you have please contact our customer services team on 0800 083 1988.\n\n\n\nThe Mecca Slots & Games app is only available to customers over the age of 18. Customers must be located in the UK or Republic of Ireland to access the Slots & Games app and the app will be blocked to those not located in these countries. GPS is used to determine location of customers.\n\n\nMecca Bingo is part of the Rank Group which is licensed and regulated by The UK Gambling Commission for UK customers playing online or at our land-based casinos/bingo clubs. For customers located outside of the UK, Mecca Bingo is licensed and regulated by the Alderney Gambling Control Commission.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-10-15T02:57:41Z",
  "updated": "2020-04-06T08:56:53Z",
  "releaseNotes": "Your favourite slots app just got even better! Our clever techy wizards have made a few small tweaks to make your experience a whole lot better. Come check it out!",
  "version": "5.10.4",
  "price": 0,
  "developer": "Mecca Bingo Ltd",
  "score": 4.41045,
  "reviews": 804,
  "currentVersionScore": 4.41045,
  "currentVersionReviews": 804,
  "searchTerms": "slots"
 },
 {
  "appId": "com.luckjoy.vegasluckyslots",
  "title": "Lucky Win Casino: Vegas Pokies",
  "description": "Play the most popular slot machines and vegas casino games with your friends!\n\nHave you meet the rising phoenix in the fire? \nWill you enjoy collecting gold from the God of Wealth? \nTime to do that in this exciting 5-reel slots! Welcome to this wonderful world!\nWith dazzling bonuses and endless wins, you can take as much as you want. Also chances to engage in thrilling tournaments, playing with millions of slots fans and getting your place on the top of leaderboards!\nSplendid animations, colorful graphics, touching music... All are prepared for you. Just come to spin and have fun!\n\nGame Features\n\n-Get started with 20,000,000 FREE coins!\n-Free coins rewarded every hour when you play!\n-Daily bonus with abundant coins. Chances to win jackpot!\n-Extra gambling games to double or quadruple your winnings!\n-Randomly change ordinary symbols into Wilds, forming extra paylines!\n-Enjoy the game whenever you want. No internet required after installation!\n\nThe game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Any success in social casino gaming is not indicative of future success at real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-09-16T18:18:23Z",
  "updated": "2020-02-17T21:17:31Z",
  "releaseNotes": "Good news for our Slots friends! NEW slot is added this time!\n\n-Brand new update with thrilling Jackpots and loads of fun\n-We've made some performance improvements to keep the Vegas slots fun going.\n\nThanks for playing our casino slots! Keep spinning and good luck to you!",
  "version": "1.4.6",
  "price": 0,
  "developer": "Luckjoy Co., Limited",
  "score": 4.73365,
  "reviews": 841,
  "currentVersionScore": 4.73365,
  "currentVersionReviews": 841,
  "searchTerms": "slots"
 },
 {
  "appId": "slots.machine.winning.ios",
  "title": "Winning Slots™ - Casino Slots",
  "description": "THE BEST SLOTS & CASINO GAMES\n\nPlay the most popular free Vegas Casino Slots game in 2020 and claim 10,000,000 FREE COINS as a welcome bonus! Claim awesome bonuses, spin your favorite casino slot machines, and get ready to experience the best free Vegas slots casino online! Prepare to enter the world of the best casinos in Vegas! Spin for Super Bonus and win Jackpots! \n\nOfficially Licensed Dark Horse Comics The Mask Slot Machine Game! The Mask slot is based on the Dark Horse Comics comic. Fans of the Mask will definitely love this slot machine. It highlights great gameplay and a high payout.\n\nGAME FEATURES:\n- Enjoy a variety of exciting slot machines – with new machines added weekly!\n- Huge Jackpots to win on every free Vegas casino slot machine game! \n- Big wins and triple wins which give you this special Las Vegas casino feeling! \n- Participate in slots tournaments for HUGE prizes!\n- Break Piggy Bank to collect coins saved in each spin!\n- Lucky scratch lottery tickets with bonuses every day!\n- Join the Vegas VIP program to get bonuses and lucky chances!\n\n\nAwesome Bonuses:\n-  Free coins every three hours in the game.\n- Daily free coins when you log in to the game.\n- Free bonus coins when you level up.\n- Free credit sweepstakes and online casino slots free promotions.\n- Participate in Daily Bonuses on our Facebook page.\n- Subscribe our notifications and mails to receive free coins.\n- Invite your friends to play Winning Slots™ and send coins to each other.\n- Connect your Facebook or email account to receive free coins.\n\nFollow us for exclusive coins offers and bonuses:\nFacebook: https://www.facebook.com/playWinningSlots\nInstagram: https://www.instagram.com/playwinningslots/\nTwitter: https://twitter.com/winning_slots\n\nVisit the website to learn more about Winning Slots™:\nhttp://playwinningslots.com/\n\nSUBSCRIPTION:\n\n*Weekly VIP Privilege offers $9.99 weekly subscription for the following benefits:\n- Free coins worth $1.99 everyday!                   \n- Unlock all slots!                                               \n- Early Access VIP Slots!                                                        \n- A random card package!\n- Remove ADS!\n\n*Monthly VIP Privilege offers $29.99 monthly subscription for the following benefits:\n- Free coins worth $1.99 everyday!                   \n- Unlock all slots!                                               \n- Early Access VIP Slots!                                                       \n- A random card package!\n- Remove ADS!\n\nThis price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.\n\n- Payment will be charged to iTunes Account at confirmation of purchase\n- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period\n- The account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal\n- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase\n- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable\n\nYou can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. \n\nPrivacy Policy: https://sites.google.com/view/t7privacy/\nTerms of Use: https://sites.google.com/view/t7gametermofuse/\n\n*ATTENTIONS:\n- This game is intended for an adult audience.\n- This game does not offer real money gambling or an opportunity to win real money.\n- Wins made while gambling in social casino games can't be exchanged into real money.\n- Past success or practice at social casino gambling does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-01-23T04:09:20Z",
  "updated": "2020-04-17T16:02:55Z",
  "releaseNotes": "*** NEW Slot Machines NOW released! Update for Free Coins!***\nWe've just added more FUN to Winning Slots, including new games, feature improvement, and updates to take your experience to the next level!\n- New slot machine: Elemental Queen\nA brand new slot game! Update to win JACKPOTS & BIG WINS!\nDo you love us? Please rate us! Your comments are important!\nFollow our fan page to collect free coins:\nhttps://www.facebook.com/playWinningSlots",
  "version": "1.90",
  "price": 0,
  "developer": "Triple Sevens Co., Ltd",
  "score": 4.6609,
  "reviews": 289,
  "currentVersionScore": 4.6609,
  "currentVersionReviews": 289,
  "searchTerms": "slots"
 },
 {
  "appId": "com.ultra7game.slotultimate",
  "title": "Slots! Ultimate Slots of Vegas",
  "description": "Check out this ultimate invitation from Ultimate Slots！\n\nStart your amazing Vegas casino adventure today wherever you are! The #1 rising free casino slots app, Ultimate Slots features exclusive Las Vegas casino video slot machines just for YOU!\n\nDownload Ultimate Slots today to experience the thrills and magic of real Vegas casino games, win incredible jackpot payouts, and increase your chances for huge slots rewards. Start playing now to instantly receive 10,000,000 FREE COINS as welcome bonus, and login via Facebook to earn an additional 1,000,000 Ultimate Slots coins! \n\nWith Ultimate Slots, enjoy more free slot coin bonuses, exclusive in-game offers and promotions, innovative casino slots game features and striking HD graphics, earn higher payouts and faster level-ups, and complete special challenges as well as epic community tournaments. \n\nUltimate Slots offers the ultimate free casino slots experience with numerous amazing video slots to choose from:\n-Start your African safari with wild animals at ELEPHANT RUSH slot and wildly win up to 10 of-a-kind! \n-Witness the magical slots collision between BLAZE AND COLD slot and smash towards exciting jackpot prizes and winnings multipliers!\n-Thirst for casino riches with Dracula and share the Grand Jackpot in HALLOWEEN MAGIC!\n-Navigate a mysterious route toward the Great Pyramid of Egypt during PHARAOH’S SUPREMACY and collect the special blue-eyes to trigger the bonus wheel of treasure!\n-Turn fruits into coins at BOOMING TREE slot machine and surge towards a savory fortune!\n\nStay tuned each week for exciting new casino slot games and slot features. Start spinning now and make your next spin an ULTIMATE win! \n\nQuestions? \nFeel free to contact our support team through the “Contact Us” tab in Game Settings, or simply send an email to: ultimateslots@outlook.com\n\nDISCLAIMER\n- The game is intended for adult audiences over the age of 18 and does not offer real money gambling or an opportunity to win real money or prizes.\n- Any success in social casino gaming is not indicative of future success at real money gambling.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-05-25T20:30:36Z",
  "updated": "2020-03-03T18:41:28Z",
  "releaseNotes": "Hello Ultimate Slots fans! We have made several exciting updates to keep your favorite slots extra-shiny and full of funs！\n\n-More FREE COINS！\n-We've made some improvements to keep the fun going.\n-Fix several bugs you reported to streamline your slot gameplay.\n\nEnjoy the Las Vegas Experience！Happy spinning and have fun with our Ultimate Slots!",
  "version": "1.1.5",
  "price": 0,
  "developer": "Wonder Game Limited",
  "score": 4.65732,
  "reviews": 321,
  "currentVersionScore": 4.65732,
  "currentVersionReviews": 321,
  "searchTerms": "slots"
 },
 {
  "appId": "com.bigfishgames.jackpotcityslotsf2pios",
  "title": "Jackpot Magic Slots™ & Casino",
  "description": "You must be 18+ to access this game.  This game does not offer gambling or an opportunity to win real money or prizes.  Practice or success at social gaming does not imply future success at gambling. \n\n--------------------- \n\nLooking for Vegas-style excitement?  Download Jackpot Magic Slots™ for free and spin up huge winnings, starting with a $1,000,000 free coin Welcome Bonus.  Enjoy AMAZING scatter slots games, Crazy Money® Deluxe™, community jackpots & more!  Play live with your friends or join a club and compete in online social tournaments.   So sit down, relax, have a martini and some coins – on us. We've got tons of slot games and friendly people to play with for free!\n\nFun & Exciting Vegas-Style Slots\n• Exciting slot machines with free spins \n• Exclusive bonus games\n• Play LIVE with your friends! \n\nClimb the ranks with CLUBS:\n• Join other players with our latest feature — Clubs. \n• Team up to win BIG PRIZES while playing your favorite slots games!\n• Create your own club or join an existing one\n• New ways to earn free coins\n\nPlay the best free slots: \n• Daily bonuses just for logging in! \n• Customize and strut your stuff with pets and gifts! \n• Compete for coin prizes in tournament\n\nWin big with 4 levels of jackpots! Awesome! Hit Flaming 7's for multiple jackpot levels in Jackpot City. Spin the Lightning Wheel for big prizes. Follow the yellow brick road for an adventure in Road to Oz. Click your heels together 3 times and you’re in the magic world of Jackpot Magic Slots™!\nGet in the zone with Jackpot Magic Slots™!\n\nQuestions? Suggestions? Contact us at http://www.bigfishgames.com/help/jackpotmagicslots\n--------------------- \nThis game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-07-15T20:31:20Z",
  "updated": "2020-04-27T16:14:18Z",
  "releaseNotes": "• Introducing a new event type, Golden Egg Magic!\n• Play our newest slot machines: Aloha Fortunes, Big Fortune Double Up\n• Minor bug fixes",
  "version": "12.3.4",
  "price": 0,
  "developer": "Big Fish Games, Inc",
  "score": 4.59011,
  "reviews": 9366,
  "currentVersionScore": 4.59011,
  "currentVersionReviews": 9366,
  "searchTerms": "slots"
 },
 {
  "appId": "com.GalaInteractive.GalaBingo",
  "title": "Gala Bingo: Play Bingo & Games",
  "description": "With over 20 bingo rooms to choose from and ‘00’s of leading slots and instant win games, it’s little wonder that Gala Bingo is the UK’s favourite bingo room. \n\nWhy choose Gala Bingo?\n•\tPlay ALL of your FAVOURITE online bingo variants, from FREE bingo through to 40, 50, 75 and 90 ball bingo\n•\tEnjoy progressive jackpot rooms like Deal or No Deal or All Sorts where BIG money can be won!\n•\tPlay bingo in EXCLUSIVE tv show rooms like The Chase, Coronation Street and Emmerdale \n•\tPlay from as little as 1p!\n \nWith over 250 exciting slot games to choose from, there's never been a better time to try your hand at playing at Gala Bingo:\n\n•\tPlay top SLOTS like Downton Abbey, Rainbow Riches, Starburst, Fishin Frenzy, Megaways, The Goonies, Well Well Well, Diamond Mine Megaways, Fluffy Favourites, Age of the Gods and Genie Jackpot Megaways\n•\tPlay exclusive ‘Gala Gold’ slots like Big Banker Slot, Money Multiplier and Cake Off \n\n•\tBig JACKPOT titles – Tiki Treasure Megaways, Loot’en Khamum, Fortunes of RA, Wish upon a Jackpot KING, Gold Frenzy, The Winnings of OZ and Clover Rollover\n\n•\tSLINGO Rainbow Riches, The Chase SLINGO, Monopoly SLINGO and SLINGO Who Wants to be a Millionaire are just some of the fantastic SLINGO games we have on offer\n\n \nHere are just some of our features:\n\n1 - Check out our Guaranteed Jackpots – hit the newest top targets from our royal lineage games at Gala Bingo and you'll be quids in. \n\n2 - Introducing Gala Rewards – a new reward scheme for all!  We've replaced Gala Bingo VIP with Gala Rewards, a new and INCLUSIVE rewards scheme designed to make everyone feel valued. With Gala Rewards, you can enjoy special perks regardless of your budget! \n\n3 - Pre-buy tickets for ALL games 24/7! Snap up entry to the big games, then play at your leisure \n\n18+.  See www.galabingo.com/rewards for terms and conditions\n\nTwitter - @GalaBingo\nFacebook - @GalaBingoOnline\nInstagram - #galabingo\n \nResponsible Gambling  \n18+.   This is a real money gambling app.  Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware on 0808 8020 133 or visit www.begambleaware.org.  For users in the Republic of Ireland, please contact telephone 1800 753 753 or visit www.problemgambling.ie.\n\nLicensing:\nGala Bingo operates under licence and in accordance with applicable laws and regulations.  For further licence information, please visit our website at www.galabingo.com.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-12-21T20:09:22Z",
  "updated": "2020-02-05T12:25:05Z",
  "releaseNotes": "We regularly bring updates to the App Store for your enhanced Casino experience.This update includes:\nChanges to enhance the push updates \nBetter crashlytics tracking \n\nThe Gala Casino Team!",
  "version": "20.01.01",
  "price": 0,
  "developer": "Gala",
  "score": 4.63699,
  "reviews": 6044,
  "currentVersionScore": 4.63699,
  "currentVersionReviews": 6044,
  "searchTerms": "slots"
 },
 {
  "appId": "com.ballytechnologies.quickhitslots",
  "title": "Quick Hit Slots – Vegas Casino",
  "description": "Quick Hit Slots™ is THE #1 mobile casino game!\nDiscover the Best of Vegas Slots - ONLINE!\n\nThat Vegas Feeling anywhere!!\nLas Vegas in the palm of your hands! The best of Bally’s REAL-LIFE Casino slot machines are ready & waiting to spin for FREE!!\nGet your Quick Hit fix with your morning coffee, on your daily commute or after a long stressful day at work.  Any place is an EXCELLENT place to get that 777 Heaven & win our DOUBLE & TRIPLE JACKPOTS on Quick Hit Slots!\n\nClassic, real-life Slots from Vegas!\nClose to 100 SLOT MACHINES (New slots added every month!) with the AUTHENTIC LOOK & FEEL of some of the world’s much-loved fruit machines. Programmed to SPIN & WIN just like their real-life counterparts including:\nQuick Hit Platinum™, Quick Hit Cash Wizard™, Quick Hit Riches™, Quick Hit Wild Red & Blue™, Quick Hit Triple Cash Wheel™, Quick Hit Black & White™ the list goes on and on!!\n\nGreat Features! - More than just Slots\nNever be idle again as Quick Hit Slots takes the slot experience to the NEXT LEVEL!! With UNIQUE daily challenges, LIVE TOURNAMENTS & ever-changing bi-monthly promotions where you can win AMAZING bonus & coin rewards.\n\nSpin2Win, The Crazy 8 Challenge, Sneak Peak, The Winners Challenge & Trivia Nights (among many others!). \n\nBe lucky, Spin fast, Blitz those reels & make yourself Quick Hit Rich in the process. Join the Quick Hit Mania of Scatter Pays, multipliers & getting that much needed respin to keep you in the game!\n\nGet Free slots games that are blast to play, with FAST reels that will get you that HUGE WIN day after day. Become a Slots Tycoon with PROGRESSIVE JACKPOTS, blazing sevens & bask in the real Vegas slots experience. \nSlots classics for FREE & with BIG WINS!! What more could you ask for?\nWINNING just got a whole lot more FUN with Quick Hit Slots.\n\nThe games are intended for an adult audience (Aged 21 or older).\nThe games do not offer “real money gambling” or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at “real money gambling.”",
  "genres": [
   "Games",
   "Action",
   "Lifestyle",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-09-18T04:56:27Z",
  "updated": "2020-04-11T10:26:09Z",
  "releaseNotes": "It's that time of year where Quick Hit Slots will put that SPRING in your step!\n \nHot MINI-GAMES including our Easter Golden Egg Hunt!\nSPECIAL Bonus Slots!\nNEW TRIVIA & Raffles!\nEXCLUSIVE Jackpot Slots!\nUNIQUE CHALLENGES to keep you on your toes!\n \nDOWNLOAD & UPDATE to immerse yourself in a Quick Hit Slots utopia!",
  "version": "v2.5.16",
  "price": 0,
  "developer": "Appchi Media Ltd",
  "score": 4.48101,
  "reviews": 158,
  "currentVersionScore": 4.48101,
  "currentVersionReviews": 158,
  "searchTerms": "slots"
 },
 {
  "appId": "com.gamesys.starspins",
  "title": "Starspins",
  "description": "Spin the reels of Starspins’ exciting slots and be in with a chance to win huge real money jackpots.\n\nNew customers get 30 FREE SPINS on top slot: Secrets of the Phoenix when you play £10*.\nThere’s no caps on your winnings, and no wagering requirements on what you win. \n\nDaily Free Game!\nWe also have our Daily Free Game for all Starspins players. Play Doubly Bubbly for your chance to win Free Spins and up to £750 in cash for free every day of the week! You just need to have wagered £2 in the last 7 days and deposited a total of £10 or more in your lifetime.\n\nTop Slots and Casino Games\nStarspins casino offers you an enormous selection of exciting online slot and casino games including, roulette, blackjack and poker, perfect for casino lovers everywhere. \n\nOur huge range of online Slots includes popular favourites like Crystal Maze Win Zones, Chasin' Rainbows and MONOPOLY Rising Riches. You’ll also discover 4 progressive Star Jackpots that can be won on any real money spin at any time.\n\nNew online slot games are added all the time, so download the Starspins app to make sure you can enjoy all of the latest fantastic slots.\n\nNew customers get 30 FREE SPINS on top slot: Secrets of the Phoenix when you play £10*.\n\nAlready a player? Download our free Starspins app and log in with your existing details.\n\nPlease play responsibly. BeGambleAware.org  18+\n\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.\n\n\n*Welcome Offer:\n 1. If you are a new member, you will be eligible to receive 30 free spins (1p coin size, maximum lines) for the game Secrets of the Phoenix (“Free Spins”) when you successfully complete the following criteria (the “Qualifying Requirements”):\n a) register as a member of this website, which means that you must accept our website terms and conditions (which can be found https://www.starspins.com/terms#welcomebonusrules);\nb) make a first deposit of at least £10;\nc) opt in to this promotion on making your first deposit; and\nd) wager at least £10 in cash on any game(s).\n2. You have 30 days from when you make your first deposit and opt in to complete the Qualifying Requirements and play any Free Spins before they expire.\n3. If you do not opt in to this promotion when you make your first deposit, you will not be eligible to opt in and receive Free Spins retrospectively.\n4. You can only take part in this promotion once. If we detect that any member has created more than one account (including in order to take part in this promotion multiple times, in breach of these Rules) we shall be entitled to close any such accounts (and void any Free Spins and related winnings).\n5. Your deposit balance and winnings (if any) are withdrawable at any time during this promotion, subject to our rights to temporarily withhold payments as further set out in section 5 of the website terms and conditions.\n6. We aim to make Free Spins available instantly when you complete the Qualifying Requirements, but please allow up to 72 hours in the case of technical difficulties.\n7. If you opt in to this promotion, you agree to comply with the website terms and conditions and these Rules at all times. If (based on reasonable evidence) we find that you have seriously breached the website terms and conditions or these Rules, we may render Free Spins and related winnings in your member account void, and we reserve the right to close your member account.",
  "genres": [
   "Games",
   "Casino",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2016-10-03T17:27:59Z",
  "updated": "2020-03-11T11:42:11Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.64014,
  "reviews": 2212,
  "currentVersionScore": 4.64014,
  "currentVersionReviews": 2212,
  "searchTerms": "slots"
 },
 {
  "appId": "com.mansion.slotsheaven",
  "title": "Slots Heaven Card & Slot Games",
  "description": ">>>DOUBLE YOUR MONEY WITH OUR 100% UP TO £100, PLUS 200 SPINS WELCOME PACKAGE<<<\n\nDownload today for the chance to win huge jackpots on the very best slot games!\n\nPlay all your favourite online casino games on the go; including slots, Roulette, Blackjack, Live Casino, and plenty more – with hundreds to choose from, you’ll be spoilt for choice. \n\n5 reasons you’ll love to play at Slots Heaven: \n\n1. Tonnes of regular promotions, offers and giveaways – from big bonuses to luxury holidays \n2. Collect Loyalty Points each time you play, then turn them into cash bonuses \n3. Experience the thrill of Live Casino, right in the palm of your hand \n4. Play for real money, or play or fun with demo mode \n5. Giant progressive jackpot games are ready to spin whenever, wherever\nJump in and join the fun today; whether you’re a master at Roulette, a whiz on the slots or love a bit of Live Casino action – there’s never a dull moment at Slots Heaven! \n\n24/7 CUSTOMER SUPPORT:\nWhatever the query, our friendly Customer Support team are always ready to help. \nFor any assistance, day or night, simply email: support@slotsheaven.com or give us a call on our UK Freephone number: 0800 279 7347\n\nSAFE AND SECURE \nLicensed and regulated in the UK, Slots Heaven is a key player in the highly respected Mansion Group. Our online casino is safe, secure, and second-to-none. From cleverly engineered games for mobile devices and tablets, to an interactive live casino where you can enjoy all the action in the company of a real croupier, Slots Heaven has your online casino experience covered.\n\n\n\nRESPONSIBLE GAMBLING\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/\n\n\n\nSIGNIFICANT TERMS:\n100% Welcome Bonus: \nNew customers only. \nMin. deposit £20. \nMax. bonus £100, applied to 1st qualifying deposit only. \nBonus is non-redeemable with 40x wagering. \nGame weighting applies. \nBonus Betting limits: Slots - £5 All other games – 10% of bonus amount. \n\nSpins: \nNew customers only. \n40 on 1st deposit + 20 per day for the next 8 days (valued £0.20 - £0.25). \nWagering on Age of the Gods slot games only. \nWager 20x before withdrawing. \n30 days to complete wagering. \nMax. winnings £100.\nFor more info and the full T&Cs, please visit: https://play.slotsheaven.com/promotions/welcome-bonus",
  "genres": [
   "Games",
   "Casual",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-05-26T14:39:38Z",
  "updated": "2020-03-20T11:19:46Z",
  "releaseNotes": "Fully optimised with the best native games, improved app speed and overall user experience.",
  "version": "7.1.0",
  "price": 0,
  "developer": "Casino.com",
  "score": 4.46666,
  "reviews": 105,
  "currentVersionScore": 4.46666,
  "currentVersionReviews": 105,
  "searchTerms": "slots"
 },
 {
  "appId": "com.gamesys.jackpotjoy",
  "title": "Jackpotjoy: Bingo & Slot Games",
  "description": "Enter a world of fun at the award-winning Jackpotjoy and play our fantastic Bingo, Slots and Casino games. \n\nThere's Bingo and Slot game jackpots worth thousands, which can be won from as little as 1p. As well as super promotions to play in our entertaining Chat rooms, Jackpotjoy is the place to be!\n\nSo join Jackpotjoy today, the proud winners of Global Gaming’s ‘Bingo Operator of the Year’ in 2018 and 2019. \n\nDaily Free Game**\nTry the Daily Free Game Doubly Bubbly where you could win Cash or Free Spins on the hugely popular Double Bubble Slot game. With a £750 top prize available, it’s time to get playing! \n\n**You just need to have wagered £2 in the last 7 days and deposited a total of £10 or more in your lifetime. \n\nBingo\nIn our 90 ball Bingo games you can play for super Jackpots and Full House prizes! In our Sapphire Bingo room enjoy exciting Bingo offers, like 1p games, BOGOF Bingo, Evens Stevens and Free Bingo!\n\nSlots\nIf you fancy a spin instead, Slots are where it’s at. Enjoy stunning titles such as Paper Wins, Winfall Wishes, Sapphire Sorceress and more.\n\nBest Chat and more\nYou’ll always be sure of a warm welcome whenever you join the conversation in Chat with our Hosts. You can have a natter about the latest soap drama, your new pet, even who makes the tea at home! And if it gets lively, they’re ready to party just as hardy as you can! There’s loads of games and quizzes to play, and you could even win cash or physical prizes just for taking part!\n\nThat’s on top of all our exciting onsite promotions as well, which could give you the chance to win anything from a household kettle to a holiday to America and beyond!\n\nCasino\nPull up a chair at our fantastic range of Casino games, including Roulette!\n\n\nPlease play responsibly. BeGambleAware.org. 18+\n\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.",
  "genres": [
   "Games",
   "Casino",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2013-08-21T18:06:47Z",
  "updated": "2020-03-11T11:39:47Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.6203,
  "reviews": 9713,
  "currentVersionScore": 4.6203,
  "currentVersionReviews": 9713,
  "searchTerms": "slots"
 },
 {
  "appId": "com.leftover.CoinDozer",
  "title": "Coin Dozer",
  "description": "Download and play Coin Dozer, the original coin pusher game enjoyed by millions of people! Experience the mania of addictive top free games and coin games found at carnivals, the circus, and arcades is now available at your fingertips to collect free coins and prizes! In Coin Dozer, you drop coins, shake the board, and raise the coins wall to collect lots of puzzle pieces and prizes for bonuses and power ups to climb to higher levels! Special coins will spawn along the way to help you win; don’t let them get away! Join the party and come push some carnival coins! You can play the game without wifi as well.\n\n\nFEATURES\n\n- Addictive 3D gameplay will keep you coming back to drop and push more coins!\n- Realistic physics that mimic your favorite carnival coin pusher; don’t forget to shake the board for that extra push!\n- Use the Coin Walls to collect coins, prizes, and puzzle pieces into your bin!\n- Drop a Giant Coin and watch everything on the board splash forward in a frenzy!\n- Lots of other Special Coins and Chips with unique abilities making free coin, prize, and puzzle collection dramatically exciting!\n- Look out for the Mystery Box to drop on the board! Collect it for free prizes!\n- Collect and complete all the many puzzles and prize lines for awesome rewards and game bonuses!\n- All new casino themed “Chip Dozer” unlocks at level 25! A whole new world of puzzles, prizes, and a slot machine jackpot! Spin for your chance to win!\n- Spin the wheel of fortune to try out your luck for jackpots and bumper rewards.\n\n\nYou’ll find yourself playing Coin Dozer everywhere you go; even play without the wifi; much like other Game Circus originals like Prize Claw and Paplinko! Bring your childhood carnival home with you and have a party on your phone or tablet with the top free coin pusher game! Mania will ensue as your mission to complete all the collectibles intensifies! Head over to the casino machine to spin the slots and win the jackpot! Whatever your strategy, it all starts with downloading Coin Dozer and playing today!",
  "genres": [
   "Games",
   "Entertainment",
   "Casual",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2010-05-21T22:33:00Z",
  "updated": "2020-01-17T10:50:48Z",
  "releaseNotes": "Special Coin Powers Every Weekend!\nFixed Prize Collection Bug: Every Prize Matters Now!",
  "version": "21.5",
  "price": 0,
  "developer": "Game Circus LLC",
  "score": 4.5797,
  "reviews": 15515,
  "currentVersionScore": 4.5797,
  "currentVersionReviews": 15515,
  "searchTerms": "slots"
 },
 {
  "appId": "com.phonato.casino.vegas.slots.machines.double.down.videopoker.craps.game",
  "title": "Vegas Slots - 7Heart Casino",
  "description": "Download now! New players get 1,000,000 FREE BONUS Coins in the #1 FREE to play Casino app in the world!\n\n7Heart Casino gives you a chance to WIN GRAND Jackpot on our Slot machines! Feel Las Vegas right at your home with 7Heart Casino! This app has been created by casino experts to match the real slots and casino experience.\n\nWin a massive fortune with HUGE Jackpots, Free Daily Games, Bonus Games, and many more! Play and win on our 777 slots.\n\nVegas Slots - 7Heart Casino lets you play some of the top Slot Machines, Roulette,  Video Poker, Blackjack, Baccarat, Craps, Keno, Lottery and many other games. Vegas Slots Casino offers you a chance to win MASSIVE wins with great fun. Play your favourite Casino Slot machines and enjoy the excitement of winning the jackpot.\n\nPlay your favourite slot machines - Mega 10X, Three Diamonds, Buffalo Dash, Irish Cash, Yummy Candy, Wolf Riches, Jewel Spin, Caesar, Zeus, Huge Bucks and many others.\n\n7Heart Casino gives you a chance to win MASSIVE prizes with AMAZING FREE slots machines!  Play your favourite casino slot machines games with 1,000,000 Free coins.\n\nEnjoy the experience of Vegas like never before with our unique Slot Machines! Have fun playing our table games! They will make you feel as if you are in the real casino playing your favourite game!\n\nAdditionally, spend time in the Casino city - 7Heart Capitalist! This exclusive city connects you to the virtual world. Buy, sell and invest virtual goods and make yourself a billionaire!\n\nThe game has engaging graphics, sound and smooth gameplay! This game takes you closest to being in Vegas!\n\nTop Features of 7Heart Casino :\n\n► Daily Bonus Wheel and Hourly Bonuses.\n► Hand Picked Slot games added frequently.\n► Larger-than-life Jackpot Wins.\n► Exciting & Interactive Bonus rounds.\n► Play Craps, Blackjack, Baccarat, Roulette, Video Poker, Keno and other table games.\n► Double Down on the BlackJack table and win Big!\n► Join VIP membership for exclusive rewards and many more benefits.\n► Play challenging Quests and win more!\n► Play Lottery and get a chance to win big!\n► Social Connect - Send your companions INVITE on Facebook and join them in the Casino.\n► Deals on Gifts - Send or receive gifts from your friends and get instant COINS.\n► Exclusive Casino City which can be owned by you. Enjoy amazing perks of a City Owner!\n► Become Rich! Feel Rich!\n► 24/7 Email/Phone Support!\n\nContinue the thrill of playing 7heart Casino and be a billionaire! Win Big!\n\nEnjoy the game!\n\nDisclaimer : The games are intended for an adult audience. Our games are meant for amusement and entertainment purposes only. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling\".",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-04-23T00:38:52Z",
  "updated": "2020-05-11T13:55:53Z",
  "releaseNotes": "********GRAND UPDATE ********\n- {NEW} 8 New Slot Games - The Jungle Queen, Blaze of Tiger, Wild Egypt, Rhino Gold, Beerfest Mania, Goldish Dynamite, The Pearl of Mermaid, Yin & Yang.\n- {NEW} 7Heart Rewards Section - Here you will be able to play cool games of chance for more ways to have fun! Explore and Enjoy!\n- {NEW} Leaderboard Introduced - Check where you stand vis-a-vis your friends and other players from the globe.\n- {NEW} Trophies - Measure your success in the casino. More the gaming activity, more the trophies! \n- Game Optimisations and Performance enhancements.\n- Fine tuning of the game play.\n- Bug Fixes\n\nEnjoy the Las Vegas experience! We hope that all of you #staysafe. If there is anything we can do to enhance your gaming experience, please feel free to ask for it. Share your feedback!",
  "version": "2.31",
  "price": 0,
  "developer": "Phonato Studios Casino Slots Gaming",
  "score": 4.81203,
  "reviews": 133,
  "currentVersionScore": 4.81203,
  "currentVersionReviews": 133,
  "searchTerms": "slots"
 },
 {
  "appId": "com.risingtidegames.blackdiamondslots.beta",
  "title": "SLOTS - Black Diamond Casino",
  "description": "Enjoy the Real Vegas Casino Experience.\nStep into the world’s most elegant social casino, designed exclusively for slots lovers. Let us transport you into a world of escapism, intrigue and luxury, filled with tantalising slots with high payouts, amazing jackpots and rewards every step of the way. Play one of our top of the line slot machines with authentic sounds and familiar faces from some of Hollywood's biggest box office hits, or experience the thrill of Magic Spins and massive progressive jackpots. Our mission is to provide you with a true Las Vegas experience -- with a hint of fairy dust, and the touch of a magic wand. Free casino slots have never felt this real!\n\nInstall Black Diamond Casino slots and enjoy luxury features:\n\n• Beautiful slot machines with captivating graphics - Visit the first family of fright in The Munsters, join Antonio for a romantic evening in Secrets of Venice, and head back in time with Danny and Sandy in Grease Back to School - as well as many many more!\n• Huge progressive & personal jackpots\n• Progressive jackpots and leaderboard – let the whole casino know that you’re climbing the ladder\n• Free Coin offers every day - the more you play, the more slots coins you’ll receive!\n• VIP Experience - Let us take care of all your needs\n• Social - Share coins with new and old friends \n\nBlack Diamond Casino - where the magic never ends!\n\nhttps://www.facebook.com/BLKDiamondCasino\nhttps://twitter.com/BDiamondCasino\n\n• The games are intended for an adult audience.\n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n• Practice or success at social casino gaming does not imply future success at \"real money gambling",
  "genres": [
   "Games",
   "Simulation",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-08-29T02:03:30Z",
  "updated": "2020-04-16T04:35:11Z",
  "releaseNotes": "Bug Fixes and Performance Improvements.",
  "version": "1.5.07",
  "price": 0,
  "developer": "Zynga Inc.",
  "score": 4.68443,
  "reviews": 244,
  "currentVersionScore": 4.68443,
  "currentVersionReviews": 244,
  "searchTerms": "slots"
 },
 {
  "appId": "com.williamsinteractive.goldfish",
  "title": "Gold Fish Casino Slots Games",
  "description": "Spin to win your favorite WMS & Bally slot machines! Over 200 classic 777 Vegas slots and casino games with free spins:) Plus, millions of FREE COINS for new players and huge FREE daily casino bonus!\n\nRelax, Win, & Repeat with the coolest online slots app:\n• Spin the reels and hit the jackpot with casino floor favorite LOCK IT LINK Diamonds\n• The GREAT ZEUS slot bestows big fortunes in this classic Las Vegas Strip casinos\n• Go wild in the BIER HAUS casino game\n• Double down on magic spins in CASH WIZARD casino slot\n• Grab your chips and win a fortune in DIAMOND ETERNITY slot game\n• Catch the winning big fish with your favorite fishing slot REEL EM IN - CATCH THE BIG ONE\n• Become an casino slot games legend with INVADERS! PLANET MOOLAH\n• Lookout for even more new slots in the future!\n\nWin Massive, Daily Free Gifts, Coins, and Enjoy Extra Benefits! There are so many ways to win with Gold Fish slots for iPad and iPhone - you just have to experience them all for yourself:\n• MILLIONS OF FREE COINS on first install!\n• Over 200 INCREDIBLE mobile casino slots free to choose from\n• Daily Bonus - 500,000+ FREE COINS every day you play, plus multipliers!\n• Receive FREE coins every 2 hours\n• Collect 1,000,000+ MEGA BONUS coins!\n• Multi-Level progressive jackpot slots – win up to 100 BILLION coins\n• Send and receive gifts from your friends - get millions in gift bonuses daily!\n• Play hot 2019 casino games for iPad & slots for iPhone with wild respins\n• The best WMS & Bally slot machine games with slots bonus rounds\n• Connect to Facebook for fun 777 casino bonus coin\n\nMake New Friends: Get Social with Gold Fish Casino Slots!\nJoin our community of half a million players who live, eat and breathe Gold Fish Casino games on our Community Page (www.facebook.com/goldfishcasinoslots) and on our Instagram page (www.instagram.com/goldfishcasinoslots)\n\nGold Fish Casino Slots is a Play-For-Fun casino that is intended for amusement only. All in-game sales are final. The games are intended for an adult audience. (i.e. Intended for use by those 21 or older) The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.”",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-06-04T17:33:06Z",
  "updated": "2020-04-22T21:26:13Z",
  "releaseNotes": "Here's the latest from Goldie!\n \n+ NEW island-themed DAILY BONUS GAME\n+ EPIC new slots\n+ Plus, other enhancements and bug fixes!\n \nUPDATE NOW, and be one of the first to access!",
  "version": "25.07.00",
  "price": 0,
  "developer": "Phantom EFX, Inc.",
  "score": 4.82731,
  "reviews": 1523,
  "currentVersionScore": 4.82731,
  "currentVersionReviews": 1523,
  "searchTerms": "slots"
 },
 {
  "appId": "com.mobilityware.Slots",
  "title": "Vegas Blvd Slots: Casino Game",
  "description": "Play the most realistic Vegas-style slots game around and experience EPIC WINS in Vegas Blvd Slots!  Enjoy diamond-quality themed slot machines, from the jungle depths of Amazon Queen to the glorious wilderness of Sunset Frontier. Join in on the Vegas Slots fun today! \n\nVegas Blvd Slots Feature:\n\nAUTHENTIC CASINO SLOTS \nExperience all the thrills of Vegas & Atlantic City with slot games that accurately replicate casino style slots, from the rewarding payouts to the fun BONUS GAMES! \n\nUNIQUE SLOTS GAMES\nCome explore all the different slot games Vegas Blvd Slots have to offer, ranging from adventures in forgotten temples to haunting ghouls that stalk the night. New machines added regularly! \n\nDAILY BONUSES & FREE COINS\nCheck back every day to spin the Daily Bonus Wheel and score HUGE WINNINGS! Also, don’t forget to check in often to collect even more FREE COINS! \n\nSTUNNING VISUAL & SOUND EFFECTS\nFrom the beautifully redrawn illustrations of each slot machine theme to the high-definition quality sounds of big wins, Vegas Blvd Slots brings the TRUE casino experience anywhere! \n\nPlay Vegas Blvd Slots on iPhone & iPad and start winning big today! \n\nFor answers to frequently asked questions, head over to http://www.mobilityware.com/support.php  \nLIKE US on Facebook  https://www.facebook.com/VegasBlvdSlots/  \nFOLLOW US on Twitter  @mobilityware  \nFor the latest info and what we are up to, check out http://www.MobilityWare.com/\n\n\nDISCLAIMER  This game is for entertainment purposes only. It is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling. Use of this application is governed by the Mobilityware™ Terms of Service. Collection and use of personal data are subject to Mobilityware’s Privacy Policy. Social Networking Service terms may also apply.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-03-16T18:15:55Z",
  "updated": "2020-03-21T16:06:01Z",
  "releaseNotes": "Hey Vegas Blvd Slots fans!  Come check out our new update with two NEW slots games.    \n\nNEW MACHINES\nPlay fun new bonuses and experience EPIC PAYOUTS in our two new slots games, Neon Blackout and Xin Nian Kuai Le! \n\nGAMEPLAY ENHANCEMENTS\nVarious updates to make your gameplay experience even better.  And hopefully it will bring you even more luck!",
  "version": "2020.3.1",
  "price": 0,
  "developer": "MobilityWare",
  "score": 4.70306,
  "reviews": 687,
  "currentVersionScore": 4.70306,
  "currentVersionReviews": 687,
  "searchTerms": "slots"
 },
 {
  "appId": "com.vegasslotspocket.heartofdiamond",
  "title": "Slots-Heart of Diamonds Casino",
  "description": "Come and Spin our addictive fun slots to escape from all bad luck and a boring day! Pick your favorite slot game free to unlock a completely brand-new way towards Las Vegas casino floor. It's your shining and super lucky day!\n\nHeart of Diamonds Casino would swipe all unpleasant blues or pressure, because we only provide the most entertaining free slot machines and massive grand wins, just for every slots lover and new beginner.\n\nEnjoy awesome free coins and lots of bonuses every day. Spin and grab more fun!\n- Get 20,000,000 coins instantly as Welcome Bonus after installing.\n- Every day a new progressive Daily Bonus will wake you up. Keep spinning!\n- Connect to Facebook to claim 3,000,000 coins. Share big win with your friends!\n- Don't forget to check your INBOX! More wonderful gifts and surprise are waiting for you!\n\nSuperb hot slots featuring wide varieties, creative gameplay and stack of winning features are just exclusively tailored for you! \n- Rush to play more than 30 fun Vegas slots!\n- Refreshing game play and mini games are coming! Diving into them for making a big fortune!\n- Multiple rewarded Respin will keep your winning rolling in Fire of Rock! Boom! Win like a eruption of volcano. Hear your winning coins falling. Tink—Tink!\n- Meet our gorgeous Vegas Lady and join fun night party in Diamond Heart. Believe me it's a blast to play and win mega with a cup of golden champagne! \n- Try your Irish luck by catching a Leprechaun! Find the treasure hidden under Rainbow!\n- Are you a loyal fan of Super bowl? Yay! Let's spin and feel the excitement of American Football in Score More slot. Cheer for them with the young cheering team!\n\nMore highlights are prepared for you! Try and we never let you down!\n- High payout and grand wins with lots of winning features.\n- Various winning features including FREE SPIN, RESPIN, BONUS GAME and so on!\n- Continued free coins and bonuses to make sure you can play longer.\n- Bright and colorful HD graphics, relaxing music to satisfy your heart like the interesting Jazz as lobby music background.\n- Feel bored on same old slots after a long time? Not here, new slots will be added every week for our dear fans!\n- All kinds of events, festival gifts and discount sales will be given away all the time.\n\nOur Heart of Diamonds slots will bring far more exhilarating and fun beyond your imagination! Join us to enjoy the real casino thrills and make shining fortunes following your heart. Download now and have hours of fun with us!\n\nThe game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Any success in social casino gaming is not indicative of future success at real money gambling.\n\nHave Any Question? \nPlease feel free to drop us a line at heartofdiamondslots@hotmail.com.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-03-24T22:57:02Z",
  "updated": "2020-02-18T22:47:16Z",
  "releaseNotes": "Welcome back, HOD Slots friends! \n-Fix several bugs you reported to streamline your slot gameplay. \n-We've made some improvements to keep the fun going. \nHappy spinning and have fun with our HOD Casino Slots! Love you guys!",
  "version": "1.4.1",
  "price": 0,
  "developer": "Unijoy Game Co., Limited",
  "score": 4.70551,
  "reviews": 1270,
  "currentVersionScore": 4.70551,
  "currentVersionReviews": 1270,
  "searchTerms": "slots"
 },
 {
  "appId": "com.huuuge.stars.slots",
  "title": "Stars Casino Slots",
  "description": "Putting the social in social casino! \n\nIt’s time to meet new friends in Slots Stars, a revolutionary new game which puts the social in social casino! With revolutionary new features and 25+ unique, amazing Slots, the game will guarantee you’ll be feeling like a real Star in no time!\n\nMeet new Friends\n\n\nEver wondered if any other slot maniacs live in your town? Would you like to make the social casino just a tiny bit more social? Activate location services to meet friends from your area and spin together!\n\nPersonalize Your Experience\n\nTired of generic avatars in social casino games? We have a solution! You can now upload your own avatar and make your virtual casinogoer truly your own!\n\nPlay thrilling Slots\n\nSlots Stars offers you a collection of 25+ completely unique, beautiful Slots that will have you spinning away for days! Whether you’re a fan of classic Slots or modern beauties, you’ll surely find something for yourself!\n\n► Hit the Grand Jackpot in Fu Fu Fu Fortunes and Jackpots!\n► Spin the Wheel of Wins!\n► Get some tasty Free Spins in Big Win Burgers!\n► Win some bling in Huuuge Jewels!\n► Get 777 wins in Speedy Spins!\n\nOn top of that, be sure to play HUUUGE LINK – a set of four Slots that share a truly HUUUGE Grand Jackpot to see how easy it is to win massive Jackpots in no time! Prepare to be amazed by the wonders of Ancient Egypt and China in this amazing Slot adventure.\n\n\n\nGet awesome bonuses\n\nSpinning isn’t the only way to get Coins in Slots Stars! Grab some freebies and play the Lottery to get them!\n\n► Collect Free Coins every 15 minutes in the Lobby!\n► A Free Bonus will appear in the Shop every 8 hours!\n► Play the Lottery to win up to 5 MILLION COINS!\n► Get extra Coins and Bucks every time you level up!\n\n\n\nRead our Terms of Use (www.huuugegames.com/terms-of-use), Privacy Policy (www.huuugegames.com/privacy-policy) and other important information.\n\nOur games are for entertainment only. All points in the game stay in the game and all game points have no cash value. Although in-game currency can be purchased for real money or won during gameplay, none of the items in the game have any cash value. Our games are intended for adult audiences only.\n\n► The game is intended for a mature audience.\n► The game does not offer real money gambling or an opportunity to win real money or real prizes.\n► Wins made while gambling in social casino games can't be exchanged into real money or real rewards.\n► Past success at social casino gambling has no relationship to future success in real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2019-01-03T15:35:36Z",
  "updated": "2020-05-11T11:41:04Z",
  "releaseNotes": "Hey there, Spinners!\nAs always, we're constantly working to improve the game experience for you. We've added minor tweaks and performance improvements so you can feel even right at home while spinning!\nLet's play together and #StayHuuuge!",
  "version": "1.19.6",
  "price": 0,
  "developer": "Huuuge Global Ltd.",
  "score": 4.65625,
  "reviews": 224,
  "currentVersionScore": 4.65625,
  "currentVersionReviews": 224,
  "searchTerms": "slots"
 },
 {
  "appId": "com.williamhill.games",
  "title": "William Hill Games",
  "description": "Are you a fan of the classics, the latest games or big jackpots? Whatever you’re in to, with over 400 slots, table and instant win games to choose from, there’s sure to be something for you at William Hill Games.\n•\tWant to get to your favourite games quickly? We’ve made it simple to bookmark them, so you can start playing at the touch/tap of a button\n\n•\tAfter a quick bit of fun? Try our impressive range of instant win games. With new releases added weekly, we’re bound to have something you’ll enjoy\n\n•\tGet even more from Games with our regular offers and promotions. Go to the promotions section and you’ll find them all in one place\n\n•\tFrom Deal or No Deal and Rainbow Riches, to 20p Roulette and Chain Reactor Super Trails, we’ve got all the popular games to keep you entertained. With exciting new games and instant wins added every week, the fun never stops at William Hill Games.\nGet the app today and start your adventure.\n\nThe app requires you be over 18 to participate in any gambling activity. Full details can be found on www.williamhill.com\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-03-05T07:19:42Z",
  "updated": "2018-02-27T09:23:12Z",
  "releaseNotes": "You will find our smart new look and feel when accessing the account menu!",
  "version": "1.4",
  "price": 0,
  "developer": "WHG (International) Limited",
  "score": 4.50387,
  "reviews": 516,
  "currentVersionScore": 4.50387,
  "currentVersionReviews": 516,
  "searchTerms": "slots"
 },
 {
  "appId": "com.chobolabs.thuglife",
  "title": "Thug Life Game",
  "description": "Build up your territory by attacking and raiding other players! Spin to to win big and grow your wealth. Will you be the next ultimate gang boss?\n\nMANY TERRITORIES TO EXPLORE\nExpand your territory to areas such as the Nightclub, Penthouse, Thugburger, Pawn Shop, Secret Motel, Hacker Garage, and with more new territories added regularly! \n\nSPIN TO WIN\nSpin to win! Increase your wealth and make it big!\n\nATTACK OTHER PLAYERS\nNo one is safe from your attacks! Show them who’s the boss and keep growing your empire!\n\nTOURNAMENTS\nChallenge other players and aim for the top to earn big rewards!\n\nCARD COLLECTION\nCard collections such as the Street Fight collection and Fire Arms collection will unlock amazing rewards!",
  "genres": [
   "Games",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2020-02-20T08:00:00Z",
  "updated": "2020-04-28T08:59:18Z",
  "releaseNotes": "• Bug fixes and improvements",
  "version": "1.5",
  "price": 0,
  "developer": "Chobolabs LLC",
  "score": 4.68519,
  "reviews": 1620,
  "currentVersionScore": 4.68519,
  "currentVersionReviews": 1620,
  "searchTerms": "slots"
 },
 {
  "appId": "com.topgame.titanslots2",
  "title": "Titan Slots™ II - Vegas Slots",
  "description": "***The most original free-to-play slots game in years!***\n\nWith Titan Slots II, you'll uncover the mystery of the gods by completing special tasks that are great fun, along with other fantastic game features. Come experience an exhilarating adventure that's just packed with fun!\n\nTitan Slots II is full of all kinds of great gameplay, and is especially designed for your iPhone/iPad to give you the most realistic Las Vegas casino experience.\n\nIf you love slots games, then you absolutely cannot miss out on Titan Slots II.\n\nAmazing features of Titan Slots II include:\n- A huge variety of slots games that provide you with all kinds of really fun slots experiences!\n- Huge payouts that will have you more excited than you've ever been!\n- Bonus games, free spins, and other special modes that are designed for non-stop fun!\n- Bonus slots: special slots-style bonus games with awesome payouts; you'll be winning more than you ever imagined while experiencing something that's truly a treat for the senses!\n- Daily challenges: complete the objectives to win rewards!\n- Regularly updated with new slot machines; the fun never stops!\n- Offline mode: Keep playing for free, even when you don't have an Internet connect!\n\nThe game is intended for an adult audience. The game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2015-12-17T20:17:20Z",
  "updated": "2017-09-28T02:46:23Z",
  "releaseNotes": "Minor bug fixes and improved performance.\n\nYour feedback gives us motivation to do better! We hope you all have a great time in Titan Slots II!",
  "version": "2.11",
  "price": 0,
  "developer": "TOPGAME",
  "score": 4.43283,
  "reviews": 67,
  "currentVersionScore": 4.43283,
  "currentVersionReviews": 67,
  "searchTerms": "slots"
 },
 {
  "appId": "de.merkur24.universalapp",
  "title": "Merkur24 – Online Casino Slots",
  "description": "Merkur24 Casino - The original Merkur online casino.\n\nAlways have the magic of the Merkur casino with you, play the best slots and feel like the king of Las Vegas. \nPlay from jackpot to jackpot and win huge amounts of chips. Gamble at the best slots for free.\n\nTons of slot machines are waiting for you to go all-in! \nMerkur24 offers huge amounts of the best casino games which are well known from real Merkur casinos.\n\n- offers the original Merkur Games \n- join the \"Road to Las Vegas\" quest with lots of challenges, royal jackpots and giant wins \n- get a steady supply of free chips to gamble \n- hugely growing jackpots in the top slot machines \n- play online with your friends and share your wins\n\nTop Slots:\n- Take - 777 - Five \n- Double Triple Chance \n- Super 777 Reels \n- Black Diamond \n- The Mighty King \n- Cash Fruits \n- Royal 777 XXL\n\nA huge welcome bonus of 150.000 Merkur chips is already waiting for you! Download Merkur24 Casino now - it's free :D\n\n► The game is intended for a mature audience. \n► The game does not offer real money gambling or an opportunity to win real money or real prizes. \n► Wins made while gambling in social casino games can't be exchanged into real money or real rewards. \n► Past success at social casino gambling has no relationship to future success in real money gambling.\n\nThis app has solely been established for an adult audience. \nIt does not offer real money gambling or an opportunity to win real money or prizes.\nSocial Casino games are intended for entertainment purposes and have absolutely no influence on any possible future success in gambling with real money.",
  "genres": [
   "Games",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2017-12-14T11:04:01Z",
  "updated": "2020-05-10T09:21:35Z",
  "releaseNotes": "With this update, you'll be ready for all of our brand new events\nWe've updated a number of our functions and corrected several errors to make the app all that much better.",
  "version": "4.7.5",
  "price": 0,
  "developer": "Whow Games GmbH",
  "score": 4.8484,
  "reviews": 343,
  "currentVersionScore": 4.8484,
  "currentVersionReviews": 343,
  "searchTerms": "slots"
 }
]