[
 {
  "appId": "com.igmarkets.ideal",
  "title": "IG: Spread Bets & CFD Trading",
  "description": "Download the mobile trading app from the world’s No.1 spread betting and CFD broker.*\n\n76% of retail clients lose money, please consider affordability.**\n\nTrade over 16,000 global markets on the move – including forex, shares, indices, cryptocurrencies and commodities – with IG’s free online trading app. Features include interactive charts, news, automatic trading alerts and real-time signals. You’ll enjoy exclusive access to data and analysis, with live prices available even before you log in.\n\nWe regularly update our app to suit your changing needs, so you can be sure you’re getting the best trading experience possible.\n\nTRADE OPPORTUNITIES\n• Access the markets through spread betting, CFD trading and share dealing – all from a single, natively-designed online trading app\n• Forex: trade our lowest ever spreads on major, minor and exotic FX pairs, including EUR/USD from 0.6 points\n• Indices: trade 24-hours on the FTSE 100, Wall St, Germany 30 and many other indices\n• Shares: online share trading on a huge range of stocks, including Apple and Google\n• Cryptocurrencies: bitcoin trading, plus ether, ripple, NEO and more\n• Commodities: 27 major commodity markets to trade, including oil, gold, silver, copper\n• Other markets: interest rates, sectors and more\n\nANALYSE TRENDS\n• Track market trends with our award-winning mobile charts\n• Access a wide range of technical indicators\n• See what others are trading with client sentiment indicators\n\nREACT TO THE MARKETS\n• Set trading alerts and respond immediately to trading opportunities\n• View the intraday high, low, change and percentage change of any market\n\nAdd markets to your watchlist to monitor live price changes\nIdentify and act on market movements with our range of interactive charts\nManage your risk with a range of stop and limit orders\nKeep track of your open positions with ease\nTrade shares and forex CFDs with direct market access\n\n\nFUND AND DEAL SECURELY\n• Secure 256-bit SSL encryption technology\n• Feel confident when you trade with an experienced provider, backed by over 45 years’ experience\n\nVIEW EVENTS\n• Stay on top of financial events with our Reuters newsfeed\n• Use our daily economic calendar to plan your daily strategy\n\nStart trading on the move. Download the IG mobile app today.\n\nSpread betting is only offered in the UK. Share dealing is offered in the UK and Ireland.\n\nYour capital is at risk.\n\nCFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. You should consider whether you understand how CFDs work, and whether you can afford to take the high risk of losing your money. Losses may exceed deposits.\n\nIG Markets Ltd (ref. number 195355) and IG Index Ltd (ref. number 114059) are authorised and regulated by the FCA in the UK.\n\nIG Asia Pte Ltd (Co. Reg. No. 200510021K) holds a capital markets services licence from the Monetary Authority of Singapore. Please read important information in the Risk Disclosure Statement at IG.com/sg.\n\nIG Markets South Africa Limited is an authorised FSP (41393). International accounts are offered by IG Markets Ltd as a juristic representative.\n\nIG Bank SA is registered and supervised by FINMA in Switzerland.\n\nIG Limited is authorised and regulated by the Dubai Financial Services Authority under Firm’s reference No. F001780.\n\n* Based on revenue excluding FX (financial statements, February 2018).\n\n** For ESMA regulated accounts only.",
  "genres": [
   "Finance",
   "Business"
  ],
  "contentRating": "17+",
  "released": "2010-12-18T02:20:45Z",
  "updated": "2020-04-28T11:02:25Z",
  "releaseNotes": "Improved the stability and performance of the app.",
  "version": "9.570.0",
  "price": 0,
  "developer": "IG Group",
  "score": 4.6269,
  "reviews": 11083,
  "currentVersionScore": 4.6269,
  "currentVersionReviews": 11083,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.cmcmarkets.iphone-cfd-unicountry",
  "title": "CMC Trading: Spread Bet & CFDs",
  "description": "Trade on stocks and shares, forex, indices, commodities and cryptos via spread bets or CFDs on our award-winning trading app*.\n\nBrought to you by the Financial Services Provider of the Year (Shares Awards, 2018), CMC Markets’ online trading app allows you to trade the financial markets on the go, 24 hours a day, from Sunday night to Friday night.\n\nFinancial spread betting and CFD trading allows you to profit from rising and falling markets without owning the underlying asset. Remember, markets can also move against you.\n\n== Mobile trading across a range of markets ==\n• Trade on shares – get exposure to global shares and ETFs, including Apple, BP and Lloyds\n• Trade on indices – based on the world’s leading underlying stock market indices\n• Trade on cryptos – including bitcoin, ethereum and ripple\n• Forex trading – take a view on major currency pairs like EUR/USD, GBP/USD and USD/JPY\n• Trade on commodities – on instruments such as gold, silver and oil\n\n== Instant access ==\n• Once installed, just log in to your account – the app gives you instant access to your spread betting or CFD account, so you can monitor the markets, view and amend positions, and trade on live streaming prices\n• You can also fund your account and customise advanced preferences, including preferred defaults \n\n== Key features and tools ==\n• Advanced dynamic search, plus filter products by type, country, region, volatility and performance\n• Advanced order tickets including stop-loss, trailing stop-loss, guaranteed stop-loss and boundary order options\n• Price depth ladder for automated instant execution of significantly larger trade sizes\n• Topical watchlists and mini ‘trend’ charts – view instrument details including spreads, margins, volatility and trading hours\n• Multiple chart types with more than 40 technical analysis indicators and drawing tools\n• Real-time market calendar with push alerts so you stay on top of crucial economic data as it’s released\n• Reuters news service across all asset types and available within each instrument menu\n• Client sentiment charts for every instrument, helping you to gain greater insight into the view of other traders\n• CMC Markets analysts’ commentary via our 'Insights' tool\n\n== Practise trading with our free demo ==\n• Download the app and practise spread betting and CFD trading with our free demo account\n• Includes £10,000 of virtual funds.\n\n\nFind out more: www.cmcmarkets.com\n\n\n----------------------------------\nSpread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 78% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money.\n\n*Awarded Best Mobile Phone/Tablet App based on highest user satisfaction among spread betters, CFD and FX traders, Investment Trends 2018 UK Leverage Trading Report.",
  "genres": [
   "Finance",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2013-07-13T23:36:41Z",
  "updated": "2020-05-01T08:51:52Z",
  "releaseNotes": "• Onboarding improvements to assist with Biometric login and Notification setup.\n• Minor bug fixes and performance enhancements based on customer feedback.",
  "version": "6.5.0",
  "price": 0,
  "developer": "CMC Markets",
  "score": 4.13253,
  "reviews": 83,
  "currentVersionScore": 4.13253,
  "currentVersionReviews": 83,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.cityindex.iphone.tradefair",
  "title": "Tradefair for iPhone",
  "description": "Tradefair Financials\n\nTrade the world’s financial markets anytime, anywhere, with our most advanced iOS app yet.\n\nTradefair offers everything you need to manage, analyse and monitor positions across your financial spread bets and CFDs, including: \n\n•          24-hour trading, 7 days a week\n•          Fast execution on thousands of global markets covering equities, indices, forex and more \n•          Tight spreads from just 1 point* on major indices\n•          Choice of risk management orders, including stop, limit and guaranteed stop losses\n•          World class live charting tools with multiple technical indicators\n•          Monitor and amend multiple watchlists of favourite markets\n•          Manage your Tradefair account\n\n*1 point spreads available on the UK 100, Germany 30, France 40 and Australia 200 during market hours on daily funded trades & daily future spread bets and CFDs (excluding futures).\n\nDownload now to join us on the trading floor.\n\nCFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money.\n\nSpread Betting, CFD Trading and Forex Trading are leveraged products and your capital is at risk. They may not be suitable for everyone. Please ensure you fully understand the risks involved by reading our full risk warning.\n\nThis app has been developed and built by GAIN Capital UK Limited. Tradefair Financials (“Tradefair”) is a trading name of GAIN Capital UK Limited, whose head and registered office is Park House, Finsbury Circus, London EC2M 7EB. GAIN Capital UK Limited are authorised and regulated by the Financial Conduct Authority in the UK FRN 113942 for details visit www.fca.org.uk. Registered in England and Wales No: 1761813. Vat no: 524837435.",
  "genres": [
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2015-10-05T00:49:45Z",
  "updated": "2019-04-30T14:00:46Z",
  "releaseNotes": "Various bug fixes and enhancements",
  "version": "4.19.7.10772.7833",
  "price": 0,
  "developer": "Betfair",
  "score": 2.44444,
  "reviews": 9,
  "currentVersionScore": 2.44444,
  "currentVersionReviews": 9,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.directinvest.trader",
  "title": "ii Spread Trading",
  "description": "Spread bet on over 5,000 individual markets across forex, indices, shares and commodities and never miss an opportunity to trade.\n\nThe ii spread trading app helps you keep your finger on the pulse of global markets with industry leading prices, superior execution and powerful analysis tools.\n\nWe’re a trading provider you can trust - listed on the LSE and authorised and regulated by the Financial Conduct Authority (FCA). Start trading today and enjoy the power of the markets at your fingertips whenever you want and wherever you go.\n\nDownload ii Spread Trading now and experience the power to Trade Connected.\n\n***NEW MULTI-DEVICE TRADING PLATFORM***\n• Multi asset class platform with industry leading pricing\n• Fast, secure trading app with price improvement technology\n• World class charting package designed for mobile\n• Trade with a Financial Conduct Authority (FCA) authorised and regulated, LSE listed provider\n• Get quality news, analysis and research from our expert team\n• Manage your account, deposit funds and customise your interface\n\nTRADE FOREX WITH CONFIDENCE\n• Trade over 60 popular currency pairs, whenever you want\n• Enjoy tight spreads from 0.6 pips on EUR/USD and USD/JPY\n• Trade directly from charts with a single tap\n\nTRACK AND TRADE A WIDE RANGE OF INDICES\n• Trade across UK, European, US and Asian markets\n• 24 hour access to global markets\n• Tight spreads on UK 100 and Wall Street\n\nACCESS GLOBAL SHARES MARKET\n• Trade shares including Barclays, Tesco, Apple and Facebook\n• Compelling analysis and breaking news from our world class team\n• Trade with a single tap, whenever and wherever you want\n\nSAFE, SECURE, DEPENDABLE\nWe are a global business, based in London with almost two decades of experience in online trading. We are authorised and regulated by the Financial Conduct Authority (FCA) and listed on the London Stock Exchange (LSE).\n\nAll of our client funds are held in segregated Tier 1 bank accounts, giving you peace of mind that your money is safe with us. Additionally our fast, reliable and secure trading technology means we’re one of the providers of choice for those serious about trading.\n\nFind out more by visiting our website at https://www.lcgspreadtrading.co.uk/\n\n-----------------------------------------------------------------------\n\nSpread betting carries a high level of risk to your capital and can result in losses that exceed your deposits. They may not be suitable for everyone so please ensure you fully understand the risks involved.\n\nii Financial Spread Trading is a trading name of London Capital Group Limited (LCG) which is registered in England and Wales under registered number: 3218125. LCG is authorised and regulated by the Financial Conduct Authority (FCA), registration number: 182110. Registered address: 3rd Floor, 80 Cheapside, London, EC2V 6EE.\n\nInteractive Investor Services Limited is incorporated in England and Wales with company number 2101863.  Registered office: Exchange Court, Duncombe Street, Leeds, LS1 4AX.  Authorised and regulated by the Financial Conduct Authority, 25 The North Colonnade, Canary Wharf, London, E14 5HS, United Kingdom (Financial Services Register Firm Reference Number 141282).  Member of the London Stock Exchange and NEX Exchange.",
  "genres": [
   "Finance",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2016-09-09T20:37:55Z",
  "updated": "2020-02-04T14:13:22Z",
  "releaseNotes": "With the new version of the ii Spread Trading app, come full-screen chart trading tools and drawings improvements:\n\n• Stop Loss and Take Profit can be added to positions & orders, and pending orders can be amended by drag & drop directly on the chart. \n• The Trend Line and Ray are improved, with precise moving of the edges.\n• Charts can now be scrolled to the future, for technical analysis purposes.",
  "version": "3.9.54225",
  "price": 0,
  "developer": "London Capital Group Holdings Plc",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.spreadex.SpreadexFinancials",
  "title": "Spreadex Financial Trading",
  "description": "Losses can exceed deposits.\n\nTrade 1000’s of global financial markets on the move with the Spreadex Financial Trading app.\n\nDownload the app to trade thousands of financials markets around the world including indices, shares, FX, commodities, interest rates and more. The app includes a range of tools for traders, from advanced charts to price alerts. \n\nTRADING\n-\tPlace spread bets, CFDs and Speed Bets on thousands of markets\n-\tAccess your account quickly and securely with PIN login and Touch ID\n-\tSecure Sockets Layer (SSL) encryption to protect your data \n-\tGuaranteed to get the best execution from our data providers\n\nTHOUSANDS OF MARKETS\n-\tIndices: all major indices including the UK 100, Germany 30  & Wall Street\n-\tShares: shares from around the world, including AIM stocks\n-\tFX: spot and future prices including EUR/USD and GBP/USD\n-\tCommodities: gold, oil, gas and many more \n-\tOptions, ETFs, Interest Rates and Bonds\n\nTRADING TOOLS\n-\tAnalyse the market with our advanced charting tools\n-\tEmploy technical indicators to help time your trades\n-\tManage your risk with stop and limit orders\n-\tSet your Price Tolerance Threshold to trade in fast-moving markets\n\nMONITOR YOUR POSITIONS\n-\tConfigure Watchlists to closely monitor your favourite markets\n-\tNever miss your entry time with our free Price Alerts service\n-\tAnalyse the Top Rising and Falling Shares\n-\tManage, close and edit your positions \n\nWe are sure that you will love our app, but if you see something that you would like improved email info@spreadex.com.\n\nSpreadex Ltd is authorised and regulated by the Financial Conduct Authority.\n\nSpread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 67% of retail investors lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money. \n\nFor professional clients, spread betting and CFD trading can also result in losses larger than your initial stake or deposit.",
  "genres": [
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2011-07-27T10:43:18Z",
  "updated": "2019-11-07T09:58:26Z",
  "releaseNotes": "Small changes and bug fixes.",
  "version": "3.3.0",
  "price": 0,
  "developer": "Spreadex Ltd",
  "score": 4.48052,
  "reviews": 77,
  "currentVersionScore": 4.48052,
  "currentVersionReviews": 77,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.intertraderdirect.swan.production",
  "title": "Intertrader – Trading App",
  "description": "Trade simply and securely on the move with Intertrader. Get all the world’s major financial instruments in the palm of your hand. \n\nTRADE SIMPLY AND SAFELY\n\nOur free mobile trading app gives you the power to trade thousands of global financial markets, with superfast market-neutral execution. Open a demo or a live trading account direct from the app.\n\nIntertrader offers spread betting and CFD trading on shares, indices, forex, commodities, rates and bonds. We operate a No Dealing Desk model where we mirror every trade you place in the real market, so we’re never trading against you.\n\nMAIN FEATURES\n\n•\tOpen and close positions on thousands of global markets\n•\tCreate orders to trade at specific market prices\n•\tView live charts for any market with simple scroll and zoom\n•\tApply 100+ chart overlays, studies and patterns\n•\tDeal and adjust your orders direct from your charts\n•\tView detailed trading signals on popular markets\n•\tSet simple or complex price and trendline alerts\n•\tSet and edit (non-guaranteed) stop and limit orders\n•\tSet and edit trailing stops\n•\tGet market news from multiple sources\n•\tView our global economic calendar with detailed listings\n•\tFund your account direct from the app\n\nAROUND-THE-CLOCK CUSTOMER SERVICE\n\nIf you have any questions, or would like to find out more about our services, you can contact the Intertrader team at +44 203 364 5189 – Monday to Friday 24 hours a day – or start a web chat via www.intertrader.com.\n\nSpread betting and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 78% of retail investor accounts lose money when trading these products with this provider. You should consider whether you understand how these products work and whether you can afford to take the high risk of losing your money.\n\nIntertrader is a trading name of Intertrader Limited which is owned and controlled by GVC Holdings PLC. Intertrader Limited is authorised and regulated by the Gibraltar Financial Services Commission and registered with the Financial Conduct Authority in the UK, ref 597312. Registered address: Suite 6, Atlantic Suites, Europort Avenue, Gibraltar.",
  "genres": [
   "Finance",
   "Business"
  ],
  "contentRating": "17+",
  "released": "2016-01-20T16:59:32Z",
  "updated": "2019-10-18T20:05:50Z",
  "releaseNotes": "Bug fixes for iOS 13.",
  "version": "3.4.5",
  "price": 0,
  "developer": "InterTrader Direct",
  "score": 4.30112,
  "reviews": 269,
  "currentVersionScore": 4.30112,
  "currentVersionReviews": 269,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.spreadex.sports.phone",
  "title": "Spreadex Sports Betting",
  "description": "The Spreadex Sports Betting app is the only app that allows you to place both sports spread bets and sports fixed odds bets.\n\nDownload the app today to bet on thousands of sporting events from around the world.\n\nSee below for some of the Spreadex Sports Betting app’s features:\n\n• Bet quickly and securely using Face ID, Touch ID or PIN login\n• Build your own football bets with our Bet-Builder markets\n• Watch matches and events while you bet, via our Live Streaming\n• Bet in-play with 3 cash out options; auto, one-click or partial\n• Tab between spread betting or fixed odds betting prices and view in decimal or fractional format\n• Analyse our pre-match football stats on all domestic, Champions League and Europa League matches\n• Monitor matches or events using our in-play match centres\n\nWe are sure that you will love our app, but if you see something that you would like improved email info@spreadex.com.\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. 18+ For gambling addiction help and support, please see below contact details for Gamble Aware in both UK and Ireland.\n\nUK: https://www.begambleaware.org and 0808 8020 133\nIreland: http://www.gambleaware.ie and 1800 753 753\n\nIn relation to spread betting, Spreadex Ltd is authorised and regulated by the Financial Conduct Authority. Spread betting carries a high level of risk to your capital and can result in losses larger than your initial stake/deposit. It may not be suitable for everyone so please ensure you fully understand the risks involved.\n\nIn relation to fixed odds and casino, Spreadex Ltd is licensed and regulated in Great Britain by the Gambling Commission under licence no 8835.",
  "genres": [
   "Sports",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-05-27T10:23:20Z",
  "updated": "2020-02-25T15:00:49Z",
  "releaseNotes": "App renamed to \"Spreadex Sports\"",
  "version": "2.10.5",
  "price": 0,
  "developer": "Spreadex Ltd",
  "score": 4.75397,
  "reviews": 126,
  "currentVersionScore": 4.75397,
  "currentVersionReviews": 126,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.cityindex.iphone.citytrading",
  "title": "City Index: Spread Bets & CFD",
  "description": "Winner of multiple awards, City Index offers users access to over 12,000 spread betting, CFD and Forex trading markets. Enjoy full, secure access to your account and never miss a trading opportunity. \n\nAccess trading markets using either a Spread Betting or CFD Trading account on;\n\n• Indices from the UK 100, Wall Street, Germany 30 and Australia 200\n• Over 4500 + global company stocks from the UK, U.S, Europe, Asia and Australasia\n• Commodities including oil, gas, food and more \n• Metals including gold, silver, copper and more \n• Options \n• Bitcoin\n• Bonds\n• Interest rates \n\nTrade on 84 global FX pairs using City Index's spread betting, CFD Trading or Spot FX on MT4 platforms with spreads from 0.5 points. \n\nWhy City Index? \n• Authorised and regulated by the Financial Conduct Authority (FCA)\n• Over 30 years' experience in Spread Betting, FX and CFD Trading\n• Fast trade execution, risk management tools and transparent pricing\n• Award-winning platform and app \n• Experienced Relationship Managers for insight and trading support\n• Fast, easy payments and secure withdrawals\n\n2017 Awards \n‘Best Spread Betting Service’ – Shares Awards\n‘Best Spread Betting Platform’ - ADVFN \n‘Best MT4 Broker’ – UK Forex Awards \n‘Best Tablet App’ - Online Personal Wealth Awards \n\nThe City Index iPhone app allows users to;\n\n• Trade, amend existing orders and place guaranteed stop loss orders (spread bet and CFD account only) \n• Check the latest prices and market movements \n• Access up to the minute market news and information from Thomson Reuters\n• Open and close positions with our new faster, simpler trading ticket \n• Research prices using real-time charts and multiple technical indicators \n• Rest assured of chart prices via live pricing data \n• Take advantage of leverage-to-suit (FX only) and price tolerance \n• View and amend multiple watch lists on favourite markets \n• Review trade and order history \n• View statements, balances and edit account information\n\nDownload now. Apply Now. Trade Now\n\nCreate a free demo account to build your confidence on our spread betting, CFD Trading, or MT4 platform. Each demo account offers 12 weeks unlimited access to over 12,000+ global markets and comes with a balance of £10,000 to trade risk-free.\n\nWhy Spread Betting?\n• Any profits made from Spread Betting are exempt from UK Capital Gains Tax and UK Stamp Duty*. Spread Bets do not incur any commission\n• A Spread Bet is a leveraged product, which means that you only need to deposit a small fraction of the overall value of any trade\n• Tight spreads from 0.5 points on FX pairs\n\nWhy CFD trading?\n• Access to over 4000 global markets including Indices, Shares, FX and Commodities \n• Commission free (except Shares)\n• Tight spreads from 0.5 points on FX pairs\n\nFollow City Index on Social \nFacebook www.facebook.com/CityIndexUK\ntwitter - @CityIndex ‏\n\nApply for a trading account through the app or at www.cityindex.co.uk\n\nCity Index is a trading name of GAIN Capital UK Limited. Head and Registered Office: Park House, 16 Finsbury Circus, London, EC2M 7EB. GAIN Capital UK Ltd is a company registered in England and Wales, number: 1761813. Authorised and Regulated by the Financial Conduct Authority. FCA Register Number: 113942. VAT number: 524837435.\n\nCFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 74% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money.\n\nSpread Betting, CFD Trading and Forex Trading are leveraged products and your capital is at risk. They may not be suitable for everyone. Please ensure you fully understand the risks involved by reading our full risk warning at https://www.cityindex.co.uk/terms-and-policies/risk-warning/.\n\n* Spread Betting and CFD Trading are exempt from UK stamp duty. Spread Betting is also exempt from UK Capital Gains Tax.",
  "genres": [
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2012-11-06T18:46:30Z",
  "updated": "2020-04-08T08:20:15Z",
  "releaseNotes": "Keep up-to-date with all the latest upgrades and features designed to enhance your trading experience. Our current version features best-in-class charting, over 80+ tools and indicators, plus instant financial news from Thomson Reuters.",
  "version": "4.20.31.10803.5416",
  "price": 0,
  "developer": "GAIN Capital Group LLC",
  "score": 2.98864,
  "reviews": 88,
  "currentVersionScore": 2.98864,
  "currentVersionReviews": 88,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.etx.traderpro",
  "title": "ETX TraderPro: Trading App",
  "description": "With industry leading-execution, on-chart trading and seamless transition with desktop, you can experience the intrinsic features of our award-winning TraderPro platform from the palm of your hand with our new ETX TraderPro mobile app. Gain access to over 5,000 markets and  trade Forex, Indices, Equities, Commodities, Bond and Cryptocurrency live pricing wherever you are. \n\nDownload the app and get access to a free demo account with £10,000 virtual funds. This will allow you to practice your Spread Betting and CFD trading strategy before going live.\n\n- Trade quick and direct from our interactive charting package with new features such as pinch to zoom and easy-scrolling so you can react instantly and make the most of every trading opportunity.\n\n- Take advantage of over 80 trading indicators, chart types and drawing tools whilst on the go to assist you to trade the financial markets\n\n- Keep on top of fast-moving markets by utilising our new and rapid price alerts. Receive instantaneous push notification and emails to make sure you never miss a trading opportunity again.\n\n- Add funds to your trading account safe and secure. You will be able to deposit and withdraw funds on the go conveniently and quickly from your mobile app.\n\n- Manage your trading risk with free* Guaranteed Stops on selected major markets. You will also be able to add standard stops and limits on all markets to orders and open positions, effectively managing your risk when you are on the go.\n\n- Take advantage of the new instant market execution and trade immediately at current levels.  \n\n-  Access to thousands of the world’s most popular and liquid financial markets. Indices such as UK 100, Wall Street, Germany 30, SP 500, US Tech 100 and more. FX such as EUR/USD, GBP/USD, USD/JPY, EUR/GBP and many more. Commodities such as Gold, Silver, Brent and Nymex oil and more soft commodities. Cryptocurrencies such as Bitcoin, Ethereum, Litecoin and Ripple. Equities from exchanges all around the world such as Apple (US) and Barclays (UK). Other markets including Bonds and Short-Term Interest Rates. \n\n- View and personalise your platform - how you view your trade and account history with our new custom sort option to create your own personalised trading experience.\n\n- Access your account quickly and easily with Touch and Face ID.\n\n- Remain logged in - there will be no more timeouts and you will not have to log-in again – the app will automatically reload for you for quicker access\n\n- Create personalised watchlists to improve your unique and personalised ETX experience.\n\nSpread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 75.1% of retail investor accounts lose money when spread betting or trading CFDs with ETX. You should consider whether you understand how spread bets or CFDs work and whether you can afford to take the high risk of losing your money.\n\nApple, iPad, iPhone and iPod touch, are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc.\n\nMonecor (London) Ltd is a member firm of the London Stock Exchange. Authorised and regulated by the Financial Conduct Authority with Financial Services register number 124721.\n\nThe information on this site is not directed at residents of the United States, Belgium, Canada, Singapore, or any particular country outside the UK and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation.\n\n*Free for retail clients on selected markets only",
  "genres": [
   "Finance",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2019-10-14T07:00:00Z",
  "updated": "2020-04-28T15:33:11Z",
  "releaseNotes": "- Bug and crash fixes.\n- General usability improvements.",
  "version": "1.1.2 (87)",
  "price": 0,
  "developer": "ETX Capital",
  "score": 4.44538,
  "reviews": 119,
  "currentVersionScore": 4.44538,
  "currentVersionReviews": 119,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.hl.hargreavestrading.iphone",
  "title": "HL Markets",
  "description": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 72% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money.\n\nHL Markets is provided in association with IG. For CFD trading and Spread Betting, all dealing, administration and settlement is carried out by IG.\n\nDeal globally in any market condition with the HL Markets app. Spread Bet and trade CFDs on shares, sectors, indices, FX and commodities.\nThe HL Markets app includes a range of features to help you identify trading opportunities, such as charts, news, alerts, analysis tools and more.\nDownload the HL Markets app now and take advantage of tight spreads, fast execution and the trusted stability of the HL Markets platform (provided by IG).\n\nAccess thousands of markets worldwide\n-\tShares: trade thousands of shares across the world’s major indices\n-\tCommodities: gold, silver, copper, oil and more\n-\tIndices: trade all the major indices\n-\tSectors: take a view on which way they’ll move\n\nInteractive trading platform\n-\tTrade CFDs and spread bet from one app\n- \tLive prices and price improvement\n-\tManage risk with a range of stop losses and limit orders\n-\tIntegrated charts and range of analysis tools\n\nMonitor Markets and analyse trends\n-\tReact to economic data \n-\tFollow the trading patterns of thousands of other clients\n-\tFollow global news\n\nSpread Bets and CFDs are leveraged products. Spread Betting and CFD trading typically require the deposit of a small percentage of the total trade value. Profits & losses can quickly exceed your deposits requiring you to make further payments. Ensure that you understand the risks as these products are not suitable for everyone. If you are in doubt seek personal advice. You can find details of these charges for particular Markets within the relevant Market Information tab, which is located on the Trading Platform next to each Market or by calling us on 0117 988 9915. Hargreaves Lansdown Asset Management is authorised and regulated by the Financial Conduct Authority, FCA Register number 115248.  \nIG is a trading name of IG Markets Limited and IG Index Limited. CFDs provided by IG Markets Limited, spread betting provided by IG Index Limited. Both IG Markets Limited (register number 195355) and IG Index Limited (register number 114059) are authorised and regulated by the Financial Conduct Authority.",
  "genres": [
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2014-10-31T12:30:33Z",
  "updated": "2019-05-07T13:53:53Z",
  "releaseNotes": "Improved the stability and performance of the app.",
  "version": "8.609.0",
  "price": 0,
  "developer": "Hargreaves Trading",
  "score": 4.37349,
  "reviews": 83,
  "currentVersionScore": 4.37349,
  "currentVersionReviews": 83,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.spreadco.tradeclient1",
  "title": "Spread Co",
  "description": "Spread Co – Spread Betting, Contracts for Difference (CFDs) and Forex Trading\n\nOur powerful spread betting, Contracts for Difference (CFDs) and forex trading app lets Spread Co clients trade on the go with access to real-time charts and live prices. With a highly intuitive and customisable interface, you can trade markets securely with ease.\n\n* Great charting features give you more market insight  \n* Clever technical analysis — helps you analyse what’s happening in the markets\n* Wide range of technical indicators \n* Event indicators on the chart\n* Advanced drawing tools — help you highlight key price movements\n* Choose your favourite chart type — candlestick, bar, Heiken Ashi and lots more\n* Choose your timeframes — from one minute to one day \n* Select your time period — chart your data from specific dates\n* Includes bid, mid and offer prices\n* Change your colour scheme — dark, light, grey or blue\n\n* Economic calendar — get the latest global economic data as it’s released. Use ‘Smart Alerts’ and receive reminders when new data is published.\n* News — financial news feed added\n* Switch between your accounts — without having to log out\n* Place your trades with one click — helps you grab those short term opportunities\n* Quick and easy trading - trade multiple markets simultaneously and place stop and limit orders\n\n* Apple Touch ID Compatible: Log in to your account securely using your fingerprint\n* Live Chat: Get in-app support from our team without interrupting your session\n* Margin Meter: shows you at a glance how much of your available margin has been used\n* Customisable layouts: Group your markets and create watch lists\n* Manage Your Positions: Create, amend and monitor your positions and orders\n\nWhen trading with Spread Co, using our mobile, tablet or web-based trading platforms, all clients benefit from highly competitive spreads and margins, meaning lower trade costs and greater exposure to an extensive range of global markets.\n\n* Fixed spreads starting from 0.8 points on many major markets – including UK100, US30 and EURUSD (up to £50/point during market hours)\n* Minimum stake of £1 per point\n* Low margins starting from just £25\n* 0% overnight financing on short index & equity positions\n* Free charting and real-time live pricing\n* A wide range of global markets to trade\n\nApply for a Live Account now at www.spreadco.com \n\nAll trades are executed in-line with industry security standards using advanced data encryption, so you can trade safe in the knowledge that your private information stays private. All client funds are held in secure and segregated client accounts in tier 1 banks guaranteeing security of your money. Spread Co is regulated in the UK by the Financial Conduct Authority (FCA).\n\nWant to keep up to date with latest market updates and insights? Follow Spread Co for up to the minute news:\nTwitter:       @spreadco\nFacebook:  /spreadco\nLinkedIn:    Spread Co Ltd\nGoogle +:   +Spreadco\n\nFor more information call our Customer Services Team on +44 (0) 1923 832682 or visit our website - www.spreadco.com\n\nRISK WARNING: \nContracts for Difference, margin Foreign Exchange trading and spread betting carry a high degree of risk to your capital and it is possible to lose more than your initial investment. Only speculate with money you can afford to lose. These products may not be suitable for all investors, therefore ensure you fully understand the risks involved, and seek independent advice if necessary. \n\n© Spread Co Limited. All Rights Reserved. Spread Co Ltd is a limited liability company registered in England and Wales with its registered office at 22 Bruton Street, London, W1J 6QE. Company No. 05614477. Spread Co Limited is authorised and regulated by the Financial Services Authority. Register No. 446677",
  "genres": [
   "Finance"
  ],
  "contentRating": "17+",
  "released": "2012-09-04T00:37:42Z",
  "updated": "2018-04-05T09:39:52Z",
  "releaseNotes": "Minor bug fixes and cosmetic improvements.",
  "version": "2.91",
  "price": 0,
  "developer": "Spread Co Ltd",
  "score": 3,
  "reviews": 2,
  "currentVersionScore": 3,
  "currentVersionReviews": 2,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.sportingindex.sportingindex",
  "title": "Sporting Index Spread Betting",
  "description": "The Sporting Index app offers the best sports spread & fixed odds betting experience on mobile.\nSporting Index have been leading the field in the cutting-edge world of Sports Spread Betting for the last 25 years.\n\nOur game just got more expansive, we have now also moved into fixed odds betting with our brand new odds website. Our heritage is spread betting, our future is all betting. \n\nThe brand new Sporting Index sports spread betting native application offers the best spread betting experience at your fingertips and on the move, combining the exciting world of sports with a spread bet. \n\nWith Sporting Index you can choose from the widest range of sports spread bets around, with thousands of markets available across all your favourite sports like football, horse racing, cricket, rugby union, darts, golf, tennis, rugby league, and many more.\n\nSporting Index Spread Betting App is now using technology that is native to your phone and has brand new features:\n\n-\tAbility to set Fingerprint login for quicker and more secure access to your account.\n\n-\tNew UI design with lighter brand colours making it easier to read our markets on your mobile phone screen. \n\n-\tFaster speed – due to the optimised native technology we are now using, the performance improvements mean the app will load markets and prices much quicker.\n\n-\tQuick betslip – we have now added markets to all homepages and have a Quick betslip function which will allow you to make faster bets. \n\n-\tSwipe between screens making the interface easier to for you to reveal more markets and betting opportunities in the app. \n\n-\tImproved navigation – on certain sports we have improved the navigation with less swiping, market groups for all sports and horse racing ordered by a time basis, showing next off. \n\n\nAlso, we have kept the other features that make our app great.\n\n-\tAccess the comprehensive Sporting Index training centre to learn more about different spread betting markets\n\n-\tAccess help and support from our UK team",
  "genres": [
   "Sports",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-06-15T18:27:12Z",
  "updated": "2020-04-27T19:11:16Z",
  "releaseNotes": "- Bug fixes",
  "version": "2.10.5",
  "price": 0,
  "developer": "SPORTING INDEX HOLDINGS LIMITED",
  "score": 4.17647,
  "reviews": 17,
  "currentVersionScore": 4.17647,
  "currentVersionReviews": 17,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.salesforce.kona",
  "title": "Einstein Analytics",
  "description": "Because it’s mobile, Salesforce Einstein Analytics (formerly Wave Analytics) goes places analytics platforms have never gone before. Now every employee can instantly get intelligent, actionable answers from any data source, without help from IT. Einstein Analytics will transform the way your company leverages data, and make every employee more valuable, so you can grow your business faster. With Analytics on mobile, business will never be the same.\n\nDownload now to try out the interactive experience with included sample apps and imagine the possibilities for your own business.",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2014-10-14T06:04:46Z",
  "updated": "2020-04-21T17:06:06Z",
  "releaseNotes": "• Bug fixes",
  "version": "9.0.2",
  "price": 0,
  "developer": "salesforce.com",
  "score": 4.78946,
  "reviews": 114,
  "currentVersionScore": 4.78946,
  "currentVersionReviews": 114,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.microsoft.Office.Excel",
  "title": "Microsoft Excel",
  "description": "Microsoft Excel, the spreadsheet app, lets you create, view, edit, and share your files quickly and easily. Manage spreadsheets, tables and workbooks attached to email messages from your phone with this powerful productivity app.\n\nWork in data analysis, accounting, auditing, or other fields confidently with anyone, anywhere. Quickly graph the most complex formulas, charts and tables with amazing features.\n\nReview spreadsheets and run data analysis on the go. Customize tables and spreadsheets the way you want with robust formatting tools and great features. The productivity app lets you build your spreadsheet to meet your specific needs.\n\nGet the complete Microsoft Office experience when you sign in with your Microsoft 365 subscription. Create templates, edit spreadsheets, organize charts and share with ease when you download Microsoft Excel.\n\nTables & Spreadsheets: Create, Calculate and Analyze\n• Jump-start your budget, task list, accounting, or financial analysis with Excel’s modern templates.\n• Quickly graph with familiar formulas to run calculations and analyze your data.\n• Rich productivity features and formatting options make your workbook easier to read and use.\n• Use Cards View to easily see and manage spreadsheets.\n\nProductivity App: Review, Edit, and Work Anywhere\n• Review your Excel files from any device.\n• Edit sheets and data or update your task list from anywhere.\n• Spreadsheet features like sort and filter columns help focus your reviews.\n• Create, duplicate, hide, and unhide sheets easily.\n\nData Analysis\n• Analyze data using common charts and graphs.\n• Use spreadsheet features like add and edit chart labels to highlight key insights in your data.\n• Pie chart maker: create charts and graphs from your data.\n\nFinance: Budgeting & Accounting\n• Use agile spreadsheets and charts to help manage budgets.\n• Familiar tools to help you drill down to your exact finance needs.\n• Calculate tax estimates, personal finances and more.\n\nDraw and Annotate with Ink\n• Make notes, highlight your worksheet, create shapes, or write equations using the draw tab feature in Excel on devices with touch capabilities.\n\nSharing made easy\n• Share your files with a few taps to quickly invite others to edit, view, or leave comments directly in your workbooks.\n• Copy the content of your worksheet in the body of an email message with its format intact or attach or copy a link to your workbook for other sharing options.\n\nDownload Microsoft Excel and get the best way to create, organize and manage data and spreadsheets from your iPhone or iPad.\n\nTo create or edit documents, sign in with a free Microsoft account on devices with a screen size smaller than 10.1 inches.\nUnlock the full Microsoft Office experience with a qualifying Microsoft 365 subscription for your phone, tablet, PC, and Mac.\n\nMonthly Microsoft 365 subscriptions purchased from the app will be charged to your App Store account and will automatically renew within 24 hours prior to the end of the current subscription period unless auto-renewal is disabled beforehand. You can manage your subscriptions in your App Store account settings.\n\nThis app is provided by either Microsoft or a third-party app publisher and is subject to a separate privacy statement and terms and conditions. Data provided through the use of this store and this app may be accessible to Microsoft or the third-party app publisher, as applicable, and transferred to, stored, and processed in the United States or any other country where Microsoft or the app publisher and their affiliates or service providers maintain facilities.\n\n\nPlease refer to the Microsoft Software License Terms for Microsoft 365. See “License Agreement” link under Information. By installing the app, you agree to these terms and conditions.",
  "genres": [
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2014-03-27T19:41:57Z",
  "updated": "2020-05-11T04:02:36Z",
  "releaseNotes": "• Bug fixes",
  "version": "2.37",
  "price": 0,
  "developer": "Microsoft Corporation",
  "score": 4.67411,
  "reviews": 100238,
  "currentVersionScore": 4.67411,
  "currentVersionReviews": 100238,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.londoncapitalgroup.trader",
  "title": "LCG Trader – Trade FX & More",
  "description": "Designed specifically for the challenging world of multi-asset trading, LCG Trader for iOS places the world’s financial markets in the palm of your hand. \nSpread Bet* or trade CFDs on 7,000+ instruments across 9 asset classes including forex, indices, shares, spot metals, commodities, exchange traded funds (ETFs), vanilla options, bonds and interest rates.\nBenefit from competitive pricing, with spreads as low as 0.2 pips, and experience the superior order execution that comes from trading with a market-leading broker.\nDownload LCG Trader today and start trading the world’s markets from anywhere, at any time.\n\nMulti-Asset Trading Redefined for Mobile Devices\n•\tSpecifically designed for multi-asset trading\n•\tUser-friendly interface optimised for mobile\n•\tLower spreads with LCG price improvement technology\n•\tFast order execution and deep liquidity from tier-1 banks\n•\tComprehensive charting package with mobile-first design\n•\tCreate, manage and fund your account from a single app\n\nTrade the World with LCG\n•\tTrade 7,000+ instruments across 9 asset classes\n•\tCFDs and Spread Bets* on forex, indices, shares, commodities & more\n•\t60+ forex pairs including EURUSD, GBPUSD and USDJPY\n•\t15+ indices including the Germany 30 (DAX), UK 100 (FTSE) & Wall Street (DJI) \n•\t4,000+ shares including Apple, Amazon, Facebook, Google and Tesla\n•\tPopular commodities including Gold, Silver, WTI & Brent\n \n20+ Years of Quality Service\n•\tSpreads as low as 0.8 on forex and 0.2 on gold\n•\tSuperior order execution backed by innovative trading technology\n•\tCommitted to transparency and providing the best possible conditions\n•\tExpert market analysis and a comprehensive suite of trading tools\n•\tWide range of commission-free payment methods\n•\t24/5 dedicated customer support in 20+ languages\n\nFor more information, visit the LCG website: www.lcg.com\nIf you are experiencing any difficulties with the LCG Trader app, please don’t hesitate to contact our customer support team by sending an email to customerservices@lcg.com.\n-----------------------------------------------------------------------\nSpread betting* and CFD trading carry a high level of risk and can result in losses. CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. Please note that 79 % of our retail investor accounts lose money when trading CFDs. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing money. Please read carefully the relevant Risk Disclosure.\n\n*Important Note: Please note that Spread Betting is only available for clients residing in the United Kingdom and registered with London Capital Group Limited.\n\nLondon Capital Group Holdings plc (LCG Group) is a company registered in England and Wales under registered number: 05497744 and is a member of the NEX Exchange. London Capital Group Limited (LCG) is a company registered in England and Wales under registered number: 3218125. LCG is authorised and regulated by the Financial Conduct Authority (FCA) under the firm reference number of: 182110. The registered address for LCG Group and LCG is: 77 Grosvenor Street, Mayfair, London, W1K 3JR. London Capital Group (CYPRUS) Limited (LCG CY) is a company registered in Cyprus under registered number: 356430. LCG CY is authorised and regulated by the Cyprus Securities and Exchange Commission (License Number: 341/17). The registered address for LCG CY is: 205 Arch. Makarios Avenue III, Victory House, 5th Floor, 3030 Limassol. LCG Int. Limited (LCG INT) is a company registered in Cayman Islands under registered number: CT 327367. LCG INT is authorised and regulated by the Cayman Islands Monetary Authority (CIMA) with License No. 1445894. The registered address for LCG INT is: Conyers Corporate Services (Cayman) Limited, Cricket Square, Hutchins Dr., PO Box 2681, Grand Cayman KY1-1111.",
  "genres": [
   "Finance",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2015-11-13T12:57:51Z",
  "updated": "2020-05-07T10:28:43Z",
  "releaseNotes": "With the new version of name LCGTrader App, come the most requested chart types: Tick Charts, Range & Renko bars.\n\nAdditional improvements include:\n• Fibonacci Retracement, coming with precise moving of the edges\n• Option to hide indicator titles to free up more charting space\n• Fast access to advanced New Order screen from Quick Trade chart panel\n\nNew indicators:\n• Alligator\n• Average Directional Movement Index Rating\n• Center Of Gravity\n• Cyber Cycle\n• Fractals\n• Hull Moving Average\n• Polynomial Regression Channels\n• Supertrend\n\nCustomisable features:\n• Fibonacci levels\n• Indicators and drawings colors\n\nThe version also comprises several bug fixes.",
  "version": "3.11.51242",
  "price": 0,
  "developer": "London Capital Group Holdings Plc",
  "score": 3.125,
  "reviews": 8,
  "currentVersionScore": 3.125,
  "currentVersionReviews": 8,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.at.ATplatform",
  "title": "ActivTrades Online Trading",
  "description": "Description\nTake your trading further on iOS, accessing hundreds of CFDs on Forex, Indices, Commodities, Shares and ETFs. Discover new possibilities with the enhanced ActivTrader app.\n\n==The latest technology ==\n- Open a position directly from precise real-time charts using the buy and sell buttons\n- Trade with an agile and fast platform, secured by the latest encryption technology\n- ActivTrader has been designed for minimum consumption of battery and internet data*\n\n==Inspired by you ==\n- Trade with a fresh and intuitive design throughout the ActivTrader platform\n- Switch between simple or advanced view modes\n- Stay up to date with daily price changes in percentages and pips\n- Create your own personalised watchlist of your most traded products\n- Monitor your account’s equity, balance, margins and trading history on the go\n- Choose between dark and light platform themes\n\n== Advanced functionalities ==\n- Take greater control with Partial Close and Trailing Stop, which is active even when your device is switched off\n- Monitor which direction the market is moving with the Sentiment Functionality\nManage your risk and strategies with Stop loss and Pending Orders\nStart trading now with ActivTrader, your advanced trading platform for FX & CFDs. Learn to trade the markets with a risk-free demo account funded with £10,000!\n*Data charges may apply to mobile trading.\n\nAbout ActivTrades Corp\n\nActivTrades is a globally esteemed CFD broker which was established in 2001. It provides more than 500 CFDs on Forex, Indices, Commodities, Financials, Shares, ETFs.\n\n==Why choose ActivTrades?==\n\nActivTrades provides extra insurance to you, by individually covering you up to $1,000,000.\n\nBalance Protection\nYour ActivTrades trading account will never be overdrawn. We always reset your balance to zero should it become negative, so that losses cannot exceed your deposits.\n\nEfficient trading services\nTrade with reliable and fast execution, no requotes, low latency and competitive spreads across a range of products.\n\nLive Education\nGet a comprehensive learning experience. Join our free webinars and seminars, where trading experts present an extensive array of topics from beginners’ tutorials to advanced trading techniques.\n\nCustomer Support\nOur highly skilled Support Desk is operational 24 hours a day, 5 days a week, providing timely responses to client queries in 14 languages. Contact us via phone, chart or email.\n\nCFDs are complex instruments and come with a high risk of losing money rapidly due to leverage.\n\nActivTrades Corp is authorized and regulated by The Securities Commission of the Bahamas. ActivTrades Corp is an international business company registered in the Commonwealth of the Bahamas, registration number 199667 B.\nActivTrades Corp is a subsidiary of ActivTrades PLC, authorized and regulated by the Financial Conduct Authority, registration number 434413. ActivTrades PLC is a company registered in England & Wales, registration number 05367727.",
  "genres": [
   "Finance",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2016-06-27T15:19:15Z",
  "updated": "2020-05-01T07:42:16Z",
  "releaseNotes": "Trade even faster. The update includes performance improvements and bug fixes.",
  "version": "5.5.2",
  "price": 0,
  "developer": "ActivTrades PLC",
  "score": 4.33333,
  "reviews": 21,
  "currentVersionScore": 4.33333,
  "currentVersionReviews": 21,
  "searchTerms": "spread betting"
 },
 {
  "appId": "org.juancho.CalcSheetLite",
  "title": "Calculator SpreadSheet Lite",
  "description": "The SpreadSheet with a Calculator input mode.  As easy to use as your desk calculator with all the power of a SpreadSheet. \nFeatures\n1) Full traditional calculator functionality.\n2) Basic Spread sheet functions\n3) user values (f you receive a Calculation sheet from a colleague with full version.)\n\nYou can look at any Calculation sheet sent from the full version.\n\nYou can store arbitrary numbers of calculation sheets",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2013-07-28T19:20:14Z",
  "updated": "2020-03-16T02:02:14Z",
  "releaseNotes": "Removed stock price and exchange since free provider stopped serving data.",
  "version": "3.8",
  "price": 0,
  "developer": "Juancho Enterprises",
  "score": 3,
  "reviews": 4,
  "currentVersionScore": 3,
  "currentVersionReviews": 4,
  "searchTerms": "spread betting"
 },
 {
  "appId": "uk.co.jamierwallace.BetSpread",
  "title": "Bet Spread",
  "description": "Increase your chance of winning by spreading your stake over multiple bets. Don't kick yourself for putting the wrong bet on and back them all.\n\nBet Spread will tell you how much of your total stake to put on each bet and calculate the profit that you will make regardless of which bet wins.\n\nSimply enter the total stake that you would like to bet.\n\nThen enter the odds for each of the bets that you would like to place.\n\nBet Spread will perform a Dutching calculation that tells you how to spread your stake and how much profit you will make if any bet wins.\n\nThe calculator will work for horse racing, football or any betting that involves odds. Odds can be entered in fractional (5/1) or decimal (6.0) format.\n\nwww.facebook.com/jrwstudio\nwww.jrw-studio.com\ntwitter.com/jrwstudio",
  "genres": [
   "Sports",
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2011-11-03T21:09:20Z",
  "updated": "2016-08-20T08:33:12Z",
  "releaseNotes": "Increase your chance of winning by spreading your stake over multiple bets. Don't kick yourself for putting the wrong bet on and back them all.\n\nBet Spread will tell you how much of your total stake to put on each bet and calculate the profit that you will make regardless of which bet wins.\n\nRemoved iAd, which is now obsolete and replaced with a Rota Calendar banner.\n\nwww.facebook.com/jrwstudio\nwww.jrw-studio.com\ntwitter.com/jrwstudio",
  "version": "2.1",
  "price": 0,
  "developer": "JRW Studio Limited",
  "score": 4.81818,
  "reviews": 11,
  "currentVersionScore": 4.81818,
  "currentVersionReviews": 11,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.savysoda.iSpreadsheetFree",
  "title": "iSpreadsheet™ : Office Sheets",
  "description": "iSpreadsheet is a free, simple to use yet powerfull mobile spreadsheet Application for your iPhone & iPad. Quickly create beautiful spreadsheets that are compatible with major office solutions such as Excel and Numbers. \n\niSpreadsheet is built from the ground up for iPhone and iPad so it runs very fast even on older devices. And iSpreadsheet works seamlessly with a myriad of file transfer and storage options including: Windows SMB Network Share, Box, Dropbox, Google Drive, Docs, OneDrive, iCloud and more.\n\nSupports Formatting and Formulas. Uses CSV comma separated file format for maximum compatibility. Can read numbers and excel xls xlsx files too!\n\nFEATURES:\n• Google Docs Integration\n• iCloud & iCloud Drive Integration\n• Manage both online and offline worksheets\n• Portrait & Wide-screen Landscape view\n• Load .XLS and .CSV files from Google Documents. (without formatting)\n• Save in .CSV format (RFC 4180 compliant)\n• Manage multiple Spreadsheets\n• Execute complex arithmetic formulas\n• Access a useful subset of Excel formulas\n• Cell Formatting\n• Column Resizing\n• Clipboard Copy Paste\n• Column Row Insert\n• Progressive Loading\n• Fluid Graphics\n• Familiar Interface\n• Online help\n• Offline formula wizard\n• Context Aware Toolbar\n• Autosave & Recovery\n• Free Updates\n\n\nMore Free iPhone Apps:\nhttp://www.savysoda.com",
  "genres": [
   "Finance",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2009-03-06T18:30:00Z",
  "updated": "2018-09-04T01:56:27Z",
  "releaseNotes": "Patch update for users on iOS 11. Fixes some issues with printing and issues when sharing spreadsheets.",
  "version": "11.5",
  "price": 0,
  "developer": "Savy Soda",
  "score": 4.52174,
  "reviews": 1679,
  "currentVersionScore": 4.52174,
  "currentVersionReviews": 1679,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.covers.app",
  "title": "Covers Live – Betting manager",
  "description": "Bring your sports bets to life with the Covers Live app. Just in time for football season, you can now quick cap your bets on the go with all the tools you need to get the full sports betting experience.\n\n\nDon't just place your bet, live it! Whether before, during or after the game, Covers Live gives you the most ways to manage your sports bets on the go;\n\n\nDRAW A LINE - Never again miss the line you want by setting custom lines on the matches that are important to you. Set your lines for spreads, moneylines, and totals.\n\n\nWE’LL KEEP YOU POSTED - Too busy to stay on top of your preferred lines? We’ll let you know when those lines move up or down with our Line History graphs.\n\n\nKNOW THE SCORE – Get the latest live sports scores and game results from all sports and more instantly at the tap of a finger.\n\n\nKEEP ORGANIZED – Add all the important football, basketball, baseball, hockey and other game matchups you want to monitor in one convenient place with My Matchups. \n\n\nSWEAT IT OUT - We’ll let you know the status of your bets when they’re down to the wire so you don’t miss any of last minute live action. \n\n\nTELL YOUR STORY - Share your big wins and heartbreaking loses with your friends in just a few taps.\n\n\nCovers has been the leader in sports betting entertainment for 25 years so download Covers Live and take sports betting management to a whole new level!",
  "genres": [
   "Sports",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2019-08-17T23:25:24Z",
  "updated": "2020-02-26T17:28:17Z",
  "releaseNotes": "Updated notification information\nNCAAB filtered display\nUX improvements for Details screen",
  "version": "1.2.10",
  "price": 0,
  "developer": "Covers Media Group",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.Luminant.SpreadSheet",
  "title": "Utility Spreadsheet",
  "description": "Designed from the ground up for optimal use of the touch interface, Utility Spreadsheet has the number crunching power you need and doesn't make you jump through hoops to use it.\n\nOur expanded keyboard keeps the operator and number keys available so you don't have to switch back and forth to write an equation.\n\nCapabilities include formula dragging, limited graphing, sorting, freezing headers, and import/export of csv files for compatibility with many other spreadsheet programs.\n\nHas built-in support for the following functions, with more to come in future updates!\n\nSIN, COS, TAN, ASIN, ACOS, ATAN, RADIANS, DEGREES, SUM, PROD, SUMIF, FACT, MEAN, MEDIAN, MODE, STDEV, SQRT, EXP, LN, LOG, IF, ABS, PMT, MIN, MAX\n\nSuggestions or comments? Email us at the support address, and help us make Utility Spreadsheet even better!",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2009-08-01T22:56:41Z",
  "updated": "2019-12-20T16:54:34Z",
  "releaseNotes": "Bug fixes",
  "version": "7.3.7",
  "price": 0,
  "developer": "Luminant Software, Inc",
  "score": 4.10286,
  "reviews": 175,
  "currentVersionScore": 4.10286,
  "currentVersionReviews": 175,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.apple.Numbers",
  "title": "Numbers",
  "description": "Numbers is the most innovative spreadsheet app ever designed for a mobile device. Created exclusively for iPad, iPhone and iPod touch, Numbers includes support for Multi-Touch gestures and Smart Zoom so you can create powerful spreadsheets using just your fingers.\n\nStart with one of over 30 Apple-designed templates for your home budget, checklist, invoice, mortgage calculator and more. Choose from over 250 powerful functions. Draw and write with Apple Pencil on supported devices, or use your finger. Tap to add tables, charts, text and images anywhere on the free-form canvas. Touch and drag your finger to reorder columns and rows and to resize tables. Double-tap a cell to bring up the intelligent keyboard that helps you enter text, formulas, dates and times, or duration. Animate your data with interactive column, bar, scatter and bubble charts. And with an all-new calculation engine, Numbers is faster than ever before.\n\nWith iCloud built in, your spreadsheets are kept up to date across all your devices. And with real-time collaboration, your team will be able to work together at the same time on a Mac, iPad, iPhone or iPod touch — even on a PC using Numbers for iCloud.\n\nCollaborate with others at the same time\n• With real-time collaboration, your whole team can work together on a spreadsheet at the same time\n• Collaboration is built in to Numbers on the Mac, iPad, iPhone and iPod touch \n• PC users can collaborate too, using Numbers for iCloud\n• Share your document publicly or with specific people\n• You can easily see who’s currently in the document with you\n• View other people’s cursors to follow their edits\n• Available on spreadsheets stored in iCloud or in Box\n\nGet started quickly\n• Over 30 Apple-designed templates give your spreadsheets a beautiful start\n• Double-tap a cell to access the intelligent keyboard to add text, formulas, dates and times, and more\n• New action menu keeps most common tasks one tap away\n• Reorder columns and rows, and resize tables, with a touch and a drag\n• Import and edit Microsoft Excel and CSV files using Mail, a WebDAV service or iTunes File Sharing\n• Quickly open password-protected spreadsheets using Touch ID or Face ID on supported devices\n\nBeautiful spreadsheets\n• Place tables, charts, text and images anywhere on the free-form canvas\n• Update tables, charts, text and images using beautiful preset styles\n• Use doughnut charts to visualise data in an engaging new way\n• Add an interactive image gallery to view a collection of photos\n• Insert photos and video with the Media Browser\n• Enhance your spreadsheets with a library of over 700 editable shapes\n• Create a form to quickly enter data on the go\n\nEverything adds up. Beautifully\n• Choose from over 250 powerful functions\n• Get built-in help and sample formulas for each function\n• Use Smart Categories to see your data in a whole new way\n• Quickly organise and summarise tables to gain new insights\n• Sort columns in ascending or descending order\n• Hide or unhide rows and columns\n• Turn filters on and off in imported spreadsheets\n• Insert gorgeous 2D and 3D charts\n• Animate data with new interactive column, bar, scatter and bubble charts\n• Change values in cells using sliders, steppers, tickboxes, pop-ups and star ratings\n• Easily add stock information to spreadsheets\n\niCloud\n• Turn on iCloud so you can access and edit your spreadsheets from your Mac, iPad, iPhone, iPod touch and iCloud.com\n• Access and edit your spreadsheets from a Mac or PC browser at www.icloud.com with Numbers for iCloud\n• Numbers automatically saves your spreadsheets as you make changes\n\nShare a copy of your work\n• Export your spreadsheet to CSV, PDF and Microsoft Excel\n• Use “Open in Another App” to copy spreadsheets to apps such as Dropbox\n\nSome features may require Internet access; additional fees and terms may apply.",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2010-05-26T02:47:30Z",
  "updated": "2020-03-31T18:22:57Z",
  "releaseNotes": "• Use Numbers on an iPad with Magic Keyboard, a mouse or a trackpad for a new way to work with your spreadsheets. Requires iPadOS 13.4.\n• Create spreadsheets with more rows and columns than ever before.\n• Apply a colour to the background of a sheet.\n• Add a Numbers spreadsheet to a shared iCloud Drive folder to automatically start collaborating. Requires iPadOS 13.4 or iOS 13.4.\n• Edit shared spreadsheets while offline and your changes will upload when you’re back online. Requires iPadOS or iOS 13 or later.\n• Touch and hold, then drag across multiple objects to select them.\n• Easily access your recently used templates in a redesigned template chooser.\n• Print or export a PDF of your spreadsheet with comments included.\n• Add a drop cap to text in a shape.\n• Enhance your spreadsheets with a variety of new, editable shapes.",
  "version": "10.0",
  "price": 0,
  "developer": "Apple",
  "score": 3.08887,
  "reviews": 1339,
  "currentVersionScore": 3.08887,
  "currentVersionReviews": 1339,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.pocketlife.fmoe",
  "title": "My Spreadsheet-For Ms Office Excel",
  "description": "Work from anywhere: View, edit, and create Office Excel files support XLS/XLSX format, It is compatible with Excel, Numbers and any other XLS/XLSX-based Spreadsheet program. \n\n● View, create, edit and save spreadsheets in XLS/XLSX format. \n● Compatible with Excel, Numbers, NeoOffice. \n● Portrait and landscape views. \n● Handles multiple worksheets. \n● Handles unlimited rows and columns. \n● Searching and sorting of cells. \n● Cell formatting, including bold,underline, italic, borders, text and cell color, alignment, text wrapping and so on. \n● Cell types, including General, Number, Currency, Percentage, Date, Time, Date/Time and Text. \n● Merge cells feature. \n● Pane freezing. \n● Copy and paste \n● Tap and drag to change row heights and column widths. \n● Intelligent auto range selection for range based functions. \n● Tap cells to compose formula. \n● Insert, copy, paste or cut cell ranges, rows or columns. \n● Date formats, date separators and numeric separators are all handled correctly according to the current locale, with manual override.",
  "genres": [
   "Utilities",
   "Lifestyle"
  ],
  "contentRating": "4+",
  "released": "2015-12-20T20:01:01Z",
  "updated": "2015-12-20T20:01:01Z",
  "version": "1.0",
  "price": 0,
  "developer": "Pocket Life",
  "score": 1,
  "reviews": 9,
  "currentVersionScore": 1,
  "currentVersionReviews": 9,
  "searchTerms": "spread betting"
 },
 {
  "appId": "org.movilsland.offixls",
  "title": "OffiXLS spreadsheet editor",
  "description": "OffiXLS is an app to edit XLS spreadsheets that you will be able to create, modify and share. OffiXLS combines the functionality of a file manager with the open source office software for spreadsheets, LibreOffice.\n\nIt contains two main modules:\n\n* The XLS module, which provides the following functionality:\n\n- Create spreadsheets.\n- Edit spreadsheets files from OpenOffice, LibreOffice or Microsoft Excel.\n- Cell styles management.\n- Search for texts.\n- Insert columns / rows.\n- Delete rows / columns.\n- Find & replace.\n- Unique Spreadsheet functions like: · CURRENT · DDE · OPT_BARRIER · GOALSEEK ...\n- Autosave\n- Open Source.\n- Spreadsheet formats supported are the OpenDocuments formats (.ods and .ots), but in addition to them OffiXLS can open the formats used by OOo 1.x (.sxc and .stc) and the following spreadsheet formats (see https://wiki.openoffice.org/wiki/Documentation/OOo3_User_Guides/Getting_Started/File_formats):\n\n· Microsoft Excel 97/2000/XP (.xls, .xlw, and .xlt)\n· Microsoft Excel 4.x–5.0/95 (.xls, .xlw, and .xlt)\n· Microsoft Excel 2003 XML (.xml)\n· Microsoft Excel 2007 XML (.xlsx, .xlsm and .xltm)\n· Microsoft Excel 2007 binary (.xlsb)\n· Lotus 1-2-3 (.wk1, .wks, and .123)\n· StarCalc formats (.sdc and .vor)\n· dBASE (.dbf) \n· Unified Office Format spreadsheet (.uos, .uof)\n· Pocket Excel (pxl) \n· Quattro Pro 6.0 (.wb2)\n\nThis app uses the LibreOffice license. It can be installed and distributed for free.\n\n B) The file manager module, which provides the following functionality:\n\n- Home directory when you first load the file manager.\n- Operations with files: copy, move, create.\n- View the file properties: name, size, date.\n- Light and Elegant client UI.\n- Preview support.\n\nThe subscription inside the app consists on the following:\n\n- The length of the subscription is 1 month\n- The price of the subscription is $0.99\n- The subscription will be auto-renewed every month so that you can continue enjoying the app without ads.\n- Payment will be charged to iTunes Account at confirmation of purchase\n- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period\n- Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal\n- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase\n- No cancellation of the current subscription is allowed during active subscription period\n- The privacy policy and terms of use of our apps are in http://www.blackhawksystems.eu/website/policy_en.html",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2017-04-21T03:13:29Z",
  "updated": "2020-04-26T09:03:48Z",
  "releaseNotes": "Improved editor for Microsoft Excel and Office 365 spreadsheets.\niOS 13 SDK.\nXcode storyboard to provide the app’s launch screen.",
  "version": "2.1",
  "price": 0,
  "developer": "SSA",
  "score": 1,
  "reviews": 2,
  "currentVersionScore": 1,
  "currentVersionReviews": 2,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.cometdocs.pdftoexcel",
  "title": "PDF to Excel Converter - OCR",
  "description": "The absolutely best way to convert PDF tables into Excel spreadsheets. Easy-to-use app and powerful converting engines with the latest OCR technology. Accurately convert PDF to Excel from anywhere on your device, Google Drive, Dropbox, Gmail, iCloud, Box and OneDrive. \n\n• No limits on the file size or number of converted files\n• Excellent PDF to Excel conversion quality\n• Rows and columns are recognized perfectly\n• Scanned PDF to Excel conversion\n• You can convert Gmail attachments and files from iCloud, Dropbox, Box, and OneDrive directly from our app\n\nThere’s even more:\n\n• Industry-leading OCR technology for your scanned files\n• No further editing needed\n• Fast and easy, won’t drain battery or resources\n\nDon’t waste your time on retyping all stats and data. Extract PDFs, both native and scanned, into Excel spreadsheets and reuse them. Find your PDF document and open it in PDF to Excel app. Once the PDF is imported and you choose to convert it, it is sent to our servers for conversion. The file is downloaded once the conversion is done. Because the conversion is not being performed on your device, the app will not slow down your device or drain its battery. After you get the result, we will delete your documents from our servers.",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2014-08-19T22:32:39Z",
  "updated": "2018-11-08T22:53:15Z",
  "releaseNotes": "Thank you for your feedback and helping us to make our app better!\n\nIn this update:\n\n• If you rely on iOS reading in-app commands, Options button is readable again\n• Adjustments for new, beautiful iPhone XS, XS Max and XR\n• You can now cancel paper recognition once started\n• Other small bug fixes",
  "version": "4.6",
  "price": 0,
  "developer": "Cometdocs.com Inc.",
  "score": 3.02703,
  "reviews": 37,
  "currentVersionScore": 3.02703,
  "currentVersionReviews": 37,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.turbocms.SimpleSpreadSheet",
  "title": "Simple Spreadsheet",
  "description": "A light weight spreadsheet app for mobile device.\n\n-Easy to use interface.\n-Automatically adjust cell's width & height.\n-Customized keyboard, easy to input numbers and formulas.\n-Provide 4 spreadsheet themes, you can change sheet style with a single tap.\n-Copy and paste cells.\n-Support Undo. & Redo.\n-Support plus, minus ,multiply, divide, etc. basic formula, include simple functions such as SUM,AVG,MAX,MIN.\n-Export to excel, export to image, or send spreadsheet to friends(same app installation required).\n-Support bluetooth keyboard('space' to begin edit, 'escape' end edit, up, down, left ,right).\n-Automatically backup to iCloud.\n\nPlease note: it's not fully compatible with excel, so excel files can not be imported.\n\nAny suggestions please email to white@turbocms.com\n\nTerms of Use: http://qqzhuti.net/sssheet/termsen\nPrivacy Policy: http://qqzhuti.net/sssheet/privacyen",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2019-03-03T14:26:20Z",
  "updated": "2019-04-10T20:52:10Z",
  "releaseNotes": "-Changed to free download, in app purchase.",
  "version": "2.5",
  "price": 0,
  "developer": "WEN WU LI",
  "score": 4.54545,
  "reviews": 99,
  "currentVersionScore": 4.54545,
  "currentVersionReviews": 99,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.smartsheet.smartsheet",
  "title": "Smartsheet: Teams & Projects",
  "description": "Maximize productivity on the go with Smartsheet, a work execution platform that empowers better collaboration and decision making, accelerating innovation for over 80,000 leading brands — including 75% of the Fortune 500 — in 190 countries.\n\nGetting started is easy! Either sign in with your existing Smartsheet account, or enter your email to sign up for a free 30-day trial. Join millions of other innovative users and upgrade to a paid account at any time.\n\nWith Smartsheet you can:\n\n► COLLABORATE WITH YOUR TEAM\nSeamlessly create, share, and collaborate with your team on projects, wherever you are, between desktop and mobile.\n\n► COLLECT INFORMATION FROM ANYONE\nCollect data from the field with forms, capture and upload images, or scan barcodes with your mobile device.\n\n► TAKE ACTION AND GET MORE DONE\nReview notifications, act on requests and approvals, or update status in card view on the go.\n\n► VIEW WORK STATUS IN REAL TIME\nEasily view your dashboards, sheets, and more in real time from your phone, so you always know the status of work.\n\n► WORK SEAMLESSLY WITH YOUR FAVORITE APPS\nSmartsheet's out-of-the-box integrations enable real-time synchronization and visibility with many of the apps you use.\n\nSmartsheet is the leading work execution platform built to plan, capture, manage, automate, and report on work — at scale.",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2012-10-18T22:18:25Z",
  "updated": "2020-05-04T17:03:49Z",
  "releaseNotes": "We regularly update the Smartsheet app to provide the best user experience possible. Here is what’s new in this update:\n\n- Bug fixes and performance improvements\n\nLove Smartsheet? Leave us a review. Your ongoing feedback helps us improve our app!",
  "version": "7.2",
  "price": 0,
  "developer": "Smartsheet Inc.",
  "score": 4.75828,
  "reviews": 2296,
  "currentVersionScore": 4.75828,
  "currentVersionReviews": 2296,
  "searchTerms": "spread betting"
 },
 {
  "appId": "mei.BlockRolling",
  "title": "Block Rolling : Stars Gem 3D",
  "description": "This is an amazing painting puzzle game for FREE!\n\nSwipe Up, Down, Left, Right, and ever make the Block jump and over the wall! Fill whole maze with paint and you clear the level. Control the Block shuttle through the maze, watching the Block jump and roll, it feels so great, you will like it.\n\nFeatures:\n1.Interesting and fun puzzles levels.\n2.More than 1000 levels.\n3.Free to play.\n4.Lovely skin.\n5.Relaxing to play.",
  "genres": [
   "Games",
   "Casual",
   "Strategy"
  ],
  "contentRating": "4+",
  "released": "2019-09-07T07:00:00Z",
  "updated": "2020-04-10T21:35:45Z",
  "releaseNotes": "- Bug fixes and general improvements",
  "version": "1.3",
  "price": 0,
  "developer": "Gao Lin",
  "score": 5,
  "reviews": 10,
  "currentVersionScore": 5,
  "currentVersionReviews": 10,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.savysoda.documents2",
  "title": "Documents Pro",
  "description": "••• Take your Documents Anywhere •••\n••• Trusted by over 7 Million iOS Users •••\n••• ON SALE! US4.99 TODAY •••\n\nDocuments Pro 7 lets you create, store, manage, print or share all your documents, spreadsheets, photos, videos, and recordings on your iPhone, iPod, and iPad!  The user interface is finder & Microsoft explorer like. You can view, edit, email, airprint, and transfer files via google, usb, wifi, ftp dropbox. Files can be automatically backed up and synchronized across all your devices using iCloud!\n\n\nBuilt on top of the acclaimed documents iPhone suite. Documents 2 is a simple to use mobile office suite and file management system for iOS.\n\n\n• FEATURE COMPARISON •\n\n\n...............D2...|..D1..|.OFFICE 2.|.QOffice.|.Docs2Go\n-------------------------------------------\ntxt edit....•.....|..•...|.....•........|.....•......|.....•.....\nspr edit...•.....|...•...|.....•........|.....•......|.....•.....\ndoc view..•.....|...•...|.....•........|.....•......|.....•.....\ndoc edit...◦ .....|...◦ ...|.....•........|.....•......|.....•.....\nphotos....•.....|...•...|......◦ ........|.....◦ ......|.....◦ ......\naudio......•.....|...◦....|.....◦........|.....◦......|.....◦......\nWiFi........•......|...•...|.....◦........|.....•......|.....•.....\nGoogle...•......|...•...|......•.......|.....◦......|.....◦.....\neMail......•......|...•...|......◦.......|......◦.....|.....◦.....\nFTP.........•.....|...◦....|......◦.......|......◦.....|.....◦.....\niPad........•.....|...◦....|......◦.......|......◦.....|.....◦.....\nairPrint...•.....|...◦....|......◦.......|......◦.....|.....◦.....\ndropbox.•.....|...◦....|......◦.......|......◦.....|.....◦.....\n\n\nThe ultimate All-In-One Mobile Office Suite for the \niPhone. 8 Premium Apps in One. Most essential productivity and business apps in one easy to use, high quality package. Transfer documents to/from your iPhone via FTP, WiFi, Google, Dropbox or Email. Edit and View many types of documents on the fly. A powerful, top value, must have app for any iPhone.\n\n\nINCLUDES\n• Latest iSpreadsheet (mobile spreadsheet app)\n• Integrated FTP Server & WiFi HD (mobile hard drive)\n• Rich Text Editor (Easy to use text pad)\n• Google Sync (Upload and Download directly to Google)\n• Photo Album (Photo manager)\n• Direct Email (Email any documents to anyone)\n• Sound Recorder (High Quality)\n• Integrated Preview (Preview any known document)\n• AirPrint (Print to Any AirPrint printer with one touch)\n• USB, FTP, WiFi, Email and Google Transfer!\n• Dropbox integration\n\n\nWIFI HD\n• Transfer Files between iPhone, iPod, Mac, PC, or any network device with a Browser\n• Easy to use, no additional software necessary\n\n\nGoogle Docs Connection\n• Upload and Download directly to your google docs account\n\n\nDirect Email\n• Email multiple files as attachments to anyone\n• Import attachments from Mail directly\n\n\niSpreadsheet\n• Full CSV support\n• Formatting\n• Formulas\n\n\nFile Preview:\n• Microsoft Word: .doc\n• Microsoft Excel: .xls\n• Microsoft PowerPoint: .ppt\n• Apple iWork: Pages, Number, Keynote\n• Images: .jpg, .jpeg, .tif, .gif, .svg\n• Adobe Acrobat: .pdf\n• Web Pages: .htm, .html\n• Web Archive: .mht\n• Audio: .mp3, .wav \n\n\nSound Recorder:\n• 44.1khz high quality recording\n• Scrolling\n• Playback\n\n\nText Editor\n• Wide screen or normal view text editing\n\n\nPhoto Album\n•Take photos\n• Resize, Zoom\n• iPhoto style panning Slide Show\n\n\nDirect Email\n• Email documents to anyone\n• Access to address book\n\n\nMore flexible than AirSharing and more features than QuickOffice!\n\n\nOne app, one friendly price, enable the full power of your iPhone, iPod, and iPad!\n\n\nMore Apps:\nhttp://www.savysoda.com",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "17+",
  "released": "2009-04-30T09:35:28Z",
  "updated": "2017-11-25T13:13:02Z",
  "releaseNotes": "Added iPhone X full screen support, Face ID support, and Dropbox v2 Support.",
  "version": "11.1",
  "price": 4.99,
  "developer": "Savy Soda",
  "score": 4.425,
  "reviews": 80,
  "currentVersionScore": 4.425,
  "currentVersionReviews": 80,
  "searchTerms": "spread betting"
 },
 {
  "appId": "org.juancho.CalcSheet",
  "title": "Calculator  SpreadSheet",
  "description": "The SpreadSheet with a Calculator input mode.  As easy to use as your desk calculator with all the power of a SpreadSheet. \nFeatures\n1) Full traditional calculator functionality.\n2) Basic Spread sheet functions\n3) user values\n\nYou can share Calculation Sheets from this full version with anyone who has the free version.",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2013-07-28T19:32:33Z",
  "updated": "2020-03-16T02:03:18Z",
  "releaseNotes": "Bug fix, removed stock quote and currency exchange since provider of data no longer provides.",
  "version": "3.8",
  "price": 0.99,
  "developer": "Juancho Enterprises",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.zoho.zohosheet",
  "title": "Zoho Sheet - Spreadsheet App",
  "description": "Create a new spreadsheet or import an Excel file to work on, break down data with your team and share your spreadsheets, with the free Zoho Sheet app for iPhone and iPad. \n\nHere's how Zoho Sheet can be the spreadsheet app for you:\n\nSPREADSHEETS ON THE GO \nWhatever your device, Zoho Sheet never compromises on functionality. Create your own spreadsheets, share them, and work on them across devices. \n\nCONVERT IMAGES INTO SPREADSHEETS\nWith \"Data from Picture\", digitize tabular data from prints and images into shareable spreadsheet data in a matter of seconds. You also get to preview the converted data and make minor changes to it before inserting it into your spreadsheet.\n\nWORK WITH YOUR TEAM\nView and make live changes in your spreadsheet with your team, no matter how far apart you are.  Add cell/range-specific comments and @mention colleagues to tag them, all inside your spreadsheets.\n\nBREAK DOWN THE NUMBERS\nWith around 350 functions and formulas, we make sure your data analysis is accurate and complete. Zoho Sheet has a Smart Bar that helps you finish up calculations in a jiffy.\n\nANALYZE YOUR CHARTS\nExplore your charts in full screen where you can filter your series, tap on points to view data, zoom in on your charts, set visibilities for your series, titles, legends, and much more.\n\nANALYZE DATA IN AN INSTANT\nVisualize your data as a chart, edit and make vibrant looking graphs, and explore your charts in full screen. Get the complete summary of your data with \"Insights\" powered by Zia, that provides automated recommendations, and answers all your data-related questions via voice command. \n\nMAKE A CALL, LITERALLY\nCall up your contacts or leave them a text message in a jiffy, with a single click—from inside your spreadsheets, using number formats in Zoho Sheet.\n\nSHARE YOUR SPREADSHEETS\nIn addition to real-time collaboration with your friends and colleagues, you can share your spreadsheets via messaging apps or other media as a Microsoft Excel (.xls, .xlsx), or PDF file.\n\nCOPY SHEETS UNIVERSALLY\nForget about repeating mundane spreadsheet tasks. Duplicate your sheets within the same spreadsheet or copy-paste them into other spreadsheets in your list.\n\nHave a feature in mind that you would like to see in Zoho Sheet? Write to us at ios-support@zohosheet.com.",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2016-06-11T01:54:37Z",
  "updated": "2020-04-19T14:57:53Z",
  "releaseNotes": "With this update:\n- Make your spreadsheets visually engaging with Charts! Now, create, customize, and insert charts into your spreadsheets using your iPhones and iPads.\n- Access and work on your spreadsheets stored on Workdrive with ease, directly from the Zoho Sheet app.",
  "version": "2.99.1",
  "price": 0,
  "developer": "Zoho Corporation",
  "score": 4.47058,
  "reviews": 17,
  "currentVersionScore": 4.47058,
  "currentVersionReviews": 17,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.appsverse.doceditoriphonefree",
  "title": "Docs U - Edit Microsoft Office Doc for iPhone Free",
  "description": "Create and edit Microsoft Office® and Open Office Documents on your iPhone. \n\nDocuments Unlimited for iPhone allows you to view and edit almost any document format including Microsoft Office® and OpenOffice documents on your iPhone. On your iPhone, you can view, edit and create Microsoft file formats including Word®, Excel® & PowerPoint® documents. Documents Unlimited also supports the creation, viewing and editing of LibreOffice and Open Office Documents based on the Open Document Format with Documents Unlimited Office Apps suite. \n\nDocuments Unlimited Free works by bringing you the power of the cloud to your iPhone or iPod by hosting LibreOffice online and streaming the app directly to you. The full functionality of LibreOffice in the cloud which is a fork of OpenOffice that has been downloaded more than 100 millions times is brought to you by our power cloud based solution. The premium version is also integrated with Dropbox, GDocs and Box. \n\n\n+Create, view and edit files \nMicrosoft Word 2007/2010 (.docx) \nMicrosoft Word 97/2000/XP/2003 (.doc) \nMicrosoft Excel 2007/2010 (.xlsx) \nMicrosoft Excel 97/2000/XP/2003 (.xls) \nMicrosoft Powerpoint 2007/2010 (.pptx) \nMicrosoft Powerpoint 97/2000/XP/2003 (.ppt) \nOpen Document Format Text (.odt) \nOpen Document Format Spreadsheet (.ods) \nOpen Document Format Presentation (.odp) \nVarious graphics format (.png, .jpg, .gif and others) \n\n+Other functionality \nConvert files to any document format and email. \nPrint your documents wireless \nDictate your text \nUse external keyboard \nMouse mode allows for precise control \n\nNOTE: You can also import PDF files to edit. However, you should note that only simple PDF files can be imported accurately and the PDF import process is not perfect. \n\nDISCLAIMER: \n- Not all documents can be opened or edited successfully. Some opened and saved documents may result in a loss of formatting due to formats in compatibility. If you are unsure, you can email us your non-confidential document to our support email to help you test if the app can open the documents successfully for you. \n- OpenOffice.org™ is a registered trademark of Oracle. \n- LibreOffice™ is a trademark of The Document Foundation. \n- Microsoft® is a registered trademark of Microsoft Corporation in the United States and other countries. \n- The Documents Unlimited app is not affiliated with, endorsed, or sponsored by LibreOffice, OpenOffice or Microsoft \n- Documents Unlimited is a cloud based and hosted solution for the popular LibreOFfice suite and requires users to be online for its editing features. \n- If you are interested in using LibreOffice on desktop computers, please visit www.libreoffice.org",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "17+",
  "released": "2013-05-16T18:54:51Z",
  "updated": "2017-04-15T02:57:01Z",
  "releaseNotes": "+ Performance improvements\n+ Bug Fixes",
  "version": "3.3",
  "price": 0,
  "developer": "Appsverse Inc.",
  "score": 3.33333,
  "reviews": 3,
  "currentVersionScore": 3.33333,
  "currentVersionReviews": 3,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.xuico.SumCalculator",
  "title": "Sum Calculator & Spreadsheet",
  "description": "Do you find yourself often creating new spreadsheet documents and setting up a sum formula? this app is for you. \n\nItemized calculator to keep track of your calculations.\n\nJust hit new document and fill in to your heart's content.\n\nAllows saving your documents for as long as you need.",
  "genres": [
   "Finance",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2016-09-07T10:52:28Z",
  "updated": "2018-05-17T17:42:02Z",
  "releaseNotes": "Updated for iOS 11.3",
  "version": "1.40",
  "price": 0.99,
  "developer": "Xuico Inc",
  "score": 2,
  "reviews": 1,
  "currentVersionScore": 2,
  "currentVersionReviews": 1,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.microsoft.officemobile",
  "title": "Microsoft Office",
  "description": "The Office app combines the Word, Excel, and PowerPoint apps you know and rely on with new capabilities that harness the unique strengths of a phone to create a simpler, yet more powerful Office experience on the go.\n\nCreate word documents, spreadsheets and presentations from a single, easy-to-use app. Share and collaborate with ease and transfer files between your phone, cloud storage and computer.\n\nMicrosoft Office makes it easy to work on the go, with mobile access to your Office tools. Use Office for free or unlock even more Office features when you log in with your Microsoft 365 account.\n\nWhether using it for personal or professional reasons, the Office app is designed to be your go-to app for getting work done on a mobile device.\n\nWord, Excel, and PowerPoint combined in one app:\n\n• The most widely used tools for working with documents, spreadsheets, and presentations, all from a single app.\n• Create, edit, and work together on Office documents with others in real-time.\n• Use templates to easily get started with your resume, budget, presentations, and other documents.\n• Easily store, access and search for Word, Excel, PowerPoint files stored in your personal cloud storage, on your device, or across your organization (if using a work account).\n\nUniquely mobile ways that make document creation easier:\n\n• Snap a picture of a document and turn it into an editable Word file with the press of a button.\n• Transform a picture of a table into an Excel spreadsheet so you can work with the data.\n• Design a PowerPoint presentation by simply selecting the pictures you want to use from your phone.\n• Create automatically enhanced digital images of whiteboards and documents with Office Lens features.\n\nQuickly perform common mobile tasks with built-in Actions:\n\n• Instantly create PDFs from photos or Word, Excel, and PowerPoint documents.\n• Easily transfer files between your phone and computer.\n• Sign PDFs using your finger.\n• Quickly jot down ideas and notes with Sticky Notes.\n• Scan QR codes to open links.\n\nAnyone can download the Office app for free and start using it right away. Access and save documents to the cloud by connecting with a Microsoft Account (for OneDrive or SharePoint) or a third-party cloud storage provider.\n\nLogging in with a personal, work, or school Microsoft Account connected to an Microsoft 365 subscription will unlock premium features within the app.\n\nSubscription & Privacy Disclaimer\nUnlock the full Microsoft Office experience with a qualifying Microsoft 365 subscription for your phone, tablet, PC and Mac.\n\nMonthly Microsoft 365 subscriptions purchased from the app will be charged to your App Store account and will automatically renew within 24 hours prior to the end of the current subscription period unless auto-renewal is disabled beforehand. You can manage your subscriptions in your App Store account settings.\n\nThis app is provided by either Microsoft or a third-party app publisher and is subject to a separate privacy statement and terms and conditions. Data provided through the use of this store and this app may be accessible to Microsoft or the third-party app publisher, as applicable, and transferred to, stored and processed in the United States or any other country where Microsoft or the app publisher and their affiliates or service providers maintain facilities.\n\nPlease refer to the Microsoft Software License Terms for Microsoft Office. See “License Agreement” link under Information. By installing the app, you agree to these terms and conditions.",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2013-06-18T15:45:39Z",
  "updated": "2020-05-11T04:08:21Z",
  "releaseNotes": "• Bug fixes",
  "version": "2.37",
  "price": 0,
  "developer": "Microsoft Corporation",
  "score": 4.4889,
  "reviews": 2027,
  "currentVersionScore": 4.4889,
  "currentVersionReviews": 2027,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.tapular.OddsInsiderFree",
  "title": "Odds Insider - Odds and Picks",
  "description": "With Odds Insider, you can:\n\n- Get odds from 14 separate online sports books\n- View and chart line movements since the sportsbook opened the sporting event\n- Star games for quick reference\n- Get proven winning Odds Insider system picks for all major sports\n\nOdds Insider gives you all the data you need to make informed bets on professional football games.  Not only do you get the latest lines from the most respected land-based and online sports books, you get to see the lines change in near real-time.\n\nPeople often refer to \"the smart money\" when betting. But how do you determine this? Tracking lines that move in the opposite direction of what team the higher percentage of public bets are on is the key. Following these reverse line moves has been shown to be profitable.\n\nEvery week, regardless of the sport, head-scratching upsets take place that have bettors cursing the heavens and crying foul while ripping up their tickets.\n\nNow do the sharps win every single time? Absolutely not! However, they are right more often than they are wrong, so being on the same side as the sharps is a prudent strategy over the long run, and Odds Insider helps you do that!\n\nPlease find our terms and conditions at https://app.termly.io/document/terms-of-use-for-website/dee533d5-efc2-4a75-84d5-a8a3c5e48270 and our privacy policy at https://oddsinsiderapp.com/tapular-privacy-policy.html",
  "genres": [
   "Sports",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2011-12-13T02:58:25Z",
  "updated": "2019-12-10T16:14:11Z",
  "releaseNotes": "- Bug fixes",
  "version": "6.0.5",
  "price": 0,
  "developer": "Tapular",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.FormaGrid.Hyperbase",
  "title": "Airtable",
  "description": "Airtable is the easy way to create your own organizational databases. From indie filmmakers to cattle farmers, creators and creatives around the world are using Airtable to organize their lives, their way.\n\nUse Airtable to create flexible checklists, organize collections or ideas, and manage customers or contacts — all in one place. Get started instantly with a variety of templates ranging from home improvement to store inventory, or easily piece together your own layout from scratch.\n\nWith Airtable, your iOS device suddenly becomes a database creation powerhouse — designed to let you easily swipe and tap your way to fully custom databases. It’s collaborative in real-time, so you can share with friends and teammates and always see their latest changes.\n\nHere are some ways that Airtable is being used today:\n\n▸ Organizing People and Customers\n\n* Sales and customers\n* Recruiting\n* Public relations and media lists\n* Business development\n* Personal CRM\n* Volunteer management\n* Sports clubs\n* Boy or Girl Scouts\n\n\n▸ Cataloging Collections, Ideas, and Inventory\n\n* Store or restaurant inventory\n* Product catalogs\n* Personal clothing collections\n* Pet medical history\n* Cattle and farm inventory\n* Frequent flyer accounts\n* Camping supplies\n\n\n▸ Managing Projects and Tasks\n\n* Team project management\n* Events and conferences\n* Blog editorial calendars\n* Wedding planning\n* Building inspection checklists\n* Planning out novels\n* Study guides\n* Film production\n\n\nOrganize anything you can imagine with Airtable!",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2014-09-16T04:08:41Z",
  "updated": "2020-04-28T18:14:54Z",
  "releaseNotes": "Organize anything you can imagine with Airtable, a modern database created for everyone.\n\n* Bug fixes and performance improvements\n\n------\n\nQuestions, comments, or suggestions? We'd love to hear from you: support@airtable.com",
  "version": "3.12",
  "price": 0,
  "developer": "Formagrid",
  "score": 4.70511,
  "reviews": 763,
  "currentVersionScore": 4.70511,
  "currentVersionReviews": 763,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.savysoda.documents",
  "title": "Documents",
  "description": "Documents - by SavySoda™\n• Take your documents anywhere •\n\n\n• Used by over 15 MILLION iOS users •\n• Now with full latest iOS, Watch, Widget, iCloud Support •\n\n\nWE ARE MAKING DOCUMENTS THE ABSOLUTE CHEAPEST FULL OFFICE & DOCUMENTS MANAGEMENT SUITE FOR THE IPHONE!  now everyone can have full documents functionality on their iPhone and iPods!\n\n\nIntroducing the iPhone's only light weight mobile office suite and file manager. This essential application allows you to edit and manage spreadsheet, text, and image files on your iPhone. Works both online and offline. You can transfer files between your iCloud, Google Docs and Dropbox accounts; and you can transfer files to your PC or Mac using USB and WiFi.\n\n\nCreated files can be opened using Microsoft Word and Excel, Open Office, Numbers, and all major office suites.\n\n\nWorks with Dropbox™\nWorks with Microsoft OneDrive™\nWorks with Google Drive™\n\n\nINCLUDES\n\n• iSpreadsheet (a premier spreadsheet app)\n• Text Editor (to edit basic text)\n• File Manager (browse and manage your files)\n• Google Sync (to upload/download documents)\n• Dropbox (manage dropbox files)\n• Instant Email (send those files to your boss)\n\nBONUS EXTRAS\n\n• Photo Album (a easier way to organize photos)\n\nFEATURES\n\n• Smooth User Interface\n• Portrait & Landscape mode\n• Full support for .txt and .csv files\n• Limited support for .doc, .xls files via Google Docs\n• Google upload & download\n• Created files can be opened in Microsoft Excel, Word, Apple Numbers, TextEdit, Notepad, Openoffice & all leading office suites.\n• Create, View & Manage Photos and Documents\n• Works anywhere online or offline.\n• Spreadsheet supports formulas, formatting, resizing, and all basic spreadsheet features.\n• Beautiful UI.\n• Free updates\n\nSOME USES\n\n• Lightweight office work on the run\n• Backup of documents\n• Quick access to spreadsheets, notes, memos\n• Basic word processing\n• Pocket Spreadsheet\n\n\nCOMING SOON\n\n- Support for more file types\n- Additional functions & features\n\n\niPhone Office Apps\nhttp://www.savysoda.com/Documents/",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2008-11-20T18:16:08Z",
  "updated": "2019-08-28T02:23:02Z",
  "releaseNotes": "12.2 Patch Fix\nFixes some UI errors\nFixes a crash when exporting photos",
  "version": "12.2",
  "price": 4.99,
  "developer": "Savy Soda",
  "score": 4.43983,
  "reviews": 698,
  "currentVersionScore": 4.43983,
  "currentVersionReviews": 698,
  "searchTerms": "spread betting"
 },
 {
  "appId": "Shift.DigitsCalculator",
  "title": "Digits Tape Calculator",
  "description": "Get organized! Conquer numbers on the go. Digits 3 is a top-to-bottom rewrite made for the latest iOS and devices.\n\nWe're human. We're busy. We make mistakes. So we designed a calculator for humans, from the ground up. Digits combines the editability of a spreadsheet with the simplicity of a calculator. Digits is a calculator a human can love.\n\nSo, why do so many humans love Digits? Its uniquely correctable tape means never worrying if you entered a calculation correctly. Make a mistake? Tap any entry on the tape to correct it (or edit, insert, copy and more). Then, add a label/comment and email or print the tape.\n\nDigits is Shift’s highly-rated iOS calculator app that features an intuitive, fully correctable and editable line-by-line tape history. It uniquely provides spreadsheet-like editing with calculator-level simplicity. Tapes are stored as documents so groups of calculations can be stored and edited conveniently. Comments can be added to each calculation line, making the app ideal for expense tracking and budgeting.\n\n---\nDigits 3 highlights:\n• An updated, polished user interface with buttery-smooth interaction.\n• Dark Mode and detailed color and sound customization.\n• Multi-threaded processing for desktop-level performance.\n• In-app upgrades, starting with Tape Document sharing (via Messages, Mail, Dropbox and other popular file sharing services).\n• Built from the ground up with support for 64-bit and the latest iOS/hardware.\n• Designed to maximize resolution on devices like the iPhone X.\n• Split View support on iPad for side-by-side work.\n• Expanded in-app help.\n• Accessibility VoiceOver support.\n\nHow Digits earned its stars:\n• Spreadsheet-like editing with calculator-level simplicity.\n• Fully correctable and editable line-by-line tape history.\n• Fluidly enter values, label and email or print.\n• Double-check and correct entries with ease.\n• Export Tape Documents in a variety of formats.\n\nButton functions:\nDelete row, backspace, clear all, clear, memory, memory plus, memory minus, plus or minus, tape browser, percent, export, settings, shop, tips, help, edit, insert, total, copy, use, comment, flag, sin, cos, tan, square, cube, exponent, square root, cube root, root, inverse, Euler, Pi, add, subtract, multiply, divide, total.",
  "genres": [
   "Utilities",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2010-04-01T19:38:58Z",
  "updated": "2019-09-17T20:28:40Z",
  "releaseNotes": "The calculator that edits, comments, shares, saves and prints, has gone Dark. Dark Mode is now supported as standard in iOS 13. And we’ve added Smart Color Sets to keep your keypad looking great as you toggle between Light and Dark.",
  "version": "3.1.2",
  "price": 1.99,
  "developer": "Shift",
  "score": 4.83333,
  "reviews": 30,
  "currentVersionScore": 4.83333,
  "currentVersionReviews": 30,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.savysoda.iSpreadsheet2",
  "title": "iSpreadsheet™",
  "description": "iSpreadsheet is a free, simple to use yet powerfull mobile spreadsheet Application for your iPhone & iPad. Quickly create beautiful spreadsheets that are compatible with major office solutions such as Excel and Numbers. \n\niSpreadsheet is built from the ground up for iPhone and iPad so it runs very fast even on older devices. And iSpreadsheet works seamlessly with a myriad of file transfer and storage options including: Windows SMB Network Share, Box, Dropbox, Google Drive, Docs, OneDrive, iCloud and more.\n\nSupports Formatting and Formulas. Uses CSV comma separated file format for maximum compatibility. Can read numbers and excel xls xlsx files too!\n\nFEATURES:\n• Google Docs Integration\n• iCloud & iCloud Drive Integration\n• Manage both online and offline worksheets\n• Portrait & Wide-screen Landscape view\n• Load .XLS and .CSV files from Google Documents. (without formatting)\n• Save in .CSV format (RFC 4180 compliant)\n• Manage multiple Spreadsheets\n• Execute complex arithmetic formulas\n• Access a useful subset of Excel formulas\n• Cell Formatting\n• Column Resizing\n• Clipboard Copy Paste\n• Column Row Insert\n• Progressive Loading\n• Fluid Graphics\n• Familiar Interface\n• Online help\n• Offline formula wizard\n• Context Aware Toolbar\n• Autosave & Recovery\n• Free Updates\n\n\nMore Free iPhone Apps:\nhttp://www.savysoda.com",
  "genres": [
   "Finance",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2014-11-04T16:37:04Z",
  "updated": "2018-08-31T03:13:18Z",
  "releaseNotes": "Patch update for users on iOS 11. Fixes some issues with printing, fixed connection issue with Google Drive.",
  "version": "11.5",
  "price": 2.99,
  "developer": "Savy Soda",
  "score": 4.33333,
  "reviews": 147,
  "currentVersionScore": 4.33333,
  "currentVersionReviews": 147,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.orcascan.wifibarcodescanner",
  "title": "Orca Scan",
  "description": "Orca Scan is a barcode scanner app that was designed to make it as easy as possible to track assets and inventory using your mobile phone. \n\nIt is fully configurable, simply add and remove fields to capture the data you need then export that data in a variety of formats including Microsoft Excel, JSON, XML and of course CSV.\n\nHOW IT WORKS\n\n1. Scan any barcode, QR code, UPC or GS1\n2. Add details such as quantity, description, GPS location\n3. Add custom fields to capture additional data\n4. Share data in a Microsoft Excel spreadsheet, CSV, JSON\n\nA few of the ways people use Orca Scan:\n\nINVENTORY TRACKING\n• Manually add items\n• Add custom fields\n• Continuously scan barcodes in batch mode (no need to tap)\n• Automatically detect and merge duplicates\n• Auto increase/decrease quantities on scan\n• Export as Excel, CSV, XML or JSON file\n• Send as an email attachment\n\nASSET TRACKING\n• Track asset locations with GPS fields\n• Create your own fields to track price, conditions, custody etc\n• Automatically timestamp when assets are inspected or transferred\n• Share assets in a sorted spreadsheet\n\nATTENDANCE TRACKING\n• Capture all the major ID barcodes like QR or Code 39\n• Use continuous/batch scan mode to check-in people in seconds\n• Use front facing camera for self-check in and self-registration\n• Share or print attendance sheet in a nicely structured spreadsheet\n\nADD CUSTOM FIELDS:\n• Text\n• Email\n• GPS Location\n• Number\n• Number (auto increase on scan)\n• Number (auto decrease on scan)\n• Date\n• Date Time\n• Time\n• True/False\n\nSCAN ANY BARCODE:\n• QR Code\n• Data Matrix\n• Aztec\n• Universal Product Codes (UPC) E & A\n• European Article Number (EAN) 8 and 13 \n• Code 39, Code 93 & Code 128\n• PDF417\n• Interleaved Two of Five (ITF)\n\nQuestions or suggestions? We'd love to hear from you hello@orcascan.com",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2016-11-03T01:11:21Z",
  "updated": "2020-03-06T22:40:30Z",
  "releaseNotes": "Hello!\n * You can now set \"Empty on edit\" for cloud sheets\n * Required status is now ignored when a field is hidden\n * Resolved conditional if-this-then-that trigger bugs",
  "version": "5.3.0",
  "price": 0,
  "developer": "Cambridge App Lab Limited",
  "score": 4.84848,
  "reviews": 99,
  "currentVersionScore": 4.84848,
  "currentVersionReviews": 99,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.vendhq.counter",
  "title": "Scanner by Vend",
  "description": "The best free inventory barcode scanner app for retail. Perform full or partial inventory counts straight from your iPhone, iPad, or iPod Touch - no additional hardware required.\n\nKey features:\n\n▶ Scan inventory item barcode labels or UPCs using the built-in camera\n▶ Hover scan (no need to take a picture) \n▶ Continuous scan (no need to edit quantity for the same item)\n▶ Auto next scan (no need to press any buttons)\n▶ Vibrates/beeps to notify you of a valid scan\n▶ Editable barcode number, product name and quantity for each scan\n▶ Add barcodes/products manually \n▶ Create and manage unlimited counts\n▶ Automatic timestamp for each count\n▶ Share your counts as a CSV via email, AirDrop, Dropbox, and other cloud services\n▶ Supported codes: PCE, Code39, Code39Mod43, EAN13, EAN8, Code93, Code128, PDF417, AztecCode, Interleaved2of5Code, ITF14Code, DataMatrixCode\n\nPlus, for existing Vend customers, Scanner integrates seamlessly with Vend POS to let you sync inventory counts, product details and stock levels - eliminating the need for spreadsheets and manual entry! \nTo find out more about how Scanner with Vend POS can help save time and improve accuracies when counting inventory, visit vendhq.com/scanner\n\nWho is Scanner by Vend great for?\n\n▶ Any retail business, especially Vend POS users\n▶ Warehouse and inventory managers\n▶ And anyone who needs to count inventory!\n\nSupport:\n\n▶ If you have any problems or suggestions please email scanner@vendhq.com",
  "genres": [
   "Business",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2016-05-19T19:58:15Z",
  "updated": "2020-04-28T22:21:30Z",
  "releaseNotes": "We've added a beautiful new dark mode to Scanner!\n\nIn case you missed it Scanner 3 was our biggest update yet! We've reworked Scanner to work a lot better for larger businesses.\n- Starting a count is significantly faster.\n- We've changed the layout of the app to make it easier to use.\n\nWe’re all about remarkable retail and love getting feedback from you. Tell us about your experiences on Facebook or Twitter!",
  "version": "3.1.1",
  "price": 0,
  "developer": "Vend",
  "score": 4.59375,
  "reviews": 96,
  "currentVersionScore": 4.59375,
  "currentVersionReviews": 96,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.silverware.timetracker",
  "title": "TimeTracker - Time Tracking",
  "description": "Track time spent on the job with this powerful, customizable and easy to use app. TimeTracker is your full featured time tracking and reporting application.  It will simplify your life and save you money!  The latest update includes many customer requested features.  It will quickly pay for itself!\n\nTimeTracker is finely tuned, exceptionally reliable and has been helping user track their time worked since 2011.\n\n------\nIts ease of use, full features and great interface make it an essential tool for any iPhone or iPad user needing to track their time spent on the job.  Its' power extends to the desktop by allowing emailing or exporting PDF format or Excel friendly files directly to the desktop.  It's so easy to use!\n------\n\n\nWHY TimeTracker IS BETTER\n* Elegant user interface\n* The most powerful and flexible Reporting features available\n* Organize your entries into logs for maximum ease of use\n* Quick and easy on-screen filtering to get the most from your tracked data\n* The MOST extensive set of preferences available\n\nEASE OF USE\n* Completely customize your app and make it your own\n* Record your entries with easy to use screens that show your frequently used items\n* Custom keyboard entry with calculator functions\n* Smart functions to make data entry FAST (i.e. once you select a client, remembers their rate)\n* Keeps a frequently used list for appropriate fields like \"Client\", \"Project\" and \"Description\" and presents those when entering for one tap entry\n* Always remembers the last log you edited and returns you there upon returning to the app \n* Unlimited customizable pay rates\n* Specify a default wage for each log\n\nVIEWING YOUR ENTRIES\n* Shows total earned for each log when displaying Log view screen\n* Sort time entries by \"Date\", \"Client\", \"Task\", \"Project\", \"Rate\" and several other parameters\n* Filter on-screen display to see exactly the information you need\n* Customizable 2nd line display and optional 3rd line for even more information\n\nREPORTING\n* The most flexible and powerful reporting available\n* Choose the attractive PDF format or CSV for importing into Excel\n* Email your time sheet reports\n* Export your reports to Dropbox, Box or directly to your Mac or PC via a wi-fi connection\n* Accountants love our templates because they provide all the key information needed\n\nPREFERENCES\n* Show those fields you wish to use and hide those you do not need\n* Ability to set password to access app\n* Includes client field and support for sorting and exporting by client.  Ideal for those who must bill different clients \n* Specify a rounding preference when recording time\n* Choose to display time in hours/minutes or decimal format\n\nTIME\n* Create custom rates using one of three different rate types\n  1.  Hourly\n  2.  Per Visit\n  3.  Per Day\n* Auto calculate overtime worked\n* Further categorize your time:  “Work”, “Vacation”, “Sick” or “Other”\n\nINTERNATIONAL\n* Supports ALL major currencies\n\nBACKUP AND SAFE KEEPING\n* Backup your data to iCloud or directly to your computer via a Wi-Fi connection (optional add-on to backup to Dropbox or Box)\n* Set backup to “Automatic” when using iCloud so your data is always safe\n\nADD-ONS\n* App offers unique and powerful add-ons if you wish to further expand the power of the app\n  1.  Create your own templates for creating PDF reports to match your company's requirements\n  2.  Keep ALL of your iOS devices in sync via iCloud or Dropbox\n  3.  Backup your data and Export reports to Dropbox or Box cloud services.\n\n------\nQuestions/comments?  For a fast reply, email us at: support@silverwaresoftware.com\n\nWe have received excellent customer reviews because we pride ourselves in providing excellent customer service. If you need assistance, please feel free to contact us.\n\nSimply go into TimeTracker's Prefs screen and tap on the \"Email the Author\" option.",
  "genres": [
   "Business",
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2011-05-24T19:32:38Z",
  "updated": "2019-09-17T19:55:12Z",
  "releaseNotes": "*** New in Version 10.70 *** (Late September 2019)\n* This update is REQUIRED if you plan on using iOS 13.\n* Changes to be compatible with iOS 13\n* Various User Interface enhancements.\n* Improved download of currency exchange rates.\n* Improved conversion of GPS location of drives to addresses for optional AutoTrack feature.\n* Minor bug fixes.",
  "version": "10.70",
  "price": 3.99,
  "developer": "Silverware Software, LLC",
  "score": 4.62263,
  "reviews": 53,
  "currentVersionScore": 4.62263,
  "currentVersionReviews": 53,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.pudding-table.business.TableMemo",
  "title": "Table Memo",
  "description": "Table Memo is simple memo app of  spreadsheet form.\nEach memo has a header of several columns, and has rows of memo.\nYou can add/delete columns, edit each item name, add/delete/copy/move rows of memo.\nCreated/edited memo can be sent by mail as CSV (with values encapsulated in double quotes) formatted data (UTF-8 encoding).\nYou can also use Table Memo app as simple CSV (with values encapsulated in double quotes) viewer(use iOS mail app).\n\nHow to use:\n1. Create Memo\n At memo list view (first view of this app), tap add('+') button, and input the memo title.\n By tapping Edit button, you can edit memo name, delete memo, and reorder list.\n\n2. Edit Memo data\n Select the created memo, and open memo table view.\n Tap each cell you want edit, and edit the data.\n If color mode is on, text and cell color also can be changed.\n To add new row, tap add('+') button.\n To copy or delete row, tap the row number of left side and select operation.\n By double tapping a cell, the entire contents of the cell is displayed, so you can check and copy the contents.\n\n At the bottom of memo table view, there are four buttons, 1) trash button, 2) action button, 3) table settings button, 4) reorder button, from left to right.\n1) trash button\n You can delete current opened memo.\n2) action button\n Current opened memo can be duplicated, or can be sent by mail as CSV formatted data.\n3) table setting button\n Table settings view will open (see below).\n4) reorder button\n By tapping this button (the reorder button changes to the edit button), memo table becomes the reorder mode, and you can reorder rows by dragging each row.\n To back to edit mode, tap the edit button.\n\n3. Table Settings\n1) Use Color switch\n If set ON, text and cell color becomes changeable.\n [[CAUTION]] If set OFF after using color, all color data will clear. \n2) MEMO TITLE section\n Select memo title and edit the title.\n3) Left Inset setting\n You can adjust the space on the left side of the cell.\n4) Font Size setting\n You can change the font size of the table.\n5) Columns section\n To add new column, tap add('+') button.\n To delete column or reorder columns, tap Edit button.\n By selecting each ITEM of columns, column edit view will open (see below).\n\n4. Column edit \n1) ITEM name section\n  You can edit item name.\n2) Column width section\n You can change column width by slider.\n By tapping the adjust button, the column width will be set to the width of existing data.\n\n*You can also open this view by long press of header item at memo table view.\n\n5. Settings\nTapping settings button at memo list view, SETTINGS view will open. \nYou can change settings below:\n1) THEME of this app\n2) settings of CSV export/import\n - encoding of CSV data\n - export header\n - import 1st row as header\n3) default column name and default number of columns.",
  "genres": [
   "Business",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2014-01-15T00:07:53Z",
  "updated": "2018-09-14T00:53:19Z",
  "releaseNotes": "- Add font size change function.\n- Add function to adjust inset.\n- Add value check function by double tap of cell.\n- Support iOS10.3 or later.\n- Fix minor bugs.",
  "version": "1.3.0",
  "price": 0,
  "developer": "RYOICHI KAWAHARA",
  "score": 4.5,
  "reviews": 66,
  "currentVersionScore": 4.5,
  "currentVersionReviews": 66,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.tecit.ScanToOffice",
  "title": "Scan-IT to Office",
  "description": "Scan-IT to Office is the efficient solution for mobile data acquisition with real-time connectivity to arbitrary PC or Mac applications and databases accessible via ODBC - with enhanced support for Microsoft Excel, Microsoft Word, Google Sheets and Google Chrome. Captured data like barcodes, texts, numbers, locations or images is transferred via cloud services immediately to targets on your desktop computer. This works regardless of your location, even across different offices, facilities or countries. \n\n\nVERSATILE\nData is captured into clearly structured input forms on the smartphone or tablet. Users can select from predefined standard forms or create their own input forms if required.\n\n\nEASY TO USE\nScan-IT to Office is ready to use in just a few steps: This data acquisition app is paired with the corresponding target by scanning a QR code. Now the data transfer works on its own: captured bar-codes, pictures, manual inputs, timestamps or location data are automatically sent to their destination.\n\n\nFEATURES\n• Mobile data collection app for smartphones and tablets\n• Captures barcodes, images, timestamps, texts, location data and numbers\n• Real-time data transfer to any PC or Mac application\n• Store data in any database accessible via ODBC\n• Insert data directly into Word, Excel, Google Sheets or Google Chrome\n• Custom and predefined data acquisition forms\n• End-to-end encryption guarantees maximum privacy & security\n• Works worldwide, independent of time and place\n• For single and multi-user scenarios\n\n\nFREE DEMO\nThe app is available as free trial, a paid subscription unlocks all functions. Without a subscription, the app replaces collected data at random intervals with a demo text and/or a notification is displayed.\n\n\nIMPORTANT NOTICE\nTo use this app, you need to install the additionally required Scan-IT to Office software (available for free) on your desktop computer: \n\nScan-IT to Office Tools enable arbitrary PC or Mac applications and ODBC-databases to receive data collected with the app. Download the tools using this link: https://www.tec-it.com/stodownload  \n\nScan-IT to Office Add-Ins are dedicated Add-Ins for Microsoft Word, Microsoft Excel, Google Sheets and Google Chrome, which provide optimized and seamless data acquisition functionality. Install the desired Add-In directly in the host application or from the respective store:\n\n• Microsoft Word / Microsoft Excel: https://appsource.microsoft.com/product/office/wa104381026  \n\n• Google Sheets: https://chrome.google.com/webstore/detail/scan-it-to-office/oeggkbdldochacapfbnbmhghcfinaehh\n\n• Google Chrome: https://chrome.google.com/webstore/detail/scan-it-to-office/ijemakhbbjajapbmdonhjmfkkcpliafp\n\n\nFREE SUPPORT\nIn case of questions, please contact us at support@tec-it.com (E-Mail), TECITSupport (Skype) or visit https://www.tec-it.com/sto. \n\n\nSUBSCRIPTION POLICY\n• Monthly, quarterly or yearly subscriptions are available\n• When buying a subscription, payment will be charged to your iTunes Account at confirmation of purchase.\n• Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.\n• Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.\n• You may also manage your subscriptions via App Store.\n• Auto-renewal of a subscription may be turned off by going to your Account Settings in the App Store after purchase.\n\n\nTerms of use and privacy: https://www.tec-it.com/download/PDF/TEC-IT_AGB_EN.pdf",
  "genres": [
   "Business",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2017-07-20T10:18:01Z",
  "updated": "2020-05-05T11:04:28Z",
  "releaseNotes": "• Fixed possible crashes",
  "version": "4.1.1",
  "price": 0,
  "developer": "TEC-IT Datenverarbeitung GmbH",
  "score": 4.71053,
  "reviews": 38,
  "currentVersionScore": 4.71053,
  "currentVersionReviews": 38,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.dataviz.DocsToGoEAS",
  "title": "Docs To Go Premium",
  "description": "Documents To Go® Premium contains best-in-class document viewing & editing, including save & synchronization options directly to your iOS device, desktop & laptop via Wi-Fi, and to the cloud service of your choice (iCloud, Google Drive, Dropbox, Box, OneDrive or SugarSync). One purchase includes the iPad & iPhone versions. \n\nTHE DATAVIZ® ADVANTAGE\n• Founded in 1984, DataViz is an industry leader in developing mobile Office & productivity solutions for iOS, Mac, and more. \n• Documents To Go, now in its 17th year, is currently preloaded on millions of devices around the world. \n• InTact Technology™ retains original document formatting of edited files.\n• No account sign-up necessary to get started in creating files and the freedom to save files where you choose!\n• All your files in one app - no need to download separate components or cloud service/drive apps. \n• Technical support is available via email by actual people in our home office & via our robust knowledge base at DataViz.com.\n\nOVERALL SUITE FEATURES: \n• View, edit, and create MS Office files (latest version).\n• View PDF, iWork, Text, .RTF files, and more!\n• View, edit, save, and sync with multiple cloud services: iCloud, Google Drive, Dropbox, Box, OneDrive, and SugarSync.\n• Save changes directly to your device, multiple cloud services, or to your computer with our desktop/laptop application - free with your purchase (this app allows you to access desktop files & sync via a Wi-Fi connection).\n• Send & receive supported email attachments using the built-in Mail app.\n• Open & edit files within Docs To Go from any 3rd party app that supports the iOS \"Open In\" feature.\n• File sorting manager (sort your file list by Name, Modified, Size, etc.)\n• Supports iTunes File Sharing via USB cable for manually moving files.\n\nFREE DESKTOP APPLICATION available for 2-way file sync via Wi-Fi - Sync & transfer files/folders in one, easy-to-use desktop app.\n\nWORD TO GO FEATURES: \n• Format font type, size, color, bold, italics, underline, and highlight text\n• High fidelity viewing for embedded graphics, tables, comments, footnotes/endnotes, text boxes, table of contents, and hyperlinks\n• Change paragraph alignment\n• Edit bullets and numbering\n• Find & replace\n• Word count\n• Open password protected Word files \n\nSHEET TO GO FEATURES:\n• Freeze panes\n• Sort\n• Extensive cell & number formatting options\n• 111 functions supported\n• Insert, delete, resize, hide/unhide rows & columns\n• Rename, insert, and delete worksheets\n• Find/find next\n• Open password protected Excel files \n\nSLIDESHOW TO GO FEATURES:\n• In-slide PowerPoint editing - Edit slide contents & formatting directly in the slide vs. a separate/outline view. \n• Thumbnail slide sorter/view\n• High fidelity PowerPoint viewing, including: charts, MS Office SmartArt, and more\n• View/edit/add speaker notes\n• Sort slides\n• Promote/demote bullets\n• Open password protected PowerPoint files\n\nPDF TO GO FEATURES:\n• Pinch-to-zoom to desired PDF page size/width\n• Open password-protected PDFs\n\n*PowerPoint files are view and edit only.",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2009-06-14T19:23:49Z",
  "updated": "2019-03-01T17:48:06Z",
  "releaseNotes": "-OneDrive fix\n-Various bug fixes",
  "version": "5.4.0",
  "price": 16.99,
  "developer": "DataViz, Inc.",
  "score": 2.5,
  "reviews": 14,
  "currentVersionScore": 2.5,
  "currentVersionReviews": 14,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.zoho.chartistic",
  "title": "Chartistic - Charting App",
  "description": "Chartistic has been featured in the App Store in 43 countries, already! It has also been listed in App Store’s ten best Apps of the year in Singapore, Thailand, Philippines, and Vietnam!\n\n-----------------------\n\nTwo ingredients to a great presentation. A powerful storyline, and the data to back it up.\n\nGood stories can sell themselves, but data needs visual support! Most presentations tumble down into the pit of forgettable mediocrity simply because they lack visually appealing data-centric charts.\n\nAlso, there aren't many easy-to-use tools for your mobile device that strip away the drudgery of creating charts.\n\nPrecisely why we built Chartistic!\n\nChartistic comes with an assortment of interactive bar charts, line charts, area charts, (sweet as) pie charts that are both great to look at and fun to create.\n\nOur unique clipart-powered data visualizer is a show-stealer, sure to drive your points home!\n\nCreate and edit them all on the go. And export as images and embed in presentations, emails, documents, spreadsheets, even in your next tweet!",
  "genres": [
   "Productivity",
   "Education"
  ],
  "contentRating": "4+",
  "released": "2016-10-04T12:13:26Z",
  "updated": "2018-07-03T10:20:06Z",
  "releaseNotes": "Bug fixes and performance enhancements.",
  "version": "2.0.3",
  "price": 0,
  "developer": "Zoho Corporation",
  "score": 4.59999,
  "reviews": 10,
  "currentVersionScore": 4.59999,
  "currentVersionReviews": 10,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.harrisrappaport.iphone.List-Maker",
  "title": "List Master Pro - Your Lists",
  "description": "\"Put this on your to-do list: buy List Master from the App Store.\" -- Mac|Life (5/5 stars)\n\"Nearly flawless: buy it now.\" -- Wired Magazine (Featured in Annual App Guide)\n\n\"We were immersed in the boundless options within each list. Everything in List Master can be customized to fit your specific needs. Lists can be as simple as this week’s groceries, but the real value of List Master is in its powerful customization tools. If you’re looking for customization and complete control, put this on your to-do list: buy List Master from the App Store.\"\n-- Mac|Life (5/5 stars) Rating: 'Awesome'\n\n\"Customization out the wazoo. Very nice interface for such a full-featured app. It works almost precisely the way you expect an iOS app to work, and it’s jam-packed with features that leave it balancing lightly on the line between a powerful list app and a simple database. And yet, with all these complexities, the lists themselves are easy to use, easy to organize, and easy to update.\"\n-- Wired (9/10 stars) Rating: 'Nearly flawless: buy it now'\n\n\"Exactly What a List App Should Be. They’ve brought something new to a genre that is otherwise tired and cluttered with generic developments. List Master is easily one of, if not the best list app for iPhone and iPad that I’ve ever seen.\"\n-- appPicker\n\n\"It's clearly a very flexible app  It is quick and easy to use, works seamlessly between iPhone and iPad versions, and syncs easily. This is a great tool that will work perfectly for most household chores and tasks you might have.\"\n-- c|net\n\n\"Your complete List Assistant. We have yet to find anything more complete than List Master.\"\n-- appsplit\n\nFeatured in Apple's New & Noteworthy Apps\n\nGetting organized is now easy and fun. With List Master, you can make the perfect Grocery List, Password List, To Do List, Gift List, any kind of list you want. This is your perfect personal database. With List Master, you get to decide exactly what type of information you want to store in your lists. Then List Master's revolutionary design lets you view your lists any way you want. List Master gives you the tools you need and then gets out of the way.\n\nList Master puts the power in your hands ... where it belongs.\n\nMAJOR FEATURES\n+ Create lists made up of virtually any number of columns\n+ Column types include: text, number, currency, date, time, contact, image, rating, phone, email, website, and more\n+ Create folders and lists within lists, as many levels deep as you want\n+ Inline editing lets you edit your items like a spreadsheet\n+ Easily move or copy between lists\n+ Due Dates / App Badge / Alerts\n+ Advanced search functionality\n+ Sophisticated filters\n+ Calculated columns\n+ Picklists\n+ Total row\n+ Custom row heights, fonts, and font sizes\n+ Use custom colors and emojis for each list\n+ Use a color wheel to choose any color for folders and items\n+ Make Quick Lists from copied data\n+ Import/Export via email or Dropbox\n+ Email formatted lists\n+ Automatic local and Dropbox backups\n+ Passcode lock\n+ Many sample lists\n+ Great customer support\n+ Sync with all your iOS devices\n+ Website membership available to view your lists online\n+ Many instructional videos at http://www.onlinelistmaster.com/video.aspx\n\nCustomer Service is a top priority for me. If you have any requests or issues, please email me directly at ios.info@onlinelistmaster.com. Thanks!",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2009-10-08T03:07:23Z",
  "updated": "2019-12-11T00:14:53Z",
  "releaseNotes": "+ added ability to filter on blank dates\n+ fixed bug where checked switch wasn't reflecting the checked state when editing an item",
  "version": "5.5.3",
  "price": 9.99,
  "developer": "List Logic Software",
  "score": 4.38462,
  "reviews": 26,
  "currentVersionScore": 4.38462,
  "currentVersionReviews": 26,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.dataviz.DocsToGo",
  "title": "Docs To Go Standard",
  "description": "Office anywhere with Docs To Go: View, edit, and create Microsoft® Office files (Word, Excel, PowerPoint*) & view Adobe PDF® files on your iOS device with the original & #1 selling mobile MS Office suite of all time. \n\nDocuments To Go® Standard contains best-in-class document viewing & editing. Options for connecting to multiple cloud storage accounts, desktop file sync, and opening password-protected files are available via in-app purchase.\n\nTHE DATAVIZ® ADVANTAGE \n• Founded in 1984, DataViz is an industry leader in developing mobile Office & productivity solutions for iOS, Mac, and more. \n• Documents To Go, now in its 17th year, is currently preloaded on millions of devices around the world. \n• InTact Technology™ retains original document formatting of edited files.\n• Technical support is available via email by actual people in our home office & via our robust knowledge-base at DataViz.com.\n\nOVERALL STANDARD VERSION FEATURES: \n• Works on both iPhone and iPad\n• View, edit, and create MS Office files (97-2018).\n• View PDF, iWork, Text, .RTF files, and more! \n• Send & receive supported email attachments using the built-in Mail app. \n• Open & edit supported files within Docs To Go from any 3rd party app that supports the iOS \"Open In\" feature. \n• File sorting manager (sort your file list by Name, Modified, Size, etc.)\n• Supports iTunes File Sharing via USB cable for manually moving files. \n\nWORD TO GO FEATURES: \n• View, edit, and create Word (.doc, .docx) files \n• Format font type, size, color, bold, italics, underline, and highlight text \n• High fidelity viewing for embedded graphics, tables, comments, footnotes/endnotes, text boxes, table of contents, and hyperlinks \n• Change paragraph alignment \n• Edit and/or insert bullets and numbering \n• Multiple undo/redo \n• Find & replace \n• Word count \n\nSHEET TO GO FEATURES: \n• View, edit, and create Excel (.xls, .xlsx) spreadsheets \n• Freeze panes \n• Sort \n• Extensive cell & number formatting options, including: font type, size, color, alignment, fill, highlight, category, and decimal place) \n• 111 functions supported \n• Insert, delete, resize, hide/unhide rows & columns \n• Rename, insert, and delete worksheets \n• Multiple undo/redo \n• Find/find next \n\nSLIDESHOW TO GO FEATURES: \n• In-slide PowerPoint editing - Edit slide contents & formatting directly in the slide vs. a separate/outline view. \n• Thumbnail slide sorter/view\n• High fidelity PowerPoint viewing, including: charts, MS Office SmartArt, and more\n• View/edit/add speaker notes\n• Sort slides\n• Promote/demote bullets\n• Open password protected PowerPoint 97-2018 files\n\nPDF TO GO FEATURES: \n• Pinch-to-zoom to desired PDF page size/width \n• Open password-protected PDFs\n\n*PowerPoint files are view and edit only.",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2009-06-14T17:19:23Z",
  "updated": "2020-03-23T17:36:16Z",
  "releaseNotes": "Several fixes including iCloud crash",
  "version": "5.5.1",
  "price": 0,
  "developer": "DataViz, Inc.",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.kerubin.iSum",
  "title": "iSum",
  "description": "iSum is extremely useful app for tracking numbers, expenses and time. App design is simple and clear for fast usage on the go. iSum will remove the headache of using complex spreadsheet apps on your iPhone - you will actually use this app!\n\nForget clumsy use of computer whenever you need to enter or update just a few numbers. Snap your iPhone out of your pocket and enter updates into iSum. It can be time, expenses, sizes, or even things like body temperature or number of heart beats - practically anything that can be represented by numbers. Lists can be exported to computer later.\n\nWith introduction of negative numbers in this version you can also track BALANCE; for example; if you give money advance to somebody and he will be spending it in several smaller chunks, you can keep track of the balance and easily see when the advance will be fully spent. \n\nFeatures:\n* Creation, reordering, renaming, deleting of basic groups\n* Fast number adding\n* Add negative numbers and track balance\n* Short notes for each entered number\n* Edit date of entry\n* Total Sum\n* Sum for: running month, last month, running week and last week\n* Average for: running month, last month, running week and last week\n* Exporting CSV file by email. CSV file can be imported into your favorite spreadsheet application on your computer.",
  "genres": [
   "Finance",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2011-05-11T00:23:47Z",
  "updated": "2017-06-05T18:09:25Z",
  "releaseNotes": "- fixed crash on iOS9 and older\n- small improvements",
  "version": "5.2",
  "price": 0,
  "developer": "ZEN PLUS LTD",
  "score": 4.5,
  "reviews": 6,
  "currentVersionScore": 4.5,
  "currentVersionReviews": 6,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.pelicanexchange",
  "title": "Pelican Trading",
  "description": "Pelican lets you execute trades and message other investors all on one platform. Trade, chat, earn, all on the go. We connect you to the traders that matter.\n\n• Execute trades from thousands of global markets 24hrs a day \n• Follow and copy trades from other users\n• Talk to other traders and learn from the best\n• See trader performance\n• Create your own chat groups \n• Follow traders and receive their trade updates \n• Join Mentor groups, learn and follow their signals \n\n...and much more.\n\nDownload Pelican to start trading now.",
  "genres": [
   "Finance"
  ],
  "contentRating": "17+",
  "released": "2017-01-12T16:55:55Z",
  "updated": "2020-05-06T12:39:34Z",
  "releaseNotes": "Bug fixes",
  "version": "2.63",
  "price": 0,
  "developer": "Pelican Exchange",
  "score": 4.72414,
  "reviews": 29,
  "currentVersionScore": 4.72414,
  "currentVersionReviews": 29,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.harrisrappaport.iphone.ListMasterLite",
  "title": "List Master - Your Lists",
  "description": "\"Put this on your to-do list: buy List Master from the App Store.\" -- Mac|Life (5/5 stars)\n\"Nearly flawless: buy it now.\" -- Wired Magazine (Featured in Annual App Guide)\n\n\"We were immersed in the boundless options within each list. Everything in List Master can be customized to fit your specific needs. Lists can be as simple as this week’s groceries, but the real value of List Master is in its powerful customization tools. If you’re looking for customization and complete control, put this on your to-do list: buy List Master from the App Store.\"\n-- Mac|Life (5/5 stars) Rating: 'Awesome'\n\n\"Customization out the wazoo. Very nice interface for such a full-featured app. It works almost precisely the way you expect an iOS app to work, and it’s jam-packed with features that leave it balancing lightly on the line between a powerful list app and a simple database. And yet, with all these complexities, the lists themselves are easy to use, easy to organize, and easy to update.\"\n-- Wired (9/10 stars) Rating: 'Nearly flawless: buy it now'\n\n\"Exactly What a List App Should Be. They’ve brought something new to a genre that is otherwise tired and cluttered with generic developments. List Master is easily one of, if not the best list app for iPhone and iPad that I’ve ever seen.\"\n-- appPicker\n\n\"It's clearly a very flexible app  It is quick and easy to use, works seamlessly between iPhone and iPad versions, and syncs easily. This is a great tool that will work perfectly for most household chores and tasks you might have.\"\n-- c|net\n\n\"Your complete List Assistant. We have yet to find anything more complete than List Master.\"\n-- appsplit\n\nFeatured in Apple's New & Noteworthy Apps\n\nNOTE: This is the free version of List Master. This version has all the same functionality as the pro version, except you are limited to 50 items. You can upgrade to the pro version from within the app.\n\nGetting organized is now easy and fun. With List Master, you can make the perfect Grocery List, Password List, To Do List, Gift List, any kind of list you want. This is your perfect personal database. With List Master, you get to decide exactly what type of information you want to store in your lists. Then List Master's revolutionary design lets you view your lists any way you want. List Master gives you the tools you need and then gets out of the way.\n\nList Master puts the power in your hands ... where it belongs.\n\nMAJOR FEATURES\n+ Create lists made up of virtually any number of columns\n+ Column types include: text, number, currency, date, time, contact, image, rating, phone, email, website, and more\n+ Create folders and lists within lists, as many levels deep as you want\n+ Inline editing lets you edit your items like a spreadsheet\n+ Easily move or copy between lists\n+ Due Dates / App Badge / Alerts\n+ Advanced search functionality\n+ Sophisticated filters\n+ Calculated columns\n+ Picklists\n+ Total row\n+ Custom row heights, fonts, and font sizes\n+ Use custom colors and emojis for each list\n+ Use a color wheel to choose any color for folders and items\n+ Make Quick Lists from copied data\n+ Import/Export via email or Dropbox\n+ Email formatted lists\n+ Automatic local and Dropbox backups\n+ Passcode lock\n+ Many sample lists\n+ Great customer support\n+ Sync with all your iOS devices\n+ Website membership available to view your lists online\n+ Many instructional videos at http://www.onlinelistmaster.com/video.aspx\n\nCustomer Service is a top priority for me. If you have any requests or issues, please email me directly at ios.info@onlinelistmaster.com. Thanks!",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2012-07-06T00:31:17Z",
  "updated": "2019-12-11T01:25:44Z",
  "releaseNotes": "+ added ability to filter on blank dates\n+ fixed bug where checked switch wasn't reflecting the checked state when editing an item",
  "version": "5.5.3",
  "price": 0,
  "developer": "List Logic Software",
  "score": 3.90909,
  "reviews": 11,
  "currentVersionScore": 3.90909,
  "currentVersionReviews": 11,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.1track.nearsight",
  "title": "AppSheet",
  "description": "With AppSheet, you can create and distribute your own custom mobile apps without writing code or hiring developers. These apps can display content, take notes, create forms, capture photos, signatures and GPS, scan bar codes, and generate workflows for a wide variety of business scenarios. You can also build web apps and chatbots.\n\nAppSheet uses data from your cloud storage -- Google Sheets, Excel on Office365, Dropbox or Box, Smartsheet, SalesForce, and a variety of databases (SQLServer, mySQL, Postgres, and DynamoDB). You can create an app in minutes and enhance it to create rich custom apps for your team, business, or enterprise. Check review sites like Capterra to learn how AppSheet’s modern technology platform outpaces older low-code solutions like PowerApps, Salesforce1, and App Maker. \n\nAppSheet is an ideal solution for many business, including those in property management, agriculture, supply chain, operations, salesforce management, education and more. Here are just a few scenarios:\n\nWORKING WITH REMOTE TEAMS\nApps built with AppSheet can help a remote team work with centralized data saved in spreadsheets (eg: in Google Drive, Box, or Droppox) or SQL databases. \n\nPROJECT MANAGEMENT\nMillions of people manage projects using Google Sheets, Excel, and Smartsheets. Project managers can build apps with AppSheet to display and share project data through a mobile device with other team members and stakeholders. Keep data centralized in a core spreadsheet and share only the parts that their audience needs to see. No more managing dozens of files that go back and forth via email!\n\nEDUCATION\nManage study plans, school rosters, grading, and group work by creating a custom app with charts, maps, text summaries and image galleries. Share the app securely with students and colleagues.\n\nCUSTOMER SUPPORT AND ENGAGEMENT:\nKeep track of your customer pipeline on a Google Sheet but get the benefits of a streamlined custom mobile app using AppSheet. You can also interact with your data in new ways like building maps from your data, calling or messaging to telephone numbers, sending emails to contacts, and building catalogs using image galleries.",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2013-11-01T00:01:33Z",
  "updated": "2020-04-04T11:11:08Z",
  "releaseNotes": "Bug fixes.",
  "version": "13.8.1",
  "price": 0,
  "developer": "Solvebot Inc.",
  "score": 4.25,
  "reviews": 12,
  "currentVersionScore": 4.25,
  "currentVersionReviews": 12,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.marinersoftware.ipadcalclite",
  "title": "Calc XLS Free Spreadsheet",
  "description": "Over a million downloads!\n\nOne of the most mature and powerful spreadsheets on the iOS platform is now available in a free version!  \n\nLike what you see but need more functionality? Upgrade via an in-app purchase and get the ability to edit imported files, transfer files using built-in web server, email files (as .pdf or .xls) and even share your data on the cloud with Dropbox! \n\nUsing Calc XLS Free, you can:  \n\n- View and edit Excel files (.xls Excel 97 and up).  \n- View pdf, rtf, rtfd, Word, Powerpoint, Keynote, Pages, Numbers.  \n- Make large multi-sheet spreadsheets with 32,000 rows x 256 columns  - Choose from more than 10 included templates for business or home.  \n- Cut copy paste data or undo and redo actions.  \n- Construct formulas using over 200 functions (see our web site for a complete function list).  \n\nBottom line, whether you are a home user, small business user, on the road or relaxing in your favorite chair, you have all the power you need, in the palm of your hand.",
  "genres": [
   "Business",
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2011-10-13T01:57:40Z",
  "updated": "2014-05-09T19:30:44Z",
  "releaseNotes": "added backup feature\nadded date format (DDMMYY)\nfixed date format bug \nupdated french language text",
  "version": "4.2",
  "price": 0,
  "developer": "Mariner Software",
  "score": 2.46153,
  "reviews": 13,
  "currentVersionScore": 2.46153,
  "currentVersionReviews": 13,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.infinitysw.powerone-ios",
  "title": "PowerOne calculator",
  "description": "Download hundreds of calculations or create your own with PowerOne® calculator.\n\n• Several-time Apple staff pick + Best of 2010\n• \"The crème de la crème of calculators\" – AppAdvice \n• \"Incredibly powerful tool for calculations of all kinds.\" – Smokin' Apps \n• \"You need this calculator. It's miles better than the competition.\" – Robert Burns \n• \"… sets the benchmark for other calculators to reach.\" – Fred Swan \n• \"Not sure how I could do my job without PowerOne.\" – Arvid Martin \n• \"A legend. The best … calculator app I have ever seen.\" – Worldwide Tech \n• \"… PowerOne shines.\" – The Mac Observer\n\n\nBENEFITS/FEATURES\n\n• Quick and accurate. Templates act similar to locked-down, mini-spreadsheets that increase accuracy and speed for repetitive calculations. Enter the data you know. PowerOne will calculate the rest.\n\n• For those one-off calculation needs, PowerOne provides a powerful standard and RPN calculator. Over a hundred functions to help with virtually anything: basic math, powers, logs, trigonometry, probability, programmer’s math, fractions, and Imperial and metric units.\n\n• Get up and running fast with hundreds of pre-created templates in PowerOne's extensive library. Covers everything: finance, conversions, real estate, business, investing, construction, engineering, health, fitness, and more.\n\n• While some calculations are common, there are millions more specific to you or your business. With PowerOne, it is easy to create powerful templates of your own using our intuitive language. You, your team, and your customers can perform their own calculations without ever having to think about the math.\n\n• Access PowerOne everywhere. Whether on the go with your iPhone or iPad or at your desk on the web, PowerOne makes sure your critical calculations are available at your fingertips, offline or on.\n\n• Keep everyone on the same page. Share your templates with your team and customers, ensuring that everyone is performing the same error-free calculations every single time.\n\n• Highly customizable. Go beyond templates with expanded calculator functions and themes! Match your mood and make it the product you want to use every day.\n\n\nCOMPANY\n\nAfter more than 20 years and 20 million software calculators distributed, Infinity Softworks has earned its reputation for high-quality apps. We'd love to hear from you. Please visit us at https://power.one, or share ideas, get help, and resolve problems by emailing us at help@power.one.\n\n\nAVAILABLE FOR FREE\n\n• Run PowerOne offline on your iPhone or iPad\n• Run PowerOne online at https://power.one\n• Full-featured standard and RPN calculator (iOS only)\n• Access to over 200 library templates\n• Sample creating your own templates\n• Share template results via email\n• Go light or dark with your choice of two themes\n• Keep your devices in sync automatically\n\n\nAVAILABLE IN PREMIUM\n\n• Over 300 library templates\n• Create your own templates without limit\n• Share templates with other Premium subscribers\n• Access any of the built-in extensions to share or save your results\n• Choose from 12 themes to customize PowerOne\n• Support independent iOS developers and your favorite calculator's development!\n\n\nSUBSCRIPTION DETAILS\n\nPowerOne is free to use with some features available via monthly or annual subscription. Payment will be charged to your iTunes account at confirmation of purchase and your subscription will automatically renew unless auto-renew is disabled at least 24 hours before the end of the current subscription period. Automatic renewals will be charged at the same price you were originally charged for the subscription. Please note that subscriptions can be managed by choosing that option via Account within PowerOne or via Account Settings on the App Store after purchase.\n\nTerms: https://power.one/terms\nPrivacy Policy: https://power.one/privacy",
  "genres": [
   "Utilities",
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2018-02-12T03:07:27Z",
  "updated": "2020-03-31T13:23:10Z",
  "releaseNotes": "Resolved bugs, especially on iOS 13. This includes search issues and misbehaving in split view on an iPad. \n\nSee anything? Please tell us. help@power.one.",
  "version": "6.2.2",
  "price": 0,
  "developer": "Infinity Softworks",
  "score": 4.86667,
  "reviews": 15,
  "currentVersionScore": 4.86667,
  "currentVersionReviews": 15,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.codulis.BloodPressure",
  "title": "Blood Pressure — BP Tracker for Hypertension Management",
  "description": "If your regular blood pressure monitor does not have any graphing capabilities, Blood Pressure app makes a perfect companion. It helps collect, track and analyze your measurements by composing them into a beautiful, color-coded chart.\n\nFeatures: \n\n• Store measurements of multiple persons\n• Add notes\n• Scroll through full history\n• Instantly see stats for inspected time range\n• Use tags (mark diet changes, exercising regimes, stress levels, used medications, etc.)\n• Filter measurements based on their tags or the time of the day at which they were taken\n• Export and email records as spreadsheet (CSV) files\n\nThere is a Lite version available if you would like to try the app before you buy it.\n\nYour feedback is very important to us. Visit Codulis.com or email your thoughts directly from inside the app. Thank You!",
  "genres": [
   "Medical",
   "Health & Fitness"
  ],
  "contentRating": "4+",
  "released": "2010-05-17T19:09:38Z",
  "updated": "2016-03-03T07:36:13Z",
  "releaseNotes": "• Slight layout adjustments and fixed shadow effects in monitor’s display",
  "version": "1.5.3",
  "price": 4.99,
  "developer": "Codulis",
  "score": 3,
  "reviews": 1,
  "currentVersionScore": 3,
  "currentVersionReviews": 1,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.gekkoglobalmarkets.ayondo-markets",
  "title": "BUX Markets",
  "description": "75.9% of retail investor accounts lose money when trading CFDs and spread bets with this provider.\n\nDescription\n\n●\tBUX markets is an intuitive CFD trading platform.\n●\tThe app allows you to trade on the go, monitor your open positions and more.\n●\tAward-winning, sophisticated technology combined with a simple interface!\n\n______________________________________________\nThe world's financial markets in your pocket\n\nNever leave your portfolio behind! With BUX markets, you can start trading CFDs/Spread Bets on stocks, indices, commodities and currencies, all from the convenience of your mobile. Centered around the TradeHub ® platform, BUX markets gives you the opportunity to trade and keep up with markets and your positions anytime, anywhere. \n\n______________________________________________\nWhat can BUX markets do for you?\n\nEXTREMELY LOW LIFECYCLE COSTS\n●\tFree automatic, guaranteed stops*\n●\tTight spreads, low funding and rollover costs\n●\tWe are completely transparent with our fees\nVARIABLE MARGIN\n●\tChoose your margin from low levels to 100% and reduce your risk\n●\tNo overnight interest charge for margin at 100%\nSECURITY MEASURES\n●\tTrade with Negative Balance Protection\n●\tNegative Balance Protection means that you cannot lose more money than you invest\n●\tSupplementary insurance covers every client up to £1,000,000** in excess of the standard FSCS cover and is free of charge\nSOPHISTICATED CHARTS & TOOLS\n●\tTrade directly from 13 different chart types\n●\tState-of-the-art indicators and charts\n●\tOne-click trading from the charts\nINTUITIVE DESIGN\n●\tSimplified design allows you to focus on your trading and tap into the markets straight away\n●\tSimple filters make searches fast, easy and accurate\nNOTIONAL VALUE TRADES\n●\tInput notional amounts for trades\n●\tTrading by value allows you to easily adjust positions according to your needs, strategy or investment goals\n●\tTrade multiple markets with ease\nReady for convenient and innovative trading? Download now.\n\n______________________________________________\nTechnical support:\n\nFor any help regarding the app or trading/investing, please visit www.buxmarkets.com\n\n-------------------------\n*Please note that free guaranteed stops do not apply to all products and are subject to trade size restrictions, which may vary for each product.\n\n**The insurance cover of up to £1,000,000 applies to only FSCS eligible claimants.\n\nCFDs and spread bets are complex instruments and come with a high risk of losing money rapidly due to leverage. 75.9% of retail investor accounts lose money when trading CFDs and spread bets with this provider. You should consider whether you understand how CFDs and spread bets work and whether you can afford to take the high risk of losing your money.\n\nBUX Financial Services Limited is a company registered in England and Wales under register number 03148972. BUX Financial Services Limited is authorised and regulated by the Financial Conduct Authority, FCA Register number 184333.\n\nThe information on this site is not directed nor is intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local laws or regulations. Such residents and countries include, but are not limited to, the United States and Belgium.",
  "genres": [
   "Finance"
  ],
  "contentRating": "17+",
  "released": "2013-03-02T04:32:33Z",
  "updated": "2020-04-07T22:42:04Z",
  "releaseNotes": "Risk Warning Changed.",
  "version": "7.3.10",
  "price": 0,
  "developer": "BUX Financial Services Limited",
  "score": 5,
  "reviews": 5,
  "currentVersionScore": 5,
  "currentVersionReviews": 5,
  "searchTerms": "spread betting"
 },
 {
  "appId": "de.sfr.ipad.calctape",
  "title": "CalcTape Paper Tape Calculator",
  "description": "Calculator thought from scratch! Calculate, comment and correct instantly.\n\nWhat happens if you combine a standard calculator App, a classic desktop calculator and a note App ?\n\nCalcTape brings you the best of these and even more.\nIt is your companion for all daily calculation needs and easily masters all scenarios you can imagine.\nCalcTape is NOT a scientific calculator, but do we need these in daily use ?\n\nEver did a long calculation with many figures and asked yourself:\n\"Did I enter the last figure correctly ?\"\n\"The result looks strange somehow !\"\nWith CalcTape you keep an overview, can check all figures and correct figures instantly inplace with\nall subsequent results being adjusted automatically ! \nMissed a figure ? No problem: Just insert it in the right place easily by entering a new line.\n\nYou can place the cursor everywhere you like in the calculation: It's like a note where\nyou can change anything you like in any place with the advantage, that changing numbers\nor operators updates your calculation immediately!\n\nCalcTape can be considered an \"Excel Lite with a calculator interface\".\n\nYou can also keep the calculation for your records (documents) and create templates: \nReplacing the figures in your template and getting the correct results is a breeze.\nCommenting figures and results gives sense to your calculations, so you can understand\nwhat you did when viewing the calculation a month later.\nCustomize CalcTape to your needs and place only those buttons on your keypad that you really\nneed everyday. Create your own functions to e.g. add a specific percent rate with a tap on\na single button.\n\nCalcTape features:\n- Save your calculations into files\n- Create own functions or text snippets to be entered when pressing a button (long press a button to enter the Button screen)\n- Create own keypad layouts (change assignment of all buttons except numbers and backspace / change button sizes)\n- Select between different keypad layouts (the \"function keypad\" contains no numbers and is nearly completely customizable)\n   to get more buttons or other functions, 2 keypads are directly accessible in the main screen\n- Share your calculations using standard iOS sharing capabilities, e.g. email\n- Sync your calculations with iPhone, iPad, Mac and PC using iCloud Drive.\n- Calculate TAX, VAT and other percent values easily\n- Use CalcTape for budget, accounting and expense tracking in the office and at home, everyday.\n\nCalcTape, more than a calculator.\n\n\nFAQ:\n- Start a new calculation on the same sheet by simply tapping the \"=\" key twice.\n- Do a long tap on a button to assign another existing function or to create a user function for it.\n- If you accidentally hit \"AC\" you can use \"Undo\" to get your calculation back.",
  "genres": [
   "Finance",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2012-05-16T22:33:04Z",
  "updated": "2019-12-02T16:55:19Z",
  "releaseNotes": "fixes an iOS13 related issue which prevented customization of Buttons",
  "version": "6.0.4",
  "price": 2.99,
  "developer": "schoettler Software GmbH",
  "score": 4.59999,
  "reviews": 5,
  "currentVersionScore": 4.59999,
  "currentVersionReviews": 5,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.neupen.neuCalc",
  "title": "neu.Calc",
  "description": "neu.Calc is an innovative financial/scientific calculator, which makes complex calculations much easier than traditional calculators or spreadsheet applications.\n\nAlso includes unit conversion and a programmer's calculator.\n\n◆ List - a series of numbers\n\nOne of the unique features of neu.Calc is the ability to deal with a series of numbers (list) directly.\n\nIf you want to calculate the average of a series of numbers, simply input the numbers a list, then tap the \"avg\" button.\n\n    (45, 55, 58, 62, 72, 80, 100) avg = 67.43\n\nIf you want to calculate the internal rate of return for a series of cash flows, input those numbers and tap the \"IRR\" button.\n\n    (-1000, 300, 300, 300, 300) IRR = 0.0771\n\n◆ Label and references\n\nEach time the \"=\" button is used, neu.Calc creates a formula. Each formula is automatically labeled (M1, M2, M3, ..., ) and can be referenced by other formulas. To reference an existing formula, tap on it in the sheet. Labels can be changed by tapping on the label to the left of the formula, when the formula is being entered or edited.\n\nM1: 45, 55, 58, 62, 72, 80, 100 = 45, 55, 58, 62, 72, 80, 100\nM2: M1 avg = 67.43\nM3: M1 sum = 472.00\nM4: M1 stdev = 16.97\nM5: 60, 52, 50, 70, 100, 74, 95 = 60, 52, 50, 70, 100, 74, 95\nM6: M1 correl M5 = 0.75\n\nHere is another example.\n\nM1: -1000 = -1000\nM2: 300 = 300\nM3: M1, M2 rep 4 = -1000, 300, 300, 300, 300\nM4: 6 % = 0.06\nM5: M3 NPV M4 = 39.53\n\n◆ Solver\n\nSolver is a powerful tool to solve linear equations. In order to solve an equation, you need to first create a formula for an unknown value with an estimate, and create a formula (or formulas) that represents the equation.\n\nHere is a simple example to solve the equation \"x * 2.5 = 100\", where the estimate is 10.\n\nM1: 10 = 10.00\nM2: M1 * 2.5 - 100 = -75.00\n\nIn order to get the appropriate value for M1 (x in the original equation) that makes the result of M2 zero, tap the \"Edit\" button of M1, then the \"Solve\" button of M2. You'll get the following result.\n\nM1: 40.00 = 40.00\nM2: M1 * 2.5 - 100 = 0.00\n\nTo demonstrate a more complex case, take a look at the NPV example again.\n\nM1: -1000 = -1000\nM2: 300 = 300\nM3: M1, M2 rep 4 = -1000, 300, 300, 300, 300\nM4: 6 % = 0.06\nM5: M3 NPV M4 = 39.53\n\nIf you want to know the minimum yearly income to justify this investment, tap the \"edit\" button of M2, and tap the \"solve\" button of M5. You'll get this.\n\nM1: -1000 = -1000\nM2: 288.59 = 288.59\nM3: M1, M2 rep 4 = -1000, 288.59, 288.59, 288.59, 288.59\nM4: 6 % = 0.06\nM5: M3 NPV M4 = 0.00",
  "genres": [
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2011-09-01T00:17:05Z",
  "updated": "2017-08-10T18:49:21Z",
  "releaseNotes": "Fixed crash in settings.",
  "version": "1.5",
  "price": 0,
  "developer": "neu.Pen LLC",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.dappological.VAT-Making-Tax-Digital-for-iOS",
  "title": "VAT Making Tax Digital",
  "description": "Do you currently submit your VAT returns online? This is no longer allowed with Making Tax Digital.\n\nIf you keep your tax records in a spreadsheet or application that doesn't support the new VAT Making Tax Digital submission rules, or maybe have multiple records and compile them together to calculate your VAT submissions, then this app is your answer to the HMRC rule change.\n\nThis app will import your VAT data from any Excel spreadsheet or a CSV text file, and let you submit your VAT return directly to HMRC with ease and with full compliancy with the new MTD rules.\n\n● Suitable for Individuals/Organisations and Agents\n● Submit VAT returns to HMRC\n● View filed VAT returns\n● Print VAT returns\n● Save VAT returns as PDF\n● Receive notifications when your VAT return period ends and your returns are due\n\nThis app works entirely on your iOS device and unlike other solutions it does not require you to send your tax/accountancy figures to a third party server to be processed. This app will not alter your spreadsheet data and doesn't store any of your figures, allowing you to keep your data completely private and just between you and HMRC.\n\nSubscription Details:\n- You may use the app free of charge to login to your HMRC MTD account and view your VAT MTD periods. In order to submit an MTD VAT return, you must purchase a subscription for either an Individual/Organisation or an Agent.\n- Subscriptions are available in 1 Month, 3 Month or Yearly durations.\n- At confirmation of purchase, or following the completion of a free-trial period, payment will be charged to your iTunes account.\n- Your subscription will automatically renew unless auto-renew is turned off at least 24-hours before the end of the current subscription period.\n- Your account will be charged for renewal within 24-hours prior to the end of the current subscription period. Automatic renewals will cost the same price you were originally charged for the subscription.\n- You can manage your subscriptions and turn off auto-renewal by going to your Account Settings on the App Store after purchase.\n- Any unused portion of a free trial period, if offered, will be forfeited when you purchase a subscription.\n- Read our terms of service and privacy policy for more information.\nTerms of Use: https://vatmtd.com/terms.html\nPrivacy Policy: https://vatmtd.com/privacy.html",
  "genres": [
   "Business"
  ],
  "contentRating": "4+",
  "released": "2019-04-27T04:54:19Z",
  "updated": "2020-01-10T21:48:41Z",
  "releaseNotes": "Fixed the date display of obligations that ended 31st Dec 2019",
  "version": "1.0.17",
  "price": 0,
  "developer": "Dappological Ltd.",
  "score": 4.30435,
  "reviews": 23,
  "currentVersionScore": 4.30435,
  "currentVersionReviews": 23,
  "searchTerms": "spread betting"
 },
 {
  "appId": "4AM6M28H79.com.berrywing.scantospreadsheet",
  "title": "Scan to Spreadsheet",
  "description": "Spreadsheet barcode scanning.\n\n1. Scan. \n2. Email. \n3. Inventory, Attendance, or any Spreadsheet Done! \n\nCreate spreadsheets using the barcode scanner in your iPhone. Use this for inventory, cycle count, marketing event scanning, attendance, or other times where scanning to make a list is needed. \n\nA great option for bring your own device (BYOD) barcode scanning and/or inventory. \n\nEmail CSV or MS Excel XML formats from your phone, iPad, or iPod. \n\nShare to Google Drive and open with Google Sheets\n\nUse templates to customize column names for each spreadsheet column.\n\nRecords GPS coordinates of each scan.\n\nSeparates the barcode into different columns using the Parse / Delimiter feature. For example, create a barcode with information separated by a comma. When scanned, the information will go do different columns; like First Name, Last Name and Email.\n\nThe date and time is recorded for each scan. \n\nUse our new validation feature to catch duplicate scan, limit scans to only values in a lookup table, or fill the spreadsheet with information from the lookup table when a matching scan is found.\n\nBarcode symbology supported; \n- QR Code \n\n- Data Matrix \n\n- EAN / UPC \n\n\n- PDF417 (drivers license)\n\n- Code 3 of 9 \n(*10 to 15 characters max) \n\n- Code 128 \n(*20 characters max) \n\nFrom our users;\nI use the app for logging runner's times in long distance running. I record a start row, then scan each runner in when they cross the finish line and I have an instant time tally sheet.\n\nWe use Scan to Spreadsheet to log when students turn in homework assignments. Now we can quickly see who has not turned in and head off any problems that could affect their grades.\n\nOur asset inventory is so easy now that we use Scan to Spreadsheet. Great Job!!!",
  "genres": [
   "Business",
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2011-11-11T03:51:23Z",
  "updated": "2020-01-03T19:33:03Z",
  "releaseNotes": "Minor updates\nDark mode support",
  "version": "6.0.9",
  "price": 0,
  "developer": "Berry Wing LLC",
  "score": 3.66667,
  "reviews": 3,
  "currentVersionScore": 3.66667,
  "currentVersionReviews": 3,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.picsel.smartoffice2gd",
  "title": "SmartOffice for BlackBerry",
  "description": "IMPORTANT: This application is designed for use by organizations that utilize a BlackBerry Dynamics secure platform. If you are an individual consumer or a company which does not utilize BlackBerry Dynamics, please download the SmartOffice app instead.\n\nSmartOffice for BlackBerry is a full-featured document management/editing suite that enables and empowers productivity among your mobile workforce.\n\nWe offer the truest, most accurate representation of Microsoft Office documents available on a mobile app. Our small file size and screen display that adapts to fit your mobile device make SmartOffice for BlackBerry the perfect match for today’s on-the-go world.\n\nCOMMON FEATURES ACROSS ALL FORMATS\n• View, edit, create, share, save MS Office documents swiftly and securely\n• Editing: copy, cut, paste, undo and redo\n• Character formatting: bold, italics, underline; font style, size, color & highlight\n• Documents may be saved in the original file format or converted to PDFs\n• Supports multi-touch gestures\n• All file formats include templates to aid new document creation\n• Password protection: open, edit and save password-protected Office files; open and view PDF files\n• Secured by BlackBerry Dynamics, your content is never exposed to vulnerable files or applications\n• Security policies to control printing, emailing, and the clipboard\n\nDOCUMENTS\n• Paragraph formatting: indent, align, bullets, numbering\n• Track Changes: add & view comments, view change summaries, accept/reject changes, highlighted changes\n• Insert images, shapes, and graphics\n• Support for tables, shapes, charts (display)\n• Reflow mode for easier viewing on small devices\n\nSLIDESHOWS\n• Comprehensive text, paragraph, content formatting\n• Shapes, images, textbox editing\n• Insert images, shapes, and graphics\n• Slide management and reordering\n• Slide transition support\n• Slideshow: present directly from a mobile device or through a projector\n\nSPREADSHEETS\n• Cell formatting options: cell size and alignments, cell/column/row inserts and removal\n• Multiple cell types: numeric, date, time, currency, fraction, percentage, scientific & more\n• Multiple worksheet support; add/delete sheets \n• Chart display and a wide range of formulas\n\nPDF, IMAGE FILES & PRINTING\n• Supports PDF AcroForms - fill, view, save and share form content\n• View, annotate, highlight and share PDF documents\n• Convert, export, save Office documents to PDF format\n• Wireless printing supports thousands of printers\n• BlackBerry Dynamics secure printing via Dynamics print services including Breezy and PrinterOn\n\nFILE FORMATS\n• Microsoft Office: Word, PowerPoint and Excel 97, 2000, XP, 2003, 2007, 2010, 2013, 2016 – doc, docx, xls, xlsx, ppt, pptx\n• PDF Viewer, PDF Reader, Save as PDF\n• JPEG, PNG, GIF, TIFF, BMP images (view); HWP (view)\n• Vector WMF and EMF diagrams (view)\n\nLANGUAGES – over 35 supported\nLocalized for Chinese (Simplified), Chinese (Traditional), English, Japanese, French, German, Italian, Korean, Polish, Portuguese (Portugal), Portuguese (Brazil), Russian, Spanish (Spain), Spanish (Mexico), Hebrew, Dutch, Turkish\nView documents in the following languages: Arabic, Azerbaijani, Chinese (Simplified), Chinese (Traditional), Czech, Danish, Dutch, English, Faroese, Finnish, Greek, Hebrew, Hungarian, Italian, Japanese, Korean, Kurdish, Latvian, Lithuanian, Maltese, Norwegian, Polish, Portuguese (Portugal), Portuguese (Brazil), Russian, Scots Gaelic, Slovak, Slovenian, Spanish (Spain), Spanish (Mexico), Swedish, Turkish, Vietnamese, Yiddish\n------------------------------------------------------------\n\nBy downloading you agree to Terms of Use at https://artifex.com/smartoffice-eula/",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2012-09-25T18:33:16Z",
  "updated": "2019-09-23T11:50:06Z",
  "releaseNotes": "This release includes an update of the BlackBerry Dynamics SDK to support iOS13, along with a number of improvements including:\n - Fix: PDF TOC may be cropped in landscape mode on iPhone\n - Make 'enter' key advance to next cell when editing Excel files\n - Fix a crash when using the password entry dialog in Office encrypted docs when DLP is enforced",
  "version": "3.5.4",
  "price": 0,
  "developer": "Artifex",
  "score": 2.5,
  "reviews": 2,
  "currentVersionScore": 2.5,
  "currentVersionReviews": 2,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.popcalc",
  "title": "PopCalc Free Calculator",
  "description": "Simple spreadsheet. Powerful multitouch calculator. \nFast. Easy. Simple. \nYou'll never be able to use a dumb calculator anymore !! \n\nQuick access to stored numbers: A simple touch on any number on the sheet will add it at the cursor location. \nLarge screen: PopCalc uses the top part of the screen to display the lines of current and previous calculations. You can scroll through them by simply sliding your finger across the screen \nReal-time memory function: All numbers entered or calculated are instantly stored \nReal-time computation: The result is calculated instantly as you input your calculation whenever possible \nInstinctive to use: Enter your calculations as you would normally write them \nEdit your calculations: All lines of calculation can be modified or deleted at will \nCalc sheets : Manage and store all you calculations and numbers in calc sheets \n\n2 keyboards: Standard and Scientific \nShare your calculations: Send your calculations by e-mail or by instant messaging \nSmart brackets: PopCalc understands whether to open or close the brackets \nSmart percentages: To add 10% to a number, simply enter +10% after the number \nComments : add comment to any calculation",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2012-10-23T19:24:29Z",
  "updated": "2014-07-15T17:47:27Z",
  "releaseNotes": "Minor bug fix",
  "version": "2.7.6",
  "price": 0,
  "developer": "Carrel",
  "score": 1,
  "reviews": 1,
  "currentVersionScore": 1,
  "currentVersionReviews": 1,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.appsonthemove.gofigure",
  "title": "Go Calc",
  "description": "EMPOWER YOUR BUSINESS - Throw away your old calculators. Transform everyday calculations. Create calculators for your business right on your iPhone or iPad.\n\nCreate your own calculator apps right on your iPhone or iPad. In minutes your business specific calculations become a breeze. Create a calculator for each type of problem you need to solve using formula similar to those found in spreadsheets.\n\nGo Calc has been helping businesses like yours get the right answers since 2008:\n\n\"It turned into a mission-critical app when I created a set of formulas for all my estimating and billing.\"\n\"I own a Retail store and have to work out margins every day.\"\n\"I use this app nearly every day for scuba gas blending. It saves a huge amount of time.\"\n\"I have several elaborate pricing formulas that I use at work. ... I can quickly adjust two simple numbers, my price and my markup ... and give me a suggested price.\"\n\"I created several functions that make it easier to interpret logistic regression results, and it works like a charm!\"\n\"I work in the Road Construction industry and have not found anything close to this app.\"\n\"This app has made my job so much easier and almost fun.\"\n\nExamples of calculators you could create:\n\n * Quickly work out potential profit when negotiating with a customer\n * Estimate costs using a set of business specific variables\n * Determine how much of a consumable you need\n\nGo Calc allows you to quickly create new calculations by setting up variables and formulas on your iPhone or iPad.\n\nCreating a new calculator is easy:\n\n 1. Tap to add a new calculator\n 2. Give it a name\n 3. Add some variables (the inputs to the calculations)\n 4. Create one or more formulas to get your results\n 5. Go Calc!\n\nEach calculator you create can be reused again and again. Calculators can be easily found by filing them into categories.\n\nFormulas in Go Calc share much with the formulas you write in your favorite spreadsheet. Over 50 functions can be used including IF, MAX, SIN, LOG, IPMT, RANDBETWEEN.\n\nImport and export your calculations. Backup all your calculations easily and without the need to install any software on your PC or Mac. Create calculators and then share them with other Go Calc users in your business.",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2019-02-08T08:00:00Z",
  "updated": "2019-11-11T11:57:06Z",
  "releaseNotes": "Fix for calculation results not always updating on iPad.",
  "version": "4.0.2",
  "price": 9.99,
  "developer": "Apps On The Move Limited",
  "score": 4.5,
  "reviews": 2,
  "currentVersionScore": 4.5,
  "currentVersionReviews": 2,
  "searchTerms": "spread betting"
 },
 {
  "appId": "dynamiqdata.s2s",
  "title": "Scan To Google Sheets",
  "description": "How does it work?\n\nFirstly, create a publicly editable Google Sheet spreadsheet.\nCopy the URL for that spreadsheet into the settings page in the app. \nYou’re ready to start scanning!\n\nGet started today and save valuable money by turning your phone into a mobile inventory scanner or track attendance in meetings or classes. \n\nWorks for a large amount of QR codes and two-dimensional barcodes.\n\n--------------------\nSee https://scantosheets.firebaseapp.com/terms.html for our terms of use.",
  "genres": [
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2019-02-10T07:57:33Z",
  "updated": "2019-11-08T00:56:39Z",
  "releaseNotes": "- scans deletable (until sent)\n- removed apostrophe before quantity",
  "version": "1.3.9",
  "price": 0,
  "developer": "Felix Huneburg",
  "score": 5,
  "reviews": 7,
  "currentVersionScore": 5,
  "currentVersionReviews": 7,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.marinersoftware.ipadcalc",
  "title": "Calc XLS Spreadsheet",
  "description": "Over a million and a half downloads!\n\nBuilt from the ground up, Calc XLS gives you the power to create captivating and compelling spreadsheets on your devices, all with streamlined simplicity. You can even share your data on the cloud with Dropbox. Functions galore! Math, Engineer, Finance, Trig, Stat, Lookup, Logic, Date, Text, and Info functions, just to name a few! Calc XLS has more than 200 (see our web site for a complete list of functions). In addition to all of Calc XLS’ functions, we’ve provided templates so that you can run your household as well as most any business. Use the Home Inventory template to catalog your household items. Create a time sheet and have a portable record of your work. Manage schedules using the Class Schedule template, even track gas mileage using the Gas Mileage Calculator template. There's something for everyone.  \n\nNeed access to Microsoft® Excel files? Calc XLS has more functions than any other iPhone or iPad spreadsheet in the world which means greater compatibility with Microsoft Excel spreadsheets. View and edit Excel files on the go, or even view Word, Powerpoint, PDF's, Numbers, and Keynote files. Email the file, transfer files via WiFi or USB to and from your computer, or use Dropbox. What could be easier?  \n\nBottom line, whether you are a home user, small business user, on the road or relaxing in your favorite chair, you have all the power you need, in the palm of your hand.",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2010-04-01T20:42:21Z",
  "updated": "2016-12-09T02:54:51Z",
  "releaseNotes": "Fixed an error that would cause a crash when entering data with large worksheets.\nFixed an error with several functions that caused memory errors.\nFixed an error with functions with no parameters that failed.\nGeneral improvement in efficiency of 64 bit calculation code. Various bug fixes.",
  "version": "4.3.1",
  "price": 2.99,
  "developer": "Mariner Software",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.no8ody.BusinessTemplates",
  "title": "Business Templates for Pages",
  "description": "105 BUSINESS-ORIENTED TEMPLATES\nBusiness Templates (for Pages, Keynote & Numbers) is a valuable add-on for Apple's Pages, Keynote and Numbers apps. It provides 100 professional business-oriented templates, in a coherent design.\n\n63 TEMPLATES FOR PAGES\n- Address Label\n- Annual Report\n- Application for Employment\n- Articles of Incorporation\n- Bill of Sale\n- Blank Page (US Legal)\n- Board Meeting Agenda\n- Board Meeting Minutes\n- Brochure\n- 3x Business Cards\n- Business Hours\n- Business Plan\n- Case Study\n- Cash Advance Request Form\n- Client Information Form\n- Clothing Tag\n- Consignment Agreement\n- Consulting Contract\n- Contractor Proposal Bid Form\n- Coupons\n- Cover Letter\n- Creative Brief\n- Customer Satisfaction Survey\n- Emergency Contact List\n- Employment Contract\n- Envelope\n- Fax Cover Sheet\n- Flyer\n- Freelance Contract\n- Graph Paper\n- Indemnity Agreement\n- Index Cards\n- Installation of Goods Contract\n- Job Description\n- Joint Venture Agreement\n- Letter\n- Loan Agreement\n- Loyalty Card\n- Meeting Agenda\n- Meeting Minutes\n- Menu\n- Name Tags\n- Newsletter\n- Non Disclosure Agreement\n- Non-Compete Agreement\n- Offer of Employment\n- Operating Agreement for LLC\n- Partnership Agreement\n- Power of Attorney\n- Project Proposal\n- Promissory Note\n- Quitclaim Deed\n- Receipt\n- Reference Letter\n- Residential Lease\n- Resume\n- Ruled Paper\n- S.M.A.R.T. Goals Worksheet\n- Simple Contract\n- To Do List\n- Will\n\n41 TEMPLATES FOR NUMBERS\n- Accounts Receivable/Payable\n- Balance Sheet\n- Break-Even Analysis\n- Calendar-Monthly\n- Calendar-Yearly\n- Cash Flows\n- Cost Benefit Analysis\n- Customer List\n- Depreciation Calculator\n- Employee Performance Review\n- Employee Warning Notice\n- Income Statement\n- Inventory List\n- Invoice\n- Job Estimate\n- Loan Amortization\n- Loan Comparison\n- Mileage Log\n- Mortgage Calculator\n- Net Worth\n- Order Form\n- Packing Slip\n- Pay Stub\n- Payroll\n- Price Quote\n- Product Price List\n- Profit and Loss\n- Project Cost\n- Project Proposal\n- Project Timeline\n- Purchase Order\n- Registration Form\n- Return on Investment\n- Tax Checklist\n- Taxable Income\n- Time Cards\n- Travel Expense Report\n- Travel Itinerary\n- Vehicle Inspection Report\n- Vehicle Maintenance Log\n- Weekly Schedule\n\n1 TEMPLATE FOR KEYNOTE\n- Pitch Deck Presentation\n\nDIFFERENT PAPER SIZES \nAll Pages and Numbers templates are available in US Letter and A4, except the envelope (6 common envelope sizes). The Keynote template is available in Standard and Wide format.\n\nEASILY CUSTOMIZABLE \nOnce opened in Pages, Keynote or Numbers you can apply your own content, colors, fonts, pictures, etc. \n\nREQUEST TEMPLATES \nLet us know what templates you would like to see in the next update. \n\nUNIVERSAL APP \nThis app works on iPad, iPhone and iPod touch. Therefore, do not forget to download this app onto your other devices - for free! - provided you purchased the app once. \n\nIMPORTANT: PAGES, KEYNOTE & NUMBERS REQUIRED!\nWe recommend having Pages (Apple’s word processor), Keynote (Apple’s presentation app) and Numbers (Apple’s spreadsheet app) installed on your device. For example, the resume requires Pages, while the invoice required Numbers. You can download Pages, Keynote and Numbers from the App Store.\n\nDISCLAIMER\nPrior to using these forms, please consult with an attorney or other expert knowledgeable in the laws of the applicable jurisdiction and the specific intended use of those forms. All forms available are general in nature; are not based on the laws of any specific state or other jurisdiction but rather general principles of law and should only be used after first consulting with an attorney or other expert knowledgeable in the laws of the applicable jurisdiction and the specific intended use of those forms.",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2013-11-02T06:23:59Z",
  "updated": "2019-06-09T14:48:13Z",
  "releaseNotes": "5 NEW TEMPLATES\nBoard Meeting Agenda, Board Meeting Minutes, Emergency Contact List, Product Price List and S.M.A.R.T. Goals Worksheet.\n\nNEW APP\nAddress Labels by Nobody: Print address labels with ease.\n\nThank you for all your feedback and requests. We love improving this app and hope you enjoy using it!",
  "version": "3.2.0",
  "price": 4.99,
  "developer": "Nobody LLC",
  "score": 4.11765,
  "reviews": 17,
  "currentVersionScore": 4.11765,
  "currentVersionReviews": 17,
  "searchTerms": "spread betting"
 },
 {
  "appId": "kr.co.infraware.poe1.gd",
  "title": "POLARIS Office for BlackBerry",
  "description": "IMPORTANT: POLARS Office for BlackBerry is an enterprise application and not meant for consumer use.  This application requires that BlackBerry Dynamics servers are setup in your Company’s IT organization. INFRAWARE does not provide access key for consumer users.\n\n■ About POLARIS Office for BlackBerry!\nPOLARIS Office for BlackBerry is a Mobile Office application that allows BlackBerry Dynamics users to view/edit Microsoft Office (Word, Excel and PowerPoint) documents on Smartphone and Tablet. Users can view/edit text files and view .pdf and .hwp files as well. POLARIS Office’s excellent rendering quality shows all the texts, charts, pictures and etc. of the documents made with Microsoft Office on a PC as the original itself without any losses. And POLARIS Office for BlackBerry provides powerful editing features and an intuitive interface that allows you to edit document easily. Now, you can safely and conveniently view/edit important documents on your Mobile devices.\n\n■ Key Features of POLARIS Office for BlackBerry\nView and edit Microsoft Office documents / View .pdf and .hwp files / Support Quick Scroll / Support around 80 types of Smart Arts & 18 types 2D, 3D charts / Provide more than 300 editing features / Useful & various templates for new creation / Slideshow mode / Page transition effects for slide shows / Pointer and drawing for slideshows\n\n■ Advantages of POLARIS Office for BlackBerry\nView and edit various document types / Excellent compatibility with Microsoft Office documents / Fast document loading speed / Fabulous Presentation at anytime and anyplace / Powerful security with BlackBerry Dynamics\n\n■ Supported Formats\nEdit (doc/docx, xls/xlsx, ppt/pptx, txt) / View (pdf, hwp)\n\n■ Customer support \nE-mail : ent1_support@infraware.co.kr",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2013-12-07T04:54:13Z",
  "updated": "2019-09-20T01:11:05Z",
  "releaseNotes": "Applied latest dynamics SDK(v6.1.0.170)\nMinor bug fix",
  "version": "3.1.8",
  "price": 0,
  "developer": "Infraware Co.,Ltd",
  "score": 2,
  "reviews": 4,
  "currentVersionScore": 2,
  "currentVersionReviews": 4,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.pdffiller.alto.PDFtoExcel",
  "title": "PDF to Excel Converter (XLSX)",
  "description": "◇ Absolutely free of charge;\n◇ No Ads;\n◇ File limit of 150 pages;\n◇ File limit of 25 MB;\n◇ Doesn’t support password files;\n◇ Convert PDF to XLSX files;\n◇ Doesn’t recognize scanned files/without OCR.\n\nThis state-of-the-art program was designed with the following goal in mind: To dramatically accelerate the document conversion process and save even more time for every one of our users. You no longer need to look for special software for editing spreadsheets in PDF format. Now you can simply transform your PDF to Excel in just a few minutes.\n\nEverybody knows that .xlsx format is great for editing large amounts of numeric data, adding information and making calculations. However, this can be very difficult, if not near impossible to do in PDF format.\n\nOur solution doesn’t require any payments registration or complex authorization. With AltoPDFtoExcel, you’ll experience the joy of being able to convert PDF files to Excel spreadsheets in just a few simple clicks.\n\nThese key app features were designed to help you achieve the best conversion results:\n\n1. You can export any Portable Document Format file to an Excel spreadsheet in seconds;\n2. The application is equipped with a high standard of safe data transmission;\n3. Every user can make an unlimited number of conversions free of charge;\n4. You can select particular pages from the whole document to convert them;\n5. Our solution has an intuitive and user-friendly interface, that’s easy to understand and work with;\n6. Once these features are used together, you get a high quality .xlsx document.\n\nTo make your experience with our solution as simple and stress-free as possible, use the step-by-step instructions given below:\n\n1. Start by uploading a PDF document from the internal storage of your iPhone or iPad. Also, you can add files from cloud storage (Google Drive, Dropbox, iCloud, etc.);\n2. Next, you need to choose one or more pages that you want to convert into a spreadsheet format and click on the ‘Convert Now!’ button;\n3. The conversion takes less than half a minute - and your file will then be available for further downloading and processing;\n4. It’s also possible to download the final Excel spreadsheet to your device or share it with other users by email;\n5. The final file can be easily edited with the latest MS Excel updates;\n6. To start over again, you should upload your new spreadsheet first. Then, just upload another document and repeat the process.",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2019-04-12T09:57:19Z",
  "updated": "2020-04-23T09:01:11Z",
  "releaseNotes": "- We are always working on performance and stability improvements. This release allows you to use the app faster and more smoothly",
  "version": "1.3.1",
  "price": 0,
  "developer": "airSlate, Inc.",
  "score": 4.85714,
  "reviews": 14,
  "currentVersionScore": 4.85714,
  "currentVersionReviews": 14,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.zoho.zdocs",
  "title": "Zoho Docs",
  "description": "Zoho Docs - Create and Manage All Your Documents Online\n\nZoho Docs is an online document management application for individuals and businesses. The mobile App lets you do the following:​\n\n​- Add files into Zoho Docs from other storage sources\n- Create and edit documents\n- Deliver amazing presentations right from your device\n- Copy, move, and tag files on the go\n- Share your files and folders with colleagues. Set permission to view, comment or edit\n- Always find the right file using the powerful content search\n- Store files offline",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2010-08-27T02:52:21Z",
  "updated": "2020-02-13T10:32:30Z",
  "releaseNotes": "Bug fixes and Performance enhancements.",
  "version": "6.5",
  "price": 0,
  "developer": "Zoho Corporation",
  "score": 2.57143,
  "reviews": 7,
  "currentVersionScore": 2.57143,
  "currentVersionReviews": 7,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.lightroom.godocspro",
  "title": "GoDocs for Google Drive & Google Docs",
  "description": "The Ultimate Solution for Google Drive and Google Docs\n\n\n--Featured by Apple in \"iPhone: Apps For Business\"\n\n--Featured by Apple in \"iPad: Apps For Business\"\n\n--Featured by Apple in \"@Work: Apps For Business\"\n\n--Featured by Apple in \"@Work: Apps For Collaboration\"\n\n--Featured by Apple in \"Apps For Teachers\"\n\n\n\nSee what reviewers say about GoDocs: \n\n\"Fascinating.\"  \n-- Richard Quest, Quest Means Business, CNN \n\n\"For all the guys who are using google docs every day.\nAll guys who are using google docs every day - this is your must have app! GoDocs will make your work with documents much more beauty and fast.\"\n-- Vollliesad \n\n\"Feathered.\nUse this app for both devices and I love it! It's one of my top favorites because with it I'm working with all my documents: I view all my spreadsheets, documents, PDFs images, video and audio files.  All these files are stored on my devise so I can use it mush faster! My conclusion - useful and extremely amazing app for everyone.\" \n-- Rettozik \n\n\"Best universal app.  \nIt's a best app that is woking for iphone and ipad. Nice UI and useful viewers\" \n-- degit \n\n\n• View Documents\nWith most common document formats support you can read and view all your documents on-the-go, with the ease and speed of iPhone or iPad.\n\n• Download for Offline\nDownload any document and you will be able to read it without any Wi-Fi or Internet connection.\n\n• Edit Documents Online\nFull support of Google Docs document editing lets you edit your documents whenever you are, just with few taps.\n\n• Share Documents\nShare your monthly balance with your boss or pdf page with designer. Just add them to your share list.\n\n• Professional PDF Viewer\nGoDocs has an enterprise standard PDF Viewer built-in. PDF files, even large, load amazingly fast. You are also able to open pdf links, go to specific page and even read in two dimensions.\n\n• Search for documents\nLost documents found easy with name search - the ability to search for any document and find them fast.\n\n• Search Document Contents\nWith document contents search there is no more hassle in finding that specific paragraph, you were looking for.\n\n• Create new documents and folders\nGoDocs allows you to create new documents, spreadsheets and folders from within the application.\n\n• Organize documents in collections\nWith GoDocs, you can make a convenient structure for your documents, moving files into folders.\n\n• Push Notifications\nWith our Push Notifications service you will receive push notification when a new document has been shared with you or when a shared document has been changed by someone else.\n\n• Manage and view revisions\nViewing separate revisions, ability to open them in other applications, send revisions by email or print specific revision.\n\n• Multiple accounts\nDo you need to use 2 or 3 or may be 5 google accounts? It's so easy - just add them.\n\n• Google Drive™ Support\nGoDocs is the first application on the App Store, that fully supports Google Drive™.",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2010-01-12T08:00:00Z",
  "updated": "2014-05-02T18:36:57Z",
  "releaseNotes": "This version contains stability improvements and bug fixes.\n\nWhat's new in GoDocs 5.1\n- Collection Layout for Documents \n- Long-tap to See Nested Folders \n- Background App Refresh \n- Full 64-bit compatibility",
  "version": "5.1.1",
  "price": 4.99,
  "developer": "lightroomapps OU",
  "score": 2.33333,
  "reviews": 3,
  "currentVersionScore": 2.33333,
  "currentVersionReviews": 3,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.citrix.office2forcitrix.ios",
  "title": "QuickEdit for XenMobile",
  "description": "This app is a component of Citrix Endpoint Management and the Secure app family.  A Citrix Endpoint Management license is necessary for full access to the apps function and features.  \n\nThe easy and flexible Microsoft editor that creates, views, and edits all of your Microsoft Office and PDF files worry and cost free.  \n\nPopular features of customers like you:\n• Automatically saves edits in all Microsoft Office document types, including PDF and TXT\n• Access files anywhere with cloud storage support for Citrix Files, Google and more\n• Wirelessly print documents and pictures from your mobile device\n• Email files as an attachment or send files up to 10GB using a Citrix Files cloud storage link\n• Password protect files\n• Display PowerPoint presentations, Excel spreadsheets and Word documents wirelessly to any monitor\n\nFrom PowerPoint presentations for the boss to stock calculations in spreadsheets to typing tomorrow's grocery list in a Word document, Citrix QuickEdit does it all and is perfect for any user.\n\nCitrix QuickEdit offers the most powerful means for collaboration when editing Microsoft Office files on your iPhone or iPad.  View, edit and track changes then edit Microsoft Word, Excel and PowerPoint files and then share them over Citrix Files!  \n\nThe unique combination of powerful editing, collaboration and cloud storage frees QuickEdit's users to  work remotely with confidence.  Whether your files are saved on your mobile device or in a cloud-storage service (such as Citrix Files), they are always quickly available.  \n\n\n\nQuickly build and edit full scale Microsoft Word documents\n\n• Copy and paste text and images from other apps\n• Easily search for text within documents\n• Collaborate with others by tracking changes\n• Print wirelessly to a network printer\n• Spell check, auto-correction and auto-completion\n• Advanced features such as footnotes, endnotes and comments\n• Word formatting including alignment, line spacing, margins, indenting, bullets and numbering\n• Supports section breaks, page breaks and column breaks",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2016-11-07T15:36:43Z",
  "updated": "2020-04-29T10:04:52Z",
  "releaseNotes": "Bug Fixes and Quality Improvements",
  "version": "20.4.5",
  "price": 0,
  "developer": "Citrix Systems, Inc.",
  "score": 1.44444,
  "reviews": 9,
  "currentVersionScore": 1.44444,
  "currentVersionReviews": 9,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.cynapse.numerics.ios",
  "title": "Numerics",
  "description": "Track & unify all your important metrics into personalized, live dashboards with Numerics.\n\nEASY\nGet started by adding a KPI widget to your dashboard in 3 easy steps:\n1. Choose a pre-defined KPI template from a system that you use\n2. Connect your account\n3. Configure data options if any, tap 'Save'\nYou have your first widget on your dashboard! Repeat to add as many widgets in as many dashboards you need.*\n\nLIVE\n- Automatic updates keep your numbers live and always fresh while intelligently throttling queries to stay within API usage limits\n- Double tap any widget to force an update immediately\n\nVISUAL\n- Not just numbers:\n - Pie charts\n - Gauges\n - Timers\n - Line graphs\n - Funnel lists\n - Month density graphs\n - Day density graphs\n - Text labels\n - Number tallies with change indicators\n- Multiple dashboards for multiple perspectives*\n- Drag and drop to re-arrange widgets & dashboards\n- Background colors to highlight select KPIs\n- Image widgets to add a dash of your branding\n\nWELL CONNECTED\n- 50+ cloud service integrations\n- 1000s of pre-defined KPI templates for business, productivity & analytics software\n- Free form data: Create dashboard widgets out of any spreadsheet or CSV\n- Big Data: Analyze your custom big data models via Google Big Query or Salesforce OQL\n- Middle-ware: Bring in data from custom software or databases\n- Custom API: Use the JSON connectors to connect to any custom application\n\nOMNIPRESENT\n- Make Siri aware of any metric in Numerics. Siri responds to your query with a quick spoken brief of current values. Works with AirPods & HomePod.\n- Push Notifications - Get alerts to changes in key metrics\n- Uniquely fine-tuned user experience for each iOS device screen size\n- Keep track of numbers from the Lock screen in the Today view\n- Quick access to dashboards with 3D Touch\n- Multitask with Numerics in Split view / Slide over modes\n- Spotlight search - Quickly lookup & jump to a metric\n- iCloud Sync makes your dashboards available on all connected devices\n- Handoff support provides a smooth continuous user experience when switching devices\n\nWEARABLE\n- A wearable micro dashboard on the watch, of your most important numbers\n- Get to your one top metric just by lifting your wrist with Numerics complications for the Apple Watch. Numerics supports all watch faces and complication types\n- Notifications on watch keep you aware of your progress\n- Get your Numerics Siri briefings directly from the watch\n\nSHARABLE\n- Stream live dashboards for teams on large screens with Numerics on Apple TV\n- Share dashboards as templates to get everyone on the same page*\n- Present selected dashboards or metrics to external displays connected via USB C or Airplay\n- Annotate & share dashboard snapshots with your finger or the Apple Pencil\n- Drag and drop multiple KPIs using multi-touch to add them as snapshots in any other app\n\nSECURE\n- Secure by design - Direct device to service connections - A truly server-less system\n- Secure sync via iCloud private DB\n- Safeguard dashboards with Touch ID / Face ID\n- Completely native iOS code\n\nEXTENSIBLE\n- Easy to integrate API\n- Shortcuts app - Design custom briefing workflows\n- Optional custom middle-ware server to connect to internal data stores\n\nENTERPRISE READY\n- Available through VPP & ABM for Enterprise deployments\n- MDM capable*\n\n*Pro subscription required.\n\nGO PRO\n- Numerics Pro is an in-app subscription with a free 1 week trial. Pro unlocks all integrated services, allows creating unlimited dashboards & widgets and enables sharing of dashboard templates.\n- The Free Lite version is limited to adding 3 KPIs on 1 dashboard.\n\nNote: Numerics Pro is available as a monthly/annual subscription. Payments will be charged to your credit card through your iTunes account. Subscriptions will renew automatically unless canceled at least 24 hours before the end of the current period. Manage your subscriptions in iTunes settings after purchase.\nTerms of use: https://cynapse.com/docs/numerics/legal/terms-of-use/",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2014-07-17T07:00:00Z",
  "updated": "2020-05-07T22:08:16Z",
  "releaseNotes": "Smart Groups in Jamf Pro \n- Added support for static and smart groups in Jamf Pro. Build intuitive dashboards with data from your Jamf Pro configured Static or Smart groups. Track & monitor number of computers in a group, devices in a mobile device group or users in a group with the newly added KPI templates.\n\nFixes\n- Resolved an issue with the Todoist integration that didn't allow adding an account when using the Google login on the iPhone.\n- Addresses an issue with the Stocks widgets that provided a time interval of 1 minute for the change indicator, but would not update. The time interval options have now been updated to start from 5 minutes.\n- Fixed the link to Manage Subscriptions in the App Settings.",
  "version": "6.4",
  "price": 0,
  "developer": "Cynapse",
  "score": 3.50746,
  "reviews": 67,
  "currentVersionScore": 3.50746,
  "currentVersionReviews": 67,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.codulis.BloodPressureLite",
  "title": "Blood Pressure Lite — BP Tracker for Hypertension Management",
  "description": "If your regular blood pressure monitor does not have any graphing capabilities, Blood Pressure app makes a perfect companion. It helps collect, track and analyze your measurements by composing them into a beautiful, color-coded chart.\n\nFeatures: \n\n• Store measurements of multiple persons\n• Add notes\n• Scroll through full history\n• Instantly see stats for inspected time range\n• Use tags (mark diet changes, exercising regimes, stress levels, used medications, etc.)\n• Filter measurements based on their tags or the time of the day at which they were taken\n• Export and email records as spreadsheet (CSV) files\n\nLite version limits the amount of data you can store to 10 records per person. This data will transfer seamlessly to the Full version after you decide to buy it.\n\nYour feedback is very important to us. Visit Codulis.com or email your thoughts directly from inside the app. Thank You!",
  "genres": [
   "Medical",
   "Health & Fitness"
  ],
  "contentRating": "4+",
  "released": "2012-08-13T19:04:33Z",
  "updated": "2016-03-03T10:13:52Z",
  "releaseNotes": "• Slight layout adjustments and fixed shadow effects in monitor’s display",
  "version": "1.5.3",
  "price": 0,
  "developer": "Codulis",
  "score": 2.5,
  "reviews": 2,
  "currentVersionScore": 2.5,
  "currentVersionReviews": 2,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.peeknest.peeknest",
  "title": "Peeknest - Inventory Organizer",
  "description": "Peeknest is the easiest way to keep track of what you have, where you have it, and how much it’s worth. It makes organizing your stuff incredibly simple, social and fun! \n\nSEE ALL YOUR THINGS\nPeek inside your closet while you're a thousand miles away. Find things you packed away without touching a box. Peeknest brings together your collections, tools, art supplies, camera gear, makeup, shoes, bags, gadgets, crafts, toys, decorations, and all the things you care about so you can see them all in one place.\n\nSAVE TIME\nStop wasting hours looking for stuff. Be awesomely productive and always find what you want, when you want it, fast!\n\nSAVE MONEY\nFeel confident while you’re out shopping and never waste money on a repeat purchase again. \n\nFEEL PROTECTED \nKeep a safe inventory of all your precious belongings should you ever need to file an insurance claim.\n\nFEEL LIGHT\nIt’s easy to accumulate clutter when your things are hidden away. Peeknest uncovers your stuff so you can quickly declutter and make more space for things you love. \n\nFEEL CONNECTED\nKeep track of stuff with others and share things with your family, friends and neighbours. \n\nGO PREMIUM\nUpgrade to Peeknest Premium to add unlimited items, share spaces with others and help support Peeknest. \n\nBefore starting a trial or completing a payment, you'll see the plan price. This amount will be charged to your iTunes account at confirmation of purchase and on renewal and will vary by plan and country. Peeknest subscriptions renew monthly or yearly, depending on your plan. Your account will be charged for renewal 24 hours before the end of your current billing period. To avoid auto-renewal, turn it off in at least 24 hours before your subscription renews. You can turn off auto-renewal anytime time from your iTunes account settings. You can manage and cancel your subscriptions by going to your account settings on the App Store after purchase.\n\nTerms of Service: https://www.peeknest.com/terms\nPrivacy Policy: https://www.peeknest.com/privacy",
  "genres": [
   "Productivity",
   "Lifestyle"
  ],
  "contentRating": "4+",
  "released": "2019-06-16T07:12:42Z",
  "updated": "2020-05-02T18:37:30Z",
  "releaseNotes": "You can now navigate between nests by swiping right and left!\n\nWe also made some tweaks to make organizing your things as easy as possible.\n\nLove Peeknest? Please support us by writing a review.\n\nHappy nesting!",
  "version": "1.4.1",
  "price": 0,
  "developer": "Peeknest Inc.",
  "score": 4.61538,
  "reviews": 13,
  "currentVersionScore": 4.61538,
  "currentVersionReviews": 13,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.no8ody.TemplatesForNumbers",
  "title": "Templates for Numbers (Nobody)",
  "description": "55 TEMPLATES FOR NUMBERS\nTemplates for Numbers (for iPad, iPhone, iPod touch) is an amazing add-on for Apple's Numbers app. It provides 55 templates suitable for various tasks.\n\nCONTENT\nAddress List 1, Address List 2, Babysitter Notes, Balance Sheet, Break Even Analysis, Budget - Personal Monthly, Budget - Travel 1, Budget - Travel 2, Budget - Wedding, Budget, Calendar Daily, Calendar Monthly, Calendar Weekly, Calendar Yearly, Calorie Counter, Cash Flow, Chores List, Comparison, Converter, Customer List, Customer Satisfaction Survey, Debt to Income Ratio, Depreciation Calculator, Emergency Numbers, Expense Report, Graph Paper 1, Graph Paper 2, Guest List, House Cleaning Guide, Inventory, Invoice, 1, Invoice 2, Loan Amortization, Net Worth, Packing List, Paper Outline Landscape, Paper Outline Portrait, Party Planner, Password Keeper, Price List, Profit and Loss Statement, Project Cost, Project Timeline, Pros vs Cons, Receipt, Recipe, Shopping List, Taxable Income, To Do List 1, To Do List 2, Tournament Brackets, Travel Itinerary, Weekly Meal Plan, Weekly Schedule, Workout Log\n\nDIFFERENT PAPER SIZES\nAll templates are available in US Letter and A4.\n\nEASILY CUSTOMIZABLE\nOnce opened in Numbers you can apply your own colors, fonts, pictures, etc.\n\nREQUEST TEMPLATES\nTell us what templates you would like to see in the next update.\n\nUNIVERSAL APP\nThis app works on iPad, iPhone and iPod touch. Therefore, do not forget to download this app onto your other devices - for free! - provided you purchased the app once. \n\nIMPORTANT: NUMBERS REQUIRED!!!\nMake sure you have Numbers for iOS - Apple's spreadsheet app. In order to open any of the templates, you need to have Numbers installed on your device. You can download Numbers from the App Store. The only reason why you would not be able to open a template is if you did not have Numbers installed on your device!",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2015-03-04T00:24:32Z",
  "updated": "2018-05-31T16:37:59Z",
  "releaseNotes": "This is a minor update with stability and performance improvements. New templates are in the works!",
  "version": "1.0.2",
  "price": 2.99,
  "developer": "Nobody LLC",
  "score": 4.61538,
  "reviews": 13,
  "currentVersionScore": 4.61538,
  "currentVersionReviews": 13,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.Luminant.DiscountSpreadSheet",
  "title": "Utility Spreadsheet Pro",
  "description": "Designed from the ground up for optimal use of the touch interface, Utility Spreadsheet has the number crunching power you need and doesn't make you jump through hoops to use it.\n\nOur expanded keyboard keeps the operator and number keys available so you don't have to switch back and forth to write an equation.\n\nCapabilities include formula dragging, limited graphing, sorting, freezing headers, and import/export of csv files for compatibility with many other spreadsheet programs.\n\nHas built-in support for the following functions, with more to come in future updates!\n\nSIN, COS, TAN, ASIN, ACOS, ATAN, RADIANS, DEGREES, SUM, PROD, SUMIF, FACT, MEAN, MEDIAN, MODE, STDEV, SQRT, EXP, LN, LOG, IF, ABS, PMT, MIN, MAX",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2010-05-25T22:21:49Z",
  "updated": "2019-12-17T18:27:36Z",
  "releaseNotes": "Bug fixes",
  "version": "7.3.7",
  "price": 2.99,
  "developer": "Luminant Software, Inc",
  "score": 3,
  "reviews": 10,
  "currentVersionScore": 3,
  "currentVersionReviews": 10,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.jellyfilledstudios.OmniCalc",
  "title": "OmniCalc",
  "description": "Let the easiest to use calculator reflect your style with complete control over form and function.\n\nThe friendliest calculator on the planet. You can change anything you enter and get instant results just like a spreadsheet. Getting one number wrong in a series of operations doesn't mean starting over anymore.\n\nCustomize the look with 10 different keyboard layouts, 19 color schemes and 3 button styles.\n\nHighly detailed, realistic appearance on all devices. Takes full advantage of the high resolution display ability of the iPhone 4\n\nScroll through operations to add, edit or delete entries in your calculation with realtime results like a spreadsheet.\n\n• Rotate the iPhone/iTouch/iPad to instantly swap between 4 different calculators.\n\n• Annotate a series of operations to turn your formula into a powerful spreadsheet style form.\n\n• Save formulas or operation history in your own math library.\n\n• Date Math is automatically detected in normal operations. Add or subtract dates from each other, add or subtract a number from any date.\n\nIncludes:\n• Standard Calculator Functions\n• Scientific Calculator Functions\n• Statistical Calculator Functions\n• Date Math Calculator Functions",
  "genres": [
   "Utilities",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2010-04-01T19:36:47Z",
  "updated": "2019-02-18T14:37:20Z",
  "releaseNotes": "Updated for new OS",
  "version": "4.1",
  "price": 0,
  "developer": "Jellyfilled Studios",
  "score": 3.61111,
  "reviews": 18,
  "currentVersionScore": 3.61111,
  "currentVersionReviews": 18,
  "searchTerms": "spread betting"
 },
 {
  "appId": "jp.jboysoft.iphoneexcel",
  "title": "Excel Notepad S",
  "description": "This is a Notepad of list-style. input so easy !",
  "genres": [
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2011-11-03T22:11:29Z",
  "updated": "2011-11-11T01:36:51Z",
  "releaseNotes": "bug-fix for using on iOS5. Adjustment buttons position.",
  "version": "1.1",
  "price": 0,
  "developer": "JBOYSOFT",
  "score": 2,
  "reviews": 15,
  "currentVersionScore": 2,
  "currentVersionReviews": 15,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.gamifiedapps.simplesheet",
  "title": "Spreadsheet touch: For Excel style spreadsheets",
  "description": "Find spreadsheet too complex and overwhelming?\nWant to print out documents and files through wifi without using your Mac / PC?\nWant to send spreadsheets as pdf files through email from iPhone, iPad, and iPod?\n\nIf so, Spreadsheet touch is the answer for you!  \n\nKey features: \n- CSV import / export\n- Send emails in both PDF and CSV\n- Change font colour\n- Change background colour (10 colours)\n- Add borders and lines\n- 4 formulas (+, -, *, /) supported\n- Align left / center / right\n- Copy & Paste words\n- Dynamically adjust the size of the spreadsheets in documents in Print Preview\n- Landscape / Portrait mode supported\n- Select multiple cells\n- Columns / Rows auto or manual adjustment\n- Multiple lines within a single cell\n- Undo / Redo styles, effects, formulas and words\n- Save multiple files, docs, and notes\n- Print preview\n- Print out document without using Mac/PC\n- Print job sent to printer through wifi\n- Print out multiple pages\n- Optimised and designed purely for mobile devices\n- View saved documents / files in master list view\n- Mastery database to store data in docs and files\n- Cut / Copy / Paste / Clear single cell and multiple cells in Edit menu Style\n- Cut / Copy / Clear / Paste / Add / Delete Rows and Columns in Edit menu Style\n- More rows and columns \n- Numerical keys \n- Advanced formulas \n- Sort option into Edit menu for columns \n- Dropbox integration\n- Folders / Files structure \n- Search function \n- Cursor control buttons \n- Delete / Move / Email / Send to features in Tab ba\n\nIf you find any errors or omissions in the content of this app, please let me know through the website.\nI welcome all feedback.\n\nNote: If you are looking for spreadsheet apps that can handle .xls format and complex formulas, this app is not for you.",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2013-02-26T04:00:12Z",
  "updated": "2015-02-14T01:15:54Z",
  "releaseNotes": "- iPad mini printing issue fixed\n- Launch images added\n- Clipboard feature to copy & paste from other apps added\n- Removed Box icon\n- Tab bar in Saved files page aligned correctly\n- 64 bit support with iOS 8 SDK\n- CSV import and export compatibility added\n- Bug fixed in Formula page\n- Add file name in the Navigation bar in the spreadsheet page\n- Tab bar icons blink when user tapped\n- Blue tick icon added\n- Keyboard slides when closing in iPhone\n- Replaced plus image in the navigation bar in iPad\n- Option pop-up message optimised for cells and rows/columns",
  "version": "8.0",
  "price": 2.99,
  "developer": "B TO J PTY LTD",
  "score": 1,
  "reviews": 3,
  "currentVersionScore": 1,
  "currentVersionReviews": 3,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.thebaitapp.Linedrive",
  "title": "Linedrive: Sports Betting",
  "description": "Linedrive is a free-to-play virtual sports betting casino. Complete with authentic, real time odds/spreads from Vegas on hundreds of teams in NFL, NBA, NHL, NCAAF, MLB and more! \n\nBet multiplayer (P2P) against real users, or bet against the house on any sport! Connect through Facebook and invite your friends and family to bet with you! Stay up to date on everything in your sports betting world with features like the Activity and Scoring Feed. Compete and bet against players from all over the world on the Global Leaderboard and Global Bets platform. \n\nEarn medals/trophies, track your stats, and become a sports betting pro. Grow your betting empire until you're a millionaire, a billionaire, a trillionaire... um and whatever comes after trillionaire!\n\nAre you still reading? Stop reading. Download the game.",
  "genres": [
   "Games",
   "Casino",
   "Sports",
   "Sports"
  ],
  "contentRating": "17+",
  "released": "2017-08-16T03:14:49Z",
  "updated": "2018-08-22T17:19:43Z",
  "releaseNotes": "Bug fixes and improvements",
  "version": "1.2.9",
  "price": 0,
  "developer": "Bait, LLC",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "spread betting"
 },
 {
  "appId": "au.com.finsa.coretrader",
  "title": "Core Trader",
  "description": "Trade spread bets at razor thin spreads on 1,000s of financial markets with Core Spreads.  \n \nTight, Fixed Spreads\nWe charge less, so you can trade for less.\n•         Low-cost trading – tight spreads across thousands of markets.\n•         Transparent spreads and commissions – fixed spreads give clear costs of trading. \n•         Unbundled business model – the essentials done superbly.\nIf you know your edge, much of what spread betting firms offer are just distractions that generate noise and cost money to provide. Because we've done away with them, we can offer some of the most competitive spreads around. And not as opening offers or discounts, but permanently.\nBring your edge to Core Spreads and trade for less. \n \nTrade without the noise\nThe platform for those who already know their edge. No bells, no whistles – just a simple, noise-free way to trade.\nNo distractions, no clutter – no republished newsfeeds or analyst reports, no learn-to-trade tutorials or expert opinions from people in braces. In fact, no marketing gimmicks or anything else that might disrupt your focus. And definitely no celebrity traders.\nStreamlined, industry-leading interface – fast, secure, easy-to-use platform.\nDesktop, tablet and mobile versions – so you can trade wherever you are.\nToo many financial spread betting firms talk about their platform like it’s an end in itself. It’s not; it’s a way for you to execute your strategies. Ours cuts out the noise, doing everything you need and nothing you don’t.\n \nSecure funds\nWe’re set up so you can trade with total peace of mind.\nYour money is always your money – regulated by the FCA, we hold customer funds in segregated, ring-fenced bank accounts, completely separate from Core Spreads money.\nFSCS protected – our customers are covered by the Financial Services Compensation Scheme (FSCS). \nWe can never take positions against our customers – the FCA permissions we sought don’t allow it, which means our financial health doesn't depend on betting against you. \nAll this means you can concentrate on your trading, knowing your money is completely safe.\n \nCredit\nBecause we want to make it easier for good traders to trade, we’re one of the only spread betting firms to offer credit.\n•         No need to hold cash for every trade – provided you've been approved.\n•         Reduced transaction costs – by making fewer credit and debit card payments. \n•         Credit on application – you can apply for credit once you've got a live trading account. \nBecause we only encourage responsible trading, we review each application thoroughly. \n\nDon’t fear risk, understand it.\n\nSpread bets are leveraged products, which means you could lose – as well as win – more than your initial deposit. You should ensure spread betting meets your investment objectives. \n\nThis email neither constitutes, nor is to be construed as an offer to buy or sell investments. The information and opinions expressed herein are based on sources we believe to be reliable but we do not represent that they are accurate or complete. No liability is accepted by Core Spreads for any direct or consequential loss arising from this email. Please carry out your own virus checks.\n\nCore Spreads is a trading name of Finsa Europe Ltd (FCA number 525164) registered address 6th Floor, 110 Fenchurch St, London, EC3M 5JT. \n \nAnalytics \nWe use Google Analytics to monitor how users use our app.  This data is anonymous, by downloading this app you consent to use gathering data in this way.",
  "genres": [
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2015-12-10T09:25:54Z",
  "updated": "2020-05-04T17:46:02Z",
  "releaseNotes": "- Minor UI Bug Fixes",
  "version": "2.17.4",
  "price": 0,
  "developer": "FINSA EUROPE LTD",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.cityindex.iphone.interactiveinvestor",
  "title": "Interactive Markets SB & CFD",
  "description": "Trade across thousands of financial markets with your Interactive Markets SB/CFD account whenever you want and wherever you are. \nOur trading app offers instant, secure access to your trade account at all times, with instant access to live prices on thousands of markets. \n\nThe Interactive Markets CFD/SB App for iPhone features:\n\n• Instant execution of thousands of global instruments\n• 24-hour trading\n• Choice of risk management orders, including stop, limit and guaranteed stop losses\n• Customisable watch lists\n• Interactive charting with technical indicators \n\nFor more information, please visit www.iii.co.uk/trade/spreadbetting-and-cfds \n\nApply for a trading account at http://www.iii.co.uk/trade/spreadbetting-and-cfds today.\n\nCFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 73% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money.\n\nCFD, Spread Bet Trading and Forex Trading are leveraged products and your capital is at risk. They may not be suitable for everyone. Please ensure you fully understand the risks involved by reading our full risk warning. \n\nThis app has been developed and built by GAIN Capital UK Limited. Interactive Markets is a trading name of GAIN Capital UK Limited whose head and registered office is Park House, Finsbury Circus, London EC2M 7EB. GAIN Capital UK Limited are authorised and regulated by the Financial Conduct Authority in the UK FRN 113942 for details visit www.fca.org.uk. Registered in England and Wales No: 1761813. Vat no: 524837435.",
  "genres": [
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2015-10-05T03:11:55Z",
  "updated": "2020-02-19T08:35:00Z",
  "releaseNotes": "Various bug fixes and improvements",
  "version": "4.20.29.10797.5317",
  "price": 0,
  "developer": "Interactive Investor Holdings Limited",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.bettingtab.betting",
  "title": "Betting",
  "description": "Betting App gives you access to the latest baseball odds including the spread, moneyline and over/under. \n\nYou can highlight a game of interest and with our current and opening lines you can track if vegas sportsbooks have moved the lines.",
  "genres": [
   "Games",
   "Sports",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-05-25T21:46:10Z",
  "updated": "2013-05-25T21:46:10Z",
  "version": "1.0",
  "price": 0,
  "developer": "Ocean View Marketing",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.graphicnode.templatesfornumbers",
  "title": "Templates for Numbers",
  "description": "The Ultimate Pack. Spend only a few moments to track your life easily! \n\nThe high-quality Templates for Numbers collection for iOS devices provides 410 various handy templates that can be used for iPhones, iPad and iPod touch. Use them for your everyday needs to handle different jobs easier. Use them at work, at school or at home. Design spreadsheets, plan, organize or analyze data wherever you are. \n\nModify the templates, adapt them to your needs and create eye-catching spreadsheets. Add data, create tables that match your requirements: change size, position, color. Just find something you like or need and use graphics, photos, or words to make it your own. Besides attractive design solutions, templates are perfectly suited for diverse purposes including personal habits or business concerns.\n\nAvailable in size A4, the standard size in most countries in the world, and U.S. Letter, the most common paper format in the United States and Canada.",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2012-04-17T18:09:14Z",
  "updated": "2019-10-09T02:20:22Z",
  "releaseNotes": "• iOS13 support integrated.\n• The new version includes multiple improvements.\n• Dark mode integrated.\n\n\n\nLoving the app? Rate us to make it official. If you think something’s missing or have any suggestions for content improvements, get in touch with us: support@graphicnode.com",
  "version": "5.0.4",
  "price": 4.99,
  "developer": "Graphic Node",
  "score": 4,
  "reviews": 7,
  "currentVersionScore": 4,
  "currentVersionReviews": 7,
  "searchTerms": "spread betting"
 },
 {
  "appId": "csvfileeditor",
  "title": "Csv File Editor with Import Option from Excel  .xls, .xlsx, .xml Files",
  "description": "* Create/Update Excel .csv (comma separated text) files which could have unlimited rows ( 77 columns each row, 12 columns in one page). \n\n* Open any Excel .xls , .xlsx, .xml, .csv file and edit that file on table view, \n\n* Edit/copy files from/to dropbox as well as documents folder on your device ,\n\n* Barcode/QRCode scanner to easy collect data,\n\n* Scan&Find  to scan barcode and find it in the .csv file,\n\n* Convert Excel XLS, XLSX, XML files to CSV,\n\n* Set column width or column width will be calculated auto,\n\n* Cut,Copy,Paste,Hide,Unhide row/column,\n\n* Add,Delete row/column,\n\n* Set background colour of cell/row/column,\n\n* Search a word in the csv file,\n\n* Set private folder password to protect private files,\n\n* AirPrint function to print csv/html/xls/xlsx file,  \n\n* Send your file with E-Mail,\n\n* Convert  your spreadsheet to xml format. That xml file can be edit with Excel or any compatible application.\n\n* Convert  your spreadsheet to html format and send it with e-mail. \n\n* Edit any .csv file as form, as spreadsheet or notepad view. (Form view is using first 2 rows of the file as column label. ) \n\n* Flexible button panel design for all versions, and easy access buttons for iPad spreadsheet viewer, \n\n* Copy files between documents folder and private folder. \n\n* Transfer files thru iTunes into the application documents folder or open it from e-mail attachment,\n\n* Change any row/column/cell colour (spreadsheet view),\n\n*  When you convert .xls file to .csv file our application is keeping cell's background colour, borders, alignment details while it is converting file contents,\n\n* Keyboard has been extended with Cursor Right,Left,Up,Down buttons to easy navigate and easy data entry,\n\n* When you save .csv file , this application is going to keep row and column position on the screen. You could re-start from same point when you re-open. \n\n* Column header is keeping on the top of the table so whatever your row number is you could see column labels.\n\n* You can swipe your finger on the table to scroll columns.\n\nYou could use this application for a lot of reasons such as sales price list, sales order, product list, etc. So, You can create an order form file and you could enter customer orders on the file then send that to your company.\n\n* Open csv file attached with e-mail  (When you open attached file (you need to hold your finger onto attached file name and choose Csv file editor to copy ) it will copy itself into this application.) ,\n\n\nList seperator parameter is in  iPhone/iPad settings menu.\n\nAll functions of this application has been tested several times with different devices. \n\nThis application is compatible with iPod Touchs, iPads, iPhone 3gs,4,4s,5,6.\n\n* You do not need to connect internet to edit your files. All files will be on your iPhone/iPad. \n\n*** Do not worry about how to use this application ! Detailed help file included with this application.\n\n*** Direct e-mail button to dedicated customer service advisor.\n\nNote : if you have any problem or if you could not find out how to use function could you please send us your concern(with your e-mail address) .",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2011-11-10T22:49:49Z",
  "updated": "2015-10-10T01:39:18Z",
  "releaseNotes": "Csv application has been updated for iOS 9.",
  "version": "V4.1",
  "price": 0.99,
  "developer": "Harmony Software UK",
  "score": 1,
  "reviews": 1,
  "currentVersionScore": 1,
  "currentVersionReviews": 1,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.trophysoft.iPIM-free",
  "title": "iPIM Info Manager+Database",
  "description": "Finally - the ONE application that keeps your personal and business information in a single, unified, secure place. And it's FREE!\n\niPIM™ Free, the free version of the leading all-in-one personal and business organizer and sophisticated database, offers a unique and innovative way to store your data  using standard or custom forms, with a host of advanced features you won't find anywhere else:\n\n● USE secure built-in templates to store emergency data, memos and reminders, checklist, to-do lists, passwords, credit card and bank account information, shopping lists, inventory lists, expenses and more.\n\n● CREATE your own custom templates easily and intuitively (or modify the built-in ones) to match your personal and business needs, using 15+ rich data types.\n\n● ORGANIZE your data in built-in or custom folders and subfolders for easy access.\n\n● ACCESS your data quickly using iPIM™'s unique time-saving user interface.\n\n● SET UP time reminders (including repeated reminders) for any item.\n\n● SEARCH your data quickly and thoroughly using simple or complex search terms, and save your searches for later use.\n\n● SHARE your data via email, Facebook and Twitter.\n\n● PROTECT your data using iPIM™'s built-in military-grade encryption and an application- or folder-based password or fingerprint authentication.\n\n● USE a single universal application for all your iPhone, iPad and iPod touch devices.\n\n● NEVER INSTALL ANOTHER INFORMATION MANAGER - iPIM™ caters for your personal and business data needs in a single, powerful solution.\n\nIf you enjoy the free version of iPIM™, you can always upgrade to the full version without losing your existing data and get much, much more:\n\n● Create unlimited number of notes.\n\n● Use additional exciting note types - photos*, videos*, sound recordings* and scribbles.\n\n● Synchronize your data across all of your devices through iCloud*.\n\n● Create location-based reminders* (including repeated reminders) in addition to the standard time-based reminders.\n\n● Print* your notes on supported printers.\n\n● Get rid of all advertisements.\n\nWant the full version right now? Search for iPIM in the App Store!\n\n* Photos, videos, sound recordings, scribbles, location-based reminders, printing and iCloud synchronization available in the full version and on supported devices only. Location reminders on some devices are GPS-based; continued use of GPS running in the background can dramatically decrease battery life.",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2012-09-14T15:55:43Z",
  "updated": "2019-06-18T19:58:03Z",
  "releaseNotes": "Minor bug fix.",
  "version": "3.0.9",
  "price": 0,
  "developer": "TrophyCon",
  "score": 5,
  "reviews": 2,
  "currentVersionScore": 5,
  "currentVersionReviews": 2,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.aepryus.oovium",
  "title": "Oovium",
  "description": "Oovium makes my geek heart flutter.\n- Anne Wind \n\nThis app is a thing of beauty. \n- W Smith Jr \n\nWow I love this \n- OkeyMor57 \n\n22nd century calculating \n- bill knighton \n\nThis will become Hari Seldon’s Prime Radiant some day. \n- nicked off \n\nOovium is not an attempt to rehash old outdated inventions, but it subsumes much of their functionality. The calculator, spreadsheet, concept map, programming language: Oovium is all of them and it's none of them. \n\nOovium is the first (but certainly not the last) of an entirely new class of app, the calculation sandbox. It has been made possible by the invention of the touch device and Oovium's clean, efficient and tactile interface, designed for such devices, has been part of its DNA since its inception. \n\nAt its heart, Oovium aspires to make powerful, sophisticated and complex abilities (such as those currently available only to programmers) accessible to a wider audience. Oovium understands that increasing accessibility does not mean dumbing down an application by hiding complex functionality, it means making that complex functionality understandable by creating explicit visual representations for it. \n\nThe workspace of Oovium is a two-dimensional surface known as the Aether. Upon this aether a user can place Bubbles. There are currently four types of bubbles: \n- InstBub is an instance of an object, usually a number, which in turn may be the result of an expression. \n- MechBub allows the user to define their own functions. \n- GridBub allows for a tabular arrangement of numbers and expressions similar to a spreadsheet. \n- TextBub is a node that can be connected to other TextBub nodes in order to create concept maps. \n\nThese bubbles can be connected to each other in order to render sophisticated calculations in a visual (and aesthetic) way. Libraries of custom functions can be developed and included in other aethers when needed. \n\nThe concept of Oovium has six different aspects; in its current form it contains only one of these six aspects. It is a highly ambitious project with much more planned, that hopes to empower users; it hopes to change the way people think about and work with their computers; in short, it hopes to change the world! Come help drive its functionality; come help make Oovium happen!",
  "genres": [
   "Productivity",
   "Education"
  ],
  "contentRating": "4+",
  "released": "2009-11-06T01:06:04Z",
  "updated": "2020-04-21T16:16:53Z",
  "releaseNotes": "Preparation for the major upgrade to Oovium 2.0.",
  "version": "1.3",
  "price": 9.99,
  "developer": "Aepryus Software",
  "score": 2,
  "reviews": 2,
  "currentVersionScore": 2,
  "currentVersionReviews": 2,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.cometdocs.imagetoexcel",
  "title": "Image to Excel Converter - OCR",
  "description": "Take a photo of your paper or on-screen document and convert it to editable Microsoft Excel document (xlsx) right on your iPhone or iPad using our quick and easy-to-use app. Our industry-leading OCR engines will spare you from wasting your time and effort for retyping whole tables, receipts, invoices, notes, lists and other documents. Instead of using scanner and then converting your scan to editable document - let our app to do the job for you. \n\n•  Excellent recognition and conversion quality.\n•  No limits on file size or number of converted files.\n•  Complex tables can be converted as well.\n•  Screenshots are also convertible.\n•  Easily share converted documents or open them in another apps.\n•  The converted document is in the .xlsx format and immediately ready for further reuse.\n•  The new Excel file is optimized for fast viewing and immediate analysis.\n•  Converted documents are editable so, if it is needed, you can quickly make small adjustments in any Excel editor on your phone or computer.\n\nFiles are sent to our servers where they are being converted by powerful OCR technology, so your phone battery and resources won't be drained by conversion. After the file is converted, the result is being downloaded back to the app, and the files are deleted from our servers immediately.",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2016-06-20T23:04:10Z",
  "updated": "2018-04-13T16:21:28Z",
  "releaseNotes": "Big update ahead! We are listening to your feedback,\nand we have added a lot of new stuff for you, including:\n\n• Scan option to recognize paper on your photo\n• Rotation and black-and-white-ing photos\n• Renaming converted files\n• Support for beautiful iPhone X\n• Haptic feedback for supported devices\n• Slightly improved user interface\n• Various bug fixes and improvements\n\nWe hope you are going to love this update - we put a lot of love into it!\n\nIf you love it, go ahead and give us 5 stars, it means a lot to us. If you\nexperience any problem, or have a suggestion, feel free to contact us\nat mobile.support@cometdocs.com. We'll be there for you! \n\n(Oh, and - you showed a lot of interest in our apps - so expect\nmore frequent updates and more features soon!)",
  "version": "4.1",
  "price": 0,
  "developer": "Cometdocs.com Inc.",
  "score": 1.8,
  "reviews": 20,
  "currentVersionScore": 1.8,
  "currentVersionReviews": 20,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.cfdspro.tradesignaller",
  "title": "tradesignaller",
  "description": "tradesignaller delivers premium trade signals, alerts and analysis for spread betting, CFD and copy traders. Spot market opportunities with trading tips, alerts, news and expert commentary for Indices, Forex, Commodities and Penny Shares. \n\n\nBuilt specifically for spread betting, CFD and copy traders, Tradesignaller offers a variety of content channels from proven market specialists to deliver signals and analysis based on your trading  experience and preferences. tradesignaller delivers content directly to your phone or tablet using secure push notifications.\n Choose Your Channels\n\n* AOL Copy Trader – Locates the best traders to follow and copy. Mirror the Top 5 ‘Watchlist’\n* Trader Tim – Trader and Blogger who donates a portion of all earnings to charity\n* The Selfish Trader – WhatsApp Group-based trading and community\n* Jason Sen’s Day Trade Ideas – Daily technical analysis for professional day traders\n* Tip TV – Finance channel dedicated to providing leading city analysis\n+ more\n\nSpot Market Opportunities\n\n* Indices – UK’s FTSE100 and FTSE250 plus DAX, S&P, Nasdaq\n* Forex – Major currency pairs such as EUR/USD, EUR/GBP, GBP/USD, USD/JPY\n* Commodities – Crude Oil, Gas, Gold, Silver, Copper etc\n* Penny Stocks & Shares - Navigating the fundamentals of Small Caps\n\nSupport & Trading Community\n* Secure online chat function, allows you to contact our channel experts directly\n* Education materials, video tutorials, webinars delivered via our partner network\n\nExclusive Premium Upgrades\n* Take advantage of exclusive free trials and offers delivered via channel updates\n\nTrusted by Thousands of Traders\nJoin thousands of Traders using tradesignaller everyday...\n\n“As an active spread better I have found this useful for staying informed with market movements and generating trade ideas.” Nil Wills, UK Trader\n\n------------------------------------ \n\nSpread Betting and CFDs are high risk investments and it is possible to lose more than your initial deposit. Spread Betting and CFDs are not suitable for all investors and you should ensure that you understand the risks involved and, if necessary, obtain independent financial advice to ensure that these products fit your investment objectives.",
  "genres": [
   "Finance",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2015-09-03T02:30:32Z",
  "updated": "2015-11-24T23:03:12Z",
  "releaseNotes": "- Resolves issue with registration.",
  "version": "1.4",
  "price": 0,
  "developer": "Dynmark International Ltd",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "spread betting"
 },
 {
  "appId": "net.openasapp.openasapp",
  "title": "Open as App",
  "description": "Quickly collaborate and share data – It’s that easy!\n\nEasily share and use your data (e.g. calculations, lists, maps/POI, dashboards, and formulae in Microsoft Excel or Google Sheets) with our Open as App Client. It’s quick and easy thanks to Open as App’s mobile frontend. “Save as PDF” becomes “Open as App”.\n\nYou need the Open as App client if:\n   - You have been invited to Open as App by a customer, colleague, or friend\n   - You want to use your spreadsheets tailor-made for your iPhone or iPad – online/offline\n   - You want to share reports, calculations, dashboards, and surveys the user-friendly way (or want to collect data)\n   - You want to improve collaboration with colleagues, partners, or customers\n   - You want to work with up-to-date Microsoft Excels or Google Sheets – no matter where you are",
  "genres": [
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2016-03-10T21:09:32Z",
  "updated": "2020-05-06T22:47:05Z",
  "releaseNotes": "- Minor bug fixes and improvements.",
  "version": "1.65",
  "price": 0,
  "developer": "Open as App GmbH",
  "score": 4.5,
  "reviews": 4,
  "currentVersionScore": 4.5,
  "currentVersionReviews": 4,
  "searchTerms": "spread betting"
 },
 {
  "appId": "org.movilsland.xlsopen",
  "title": "XlsOpen spreadsheets editor",
  "description": "XlsOpen is an adaptation for iPhone and iPad of the app Gnumeric, which is a spreadsheet, a computer program used to manipulate and analyze numeric data. Gnumeric can keep track of information in lists, organize numeric values in columns and rows, perform and update complex calculations by defining each step of the calculation and modifying particular steps subsequently, create and display or print graphical plots of data using bar plots, line graphs, pie charts or radar charts, implement complex optimization modeling or perform many other tasks involving numbers, dates, times, names or other data.\n\nXlsOpen inherits the Gnumeric features:\n\n- 100% of the worksheet functions in MS Excel\n- Arrays values and formulas\n- Toolbar for common operations like Zoom\n- Sheet objects: Lines, Arrows, ellipses, squares, Buttons, Scrollbars, Checkboxes, Images, Charts.\n- All Excel formats: number, currency, accounting, date, time, percentage, fraction, scientific, text.\n- Filters: XML (gnumeric format), MS Excel (tm) 2,3,4,5,95,97,2k,XP, Applix (4, 5),  CSV (comma separated values), Lotus 1-2-3 .wk1 \n\n\nA guide about how to use this app can be found at https://help.gnome.org\n\nXlsOpen is the app Gnumeric that is run remotely.\n\nThe subscription inside the app consists on the following:\n\n- The length of the subscription is 1 month\n- The price of the subscription is $0.99\n- The subscription will be auto-renewed every month so that you can continue enjoying the app without ads.\n- Payment will be charged to iTunes Account at confirmation of purchase\n- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period\n- Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal\n- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase\n- No cancellation of the current subscription is allowed during active subscription period\n- The privacy policy and terms of use of our apps are in http://www.blackhawksystems.eu/website/policy_en.html",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2016-02-03T01:08:57Z",
  "updated": "2020-04-10T20:55:33Z",
  "releaseNotes": "iOS 13 SDK.\nXcode storyboard to provide the app’s launch screen.",
  "version": "4.4",
  "price": 0,
  "developer": "SSA",
  "score": 1.25,
  "reviews": 4,
  "currentVersionScore": 1.25,
  "currentVersionReviews": 4,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.emendoMedia.TemplatesForNumbersPro",
  "title": "Templates for Numbers Pro",
  "description": "++++++++++++++++ \nSPECIAL: 4.99 DOLLAR!!! -50% DOWN FROM $9.99 \nGET IT NOW BEFORE THE PRICE INCREASES!!!\n++++++++++++++++\n\nTemplates for Numbers Pro is the only available app in the App Store that brings 90 powerful and efficient spreadsheet templates to Apple's Numbers application on your iPhone, iPad and iPod touch. With a great variety of templates and an emphasize on design and functionality Templates for Numbers Pro takes your spreadsheets to the next level!\n\nTONS OF SPREADSHEETS\n90 polished spreadsheets are waiting to get edited by you. Our templates range from accurate accounting sheets and proposals to casual menu and fitness planners to handy calendars and schedules.\n\nAUTOMAGICAL DOCUMENTS\nMany of our spreadsheets are already filled with many smart as well as convenient formulas and conditional formatting settings to save you time and calculate almost everything automagically!\n\nEASY TO USE AND CUSTOMIZE\nYou can use every template right away, but it is also very easy to customize them the way you want: You can change almost everything: styles, fonts, colors, borders, formulas...\n\nNEW TEMPLATES ON THE WAY\nWe are ready for feedback and ideas for new templates and spreadsheets. Suggest new templates or vote for existing ideas on our website and we´ll add them with future updates for free.\n\nWE'RE HERE FOR YOU \nFollow us on Twitter for the latest updates, contests, more info at: https://twitter.com/madeforuse",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2012-03-28T20:18:51Z",
  "updated": "2015-10-09T00:49:16Z",
  "releaseNotes": "Templates for Numbers Pro is written from the ground up to fit the needs of productive people even better.\n\n- Update of all templates and support for the theme (.nmbtemplate) format. You can now choose whether you want to export a completely filled Numbers spreadsheet or a theme to create your own custom spreadsheet from.\n- A beautiful new design to make it even easier to browse, preview and pick templates\n\nMade for iOS 9:\n- Support for iOS 9 Search: you can now search and find your templates with Spotlight\n- Support for Split View on iPad Air 2 and iPad Pro\n- Support for Slide Over on iPad\n\nMade for iPhone 6s and iPhone 6s Plus:\n- 3D Touch Quick Action to jump directly to your templates, favorites or the For You tab from the Home Screen\n- Peek and Pop gestures to preview and open a template or one of your favorites\n\n123 B",
  "version": "5.0",
  "price": 4.99,
  "developer": "Made for Use",
  "score": 1,
  "reviews": 2,
  "currentVersionScore": 1,
  "currentVersionReviews": 2,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.pocketfun.excel2",
  "title": "Spreadsheets - For Excel Format",
  "description": "Work from anywhere: View, edit, and create Office Excel files support XLS/XLSX format, It is compatible with Excel, Numbers and any other XLS/XLSX-based Spreadsheet program. \n\n● View, create, edit and save spreadsheets in XLS/XLSX format. \n● Compatible with Excel, Numbers, NeoOffice. \n● Portrait and landscape views. \n● Handles multiple worksheets. \n● Handles unlimited rows and columns. \n● Searching and sorting of cells. \n● Cell formatting, including bold,underline, italic, borders, text and cell color, alignment, text wrapping and so on. \n● Cell types, including General, Number, Currency, Percentage, Date, Time, Date/Time and Text. \n● Merge cells feature. \n● Pane freezing. \n● Copy and paste \n● Tap and drag to change row heights and column widths. \n● Intelligent auto range selection for range based functions. \n● Tap cells to compose formula. \n● Insert, copy, paste or cut cell ranges, rows or columns. \n● Date formats, date separators and numeric separators are all handled correctly according to the current locale, with manual override.",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2015-08-26T02:58:17Z",
  "updated": "2015-08-26T02:58:17Z",
  "version": "1.0",
  "price": 0,
  "developer": "Mu Jun",
  "score": 1.14286,
  "reviews": 7,
  "currentVersionScore": 1.14286,
  "currentVersionReviews": 7,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.kizeo.kizeoforms",
  "title": "Kizeo Forms",
  "description": "REPLACE YOUR PAPER FORMS BY YOUR OWN DEVICE!\n\nCreate unlimited forms and collect all your information on your iPhone or iPad directly from the field (even without any internet connexion !)\n\n--> Create 100% customizable forms and record the data you are looking for !\nWhatever your job is, Kizeo Forms™ tailors your needs and your work procedures and allows you to easily build your own application forms, thanks to a wide choice of combination tools.\nThe freedom of choice, offered by Kizeo Forms™ gives you the total autonomy to perform your creation as swiftly and easy as possible.\nNo matter what your profession is, Kizeo Forms™ will fit your needs. Here are some examples :\n- Site supervision\n- Expense reports\n- Rental application forms\n- Property inventories\n- Contact making\n- Work time monitoring\n- Business followings\n- Financial services\n- etc...\n\n--> Networkless !\nPerform your operations and your interventions wherever you are with Kizeo Forms™ Offline Mode.\nAll your data is stored in your device and pending to receive an internet connexion.\n\n--> Optimize the communication with your employees and spread your information in real time !\nFeedback your data to your company in real time and increase your responsiveness.\nCommunicate easily with your technicians and other out-of-office workers to increase your productivity and.\n\n--> Store your data and receive it in the file format you want :\nAll the recorded data is centralized and can be consulted in real time. You can either forward your data or simply retain in PDF/Word format (for reports, assessments, summaries, etc.) or in Excel (to organize your data, draw statistics, perform calculations, etc.) or even in CSV or XML format which allow you to integrate these data directly in your company’s database.\n\n--> Communicate better and modernize the image of your company :\nShare your data with your co-workers, employees, clients, or other users by email, with automatic PDF-attached documents, signed by your company’s logo and details.\n\nStep 1 : Register now and create your account on Kizeo Forms™ website.\nStep 2 : Create your form.\nStep 3 : Collect your data on the field with Kizeo Forms™ App.\nStep 4 : Send out your data the way you want.",
  "genres": [
   "Business",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2012-02-21T15:40:07Z",
  "updated": "2018-03-26T12:27:07Z",
  "releaseNotes": "Various upgrades",
  "version": "6.8.0",
  "price": 0,
  "developer": "Kizeo",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.iosappdev2013inc.gowordphone",
  "title": "Office Docs - for Word Editor",
  "description": "Office Docs is a fully featured word processor app, which lets you create and edit Word 97-2010 (.doc & .docx) format files on your iPhone/iPad. It supports advanced character and paragraph formatting, including tables, images, auto-correction, auto-completion, copy/paste and undo/redo. It also has support for tracked changes.\n\nSUPERIOR WORD PROCESSING\n\nOffice Docs gives you the power of a desktop word processor, right on your iPad. It lets you format documents into multiple columns, drag images around the page as the surrounding text flows around, add footnotes and endnotes. You can also collaborate with other Microsoft Word users with its unrivaled support for tracked changes. Review, add, accept and reject textual changes using the easy to use interface.\n\nCLOUD SUPPORT.\n\nWORD PROCESSOR FEATURES\n\n• Character formatting, including: \n- Text and fill color \n- Bold, Italic, Underline \n- Font face & Size \n• Paragraph formatting including alignment, line spacing, margins, indenting, bullets and numbering \n• Support for tables, including table creation \n• Support for floating and inline images (inserting from camera roll or pasting from other programs) \n• Support for shapes and floating text boxes \n• Support for textual tracked changes \n• Footnotes, endnotes and comments \n• Multi-column formatting \n• Supports section breaks, page breaks and column breaks \n• View headers and footers \n• Ruler bar with ability to set paragraph margins and tab stops \n• Searching of text within documents \n• Undo and redo, up to 100 undo levels \n• Auto-correction and auto-completion are supported \n• Spell check \n• Copy & Paste, even text and images from other applications\n\nGENERAL FEATURES\n\n• Revert to a previous version of a file.\n• Organize files into folders.\n• Email documents as attachments.\n• Print files wirelessly",
  "genres": [
   "Productivity",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2013-11-09T21:08:12Z",
  "updated": "2018-01-15T17:42:26Z",
  "releaseNotes": "bug fix;",
  "version": "1.3",
  "price": 6.99,
  "developer": "las Condes",
  "score": 3.33333,
  "reviews": 9,
  "currentVersionScore": 3.33333,
  "currentVersionReviews": 9,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.tzechuen.SumUp",
  "title": "SumItUp – mini spreadsheet for iMessage",
  "description": "Ever needed to perform calculations to sum things up in the midst of a conversation? Enter SumItUp, gone are the hassles to switch between apps, or needing to bring out your calculator. SumItUp gives you the power to sum things up on the fly!\n\n\nWhat can you do with SumItUp?\n• Want to plan for your next holiday and know how much would it cost? SumItUp!\n• Send a quotation or an invoice to your client for your products and services without needing to bring out your laptop and firing up Excel (P/S: We’ve made it super easy to add Discounts and Taxes)\n• Pooling funds together to buy a birthday gift? SumItUp to keep track of funding by family and friends. Just share the sheet with them and let them update it themselves\n• And many more — the possibilities are endless!\n\n\nSumItUp features\n• Perform calculations with the option to add a Quantity column for inline multiplication\n• Send and share your sheet with family and friends\n• Anyone who you’ve shared the sheet with can update it\n• Add Discount and Taxes to the total\n\n\nSumItUp is Free for the first 10 sends. An in-app purchase to Go Pro allows you to create and share an unlimited amount of sheets!\n\nWe hope you enjoy using SumItUp as much as we’ve enjoyed making it. If you have any questions or feedback, please feel free to email us at hello@getsumup.com \n\nThank you!",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2016-09-12T21:28:14Z",
  "updated": "2016-09-27T19:13:54Z",
  "releaseNotes": "• We have rebranded as SumItUp\n\nWe hope you enjoy using SumItUp as much as we’ve enjoyed making it. If you have any questions or feedback, please feel free to email us at hello@getsumup.com",
  "version": "1.0.3",
  "price": 0,
  "developer": "Ting Tze Chuen",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "spread betting"
 },
 {
  "appId": "com.stone.software.folder",
  "title": "Folder",
  "description": "Folder is an application that allows you to use your iPhone, iPod touch or iPad as a portable hard drive via iTunes.  Plug in your device, open iTunes, and transfer files to and from your iPad, iPhone or iPod touch to take with you wherever you go.\n\nWhen the app is launched you can browse your files, open them in the appropriate application and delete them when you're finished.  You can preview many kinds of files using preview mode and email files as attachments.  Simple, fast, easy.\n\nYou can also send files from mail and other applications to Folder directly on your device.  Use these files later in another application or for easy retrieval on the go.\n\nTip:  You can copy files on and off of your device using Folder from any computer with iTunes on it, not just the computer you sync with.",
  "genres": [
   "Productivity",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2010-04-15T22:25:02Z",
  "updated": "2017-06-27T19:57:00Z",
  "releaseNotes": "- Updated to 64 bit.\n- Minor bug fixes and visual tweaks.",
  "version": "1.5",
  "price": 0,
  "developer": "Geopher Tools",
  "score": 3,
  "reviews": 1,
  "currentVersionScore": 3,
  "currentVersionReviews": 1,
  "searchTerms": "spread betting"
 }
]