[
 {
  "userName": "Myfanwy Lewis",
  "date": "2020-05-10T17:37:40.795Z",
  "score": 5,
  "title": null,
  "text": "Never played Bingo online before ....So this has been my first time .... I have to say I am impressed.....You set daily ...weekly ...monthly limits .... So you do not over spend and only play with what you can afford ...... You are also given free games....and you can also play from as little as 2p a game... On a serious note ... Tombola also offers help if you know you have a problem with gambling ...",
  "replyDate": "2020-05-13T12:15:02.878Z",
  "replyText": "Thank you for your review Myfanwy. It's fantastic that you are making use of the tools we have to make sure you stay safe while playing. take care - tombola Team",
  "version": "5.11.1",
  "thumbsUp": 11
 },
 {
  "userName": "Lush bingo slot offers Lou",
  "date": "2020-05-20T11:35:52.904Z",
  "score": 3,
  "title": null,
  "text": "Not all bingo games available. Would like to be able to turn phone on its side. Getting rid of chat and allowing us to play on full phone screen and allowing me to use my phone holder. This application heats my phone quick. Would like a drop down box in each room to go to other rooms rather than having to return home all the time. Would like to see balance at all times. Huge glitch with my account loading. It freeze's. My net is fine and I have deleted the app and data a few times but still happ",
  "replyDate": "2020-05-21T08:11:14.856Z",
  "replyText": "Hi Lou. If you could please call on 0800 29 888 73 so our CS team can take some further details from you and see if we are able to help with the freezing issues you are having. tombola Team",
  "version": "5.11.1",
  "thumbsUp": 3
 },
 {
  "userName": "huu shuu",
  "date": "2020-05-02T07:49:40.347Z",
  "score": 4,
  "title": null,
  "text": "Have to say, best bingo app out. Excellent variety of games for however little or as much as you can afford. Only downside is I've been playing for 10+ years and never won a jackpot despite observing many people winning them several times. Same goes for free games. C'mon Tombola.... share the love and the winnings☺",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 15
 },
 {
  "userName": "Leanne Jeffrey",
  "date": "2020-04-06T11:52:12.270Z",
  "score": 1,
  "title": null,
  "text": "I have decided this app is getting uninstalled! Still experiencing the same frustration, of seeing the same people constantly winning, and a couple of times I have been close to full house let's say im waiting for number 43, number 42, then 44 will come up. People may think its just luck of the draw but I'm seeing this all too often. I also received no reassurence or feedback from the last comment I made which makes me feel a bit sceptical about the whole thing.....",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 39
 },
 {
  "userName": "George Strachan",
  "date": "2020-04-23T09:54:28.243Z",
  "score": 1,
  "title": null,
  "text": "Games are stacked against you. I deposited £25 for £50 so played with £75 playing games from 10p to £2 with not a single win overs days of playing. The usual came close to winning. This is to draw you in to keep playing, to many times of 1 number left to win. Patterns showing in number of balls drawn before 1 line 2 line and full house usually around 15,30,50 on bingo. DON'T INSTALL THIS GAME. I will now uninstall and tell others not to waist money on this app",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 17
 },
 {
  "userName": "James Marrison",
  "date": "2020-04-11T23:50:43.571Z",
  "score": 5,
  "title": null,
  "text": "Played them all, but none so unique & as fair set as this lot, forget the rest, Tombola got it all & without it costing much to play. You can manage your spends well on here. Chose your on boards or swap them til u ve 1 u like on Bingo 80. Had so much luck & fun with this app since came on here last month. Easily my favourite gaming site, thank you Tombola!",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 7
 },
 {
  "userName": "Eleanor Abbott",
  "date": "2020-05-01T10:54:41.590Z",
  "score": 2,
  "title": null,
  "text": "Its not same people winning all time its the same 50 💻robots/👻 ghosts who have been names same time it gets familiar ,that dont just win in one room your in there in every room you go in winning again there even if you go on mecca/gala/ and foxes site the same ones seem follow you there too!! 🤣 🤣 And i reckon they keep 80% of the tickets between them hiding in there own private chatrooms , cause they aint ever typed a word in any i been in even when players say well done on jackpot again 🤔",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 4
 },
 {
  "userName": "Jayne Taghzouit",
  "date": "2020-04-13T18:46:47.280Z",
  "score": 5,
  "title": null,
  "text": "Extremely well organised site that develops continuously to maintain interest and always seeks to reflect current trends. The games are great with loads of options but all designed to be easily accessible for novices and experts alike. The CMs in the rooms are so helpful and often very funny to chat to. Makes it feel really comfortable. Easy to keep a check on your spending so it doesn't becone a problem. I just feel a lot happier having my Tombola app with me wherever I am:).",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 6
 },
 {
  "userName": "Dee Dupille",
  "date": "2020-05-25T08:55:40.642Z",
  "score": 1,
  "title": null,
  "text": "I love this website but I gave a one star because of the new Cinco. It is harder to see and the colours arn't as vibrant as the old one now it looks so drab. I wish I had the old version back :/",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Terry Pace",
  "date": "2020-05-07T16:31:04.722Z",
  "score": 5,
  "title": null,
  "text": "Love playing on this site but ti be honest I've got a photographic memory and there are certain names that win very regularly. That's just being honest but I really do enjoy your games.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 1
 },
 {
  "userName": "CJ Doyle",
  "date": "2020-05-19T17:51:44.601Z",
  "score": 5,
  "title": null,
  "text": "Fun and low cost play, a fab way to avoid boredom during this time period. Great bonuses and fast transfer of winnings. I can't fault this application.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Dianne Butterworth",
  "date": "2020-04-10T23:16:52.936Z",
  "score": 5,
  "title": null,
  "text": "Great so far Would like to see a better chance of winning free things as I played the Easter hunt today and every time I tried to comment in a room a the alloted time it crashed and I was kicked out of the chats so didn't stand a chance but other than that no issues",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 1
 },
 {
  "userName": "Kim Goodheart",
  "date": "2020-04-24T15:04:27.502Z",
  "score": 5,
  "title": null,
  "text": "Hi there, 90% of the time this app is great, however for the last 12hrs all I get now is a green screen with tombola displayed in the centre. I've tried uninstalling, & reinstalling, switching phone off? Still nothing, Any ideas please?",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 2
 },
 {
  "userName": "Marie Logan",
  "date": "2020-04-26T14:56:35.729Z",
  "score": 1,
  "title": null,
  "text": "Same people winning time and time again this game especially the bingo is rigged no way even by chance can the same people win constantly and even on the jackpot iv been playing well over a year and not won at all on the bingo and I must have spent in excess of 2000 pounds totally rigged and would not recommend this app ever",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 7
 },
 {
  "userName": "S Saleem",
  "date": "2020-04-11T17:11:28.806Z",
  "score": 1,
  "title": null,
  "text": "Convinced games are rigged. Spent £100 not a win in any form even on daily free games. Same people winning. Most of my games I've been one number away from winning just to make it look like I've got a chance.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 9
 },
 {
  "userName": "Tiannah & Lauralee Duff",
  "date": "2020-04-07T18:38:40.496Z",
  "score": 5,
  "title": null,
  "text": "I have played tombola for years and years I love it. Cannot fault it. Had my fair share of wins and cannot forget the daily free game Trio I won as soon as it started but nothing since.. keep up the good work tombola the CMS are great too overall 5outta5 for me",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 7
 },
 {
  "userName": "Anne Mcgarry",
  "date": "2020-05-17T22:53:51.220Z",
  "score": 1,
  "title": null,
  "text": "Rubbish. Put £20 on and got £60 and not a penny won. This is a fix. Money grabbers. Dont install. Waste of time. Plenty others saying the same.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 3
 },
 {
  "userName": "Jillian Myers",
  "date": "2020-04-20T08:21:15.370Z",
  "score": 5,
  "title": null,
  "text": "I am a member of a few different online bingo games but tombola is the best. So easy to use and the best arcade games out of all of them. Love TOMBOLA so get registered now and give it a try!",
  "replyDate": "2020-04-20T11:55:24.609Z",
  "replyText": "Thank you for your review Jillian and your kind words . - tombola team",
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Denitsa Dimitrova",
  "date": "2020-05-18T17:45:22.875Z",
  "score": 1,
  "title": null,
  "text": "Never win anything lost lots of money. Same people win constantly its such a rip off. How can someone win 10 times in a row and i can't win once. Deleting this app, play something else its not worth it",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 2
 },
 {
  "userName": "Mark Clavering",
  "date": "2020-04-29T18:56:48.925Z",
  "score": 5,
  "title": null,
  "text": "Had a good win on the first day I played, hopefully it won't be long for my next one, very easy to use and enjoyable, I recommend this app to all bingo lovers.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Cereal Games",
  "date": "2020-03-28T21:29:15.924Z",
  "score": 1,
  "title": null,
  "text": "RIP OFF! Spent way too much on this over the years, never had the opportunity to withdraw any kind of win (if your lucky enough to actually win)... Save your money and spend it on something you actually want.",
  "replyDate": null,
  "replyText": null,
  "version": "5.10.1",
  "thumbsUp": 32
 },
 {
  "userName": "Ant Valade",
  "date": "2020-05-11T16:43:51.114Z",
  "score": 2,
  "title": null,
  "text": "Same number came out twice , noticed a few times that it happened , also guess what ... I've never won on there so to me it's a F IN CON!!!",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 1
 },
 {
  "userName": "Markus Allard",
  "date": "2020-05-13T04:28:42.737Z",
  "score": 1,
  "title": null,
  "text": "Played at different times and different days. Played for approx £95 and won nothing. I recommend to go to the local Mecca or Gala and win at least a few pennies.",
  "replyDate": "2020-05-13T12:11:14.800Z",
  "replyText": "Hi Markus. I'm sorry to hear that you had no luck with us. All tickets purchased have the same fair chance of winning and this applies to all gambling regardless of where you do it. We recommend that players  set a deposit limit to stay safe, but would also recommend the same approach whenever gambling. tombola team",
  "version": "5.11.1",
  "thumbsUp": 1
 },
 {
  "userName": "Helen Landing",
  "date": "2020-04-14T12:33:47.744Z",
  "score": 5,
  "title": null,
  "text": "Great experience, it's gambling. You win some you lose some but definitely find the arcade to be better.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Turakius",
  "date": "2020-04-13T12:02:56.532Z",
  "score": 3,
  "title": null,
  "text": "Its okay. Win a decent amount but if your not careful you can get hooked and spend your winnings and not win it back.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 2
 },
 {
  "userName": "Alan Bates",
  "date": "2020-03-29T15:17:10.539Z",
  "score": 1,
  "title": null,
  "text": "How come when I lost connection for 3 minutes the game should have been over but it was waiting for me this was very weird is the game's fikst",
  "replyDate": null,
  "replyText": null,
  "version": "5.10.1",
  "thumbsUp": 5
 },
 {
  "userName": "Darren Nicholls",
  "date": "2020-04-06T00:12:31.729Z",
  "score": 1,
  "title": null,
  "text": "Don't waste your money on it same people winning all the time. Wouldn't recommend it to anyone bloody big con. Spent so much money never wins any big games absolutely rubbish .",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 18
 },
 {
  "userName": "Joao Leite",
  "date": "2020-04-07T19:16:27.224Z",
  "score": 5,
  "title": null,
  "text": "Very good app. Works fine. Nice bingo games. Withdraw money in 1 or 2 days. Recommend",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 1
 },
 {
  "userName": "Trish",
  "date": "2020-05-15T19:51:38.545Z",
  "score": 5,
  "title": null,
  "text": "Love love love oh and did I say love my tombola. Easy to navigate,no crashes so far love it",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Jeanette Nicholls",
  "date": "2020-04-06T11:03:21.912Z",
  "score": 5,
  "title": null,
  "text": "This app us great fun just keep your purse close to your chest and play sensible play with your heart not your head.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "littlewolf wolves",
  "date": "2020-05-14T20:28:24.542Z",
  "score": 5,
  "title": null,
  "text": "Absolutely love it. It's been a lucky 🍀 one for me. It's fun and rewarding and it gets a five star 🌟 🌟 🌟 🌟 🌟 from me.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Jamie Bridges",
  "date": "2020-04-12T08:51:17.250Z",
  "score": 1,
  "title": null,
  "text": "MASSIVE FIX Seems impossible to win on and seems same people always win. Noticed i aint the only one to say this",
  "replyDate": "2020-04-20T13:04:19.629Z",
  "replyText": "Hi Jamie. It is possible for any player to win more than once due to all purchases having the same fair chance. We have no way to predetermine the result or control who wins, I'm sorry to hear you have not had much luck though and wish you all the best. - tombola Team",
  "version": "5.11.1",
  "thumbsUp": 7
 },
 {
  "userName": "julie Columb",
  "date": "2020-05-12T20:00:27.405Z",
  "score": 3,
  "title": null,
  "text": "played for a couple of years play safe but lost more than won cant even win on the free one but I enjoy it every now and again",
  "replyDate": "2020-05-13T12:11:45.701Z",
  "replyText": "Thank you for your review Julie. I''m sorry to hear you have not had much luck recently, but wish you luck in any future games! tombola team",
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Julie Cleary",
  "date": "2020-04-18T21:11:10.750Z",
  "score": 5,
  "title": null,
  "text": "Good selection of game and great chat rooms with great people playing and chatting from all round the uk",
  "replyDate": "2020-04-20T11:57:32.325Z",
  "replyText": "Thank you so much for your review!",
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Wendy Gibbons",
  "date": "2020-04-24T14:11:39.844Z",
  "score": 4,
  "title": null,
  "text": "Downloaded today. Easy to register and use. And I like the spend limit option too.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 1
 },
 {
  "userName": "A Google user",
  "date": "2020-04-23T23:13:09.207Z",
  "score": 5,
  "title": null,
  "text": "Best time ever playing bingo and bobble these games have helped me get through some boring times.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Eileen e Curran",
  "date": "2020-04-13T11:41:33.888Z",
  "score": 2,
  "title": null,
  "text": "Found lot of same names win bingo even though it is random makes you not want to play and spend money",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 3
 },
 {
  "userName": "Sally Graham",
  "date": "2020-04-21T10:40:19.236Z",
  "score": 5,
  "title": null,
  "text": "Its Great! I haven't won yet but i hope i do soon! Also Its Very intense when its like 1 or 2 numbers left 😩 but overall great app recommend it👍",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "paula harvey",
  "date": "2020-04-17T03:53:26.754Z",
  "score": 5,
  "title": null,
  "text": "Easy to get through and navigate, loads great plays smooth fab layout",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Claudiu Dascalescu",
  "date": "2020-05-15T17:10:17.829Z",
  "score": 2,
  "title": null,
  "text": "Some winnings but sometime you are playing to much for a win.. I have played £ 200 without a win",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Lee Bond",
  "date": "2020-04-26T13:49:46.400Z",
  "score": 5,
  "title": null,
  "text": "Easy to install very safe and easy to use and great fun",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Adam Wolsey",
  "date": "2020-05-21T12:02:52.202Z",
  "score": 1,
  "title": null,
  "text": "Twice uninstalled and twice installed and still won't get past the welcome screen",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Colin Harley",
  "date": "2020-04-25T15:34:03.543Z",
  "score": 5,
  "title": null,
  "text": "Very easy to use And the graphics are fantastic",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Dawn Edwards",
  "date": "2020-03-27T00:12:13.667Z",
  "score": 5,
  "title": null,
  "text": "Best understanding bingo and arcade and helpfull and love the odd win too stay safe all xxxx",
  "replyDate": null,
  "replyText": null,
  "version": "5.10.1",
  "thumbsUp": 0
 },
 {
  "userName": "David Cygan",
  "date": "2020-05-07T13:11:01.662Z",
  "score": 2,
  "title": null,
  "text": "Bad I know what people will say it's gambling but the odds of actually winning are stacked against u.i put in nearly 100 quid in one day yes I think I have a problem but it was saying others were winning lots so I thought I'm in well the most I won was 4p on a 20p bet and when I did get a bonus round it gave me hardly ought. Bonus rounds are a joke. Also checking history of transactions I noticed yes you do win on the odd time but it works u always end up putting in triple what u get out",
  "replyDate": "2020-05-13T12:17:57.710Z",
  "replyText": "Hi David. Player safety is very important and making sure you stay safe. If you could call on 0800 29 888 73 our Safe play can offer advice on all aspects of gambling and options to have regarding this and keeping safe.  - tombola team",
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Donna Clay",
  "date": "2020-05-15T20:38:24.725Z",
  "score": 5,
  "title": null,
  "text": "Fun app love the arcade bit too deffo worth a look .. thumbs up from me x",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Yvo M",
  "date": "2020-04-19T03:38:05.430Z",
  "score": 2,
  "title": null,
  "text": "No doubt about tombola being fun but to win now its so hard especially if you happen to be Scottish!",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 2
 },
 {
  "userName": "Steve Daykin",
  "date": "2020-04-18T09:29:57.380Z",
  "score": 5,
  "title": null,
  "text": "Love it, best bingo app you can get! 5 stars all the way",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Veronica Galloway",
  "date": "2020-04-06T16:54:56.183Z",
  "score": 5,
  "title": null,
  "text": "Lol i never win but enjoy particpating n chatting to others, always see jackpots every few minutes, very exciting",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 },
 {
  "userName": "Adam Smith",
  "date": "2020-04-05T23:34:10.951Z",
  "score": 5,
  "title": null,
  "text": "Smooth, well set out and easy to use.",
  "replyDate": null,
  "replyText": null,
  "version": "5.11.1",
  "thumbsUp": 0
 }
]