[
 {
  "userName": "Peter Spratt",
  "date": "2020-03-07T08:22:49.317Z",
  "score": 1,
  "title": null,
  "text": "Signed up and been using it for about an hour. The slowest app I've ever seen and then tried to use website in browser and won't let me sign in. So far a very poor website and app",
  "replyDate": null,
  "replyText": null,
  "version": "1.42",
  "thumbsUp": 0
 },
 {
  "userName": "Jamie Martin",
  "date": "2019-06-02T11:10:35.468Z",
  "score": 5,
  "title": null,
  "text": "Easy set-up, the app is well laid out and easy to navigate. I primarily bet on rugby and there's a good option across league, union and sevens compared to other providers. Would like some additional markets on alternative handicaps or 2/3+ try scorers but not enough to put me off. Fairly unknown in the UK market but a quality find IMO!",
  "replyDate": "2019-06-06T07:41:09.371Z",
  "replyText": "Thank you for your review, Jamie.  We really appreciate your positive feedback and are glad that our app provided you with a positive customer experience.  We are always striving to enhance our products and services and will take your suggestions in relation to additional markets on board. We hope you continue to enjoy using the SportPesa UK app.",
  "version": "1.3.5",
  "thumbsUp": 10
 },
 {
  "userName": "Ruth Lopardo",
  "date": "2020-03-07T17:20:13.551Z",
  "score": 1,
  "title": null,
  "text": "Waste of time. Good luck even registering never mind placing a bet or getting winnings out of them. Well dodgy.",
  "replyDate": null,
  "replyText": null,
  "version": "1.42",
  "thumbsUp": 1
 },
 {
  "userName": "Steven Smith",
  "date": "2018-10-13T13:38:44.519Z",
  "score": 1,
  "title": null,
  "text": "The sports page in the app doesnt open on any device and the makers have been informed but nothing to correct the issue therefore the app is totaly useless",
  "replyDate": "2019-05-15T12:14:50.961Z",
  "replyText": "We really appreciate your feedback.  There was a problem with the app which was addressed and, since then, we have updated our app. We hope you can give our latest release a try and do please contact us at https://www.sportpesa.uk/contact-us/ with any feedback you might have.",
  "version": "1.3.2",
  "thumbsUp": 14
 },
 {
  "userName": "A Google user",
  "date": "2018-11-11T16:35:28.577Z",
  "score": 1,
  "title": null,
  "text": "DO NOT DOWNLOAD THIS APP. Bunch of crooks who do not pay out on winning bets claiming technical difficulties. Rude and unhelpful support staff. Complete waste of time. Should be closed down",
  "replyDate": null,
  "replyText": null,
  "version": "1.3.3",
  "thumbsUp": 35
 },
 {
  "userName": "Scott Parsons",
  "date": "2019-09-23T10:07:58.429Z",
  "score": 5,
  "title": null,
  "text": "Good betting app, loads quick and works well",
  "replyDate": null,
  "replyText": null,
  "version": "1.42",
  "thumbsUp": 6
 },
 {
  "userName": "Martin Collingwood",
  "date": "2019-03-11T15:41:22.806Z",
  "score": 1,
  "title": null,
  "text": "Dreadful app doesnt open, server error",
  "replyDate": "2019-05-15T12:25:57.279Z",
  "replyText": "Sorry to hear you had problems using our app. Since your review, we have updated our app and are confident that it will run smoothly on your device.  We’d really appreciate it if you’d give the app another go.  If you do experience any issues, please contact us at https://www.sportpesa.uk/contact-us/ where we will be able to assist via live chat.",
  "version": "1.3.3",
  "thumbsUp": 5
 },
 {
  "userName": "A Google user",
  "date": "2018-09-23T12:25:28.517Z",
  "score": 1,
  "title": null,
  "text": "Rubbish app does not work dont waist your time by downloading",
  "replyDate": "2019-05-15T12:34:11.195Z",
  "replyText": "We really appreciate your feedback.  There was a problem with the app which was addressed and, since then, we have updated our app. We hope you can give our latest release a try and do please contact us at www.sportpesa.uk/contact-us with any feedback you might have.",
  "version": "1.3.2",
  "thumbsUp": 14
 },
 {
  "userName": "A Google user",
  "date": "2019-02-01T10:39:48.755Z",
  "score": 1,
  "title": null,
  "text": "rubbish dont recomend it",
  "replyDate": "2019-05-15T12:29:32.870Z",
  "replyText": "We were sorry to hear that your experience of our app was not positive.  We have now released an updated version of our app and would really appreciate it if you could give it a try.  If you have any problems, our team are always on hand to assist at https://www.sportpesa.uk/contact-us.  Thank you.",
  "version": null,
  "thumbsUp": 1
 },
 {
  "userName": "A Google user",
  "date": "2019-02-05T09:19:35.360Z",
  "score": 5,
  "title": null,
  "text": "good",
  "replyDate": "2019-05-15T12:31:00.528Z",
  "replyText": "Thanks so much for your feedback.  We have updated the app since your review but if you have any suggestions on how we can improve our app experience further, we'd love to hear from you at https://www.sportpesa.uk/contact-us/",
  "version": "1.3.3",
  "thumbsUp": 9
 },
 {
  "userName": "Michael Spires",
  "date": "2018-09-01T08:24:32.228Z",
  "score": 1,
  "title": null,
  "text": "Rubbish app, hard to navigate, free bets don't work.",
  "replyDate": "2019-05-15T12:37:44.816Z",
  "replyText": "Thank you for your feedback. There was a problem with the app at the time of your review, which has been resolved. We have now updated our app, taking customers’ valued feedback on board and we would really encourage you to give it another try. If you do experience any future issues at all, don’t hesitate to  contact us at sportpesa.uk/contact-us.",
  "version": null,
  "thumbsUp": 3
 }
]