[
 {
  "userName": "Luke Carlisle",
  "date": "2020-05-20T14:50:12.740Z",
  "score": 5,
  "title": null,
  "text": "It's brilliant they pay often and the app is easy to navigate. Just don't use it if you come into a lot of money when you're in a bad place because you'll lose a lot; Which is only logical because they are a business and they can't be paying out massive amounts all the time. I set limits and it really keeps it fun.",
  "replyDate": "2020-05-20T21:14:53.186Z",
  "replyText": "Hi Luke, thank you for your review and massive 5 star rating! It's great to hear you've had a lucky run - making some withdrawals of winnings, fab! We're also delighted to hear of your ease when navigating our App and that you place smart bets and only spend what you're comfy with. 👍 We hope you continue to have fun and spend wisely.",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Dean Jones",
  "date": "2020-05-27T09:51:01.925Z",
  "score": 5,
  "title": null,
  "text": "Great app. Easy deposit and withdraw. Win a bit lose a bit. That's the game. Loads of different games to play and promotions are good too",
  "replyDate": "2020-05-27T15:57:41.630Z",
  "replyText": "Thanks for your wonderful feedback and 5* review Dean! We're so pleased to hear that you have found it easy to navigate around the site and enjoy the variety of games and promotions.",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Lauraine Hannah",
  "date": "2020-05-29T17:04:35.879Z",
  "score": 5,
  "title": null,
  "text": "Jpj makes me feel right at home, feel part of the furniture 😌 friendly staff, good choice of games ,and plenty of promotions to take part in. All the joys of being Jackpotjoy.",
  "replyDate": "2020-05-29T20:03:38.947Z",
  "replyText": "Hi Lauraine, thank you so much for that lovely review and 5 star rating! It's so wonderful to hear you feel so comfortable with us and that you're having a great time on our selection of games and promotions. We're glad our Support Team are looking after you; especially during these concerning times. All the joys of being Jackpotjoy - Love it! 💙",
  "version": "11.26.0",
  "thumbsUp": 0
 },
 {
  "userName": "Sammyjo Heath",
  "date": "2020-05-29T08:42:21.933Z",
  "score": 5,
  "title": null,
  "text": "This game is great played it everyday always won money and gone in bank within 2days. The free games are good aswell free spins on slots.",
  "replyDate": "2020-05-29T13:00:49.839Z",
  "replyText": "Hey Sammyjo, thanks for the fabulous review, great to hear you're getting your lovely winnings through so quickly! Enjoy!",
  "version": "11.26.0",
  "thumbsUp": 0
 },
 {
  "userName": "Kevin Hornsby",
  "date": "2020-04-25T20:08:51.275Z",
  "score": 5,
  "title": null,
  "text": "Look forward when they put the new slots, play on them as soon as they arrive, during this crises this is what you need a bit of fun and winning money with the slots and casino they are a good team that look after you,like playing the free picks each night, the graphics and bonuses to the slot machines are the best, can be addictive, just spend what you can afford, the jackpot are quite big if you win them. My company I work for isn't doing well so I hope t can make lots of money to keep me goin",
  "replyDate": "2020-04-26T04:09:59.776Z",
  "replyText": "Hi Kevin, thank you so much for that wonderful review and lovely 5 star rating! We're delighted to hear you've had a great time with us on our selection of Slot games and our Support Team are looking after you; especially during these concerning times. Remember to always place smart bets and only spend what you're comfy with. Stay safe. 💜",
  "version": "11.22.0",
  "thumbsUp": 3
 },
 {
  "userName": "Jay Dunn",
  "date": "2020-05-11T15:32:25.199Z",
  "score": 5,
  "title": null,
  "text": "Best online slots by far never won so much money in my life. definitely better then williamhill , skyvegas and ladbrokes!!!",
  "replyDate": "2020-05-11T21:07:56.912Z",
  "replyText": "Oh wow Jay!! That's wonderful to hear you've been so lucky, what a brilliant result. We hope you're going to treat yourself to something nice and thanks for that awesome review and 5 star rating! 🤩🎉",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Emma Louise",
  "date": "2020-05-21T16:17:36.108Z",
  "score": 1,
  "title": null,
  "text": "Terrible app, forever freezing and then crashing, it froze and logged me out now I can't get back on",
  "replyDate": "2020-05-21T19:34:36.941Z",
  "replyText": "Hi Emma, around the time you left the review we were having problems with the site, we're sorry to hear you were affected by this, but the site were back up and running at around 6pm. If you are still having trouble logging in, be sure to pop over to our Customer Support team and they will be able to help you further.",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Steph Brookes",
  "date": "2020-05-14T20:26:24.125Z",
  "score": 1,
  "title": null,
  "text": "I have lost out on my free spins several times due to loss of connection",
  "replyDate": "2020-05-14T20:54:31.671Z",
  "replyText": "Hi Steph, and thanks for your review. So we can look into the error you are facing, please take a screenshot of the error message you are receiving and contact our Customer Support Team who will be able to look into it further for you.",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Kelly Jones",
  "date": "2020-05-23T11:39:25.883Z",
  "score": 5,
  "title": null,
  "text": "I love jackpotjoy I think it's the excellent experience games to play I even refer my friend to play and she absolutely loves it",
  "replyDate": "2020-05-19T21:08:49.761Z",
  "replyText": "Hi Kelly, thanks so much for taking the time to review our App and give us a that great big 5 star rating! We hope you continue to enjoy your time with us. 🥰",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Glenn Elliman",
  "date": "2020-05-06T23:09:30.623Z",
  "score": 2,
  "title": null,
  "text": "Since update buggy and 404 pages everywhere. Usually brilliant",
  "replyDate": "2020-05-07T22:34:34.964Z",
  "replyText": "We're sorry to hear that things have been a little buggy for you Glenn. This will be due to the site downtime in the early hours and should be fully resolved now. If you experience any further difficulties, just give us a shout and we'll be happy to help. https://help.jackpotjoy.com/hc/en-gb/articles/360010013420-Contact-Us",
  "version": "11.24.0",
  "thumbsUp": 0
 },
 {
  "userName": "gabriela Kissova",
  "date": "2020-05-15T14:40:18.526Z",
  "score": 4,
  "title": null,
  "text": "I like this site but haven't been lucky enough yet to win any box bonanza bonus game. Well maybe one day luck will be on my site too lol x",
  "replyDate": "2020-05-15T20:45:21.954Z",
  "replyText": "Hey Gabriela, and thank you for your review and rating. It's great to hear you are enjoying the app so much, and we hope that your luck improves soon. We will keep our fingers crossed that you get a Box Bonanza soon too!",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Miss Kelly Eileen Hilton Ford",
  "date": "2020-04-18T10:26:20.900Z",
  "score": 5,
  "title": null,
  "text": "I Joined yesterday and wagered my 30 spins, an started winning on some of the games I was shocked because usually on other sites I've been on hardly won, this an one other I'm on are best sites to play an win on, from my 10 deposit I withdrew £25 an still have just under 16 quid on it I'm so happy thanks so much for this site. It's so much better than foxy, heart etc",
  "replyDate": "2020-04-18T22:37:59.972Z",
  "replyText": "Thanks for that awesome review and wonderful 5 star rating Kelly! Welcome to our App, it's great to hear you're enjoying your games with us and it's brilliant you've had some lucky winnings already, a big congratulations there! We hope our App is the luckiest one for you! 😊",
  "version": "11.22.0",
  "thumbsUp": 3
 },
 {
  "userName": "Dean Baxter",
  "date": "2020-04-28T20:31:12.769Z",
  "score": 5,
  "title": null,
  "text": "Never won big but enjoyable as long as you don't spend to much and set a limit.. But it's a fun game when you don't want to leave your home you can just have a few games on here",
  "replyDate": "2020-04-28T21:40:37.901Z",
  "replyText": "Hi Dean, and thank you for your review and rating. It's great to hear that you are enjoying the app so much and that you are doing so responsibly. We hope you keep having fun!",
  "version": "11.22.0",
  "thumbsUp": 1
 },
 {
  "userName": "Sophie Knight",
  "date": "2020-04-22T11:58:14.240Z",
  "score": 3,
  "title": null,
  "text": "It's a great game I only started playing cause a friend of mine just keeps winning over 100 a day on it but I clearly have no luck cause I've just keep winning the proxy 20p😂😂but it gets me through the isolation",
  "replyDate": "2020-04-22T15:02:42.993Z",
  "replyText": "Hi Sophie, thank you taking the leave a review. We are sorry you aren't having the luckiest experience on the App at the moment, fingers crossed this changes for you soon! Good luck & stay safe.",
  "version": "11.22.0",
  "thumbsUp": 2
 },
 {
  "userName": "Kelvin Lancaster",
  "date": "2020-05-17T02:23:39.486Z",
  "score": 1,
  "title": null,
  "text": "Total rubbish, cons you in with free spins but pays out very little, stay away",
  "replyDate": "2020-05-17T03:42:34.169Z",
  "replyText": "Hi Kelvin, and thank you for your review. All of our games are tested internally and externally to ensure they pay pout at the rate they are advertised at. Please note, this return isn't per member, but across all members based on thousands of wagers.",
  "version": "11.25.0",
  "thumbsUp": 1
 },
 {
  "userName": "Gavin Vinson",
  "date": "2020-05-07T21:32:44.737Z",
  "score": 5,
  "title": null,
  "text": "Very good to play And so many different games to play which is very fun",
  "replyDate": "2020-05-07T21:52:39.214Z",
  "replyText": "Thanks for the lovely feedback and 5* review Gavin, greatly appreciated. Keep on having fun!",
  "version": "11.24.0",
  "thumbsUp": 0
 },
 {
  "userName": "Joel Sinclair",
  "date": "2020-04-14T17:36:02.330Z",
  "score": 4,
  "title": null,
  "text": "Excellent game safe an secure , winnings not bad , unfortunately takes a lot to win on bingo , but better than most games out there",
  "replyDate": "2020-04-14T19:47:41.154Z",
  "replyText": "Hi Joel. We appreciate you taking the time to leave your review. It's lovely to know that you are liking the App and it's features too. We wish you the very best of luck during your games and hope to see some big wins for you too!",
  "version": "11.22.0",
  "thumbsUp": 1
 },
 {
  "userName": "Joanne Crosier",
  "date": "2020-05-15T04:42:18.630Z",
  "score": 5,
  "title": null,
  "text": "Good fun, easy to use and Quick pay out 👍",
  "replyDate": "2020-05-15T06:57:29.933Z",
  "replyText": "Hi Joanne, and thank you for your review and rating.\n\nIt's great to hear that you are enjoying the app so much, and you are happy with our withdrawal timescales, we hope that it continues for a long time to come 😃",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "its-_- -_-lockie",
  "date": "2020-04-26T17:55:39.278Z",
  "score": 5,
  "title": null,
  "text": "didnt really win much put on £30 and was gone pretty quick but i suppose its the gamble you take apart from that is a bit glitchy but overall good app",
  "replyDate": "2020-04-26T19:09:12.564Z",
  "replyText": "Thanks for your review today, we really appreciate that. Please do contact us if you feel that the App is still glitchy and we will be happy to discuss anything that will help to stop that. You are more than welcome to  contact us from the following link: https://help.jackpotjoy.com/hc/en-gb/articles/360010013420-Contact-Us",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "Louise Mcgrath",
  "date": "2020-04-15T22:10:35.146Z",
  "score": 5,
  "title": null,
  "text": "Fun to play, easy to talk to hosts, also the betting limits are easy to see",
  "replyDate": "2020-04-15T22:56:24.987Z",
  "replyText": "Thanks for the 5 star review Louise, it's great to hear your enjoying the app!",
  "version": "11.22.0",
  "thumbsUp": 1
 },
 {
  "userName": "James Paterson",
  "date": "2020-04-18T21:23:03.433Z",
  "score": 4,
  "title": null,
  "text": "Fun to play and penny bingo means you can play for ages without spending a lot of money.",
  "replyDate": "2020-04-18T23:11:01.660Z",
  "replyText": "Hi James, thank you so much for that wonderful review and rating! We're delighted to hear you've had a great time with us on your Bingo games, and that you're placing smart bets; by enjoying a longer game play from penny games. 😎",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "Tracey Shipman",
  "date": "2020-05-02T03:43:47.493Z",
  "score": 5,
  "title": null,
  "text": "I love this site makes things clear and wonderful respect for staff very helpful I have told friends and family who play other games to try jpj they have and have had wonderful cash prizes and made friends from every corner of the world with this lock down even if u do t deposit u can still have friends to talk with thank you jpj. Xxx",
  "replyDate": "2020-05-02T14:48:34.660Z",
  "replyText": "Thanks for the wonderful review Tracey, it's great to hear you've been recommending us and enjoying the chat rooms too!",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "Natasha Challacombe",
  "date": "2020-04-10T23:26:52.986Z",
  "score": 5,
  "title": null,
  "text": "I love this site, you cant win them all so bare that in mind! Had a lovely Christmas surprise from the VIP team... and I have had plenty of Box Bonanza's too 😉👍❤",
  "replyDate": "2020-04-11T06:35:46.498Z",
  "replyText": "Aw thanks for the love Natasha! We appreciate you leaving us such a lovely review and 5 star rating. It's sounds like you're on the ball with how gambling works, and it's wonderful to hear you've enjoyed some fabulous treats and lucky rewards from us too! :)",
  "version": "11.20.0",
  "thumbsUp": 0
 },
 {
  "userName": "Karan Lovell",
  "date": "2020-05-11T22:14:39.764Z",
  "score": 5,
  "title": null,
  "text": "Quick and easy to use. Brilliant app",
  "replyDate": "2020-05-12T06:04:00.428Z",
  "replyText": "Hi Karan, it's great to hear you got up and running easily and quickly and that you're enjoying our App! We really appreciate your lovely feedback and brilliant 5 star rating - Thanks! 😊",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Richard Hogarth",
  "date": "2020-04-18T20:08:49.195Z",
  "score": 5,
  "title": null,
  "text": "I have download many of sites. And I have to say this is the best site I have played on in 5years great games and fast pay outs well done Jackpotjoy. 🤑",
  "replyDate": "2020-04-18T23:01:17.598Z",
  "replyText": "Wow, that's some high praise there Richard and we greatly appreciate it. Thanks for taking the time to give us a review and wicked 5 star rating! We'll keep our fingers crossed for some more lucky winnings for you! 🤞🍀",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "Gemma Hughes",
  "date": "2020-04-03T22:47:57.626Z",
  "score": 4,
  "title": null,
  "text": "Love the game and have won abit during my time playing. I'm just curious what the statistics are for the Scratchcard Shop game 'Whole Lotta Luck' has anyone won the Jackpot of £800 or even the £200 in one single go? 😁😁",
  "replyDate": "2020-04-04T00:02:37.425Z",
  "replyText": "Thanks for that review and rating Gemma! It's great to hear you're enjoying your games and that you've had some winnings! The Scratch Card Shop has prizes of up to £30,000 on offer, and Jackpots have been won on a single go, to see statistics for the game click here: https://www.jackpotjoy.com/category/instants?game-info=play-scratchcard-shop",
  "version": "11.20.0",
  "thumbsUp": 1
 },
 {
  "userName": "Kellymarie Conway",
  "date": "2020-04-05T23:02:09.535Z",
  "score": 5,
  "title": null,
  "text": "Easy to deposit, friendly bingo rooms, enjoyable all round.",
  "replyDate": "2020-04-06T00:46:00.252Z",
  "replyText": "Thanks for the fab review Kellymarie, it's great to hear you're enjoying the app and all it offers!",
  "version": "11.20.0",
  "thumbsUp": 1
 },
 {
  "userName": "Lee Collis",
  "date": "2020-04-17T16:29:51.492Z",
  "score": 5,
  "title": null,
  "text": "Good app with reasonable promotions just wish there where more promotions you actually get a bigger chance of receiving when entered.",
  "replyDate": "2020-04-17T21:17:03.341Z",
  "replyText": "Hi Lee, thanks for your review and huge 5 star rating! We're delighted to hear you're enjoying our App and promotions, you can always find something to enjoy by hitting up our promotions page on or clicking here: https://www.jackpotjoy.com/promotions - The Big Night In promotion is running all today with loads of chances to win! ✨",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "James Knowles",
  "date": "2020-05-11T20:55:54.824Z",
  "score": 5,
  "title": null,
  "text": "Great site especially blox bingo 😀 any chance of a box bonanza plz or bonus credit 🤞( jamesnotts1) me 2 😀🤞",
  "replyDate": "2020-05-11T20:49:11.838Z",
  "replyText": "You never know James!! You might just be lucky enough to have a box or a bonus pop up on your account, we certainly hope so! 🍀🤞",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Dean Samson",
  "date": "2020-04-11T13:58:47.102Z",
  "score": 4,
  "title": null,
  "text": "Very good site and if you win your not waiting long for it to clear 👍👍",
  "replyDate": "2020-04-11T14:24:58.824Z",
  "replyText": "Thanks for the great feedback Dean, congratulations on your winnings, we hope you enjoy them!",
  "version": "11.20.0",
  "thumbsUp": 0
 },
 {
  "userName": "Paula Johnston",
  "date": "2020-04-25T17:12:24.567Z",
  "score": 3,
  "title": null,
  "text": "Have had difficulty getting logged on on numerous occasions unfortunately.",
  "replyDate": "2020-04-25T19:52:33.150Z",
  "replyText": "Hi Paula, thank you for your review and rating. We're sorry to hear you've had difficulty getting logged on, to ensure you can get back on please do contact our friendly Customer Support Team by clicking here: https://help.jackpotjoy.com/hc/en-gb/articles/360010013420-Contact-Us or calling us free on: 0800 458 0770",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "Susan",
  "date": "2020-05-04T00:19:40.746Z",
  "score": 5,
  "title": null,
  "text": "New layout is innovative and easy to use.",
  "replyDate": "2020-05-04T07:58:39.806Z",
  "replyText": "Hi Susan, thank you so much for your review and whopping 5 star rating. It's great to hear of your ease when navigating our App and we wish you all the best of luck on your games! 🍀",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "Steve Crick",
  "date": "2020-04-30T21:27:27.875Z",
  "score": 5,
  "title": null,
  "text": "Good app great games. Has good tools for responsible gambling too😁",
  "replyDate": "2020-05-01T09:48:39.922Z",
  "replyText": "Hi Steve, thanks for the fab review, it's great to see you're enjoying the app and know where to find our responsible gaming tools.",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "Leigh Longmuir",
  "date": "2020-05-09T00:24:35.804Z",
  "score": 3,
  "title": null,
  "text": "Great for chat. But not so good for winning money.",
  "replyDate": "2020-05-09T07:13:12.250Z",
  "replyText": "Hi Leigh, and thank you for your review. It's great to hear you're involved with the chat, and hope that you are having fun with everyone else. We also hope your luck improves soon and you are able to make a fantastic withdrawal!",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Nick",
  "date": "2020-04-06T17:56:42.515Z",
  "score": 2,
  "title": null,
  "text": "Games always freeze wait an hour to speak to representatives to get absolutely nowhere.very poor",
  "replyDate": "2020-04-06T19:58:37.382Z",
  "replyText": "Hi Nick. Thanks for your review. We are happy to learn that you are enjoying the App. If you ever have any need for technical support pop us a quick call and we can help you right away. The advice we give will fix the issues you experience.",
  "version": "11.20.0",
  "thumbsUp": 0
 },
 {
  "userName": "lynn ridgley",
  "date": "2020-04-29T15:08:03.231Z",
  "score": 5,
  "title": null,
  "text": "Fun and you can go on chat to other members.",
  "replyDate": "2020-04-29T21:35:50.690Z",
  "replyText": "Hi Lynn, and thank you for your review and rating. It's great to hear you are enjoying the app so much, and we hope that we see you back on it soon!",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "Kirsty Spence",
  "date": "2020-04-16T15:22:47.626Z",
  "score": 5,
  "title": null,
  "text": "Well I love this site. A few small wins here and there, went on fortune 88 megaways the other day while in the car thinking as always I'm not gonna win big.... A few spins went by and I ended up winning over 1k on a 2.64 bet I was astonished thank you Jackpotjoy",
  "replyDate": "2020-04-16T21:55:08.850Z",
  "replyText": "Aw thanks for the love Kirsty! We appreciate that awesome review and whopping 5 star rating. It's great to hear you are enjoying your games with us and WOW what an AMAZING result for you on 88 Fortunes Megaways, a big congratulations there!! We hope your good 'Fortune' continues! :)",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "K H",
  "date": "2020-04-10T23:12:45.396Z",
  "score": 5,
  "title": null,
  "text": "Very good played on and off for years jackpot joy is amazing",
  "replyDate": "2020-04-11T05:41:48.294Z",
  "replyText": "Hi K H, we appreciate you leaving us a lovely review and huge 5 star rating! We really do appreciate your years of loyalty and are delighted to hear you're enjoying our App! :)",
  "version": "11.20.0",
  "thumbsUp": 0
 },
 {
  "userName": "Claire Fielding",
  "date": "2020-04-15T13:28:34.774Z",
  "score": 5,
  "title": null,
  "text": "Great games. Easy to navigate",
  "replyDate": "2020-04-15T23:40:33.772Z",
  "replyText": "Thanks for your review Claire, it's great you're finding the app easy!",
  "version": "11.22.0",
  "thumbsUp": 0
 },
 {
  "userName": "iBxon",
  "date": "2020-05-11T20:04:03.231Z",
  "score": 5,
  "title": null,
  "text": "Love 1p bingo and slots",
  "replyDate": "2020-05-11T21:13:35.640Z",
  "replyText": "Great stuff iBxon! We're delighted you've found some games you really enjoy playing, and fingers crossed you strike it lucky on some! 🤞",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Sascha Reissner",
  "date": "2020-03-06T09:39:47.393Z",
  "score": 4,
  "title": null,
  "text": "Tikki island bonus games are not paying out as they should something wrong with the bonus calculations have emailed you ages ago twice but no answer, really? The bonus defaults at 1x8 and the game then stops and I cannot proceed. Must log out and then in again.",
  "replyDate": "2019-11-23T20:37:28.714Z",
  "replyText": "Hi Sascha, we regret to hear that you're having issues with this particular game. Rest assured, we'll be more than happy to look in to this for you. We kindly ask that you allow up to 24 hours for an email response but you can always call us on 0800 458 0770 instead, or using our Live Chat facility.",
  "version": "11.19.1",
  "thumbsUp": 7
 },
 {
  "userName": "Kevin Hornsby",
  "date": "2020-02-14T12:05:52.810Z",
  "score": 5,
  "title": null,
  "text": "Excellent games I could play them for hours there is too many to choose from but I am trying them all out and if you are lucky to win you have no problem if you want to withdraw some they are very helpful with any problems you have. And you get free games each day something to look forward to it is like having your own arcade on your tablet, I give jackpot joy 100 percent.",
  "replyDate": "2020-02-15T15:34:41.571Z",
  "replyText": "Thanks for the great review Kevin, we're glad you're loving the site. Don't forget to take breaks when you play though :)",
  "version": "11.19.0",
  "thumbsUp": 6
 },
 {
  "userName": "Elsa Marti",
  "date": "2020-05-16T06:23:58.795Z",
  "score": 2,
  "title": null,
  "text": "Machine took a lot of money from me know satisfied takes takes but it doesn't pay ìm very sad",
  "replyDate": "2020-05-16T06:39:13.510Z",
  "replyText": "Hi Elsa, and thank you for your review. We are a little bit concerned by your comments, so please contact our Customer Support Team when you can to discuss these comments in full.",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "Nathan Tempest",
  "date": "2020-03-06T07:53:19.255Z",
  "score": 5,
  "title": null,
  "text": "So far, wins far exceed my deposits so I'm impressed and the slots are decent. As for the app, its crashed about 3 times so a little unstable considering I've only had it a few hours..",
  "replyDate": "2020-03-07T07:14:53.323Z",
  "replyText": "Following on from our previous message to address the App crashing for you. This often happens if there is a build up of data on the device or connection drops. If you're using a mobile device please connect to your WiFi after resetting this for 10 minutes and reinstall the App.",
  "version": "11.19.1",
  "thumbsUp": 1
 },
 {
  "userName": "kymberley khalsa",
  "date": "2020-01-30T18:49:59.599Z",
  "score": 1,
  "title": null,
  "text": "I play alot of slot sky virgin William hill to name a few this o e is t great alot of money spent no return ...I would mind I I was paying for the play experience as I enjoy it but you dont even get much of a play from 20p spins to £1 spins gone withing minutes...sent me a notification saying try our new game thought I'd have a quick 10 pound gone less that 3 mins at 50p per spin it never went above £10.25p then took the lot ...id give this a wide birth if your looking to explore slots",
  "replyDate": "2020-01-30T23:01:12.773Z",
  "replyText": "Hi Kymberley, thanks for your review. Sadly, we can’t guarantee wins and that you'll be lucky every time, but we hope that you would be! As all games run through a Random Number Generator this ensures that every spin is unique/fair, and each wager placed has the same chance to win. We'll cross our fingers your luck improves and the games are kinder",
  "version": "11.18.0",
  "thumbsUp": 3
 },
 {
  "userName": "Jo Richards",
  "date": "2020-02-22T21:01:07.380Z",
  "score": 2,
  "title": null,
  "text": "I dont like having to scroll through loads of games to locate my favourites - i shd be able to save my favourites for easier access. Also shd be able to make further deposits whilst still in the games & not have to go back to Home to make a deposit & then have to go find my game again to continue playing!",
  "replyDate": "2020-02-23T01:10:55.330Z",
  "replyText": "Hi Jo, thanks for your review and rating. Don't worry, if you know the name of the game you want to play; type it in the search bar within Jackpotjoy and it will take you there, (the little magnifying glass at the top right) no more scrolling! Also you can most certainly deposit in game, click the three dots in the bottom left and click 'Deposit'.",
  "version": "11.19.0",
  "thumbsUp": 3
 },
 {
  "userName": "carole denney",
  "date": "2020-01-12T01:47:44.884Z",
  "score": 1,
  "title": null,
  "text": "The daily games are rubbish as you're lucky to get 5 free spins. Slots don't pay out like they used to & i think the settings have been changed to lower pay outs. I've spent absolute 1000s on literally every site & not one withdrawal.",
  "replyDate": "2020-01-12T05:45:41.491Z",
  "replyText": "Hi Carole, thanks for your review. Don't worry as all our games run through a Random Number Generator this ensures that every spin is independent, unique and fair, and each wager placed has the same chance to win. We'll keep our fingers crossed your luck improves soon and the Daily Free Games are kinder!",
  "version": "11.16.1",
  "thumbsUp": 5
 },
 {
  "userName": "Alexis Stott",
  "date": "2020-03-12T21:04:58.785Z",
  "score": 3,
  "title": null,
  "text": "Apps good games good and rewards for regular players are good just think wins could be more often and more substantial better rewards for long standing players",
  "replyDate": "2020-03-12T22:03:09.123Z",
  "replyText": "Hi Alexis, and thank you for your review. To ensure fairness, we use an industry certified random number generator. This means you can always be assured of fair gameplay whenever you are on the app. We also have a loyalty structure, so if you ever became eligible for a bonus then we would be straight in touch!",
  "version": "11.19.1",
  "thumbsUp": 0
 },
 {
  "userName": "Jason Mc Minn",
  "date": "2020-05-17T00:36:19.201Z",
  "score": 3,
  "title": null,
  "text": "Keeps freezing and going off",
  "replyDate": "2020-05-17T03:39:26.395Z",
  "replyText": "Hi Jason, and thank you for your review. Can you kindly please uninstall and then reinstall the app. Should this continue to happen, please note the exact time it happens and contact our Customer Support Team.",
  "version": "11.25.0",
  "thumbsUp": 0
 },
 {
  "userName": "bert smith",
  "date": "2020-03-29T10:11:03.328Z",
  "score": 5,
  "title": null,
  "text": "Easy to use and good fun",
  "replyDate": "2020-03-30T03:30:38.728Z",
  "replyText": "Hi Bert, and thank you for your review and rating. It's great to hear that you are enjoying the app and hope that it continues for a long time to come :)",
  "version": "11.20.0",
  "thumbsUp": 0
 }
]