[
 {
  "userName": "Relu Bolboceanu",
  "date": "2020-05-23T09:28:19.833Z",
  "score": 1,
  "title": null,
  "text": "I have spent on FI, 3 months. Covid-19 came and no football anymore. All players lost from they value excepting Sancho(british) and on media rankings from 7 days, 5 was exclusive for man united...which is weird because no football. For example, van Dijk which is the best defender in the world at this moment and is playing for the best team from Europe at this moment (Liverpool) has decreasing by 0.26pi/share. Pure gambling!",
  "replyDate": null,
  "replyText": null,
  "version": "4.18.0",
  "thumbsUp": 0
 },
 {
  "userName": "David Willis",
  "date": "2020-05-24T07:29:31.560Z",
  "score": 5,
  "title": null,
  "text": "Been trading for 3 months and I'm totally hooked. As a gambler I was seeing very little return but with football index I'm just sat back watching my money grow £££'s. Even with barely football on at the minute due to covid-19 the value of players are still soaring and the product is going from strength to strength!",
  "replyDate": null,
  "replyText": null,
  "version": "4.18.0",
  "thumbsUp": 4
 },
 {
  "userName": "Steve W",
  "date": "2020-05-22T18:00:25.447Z",
  "score": 3,
  "title": null,
  "text": "The app itself is pretty good, though I know some features I've seen other people have aren't on the app for some reason. The only gripe I have with the app is that pretty much every time I open it up I have to enter my security code. Although this is obviously good for security, it's very annoying when I have to enter it even though I was on the app 10 seconds before. The whole platform is enjoyable but also quite frustrating, but there is definitely money to be made if you know your stuff.",
  "replyDate": null,
  "replyText": null,
  "version": "4.18.0",
  "thumbsUp": 2
 },
 {
  "userName": "Tony Duffy",
  "date": "2020-05-22T15:46:49.215Z",
  "score": 1,
  "title": null,
  "text": "Seemed like a good idea at first , but the longer I spend on it , the more I realise all its designed to do is strip you of your cash , such a massive margin between the buy and sell price makes it almost impossible to make money, and they take a commission when you sell .... DO NOT USE RIP OFF",
  "replyDate": null,
  "replyText": null,
  "version": "4.18.0",
  "thumbsUp": 5
 },
 {
  "userName": "James Careless",
  "date": "2020-05-08T19:11:20.653Z",
  "score": 5,
  "title": null,
  "text": "This App is amazing, I always thought it was a scam. I've always been interested in stocks and share. This is simple, loads of YouTube tips as well, the media dividends payout daily as well. I can't recommend this enough, make sure you get your mate to recommend you and do it quickly. They even give you both a tenner when you stake a tenner or more, making it risk free or you even make money for trying it. Thanks F. I, keep it up and can't wait to earn some more monies.",
  "replyDate": null,
  "replyText": null,
  "version": "4.15.1",
  "thumbsUp": 16
 },
 {
  "userName": "Steve Roberts",
  "date": "2020-05-22T05:56:06.390Z",
  "score": 5,
  "title": null,
  "text": "Lots of misinformation in previous reviews, first of all you don't instantly lose half your money that is the \"cash out now\" price you can sell to market for the current value. If you want you use FI use the academy first before investing money this will show you how to properly use the product. Also start small don't spend big till you know what's happening and how the market works",
  "replyDate": null,
  "replyText": null,
  "version": "4.16.0",
  "thumbsUp": 1
 },
 {
  "userName": "David Norvell",
  "date": "2020-05-20T05:18:10.347Z",
  "score": 1,
  "title": null,
  "text": "Scam - This poor attempt at replicating the finance market is a money vacuum. 1 example is selling your players. You can add a sale order and wait for some stranger to buy your players share or instantantly sell for half the value (you lose half your money). While this is bad, the function has been unavailable for over 1 month in an attempt to keep your money stored with them. It reminds me of a pyramid scheme structure ... Invest in the real economy, not this poor attempt.",
  "replyDate": null,
  "replyText": null,
  "version": "4.16.0",
  "thumbsUp": 9
 },
 {
  "userName": "Tom Rowe",
  "date": "2020-04-11T13:05:48.942Z",
  "score": 4,
  "title": null,
  "text": "Great user interface, simple to use. Much easier than having to log in to the website every time you want to check your port or make a trade. Wish it told you how long you had each share so you could plan to exit before the 3 years. Some options to filter on transaction history would be good too",
  "replyDate": null,
  "replyText": null,
  "version": "4.14.0",
  "thumbsUp": 2
 },
 {
  "userName": "Harry Brown",
  "date": "2020-05-15T10:23:28.913Z",
  "score": 5,
  "title": null,
  "text": "Great platform. Always has improvements coming through. Watchlist has been added after it was requested, but easier access to the forums is still needed, so can upgrade the app from 4 stars to 5",
  "replyDate": null,
  "replyText": null,
  "version": "4.16.0",
  "thumbsUp": 0
 },
 {
  "userName": "David Tainsh",
  "date": "2020-05-22T15:18:09.740Z",
  "score": 5,
  "title": null,
  "text": "Great Concept - I really enjoy playing FootBall Index. It is a great concept and totally unique. I guess if you were really football savvy you could probably make a fortune from it.",
  "replyDate": null,
  "replyText": null,
  "version": "4.16.0",
  "thumbsUp": 0
 },
 {
  "userName": "Kieron Hinds",
  "date": "2020-04-28T00:15:27.401Z",
  "score": 5,
  "title": null,
  "text": "A good long term investment. Better than money sat in your bank. The more people investing on the app, the better portfolio increase you gain. My portfolio value has boomed even with no football matches been played! Have a lot of trust in this company to continue its growth seeing how they have been able to continue the FI growing in these times! 100% recommend",
  "replyDate": null,
  "replyText": null,
  "version": "4.15.1",
  "thumbsUp": 16
 },
 {
  "userName": "Daniel Driver",
  "date": "2020-05-22T15:54:43.660Z",
  "score": 5,
  "title": null,
  "text": "Fantastic app! 100% legit. Been on over a year now and have over 25% profit! Definelty recommend!",
  "replyDate": null,
  "replyText": null,
  "version": "4.18.0",
  "thumbsUp": 0
 },
 {
  "userName": "James Fosberry",
  "date": "2020-04-25T05:36:28.531Z",
  "score": 5,
  "title": null,
  "text": "Brilliant app, use small amount of money at first and understand how the product works. Once you got the basics and understand the mechanism, can start adding more to the portfolio and start reaping rewards.",
  "replyDate": null,
  "replyText": null,
  "version": "4.15.1",
  "thumbsUp": 2
 },
 {
  "userName": "Jonathan Joseph",
  "date": "2020-05-22T15:34:18.394Z",
  "score": 5,
  "title": null,
  "text": "No longer using traditional betting sites. Been using this FI for over 4 years. The development has been fantastic. A must for FPL and FM fans, you'll do great.",
  "replyDate": null,
  "replyText": null,
  "version": "4.16.0",
  "thumbsUp": 0
 },
 {
  "userName": "James W",
  "date": "2020-04-08T13:26:21.274Z",
  "score": 5,
  "title": null,
  "text": "I'm a fan! It's a lot like any old trading platform, you have to know what you're doing or be prepared to take a mean loss. The more you contribute, the more we all make!!!",
  "replyDate": null,
  "replyText": null,
  "version": "4.14.0",
  "thumbsUp": 1
 },
 {
  "userName": "Aaron Palace",
  "date": "2020-04-13T10:11:32.350Z",
  "score": 5,
  "title": null,
  "text": "The future of gambling in my opinion. The app works well and is easy to navigate. Onwards and upwards for this product over the next ten years I reckon.",
  "replyDate": null,
  "replyText": null,
  "version": "4.14.0",
  "thumbsUp": 0
 },
 {
  "userName": "Michael H",
  "date": "2020-03-14T18:35:34.540Z",
  "score": 1,
  "title": null,
  "text": "Don't believe the hype! Very poor depth to this. Players who are very highly rated in the English championship are not found within the database of players. Very disappointing. Will not spend anymore cash on investments here!",
  "replyDate": null,
  "replyText": null,
  "version": "4.13.0",
  "thumbsUp": 3
 },
 {
  "userName": "Quentin Cake",
  "date": "2020-04-14T11:42:28.105Z",
  "score": 5,
  "title": null,
  "text": "Awesome platform and app. Once you start you'll never want to stop. Only gamble what you can afford to lose 👍🏼",
  "replyDate": null,
  "replyText": null,
  "version": "4.14.0",
  "thumbsUp": 0
 },
 {
  "userName": "Tóth Tünde",
  "date": "2020-04-25T23:04:40.630Z",
  "score": 1,
  "title": null,
  "text": "I have requested my deposit within 7 days as it was in the offer but I did not get it back. I will change my rating if I get it back. Until then it feels like a scam 3 days later still nobody contacted me regarding my request. Don't sign up it's a scam.",
  "replyDate": null,
  "replyText": null,
  "version": "4.15.1",
  "thumbsUp": 2
 },
 {
  "userName": "James Barrie",
  "date": "2020-05-22T15:11:18.416Z",
  "score": 4,
  "title": null,
  "text": "Decent app but lacks in depth player stats (web browser does have this)",
  "replyDate": null,
  "replyText": null,
  "version": "4.16.0",
  "thumbsUp": 0
 },
 {
  "userName": "Michael Yeouart",
  "date": "2020-04-13T12:48:18.390Z",
  "score": 3,
  "title": null,
  "text": "Selling is a joke. Good for testing your football knowledge but what's the point in buying a sancho when his sell on is lower despite increasing in price... need to sort this. Otherwise good knowledge test on up and coming stars.",
  "replyDate": null,
  "replyText": null,
  "version": "4.14.0",
  "thumbsUp": 0
 },
 {
  "userName": "Nordic Viking",
  "date": "2020-04-07T10:27:49.983Z",
  "score": 4,
  "title": null,
  "text": "Honest reliable and secure gambling platform but very slow to make money no problem with crashes on app",
  "replyDate": null,
  "replyText": null,
  "version": "4.14.0",
  "thumbsUp": 0
 },
 {
  "userName": "Dave McAuley",
  "date": "2020-04-25T11:37:24.789Z",
  "score": 5,
  "title": null,
  "text": "Great app, fantastic platform for achieving profits on Football trading.",
  "replyDate": null,
  "replyText": null,
  "version": "4.15.1",
  "thumbsUp": 0
 },
 {
  "userName": "Ash Rowland",
  "date": "2020-03-19T17:52:50.190Z",
  "score": 1,
  "title": null,
  "text": "AVOID! The sale values of players shares have recently dropped so dramatically that it is now pretty much impossible to actually make any profit from your portfolio. Absolute joke.",
  "replyDate": null,
  "replyText": null,
  "version": "4.13.0",
  "thumbsUp": 3
 },
 {
  "userName": "Darren Atkinson",
  "date": "2020-05-22T16:06:38.686Z",
  "score": 5,
  "title": null,
  "text": "Love the ease of the app. Easier than the laptop",
  "replyDate": null,
  "replyText": null,
  "version": "4.16.0",
  "thumbsUp": 0
 },
 {
  "userName": "TheKaiShow",
  "date": "2020-04-16T11:21:52.515Z",
  "score": 5,
  "title": null,
  "text": "Great way to invest and save money. I can put my football knowledge to very good use.",
  "replyDate": null,
  "replyText": null,
  "version": "4.14.0",
  "thumbsUp": 0
 },
 {
  "userName": "Aleksandar Besevic",
  "date": "2020-04-22T09:48:14.760Z",
  "score": 5,
  "title": null,
  "text": "Brilliant, great to put football and trading knowledge to use",
  "replyDate": null,
  "replyText": null,
  "version": "4.15.1",
  "thumbsUp": 0
 },
 {
  "userName": "Don Chapman",
  "date": "2020-05-22T21:37:34.826Z",
  "score": 5,
  "title": null,
  "text": "Excellent way of investing and participating in the great game",
  "replyDate": null,
  "replyText": null,
  "version": "4.18.0",
  "thumbsUp": 0
 },
 {
  "userName": "Kev K",
  "date": "2020-03-24T21:31:49.793Z",
  "score": 5,
  "title": null,
  "text": "It's constantly improving, easy to use, and I'm sure they'll continue improving.",
  "replyDate": null,
  "replyText": null,
  "version": "4.13.0",
  "thumbsUp": 0
 },
 {
  "userName": "Luke Spencer",
  "date": "2020-03-02T06:42:02.270Z",
  "score": 5,
  "title": null,
  "text": "I've been useing footballindex for just over a year and it's changed my life. Football has never been so exciting and I've have completely stopped traditional betting (used to spend £25 a week and was terrible at it) now I've made my first £1000 and hope to double that next year. Withdrawing money is easy and I do it regularly. There have been some tech issues in that time which FI are very keen to iron out and I know have taken on alot more staff to help with that. Thanks football index",
  "replyDate": null,
  "replyText": null,
  "version": "4.12.0",
  "thumbsUp": 6
 },
 {
  "userName": "Mat Horton",
  "date": "2020-03-05T00:27:00.865Z",
  "score": 4,
  "title": null,
  "text": "The app itself is good easy to use, was a bit difficult setting up but got there in the end. I would perhaps suggest the 2 leagues worth of players from all the best leagues for example - premiership/championship etc. Think alot of the younger players are sent out to lower league clubs but you can't get a share on them as they are not in the system",
  "replyDate": null,
  "replyText": null,
  "version": "4.11.2",
  "thumbsUp": 7
 },
 {
  "userName": "Darren Saunders",
  "date": "2020-05-22T16:00:47.772Z",
  "score": 5,
  "title": null,
  "text": "Have to give it 5stars based on a couple good deals... invested couple hundred. Portfolio shows value of 650.00. Better interest in a year then any other way.",
  "replyDate": null,
  "replyText": null,
  "version": "4.18.0",
  "thumbsUp": 0
 },
 {
  "userName": "We. R. On. R. Way. Back",
  "date": "2020-01-16T07:21:19.763Z",
  "score": 4,
  "title": null,
  "text": "Pretty good app. Better than the website for some things but plenty of room for improvement. No option to see total deposits or receipts though, which the website has. Wish individual player's profit/loss % was available to view from portfolio screen, instead of having to actually click on a player to view profit/loss % 7/10 from me. Edit: this app has since been updated and now has excellent features. 9/10",
  "replyDate": null,
  "replyText": null,
  "version": "4.9.0",
  "thumbsUp": 11
 },
 {
  "userName": "Arron L",
  "date": "2020-01-18T15:13:23.880Z",
  "score": 1,
  "title": null,
  "text": "I like the concept of this app but having tried it out for 1 week I think it is very poor. For a start many of the players on the system are out of date such as players like Nacer Chadli and Kevin Wimmer...Still shown as Tottenham players despite having left the club many years ago. Also players with true potential to take a gamble on and worth purchasing shares for such as 16 yr old Birmingham boy, Jude Bellingham...doesnt even feature despite being a regular starter for the Championship side",
  "replyDate": null,
  "replyText": null,
  "version": "4.9.0",
  "thumbsUp": 16
 },
 {
  "userName": "Shaun L",
  "date": "2020-02-02T01:04:38.878Z",
  "score": 1,
  "title": null,
  "text": "Terrible app/site. Players don't even have their right clubs. More than 50% of the player pool don't even have the correct positions. Impossible to take these amateurs seriously when they don't even know what teams players play for. In 9 months I sent 10-12 emails and not one was answered. Sent 20-25 DMs on twitter. All ignored, I messaged on my brothers account about trying to deposit and they answered within 10 minutes (how convenient) Only care about getting money into the site.",
  "replyDate": null,
  "replyText": null,
  "version": "4.10.0",
  "thumbsUp": 40
 },
 {
  "userName": "Mark Barrell",
  "date": "2020-01-11T22:12:51.520Z",
  "score": 2,
  "title": null,
  "text": "Great for a bit of fun, with all things like this - probably best not to take it too seriously! Be great to have the option of a watch list to track players. Edit - I had to downgrade my rating as current profit is calculated based on buy prices not sell therefore makes it look like you're doing better than you are (spreads can be huuuge too). I have to keep a separate spreadsheet to track portfolio properly which is a pain in the backside!",
  "replyDate": null,
  "replyText": null,
  "version": "4.9.0",
  "thumbsUp": 1
 },
 {
  "userName": "Michael Stock",
  "date": "2020-01-23T19:56:52.332Z",
  "score": 2,
  "title": null,
  "text": "Needs work. Not as good as the site with reduced functionality and, seemingly, a smaller pool of players too. The main site isn't great either, to be honest. Feels like the majority of time and money spent in making the app went towards the loading screen.",
  "replyDate": null,
  "replyText": null,
  "version": "4.10.0",
  "thumbsUp": 12
 },
 {
  "userName": "Luke Neate",
  "date": "2020-01-17T11:21:14.428Z",
  "score": 1,
  "title": null,
  "text": "Football index is great and I love the concept but this app is awful. It's very hard to find a lot of players as the search bar is horrific. So many players simply don't come up. This app also needs to add the watchlist feature",
  "replyDate": null,
  "replyText": null,
  "version": "4.9.0",
  "thumbsUp": 2
 },
 {
  "userName": "Iain Bennet",
  "date": "2020-01-22T18:06:25.198Z",
  "score": 1,
  "title": null,
  "text": "It's a massive con. The more players are in the news the more money your player will be worth so you can earn some money. Well at 11am 22nd January a player Cavani was in the news, earning money and I even spotted on the index how many times he had been in the news so far this day. By 4pm his money had dropped and when I looked at the news apparently he hadn't been in the news that day. I must add that I haven't lost money as he is still above what I paid but index are conning people",
  "replyDate": null,
  "replyText": null,
  "version": "4.10.0",
  "thumbsUp": 9
 },
 {
  "userName": "Phil Williamson",
  "date": "2020-02-22T07:06:46.160Z",
  "score": 3,
  "title": null,
  "text": "A lot of the player profiles are missing or out of date. Transaction process is ok, but would like to see more help info and guidance for people new to the platform.",
  "replyDate": null,
  "replyText": null,
  "version": "4.11.2",
  "thumbsUp": 1
 },
 {
  "userName": "Peter Cordiner",
  "date": "2020-01-19T13:45:33.901Z",
  "score": 4,
  "title": null,
  "text": "Quick and easy to use. Just need a watchlist and possibly notifications of players being sold/value changes and it will have all the requirements for an easier trading life",
  "replyDate": null,
  "replyText": null,
  "version": "4.9.0",
  "thumbsUp": 0
 },
 {
  "userName": "David E",
  "date": "2020-01-21T00:14:54.670Z",
  "score": 5,
  "title": null,
  "text": "This platform has genuinely changed my life. I have always struggled to save money but this has made it fun. I get to use my football knowledge to make money and I am loving every minute off it.",
  "replyDate": null,
  "replyText": null,
  "version": "4.9.0",
  "thumbsUp": 15
 },
 {
  "userName": "Chris Thompson",
  "date": "2020-01-12T10:41:20.413Z",
  "score": 1,
  "title": null,
  "text": "I've put money into this app and can never see my portfolio because \"Something went wrong\" every time I try to load it!!",
  "replyDate": null,
  "replyText": null,
  "version": "4.9.0",
  "thumbsUp": 4
 },
 {
  "userName": "Jimmy Boxall",
  "date": "2020-01-12T22:08:33.400Z",
  "score": 3,
  "title": null,
  "text": "Database is not very extensive looking for some player to ad to my portfolio and they are not available but is a fun app can be improved.",
  "replyDate": null,
  "replyText": null,
  "version": "4.9.0",
  "thumbsUp": 0
 },
 {
  "userName": "Chris Grant",
  "date": "2020-02-12T18:34:43.705Z",
  "score": 1,
  "title": null,
  "text": "The idea is great, and works well, but I can never log in without getting the error message \"something went wrong\"",
  "replyDate": null,
  "replyText": null,
  "version": "4.10.0",
  "thumbsUp": 0
 },
 {
  "userName": "Henry Gannon",
  "date": "2020-04-25T16:04:13.605Z",
  "score": 1,
  "title": null,
  "text": "Cant access my account after making a deposit. Feels like I have been scammed",
  "replyDate": null,
  "replyText": null,
  "version": "4.15.1",
  "thumbsUp": 1
 },
 {
  "userName": "american ninja",
  "date": "2020-01-07T11:21:17.456Z",
  "score": 5,
  "title": null,
  "text": "Very enjoyable and so far in profit,so very pleased with the app and fi in general, I would recommend it definitely.",
  "replyDate": null,
  "replyText": null,
  "version": "4.9.0",
  "thumbsUp": 10
 },
 {
  "userName": "Giuseppe Schiro'",
  "date": "2020-03-09T10:16:43.148Z",
  "score": 1,
  "title": null,
  "text": "Terrible customer service: email them to activate the money back they advertise, they haven't replied and you cannot use their customer support chat as it's broken. After a week looks more like a scam.",
  "replyDate": "2020-03-09T11:12:19.548Z",
  "replyText": "Hi Giuseppe,\n\nThank you for taking the time to leave us a review.  We are sorry to hear that you have had a bad experience with us.\n\nOur team will always aim to come back to you as soon as possible.\n\nWe're not aware of any issues with our Livechat function.  Please do share further details of the issues experienced to support@footballindex.co.uk",
  "version": "4.12.0",
  "thumbsUp": 1
 },
 {
  "userName": "Jan Szabala",
  "date": "2020-03-15T15:00:47.378Z",
  "score": 5,
  "title": null,
  "text": "5/5 120% in a year on a safe long term portfolio. Highly recommended.",
  "replyDate": null,
  "replyText": null,
  "version": "4.13.0",
  "thumbsUp": 0
 },
 {
  "userName": "David Manning",
  "date": "2020-04-29T15:18:03.878Z",
  "score": 4,
  "title": null,
  "text": "Stock market meets football, fantasy football for £ and pennies",
  "replyDate": null,
  "replyText": null,
  "version": "4.15.1",
  "thumbsUp": 0
 }
]