[
 {
  "userName": "Stephen M",
  "date": "2020-05-26T09:55:18.260Z",
  "score": 1,
  "title": null,
  "text": "This app professes to have 'fingerprint recognition', it doesn't work. When you tap the slider to enable the FR, it confirms by changing to 'green' and also showing a pop up window instructing you to touch the sensor. On touching the sensor, it confirms it has been recognised, though on continuing, the slider returns to being 'greyed out'! On trying to enable the FR again, you get the same pop up message saying touch sensor. It's an endless black hole loop - useless...",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 3
 },
 {
  "userName": "Alison Chase",
  "date": "2020-05-15T22:57:50.723Z",
  "score": 1,
  "title": null,
  "text": "Initially this app worked fine but subsequently I have not been able to add funds. It seems to override the amount I want to pay by inserting £5 in the \"other\" amount field. It also says I need to correct the highlighted errors but I can't see what is wrong. My card details are correct and valid. I don't understand what the problem is. When this happens I then can't exit the screen or go back. Can anyone help?",
  "replyDate": "2020-05-20T13:37:43.181Z",
  "replyText": "Hi Alison, we're sorry that you're experiencing this issue. Thanks for the feedback, which we will forward on to our development team. We want you and all our players to have the best possible experience using the app. If this issue continues, please contact our Customer Services team at: help@national-lottery.co.uk for further support.",
  "version": "7.3.0",
  "thumbsUp": 20
 },
 {
  "userName": "Helen Twyford",
  "date": "2020-05-10T09:26:25.693Z",
  "score": 2,
  "title": null,
  "text": "There is no easy way to display which games you have entered. The list in 'My Games' show's the date the ticket was purchased and not the date the ticket is entered for. It also doesn't display the numbers entered, so for example you have 2 lines entered into both Saturday and Wednesday draws, the list will display them all as date purchased, e.g. Sun 10th May. You have to click on each one in turn to see which day and numbers it refers to. Not user friendly at all.",
  "replyDate": "2020-05-20T13:23:00.798Z",
  "replyText": "Hi Helen, we're really sorry that your experience wasn't the best. Your feedback is much appreciated and will help us in developing the next versions of our app. Feel free to get in touch at help@national-lottery.co.uk if you encounter any other issues.",
  "version": "7.3.0",
  "thumbsUp": 27
 },
 {
  "userName": "Simon",
  "date": "2020-05-23T17:29:32.870Z",
  "score": 3,
  "title": null,
  "text": "When it works it is really good, clean and intuitive, slick and easy to use. That's when it works. I realise the app doesnt work when the draw is being made (although a message would be good) but all I get most times is 'Our app is currently unavailable' and the old Windows blue screen of death. Why?",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 6
 },
 {
  "userName": "Rob Car",
  "date": "2020-05-24T11:54:52.120Z",
  "score": 3,
  "title": null,
  "text": "Great to use when you need a lottery ticket and cannot get to the shop, however when playing instant win games every single time I buy one and play at the end you click finish and it just phauses the game and then when you unphause it its as of its frozen and you are forced to shut the app down and restart it every time you want to play again. ...... IT HAS BEEN DOING THIS FOR WELL OVER A YEAR, GET IT FIXED !!!!!",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 3
 },
 {
  "userName": "paul chappell",
  "date": "2020-05-25T08:57:21.558Z",
  "score": 1,
  "title": null,
  "text": "I've downloaded this app thinking it would eliminate having to go to the shop and buy a ticket, however it will not allow you to register and the screen goes blank. I've uninstalled and reinstalled,checked for updates and yet no change. This app was downloaded via galaxy J6plus. Hoping this is not a phone issue.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 1
 },
 {
  "userName": "Mark Orford",
  "date": "2020-05-21T16:39:25.271Z",
  "score": 1,
  "title": null,
  "text": "While in 'check my numbers>my matches' and you click 'load more results' and say, you go back a few months and view a particular draw, afterwards it returns back to the 'my matches' most recent draws every time, resulting in having to press 'load more results' countless times to go back to where you were. This drives me insane!!! Can you fix this pretty please, so that a back press takes you to where you were. EDIT: DOCKED ANOTHER 2 STARS DUE TO NO DEVELOPER RESPONSE REGARDING THIS ISSUE.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 112
 },
 {
  "userName": "Brian Windsor",
  "date": "2020-05-21T16:42:00.191Z",
  "score": 2,
  "title": null,
  "text": "Not sure what planet the developers are on but it is obviously not the same one as their customers! Why on earth would you be able to see a list of tickets on the web site showing the draw dates whilst this app shows the list with purchase dates? Think the developers need think about the \"customer experience\" and make this app display the list with draw dates - I just cannot see the point of showing the purchase date.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 2
 },
 {
  "userName": "Fraser Murrell",
  "date": "2020-05-27T04:59:03.714Z",
  "score": 2,
  "title": null,
  "text": "The app seems to work ok, but it's a very disappointing experience from such a high profile cause! Clunky UI where there is actually built in features, other features such as checking your messages to see what you've won are just a web wrapper of the site itself. Could do so much more with this.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 1
 },
 {
  "userName": "Terry Barrett",
  "date": "2020-04-20T12:38:34.964Z",
  "score": 1,
  "title": null,
  "text": "Gave it one star as I can't give it zero. Just upgraded and now on trying to open the app all I get is a blue screen saying \"25 Years Of Amazing\" with the word \"loading\" underneath. Gave up after 30 minutes. Restarted phone tried again, gave up again after another 30 minutes. Is the message about 25 years, an indication that it takes that long to load? I can't answer the optional questions if it won't load.",
  "replyDate": "2020-04-22T14:21:01.990Z",
  "replyText": "Hi Terry, we're sorry that you're experiencing this issue. Thanks for the feedback, which we will forward on to our development team. We want you and all our players to have the best possible experience using the app. If this issue continues, please contact our Customer Services team at: help@national-lottery.co.uk",
  "version": "7.2.2",
  "thumbsUp": 42
 },
 {
  "userName": "Andrew Wood",
  "date": "2020-05-12T18:53:13.528Z",
  "score": 1,
  "title": null,
  "text": "I've down loaded this app a few times. Each time it has frozen on a page which tells me , unasked, about fingerprint logging in. I cant scroll down to acknowledge or cancel it, and i cant go back. All I can do is uninstall it from the icin and download it again. After a few times, over a few days, I gave up.",
  "replyDate": "2020-05-20T13:32:33.332Z",
  "replyText": "Hi Andrew, we're really sorry you cannot log in. Please double check your details and try again. If you're still having problems, please contact our Customer Services team at: help@national-lottery.co.uk for further support.",
  "version": "7.3.0",
  "thumbsUp": 10
 },
 {
  "userName": "James Falloon",
  "date": "2020-05-18T02:34:00.787Z",
  "score": 4,
  "title": null,
  "text": "Games are fun but I swear at least every other night it comes up saying \"sorry! We can't log you in right now\" (and it's biometrics so not incorrect details) you can't be doing THAT much maintenance surely? EDIT- the website actually tells you that they do system processing when you try- maybe some more transparency on the app? 🤷🏻‍♂️",
  "replyDate": "2020-05-20T13:31:00.110Z",
  "replyText": "Hi James, we're really sorry that your experience wasn't the best. Your feedback is much appreciated and will help us in developing the next versions of our app. Feel free to get in touch at help@national-lottery.co.uk if you encounter any other issues.",
  "version": "7.3.0",
  "thumbsUp": 2
 },
 {
  "userName": "shane nightingale",
  "date": "2020-05-01T08:55:46.877Z",
  "score": 2,
  "title": null,
  "text": "App works okay, a bit outdated. Basically starts with advertising to buy more tickets even if your there to check how close you were to getting a lucky dip. So if its rolled over etc you already know you have lost from the home screen after logging on as it shows the jackpot amount etc, so the 'dream' is gone before you even check your tickets. Let people check tickets before disappointing them. Like incorporating a personal home screen, with check your games etc, not advertise from the get go",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 15
 },
 {
  "userName": "DOF 2965",
  "date": "2020-05-11T15:20:52.469Z",
  "score": 4,
  "title": null,
  "text": "Simple, fuss free and quick to use. My only gripe, why can't users just deposit £5 instead of the minimum amount being set at £10. Come on, where's the gamblers choice and support here?? Would of got 5* otherwise.",
  "replyDate": "2020-05-20T13:28:35.975Z",
  "replyText": "Thanks for taking the time and leaving an honest review for our app. When depositing funds into your account, there is an option to manually enter in a value after the pre-filled options. Please use this field to enter in your amount as we do allow for £5 as a minimum. If you do have any questions, please email us at help@national-lottery.co.uk",
  "version": "7.3.0",
  "thumbsUp": 3
 },
 {
  "userName": "Tracey Pugh",
  "date": "2020-05-12T08:44:26.738Z",
  "score": 3,
  "title": null,
  "text": "Not that easy to use, not clear where to find purchased tickets. I cant see where the flames are explained. I like that you can set your own limit for spend in the month, and fund clear after 24hrs when you have added them",
  "replyDate": "2020-05-20T13:30:52.962Z",
  "replyText": "Hi Tracey, we're really sorry that your experience wasn't the best. Your feedback is much appreciated and will help us in developing the next versions of our app. Feel free to get in touch at help@national-lottery.co.uk if you encounter any other issues.",
  "version": "7.3.0",
  "thumbsUp": 3
 },
 {
  "userName": "Alun Williams",
  "date": "2020-05-07T13:26:56.675Z",
  "score": 4,
  "title": null,
  "text": "waste of time downloading this app as it won't let me open an account to sign in ***************************** I originally couldn't open an account to sign in using the app so I gave it 1 star, I have since then gone to the national lottery website and opened an account there, Then i signed in using the app, And am glad to say once signed in the app is very easy to use and very convenient too so ive change the rating from 1 star to 4 stars",
  "replyDate": "2020-05-07T12:13:14.277Z",
  "replyText": "Hi Alun, we're really sorry you're having this difficulty opening an account to sign in. Please double check your details and try again. If you're still having problems, please contact our Customer Services team at: help@national-lottery.co.uk for further support.",
  "version": "7.3.0",
  "thumbsUp": 9
 },
 {
  "userName": "Ad Harg",
  "date": "2020-04-01T10:04:44.723Z",
  "score": 1,
  "title": null,
  "text": "Useless, don't bother downloading! Just use the website, as it only redirects you there anyway. The instant win \"games\" on the app are literally spend your money to have a message saying you didn't win. Dissatisfied to say the least. Even the website has problems but at leaat you can play the games to win/lose money",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 85
 },
 {
  "userName": "Tiffany Onions",
  "date": "2020-04-22T10:28:17.140Z",
  "score": 1,
  "title": null,
  "text": "Instant play games are not what they were it feels like your playing a fixed game now against you and the price of the games have also changed there used to be games for 25p and 50p now the minimum is £1 I used to put at least £10 a week on this app I wont be doing that any more don't even feel like I had a fair shot",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 7
 },
 {
  "userName": "Peter C",
  "date": "2020-03-23T23:44:43.395Z",
  "score": 4,
  "title": null,
  "text": "All I get is \"Our app is currently unavailable\". The \"Try Again\" button produces the same response... UPDATE: They don't tell you this but it only works if you're NOT connected to WiFi. They need proof of who you are and where you are. I can give it 4 stars now I've realised this.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 107
 },
 {
  "userName": "Elena **",
  "date": "2020-04-06T16:04:52.835Z",
  "score": 4,
  "title": null,
  "text": "The application works fine on Android, i can buy tickets, i can store the numbers i am playing, i can see the results from previous weeks and compare them to the numbers i played. It offers a fingerprint sign in. Not sure what else people expect from this application. I am happy with the functionality it offers.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 55
 },
 {
  "userName": "Max Hurlbut",
  "date": "2020-04-14T00:09:32.594Z",
  "score": 2,
  "title": null,
  "text": "If you're buying lottery tickets it's fine although I've never won anything more than £5 through a digital ticket. Playing instant win is a complete waste of money. Odds are wrong. 0 in 7 win on mega cashword.. in fact most games are more like 1 in 8 wins App is a bit glitchy sometimes. Uninstalled... Buying from the shop still feels more secure",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 36
 },
 {
  "userName": "Paul Woodcock",
  "date": "2020-05-17T10:12:52.885Z",
  "score": 5,
  "title": null,
  "text": "Excellent website easy to use lot better then the paper ticket. When you win it goes in to your account. Your information is save for your tickets on the site. They will email if you have won.",
  "replyDate": "2020-05-20T13:33:54.593Z",
  "replyText": "Thanks for taking the time and leaving a great review for our app. By playing you are helping to contribute around £30M a week to good causes across the UK!",
  "version": "7.3.0",
  "thumbsUp": 1
 },
 {
  "userName": "Nick C",
  "date": "2020-05-09T16:16:50.278Z",
  "score": 2,
  "title": null,
  "text": "It's fine for doing the actual lottery but avoid the instant win games. Because it's all done automatically, they're never going to give away huge amounts of money. Monopoly and bingo for example, you're always 1 never away.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 9
 },
 {
  "userName": "Sam Thomas",
  "date": "2020-04-11T10:12:33.338Z",
  "score": 1,
  "title": null,
  "text": "I always get suspicious that the reason they don't show the winning numbers when you've scanned your ticket under the \"my numbers\" dropdown alongside yours is because they think the app is broken again like in 2018 where it declared winning tickets as \"no prize won\" and got fined for it so it's untrustworthy for me.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 13
 },
 {
  "userName": "Asa Johnson",
  "date": "2020-04-08T10:31:00.735Z",
  "score": 3,
  "title": null,
  "text": "Was working fine until a recent update. Every time I play an instant game, the app freezes and you can't leave the game after completion. You then get an error message stating that the game could not be processed. Purchasing lottery tickets in easy and quick.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 33
 },
 {
  "userName": "John Walton",
  "date": "2020-05-07T20:21:45.956Z",
  "score": 1,
  "title": null,
  "text": "Yes you can buy your lottery tickets but most of the time when you spend your change on an instant scratch card app fails ,spend ya money in a shop at least you can spend what you need to put in ,not a specific requirement",
  "replyDate": "2020-05-20T13:13:27.131Z",
  "replyText": "Thanks for taking the time and leaving an honest review for our app. We help support our players by providing a unique set of tools that allows them to be in control of their play limits. You can find more information at https://www.national-lottery.co.uk/responsible-play",
  "version": "7.3.0",
  "thumbsUp": 2
 },
 {
  "userName": "Chesnay Jonathan",
  "date": "2020-05-19T13:51:20.991Z",
  "score": 5,
  "title": null,
  "text": "Easy to use with various of games. It is easy to buy lottery tickets. Lots of restrictions in place to avoid gambling if you are at risk. You can set your own limit too.",
  "replyDate": "2020-05-20T13:22:03.313Z",
  "replyText": "Thanks Chesnay for taking the time and leaving a great review for our app!",
  "version": "7.3.0",
  "thumbsUp": 0
 },
 {
  "userName": "RoxMeNot 2",
  "date": "2020-05-04T11:12:13.462Z",
  "score": 1,
  "title": null,
  "text": "Why do I have to opt out of cookies every single time I log in? I bet if I allowed them you wouldnt ask again. Why cant my decision be respected and you stop asking? Checking my numbers is a 12-step process now having to log in every time, set preferences and go to the relevant section. Who ever made this app and whoever's greenlit it should be fired.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 2
 },
 {
  "userName": "paula simmons",
  "date": "2020-05-14T03:08:20.573Z",
  "score": 5,
  "title": null,
  "text": "Very easy to access and navigate throughout website..great to be able to do it mobile..no more running last minute to play lottery when u can do it from palm of your hand..highly reccomend app..A++",
  "replyDate": "2020-05-20T13:34:01.362Z",
  "replyText": "Thanks Paula for taking the time and leaving a great review for our app. If you do have any questions or require help, please email the team at help@national-lottery.co.uk",
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "A Google user",
  "date": "2020-05-19T17:44:18.737Z",
  "score": 1,
  "title": null,
  "text": "Man what happened to all the good Games? All the decent £5 and £10 games are gone and you're left with cash word as the only good one. Lots of boring click and reveal games. Time to look for a new app. Pity.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 11
 },
 {
  "userName": "Rossi Roo",
  "date": "2020-04-10T18:07:45.943Z",
  "score": 1,
  "title": null,
  "text": "Downloaded the app as the website wouldn't let me log in or create an account. Well the app was no better! Still won't let me sign in or create a new account. Utterly useless and extremely disappointing.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 2
 },
 {
  "userName": "Sandra McMaster",
  "date": "2020-05-05T16:43:45.858Z",
  "score": 1,
  "title": null,
  "text": "I've uninstalled and reinstalled twice and each time I open it I get a message that the app is 'currently unavailable', even though it's working perfectly well on another device. Frustrating.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 14
 },
 {
  "userName": "craig reid",
  "date": "2020-04-05T09:01:52.839Z",
  "score": 2,
  "title": null,
  "text": "Current multiplay tickets are never displayed at the top, have to scroll through list to try and find it. Online shows all current running tickets that are still to play. Less games now on instant win now after update.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 4
 },
 {
  "userName": "Lloyd. W",
  "date": "2020-04-09T07:09:19.274Z",
  "score": 5,
  "title": null,
  "text": "Excellent app and spot on if your a winner!. Will save you having to trust the sales advisor if you get them to scan your ticket! It's quick and very easy to use. But i still get the tickets scanned at the shop to be sure.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 },
 {
  "userName": "Paul Brady",
  "date": "2020-05-21T14:07:28.490Z",
  "score": 3,
  "title": null,
  "text": "Works Ok. But the notification icon is just a white square. Would be better if it was more meaningful, like the crossed fingers.",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 0
 },
 {
  "userName": "Michael Potts",
  "date": "2020-05-11T17:01:53.295Z",
  "score": 2,
  "title": null,
  "text": "This app does not seem to have the option to buy a ticket for more than a week at time. So for that inconvenience I will uninstall it and revert to loading the National Lottery site as and when I need it.",
  "replyDate": "2020-05-20T13:30:07.771Z",
  "replyText": "Hi Michael, we're really sorry that your experience wasn't the best. Your feedback is much appreciated and will help us in developing the next versions of our app. Feel free to get in touch at help@national-lottery.co.uk if you encounter any other issues.",
  "version": "7.3.0",
  "thumbsUp": 1
 },
 {
  "userName": "Sarah Muscat",
  "date": "2020-05-21T11:49:11.407Z",
  "score": 1,
  "title": null,
  "text": "Just downloaded the app and haven't been able to add funds. I tried multiple times and double checked everything. The app is essentially unusable because of it",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 0
 },
 {
  "userName": "A Google user",
  "date": "2020-04-11T20:27:57.931Z",
  "score": 1,
  "title": null,
  "text": "fingerprint enabled on my mate 20 pro but goes straight into the account without fingerprint scanning!!! contacted Hannah in customer support. as much use as a chocolate condom. One year on and I've changed my phone to a one plus 7 Pro and still the same issue. Invest some of OUR money into a decent app.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 3
 },
 {
  "userName": "Sean Callaghan",
  "date": "2020-04-07T21:14:17.960Z",
  "score": 1,
  "title": null,
  "text": "Absolute joke every time I try to register it keeps freezing, think I will just check the results using YouTube a lot easier also will prob save some money from playing there games, I would of giving no stars if possible.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 4
 },
 {
  "userName": "Lisa Ashburn",
  "date": "2020-05-22T19:32:12.530Z",
  "score": 3,
  "title": null,
  "text": "Keeps crashing, done a few instant wins and a few times it's not loaded and gone into unfinished games so I my only option was to see the result instead of playing it",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 0
 },
 {
  "userName": "John Macalister Wood",
  "date": "2020-04-05T10:34:38.322Z",
  "score": 1,
  "title": null,
  "text": "The app is functional, I can see or experience no difference from the previous version. Google forced me to update, wanting me to remove some apps that I wanted, however, I got round it by removing some Google apps. Done.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 6
 },
 {
  "userName": "Keith Law",
  "date": "2020-03-27T14:54:08.910Z",
  "score": 2,
  "title": null,
  "text": "So frustrating if you want to use the app to buy a ticket on the day of the draw because it always says unavailable. Works every other day but never on a draw day. Even clicking the website link doesn't work.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 42
 },
 {
  "userName": "Nigel Smith",
  "date": "2020-04-04T06:30:21.976Z",
  "score": 4,
  "title": null,
  "text": "Nice app, good layout and easy to use. The only issue I've had is when you click add funds, it initially does nothing, when I click it again it works",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 4
 },
 {
  "userName": "Kevin Yates",
  "date": "2020-05-20T13:30:15.974Z",
  "score": 1,
  "title": null,
  "text": "This app does not work on my Samsung Galaxy S9.when it opens all a get is a blank screen.can anybody out there help. Have reinstalled app numerous times.did work ok at one time now nothing.",
  "replyDate": "2020-05-20T13:28:17.404Z",
  "replyText": "Hi Kevin, sorry for the delay in responding to your comment, and thanks for letting us know. If you're still having problems, please get in touch with our Customer Services team at: help@national-lottery.co.uk for further support.",
  "version": "7.3.0",
  "thumbsUp": 0
 },
 {
  "userName": "Monkey Brain",
  "date": "2020-04-07T10:32:20.705Z",
  "score": 1,
  "title": null,
  "text": "Absolute pos app. Have had to change my password 3 times this morning, only to have the session expire after 2 minutes. My profile persistently shows up as 'profile not found'. Waste of time.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 5
 },
 {
  "userName": "Steven Mcneil",
  "date": "2020-05-10T13:56:07.525Z",
  "score": 1,
  "title": null,
  "text": "Can't even open an account just left with a white screen useless. You have this monopoly and you won't even invest in a decent app.You should have the lottery taken away when a company becomes lazy and complacent.",
  "replyDate": "2020-05-20T13:23:33.780Z",
  "replyText": "Hi Steven, we're really sorry you're having this difficulty. Please double check your details and try again. If you're still having problems, please contact our Customer Services team at: help@national-lottery.co.uk for further support.",
  "version": "7.3.0",
  "thumbsUp": 2
 },
 {
  "userName": "Alex Petrea",
  "date": "2020-05-25T22:56:46.676Z",
  "score": 1,
  "title": null,
  "text": "Downloaded it multiple times still won't let me make an account. The page just doesn't load up. Screen stays white. Water of time",
  "replyDate": null,
  "replyText": null,
  "version": "7.3.0",
  "thumbsUp": 0
 },
 {
  "userName": "SuffolkLad",
  "date": "2020-03-27T06:54:42.236Z",
  "score": 2,
  "title": null,
  "text": "Not impressed! Smaller selection of 'scratch cards' than there used to be, odds of winning are inaccurate, only really useful for playing a few lines without having to go to a shop.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 14
 },
 {
  "userName": "Samuel Hallett",
  "date": "2020-03-28T21:10:55.900Z",
  "score": 2,
  "title": null,
  "text": "Awkward to use, buy a lottery ticket, don't expect to see it again unless you hunt high and low, in which case you may as well just go look for buried treasure yourself, scratchcards are a scam no doubt, don't waste your money, stay away, far away.",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 20
 },
 {
  "userName": "Serena Easton",
  "date": "2020-04-19T07:03:04.421Z",
  "score": 3,
  "title": null,
  "text": "This is a really good for putting my tickets on I would give it 5 stars but u cant delete tickets that have expired witch is really annoying as I have to look at all my tickets to find the ones that are still in play",
  "replyDate": null,
  "replyText": null,
  "version": "7.2.2",
  "thumbsUp": 0
 }
]