[
 {
  "title": "Bingo - Play Free Bingo Games Offline or Online",
  "description": "READY TO PLAY FREE BINGO GAMES OFFLINE AT YOUR OWN SPEED?\r\n\r\nIt's BINGO time! Play one of the best FREE Bingo games offline or online for Android phones and tablets! This fun bingo game by Absolute Games is free to play with lots of bingo bonuses and bingo coins! Best of all, you can play Absolute Bingo at home anytime you want as the game can be played offline with no internet connection. \r\n\r\n\r\nABSOLUTE BINGO FUN UNIQUE FEATURES\r\n\r\n⭐ FREE bingo play - get free bingo coins to play every 4 hours\r\n⭐ FUN bingo rooms and mini games\r\n⭐ Great bingo odds and GENEROUS payouts\r\n⭐ PLAY up to 4 bingo cards\r\n⭐ Play OFFLINE BINGO GAMES or play free bingo online too! You can play fun bingo at home, anywhere, anytime\r\n⭐ PAUSE the game whenever you want\r\n⭐ CHANGE your game SPEED - play faster or slower as you please\r\n⭐ WIN powerups in and unlocked at higher levels of fun bingo games!\r\n⭐ Double bingo - double the fun! Win double and triple bingo!\r\n⭐ Coming soon - 8 card bingo games! Play up to 8 bingo cards\r\n\r\nJoin the bingo community and play fun bingo at home!\r\n\r\nIf you love to play bingo games and are looking for a fun new bingo game, this is the game for you. Try it out! It'll be a bingo story you can't wait to tell your friends!  One of the best gwmes to try!\r\n\r\n\r\n\r\nDOWNLOAD THIS TOP FREE BINGO GAME NOW AND START PLAYING FUN BINGO OFFLINE OR ONLINE\r\n\r\nTry out this fun bingo gsme and share your bingo story with us! We love hearing your fun bingo experiences, and improving the gwmes with your suggestions!\r\n\r\nNeed help?\r\nSend us a message inside the game!  We respond to all messages!\r\n\r\nFollow us to get news and updates:\r\nfacebook.com/AbsoluteBingo\r\n\r\n\r\n\r\nAre you new to bingo?  Welcome to the bingo community!\r\nAmerican bingo is one of the most popular gwmes out there for when you're bored! 75 card bingo gsme is played on a 5x5 grid with numbers 5 across and 5 down.  Each grid square contains a letter and a number.  Match any 5 numbers across, down, or diagonal and call bingo to win! Try it out!\r\n\r\n\r\nPLEASE NOTE: This app lets you purchase digital content using real money. You can turn off payments by disabling in-app purchases in your device settings.\r\n\r\nBingo does not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\nPractice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "★ THE #1 TOP FREE GAME TO ESCAPE STRESS! ★",
  "installs": "10,000,000+",
  "score": 4.6572285,
  "ratings": 164405,
  "reviews": 63878,
  "price": 0,
  "IAPRange": "£0.99 - £63.88 per item",
  "developer": "Absolute Games : Free Bingo Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 6, 2013",
  "updated": 1588116788000,
  "version": "Varies with device",
  "recentChanges": "You asked for it!  There are now more types of daily goals!<br>New room - Solais!<br>Lots of under the hood improvements and bug fixes.",
  "appId": "com.absolute.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo: Lucky Bingo Games Free to Play at Home",
  "description": "For all Bingo Lovers, let's Bingo at home! Come on! Bingo with friends and family in this best free bingo games online! Daily Freespin, hourly FREE Cash, epic bingo power-ups and amazing minigames will take your free bingo game to a super Bingo WIN! \r\n\r\nThe most interesting free bingo game here! Play free bingo games online with this mobile bingo app to enjoy the social bingo blast! Realtime multiplayer Bingo tournaments will give you a thrilling bingo rush! Don’t need to play real money bingo outside, you can play free Bingo at home! Without bingo dauber or bingo markers, you can play free bingo app with this mobile bingo to win Bingo Infinity! It is fun adult games with new Bingo Holiday features every month! Let’s enjoy our Lucky Bingo Party and speak bingo lingo, it has never been so fun!\r\n\r\nNew Bingo Story Themes! \r\nAre you a classic bingo card fan, or special bingo caller lover? Don’t miss out this fun free bingo app! Lucky bingo has the most fun bingo games with both classic 75-ball bingo games and special pop bingo games! Each bingo room has an absolute bingo story to adventure! Lucky bingo has almost 30 new bingo rooms including Multiple bingos gameplay in one bingo card, Poker King Bingo with solitaire card games, 90-Ball UK bingo Jackpot… Buy Bingo cards to WIN full house, blackout and Infinity Bingo! You can also play free slot machines games before joining your speed bingo room. Lucky Bingo is one of the top free bingo games to download for FREE!\r\n\r\nRealtime Multiplayer Bingo\r\nLive multiplayer bingo games for free! Play Rea-time Multiplayer Bingo games and compete with other players in this free game app. Bash with friends in each Bingo game with its own live multiplayer bingo leaderboard. More interesting than Facebook Bingo games, this free bingo app gives you an online bingo mania to play Bingo online any time, anywhere! \r\n\r\nPuzzle Games in Every Bingo Room & Bingo Club\r\nAre you also a free jigsaw puzzle games lover or word puzzles lover? You can’t miss this free bingo games app! Every showdown bingo card has a chance to win jigsaw puzzle pieces! Play free bingo games to collect epic jigsaw puzzle pieces to get super collectibles in each bingo room!\r\nWhen you reach level 7, Bingo Club will open with new puzzle game “Billionaire Assets”. Collect assets cards to find precious treasures! After you find all Precious treasures you’ll win big rewards, Bingo bonus offers, and more! Then the second puzzle game will open which is a kitchen game “Cooking Craze”! You'll be a great chef by making food with Ingredients Cards winning from bingo games!\r\n\r\nAmazing Lucky Bingo Features\r\n\r\n✔ Realtime multiplayer! Play against thousands of real players in real time.\r\n✔ Free Power-ups and Chips every hour!\r\n✔ Free spins every day and blitz to collect bonus\r\n✔ Join elite membership to play up to 8 Cards!\r\n✔ Almost 30 bingo rooms with new bingo gameplay\r\n✔ Consecutive bingo winning on one bingo card in Multiple Bingo Room\r\n✔ 9 Crazy bingo power-ups in game, more than other bingo games!\r\n✔ Free hint and auto daub help you play bingo app more easily.\r\n✔ Customize your bingo voice of the bingo caller calling your lucky numbers.\r\n✔ Interesting collectables in every bingo room\r\n✔ Super Billionaire Assets Bingo Club with puzzle cards\r\n✔ Exciting minigames & top fun bingo events\r\n✔ Boost your Bingo Cards for better rewards and more puzzles.\r\n\r\nWelcome to contact us and glad to hear from you! Our Email: bingoservicesvc@gmail.com\r\nLike us on Facebook for your daily free bonuses, @BingoLuckybingowonderland\r\nhttps://www.facebook.com/BingoLuckybingowonderland/\r\n\r\nDisclaimer:\r\n- The games are intended for use by those 17 or older for amusement purposes only.\r\n- The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n- Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "★ The #1 Lucky Bingo Party Game Free to Play!  Live Multiplayer BINGO Journey! ★",
  "installs": "1,000,000+",
  "score": 4.477211,
  "ratings": 29640,
  "reviews": 9404,
  "price": 0,
  "IAPRange": "£0.89 - £83.99 per item",
  "developer": "Theotino Entertainment",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "May 14, 2018",
  "updated": 1583906125000,
  "version": "1.5.2",
  "recentChanges": "1. New Crazy and Thrilling Video Bingo is coming! If you love Video Bingo or Slots Machines, you won’t miss it!<br>2. Bug fixed and game optimized! We are trying to be a best free Bingo game!",
  "appId": "com.theotino.bingo.luckybingo.wonderland",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Bash: Live Bingo Games & Free Slots By GSN",
  "description": "Warm those fingers up because now it’s BINGO time!!! \r\nPlay for free exciting bingo games @ Bingo Bash – The game of Bingo & Slot machines\r\n\r\nPlay the world’s #1 BINGO MULTIPLAYER GAMES with the best Bingo players of all time! Mix up bingo games free to play with some of your favourite 777 slot machine games like Stars & 7s Slots and many more slot games! Brace yourself for an exciting bingo cruise party filled with bingo games for free! BOOST your bingo with power plays in one of the top bingo games and continue playing bingo for free! Grab some bingo chips & make it a bingo party that you’ll never forget! \r\n\r\nExplore an amazing world of bingo free games with Bingo Bash by GSN! Spin the wheel of fortune every day and receive daily gifts!\r\n\r\nJoin millions of live Bingo players from across the globe, play in over 30  Bingo Live rooms with 13 different ways to win big and call “Bingo”! Play multiple Bingo cards at once and make those bingos pop right out.\r\n\r\nPlay with Power Plays and complete collections to win huge rewards for daubing all the bingo balls. Play live bingo free and listen to the bingo caller for your lucky numbers to win big at our bingo party.\r\n\r\nPlay with friends and chat while you’re playing Bingo games and team up with them to uncover huge rewards and bonuses! Earn more coins with free slots games. Call 4 Bingos in Premium to WIN a JACKPOT. Spin daily to win bonuses!\r\n\r\nFly around the world in our classic and exclusive Bingo rooms:\r\n- Chow down on some sticky sweets with Sugar Rush Bingo and Cupcake Street!\r\n- Taste our very special espresso in the Coffee Crush Bingo room, sell coffee and win chips!\r\n- Prepare yourself for the summer season on the Beach Bash - remember, Bingos give you drinks! Win up to 3400 chips in this room!\r\n- Find the hidden objects and win chips with a very special bingo Drive & Go Seek room. Reveal dish and cutlery to call BINGO!\r\n- Get all elves to a workshop with Merry Maze bingo room, call Bingo and get special tools to clear obstacles to collect bells. \r\n- Blow your mind away in Spellbound Bingo room - fight with dragons to get dragon scales and craft your own charms to win big!\r\n\r\nMany more rooms are waiting for you to play with friends and family, enjoy great graphics and relax, let the fun begin right now! Play every day and get a daily bonus for free!\r\n\r\nInstall the game Bingo Bash and get access to special mini games: Lucky Scratchers, Pull Tabs, 777 Slots, Daily Spin and more games coming soon!\r\n\r\nPlay the game of bingo and enjoy our awesome free Slots, scratch cards and Mini-games, win huge rewards & grab bingo chips! Don’t miss our special events to win big!\r\n\r\nInstall now & start playing FREE BINGO GAMES!\r\n\r\n• Bingo Bash is intended for a mature audience.\r\n• Bingo Bash does not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n• Past success at social casino gaming has no relationship to future success at \"real money gambling\".",
  "summary": "🏆 Best Bingo in 2020 🏆 Install now and play Bingo games online for free! 🎊",
  "installs": "10,000,000+",
  "score": 4.5073347,
  "ratings": 612406,
  "reviews": 178881,
  "price": 0,
  "IAPRange": "£0.99 - £194.99 per item",
  "developer": "GSN Games, Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 18, 2012",
  "updated": 1588247267000,
  "version": "Varies with device",
  "recentChanges": "WHAT’S NEW:<br><br># This month’s New Bingo Room, ‘Sun’s Out’ - Summer is here, it’s time to chill out. Come play some bingo in our new room Sun&#39;s Out\\!<br># Bug fixes and performance improvements",
  "appId": "air.com.bitrhymes.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "BINGO!",
  "description": "BINGO GAMES FREE TO PLAY EVERY DAY! Try OVER 35+ FREE Bingo Games unlocked NOW with BINGO - Bingo Heaven! Updated regularly with new Bingo Games free to play!\r\n\r\nPlay Bingo Heaven free without wifi - online or offline - and try to win the Jackpot! Bingo Heaven brings the Bingo Caller Parlor to your device in an android game app! Want the best free bingo games free to play and get daily free coins? Play BINGO! - Bingo Heaven Free games without wifi today!\r\n\r\nThis free bingo games casino is intended for adult audiences and does not offer real money gambling or any opportunities to win real money or prizes. Success within this free to play bingo game app does not imply future success at real money gambling.\r\n\r\nQuestions/Problems? \r\nE-mail us at: BNGa@12gigs.com",
  "summary": "For Bingo Games free to play install BINGO! Over 35+ Bingo Games free to play!",
  "installs": "10,000,000+",
  "score": 4.5177155,
  "ratings": 446029,
  "reviews": 156565,
  "price": 0,
  "IAPRange": "£0.99 - £165.80 per item",
  "developer": "Super Lucky Casino",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 23, 2011",
  "updated": 1582839917000,
  "version": "1.360",
  "recentChanges": "BINGO heaven is the best bingo out there!<br>- New Machines! <br>- New Game Events! <br>- Updates to your favorite Bingo Rooms!",
  "appId": "com.twelvegigs.heaven.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Party - Free Bingo Games",
  "description": "Join Bingo Party to play Bingo with friends and millions of players around the world. Play in 30+ bingo rooms anytime, anywhere!\r\n\r\nBingo Party is the #1 Classic & Special Bingo Game with 8 CARD VERSION!  Wanna get more bingos? Wanna be more fun? Just play Bingo Tour!\r\n\r\nGame Features:\r\n# Realtime multiplayer! Play with more than 10,000 players at a time!\r\n# Join elite to play up to 8 cards!\r\n# Over 30 bingo rooms! We will be rolling out more rooms!\r\n# 500 Tickets & 30 power-ups to start off. Each day you have another 150+ tickets to continue the bingo tour. Don't miss it!\r\n# Your daily bonus will increase by your level up!\r\n# Complete kinds of puzzles to get BIG BONUS!\r\n# 7 types of power-ups - Help you get more bingos!\r\n# Daily Tournament - Complete other players to win big!\r\n# Achievement - Over 200 achievements to challenge. Complete to win!\r\nIf you love bingos and want to try a new one, Bingo Party is a good choice. Just have a rest out from other bingo games, we will not let you down!\r\nIf you love bingos and want to try a new one, Bingo  Party is the best choice. Come experience the fantastic NEW BINGO game, we will not let you down!\r\nDon't Wait and download now, a new Bingo World is waiting for you!\r\n\r\nPractice or success at social casino gaming does not imply future success at real money gambling. \r\n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n***********************************************************************\r\n\r\nHave questions or suggestions about Bingo Party - Crazy Bingo Tour?\r\nEmail your questions to bingo@avid.ly\r\nIt will request READ_PHONE_STATE permission in the first time you install the game for generating the account, sorry for the trouble.\r\n\r\nThank you for playing and have a wonderful bingo trip!",
  "summary": "★★★ Enjoy the latest free Bingo game with multiple cards and new rooms! ★★★",
  "installs": "5,000,000+",
  "score": 4.6551514,
  "ratings": 282369,
  "reviews": 64816,
  "price": 0,
  "IAPRange": "£0.79 - £92.99 per item",
  "developer": "Avid.ly Entertainment",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 8, 2017",
  "updated": 1588262829000,
  "version": "2.3.9",
  "recentChanges": "1. Bug fixed and game optimized.<br>2. Newly added Advancement Pack for new players.",
  "appId": "com.bingo.tour.party.crazy.free",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Abradoodle - Bingo Games Free to Play!",
  "description": "This is it. Play the CUTEST and MOST FUN FREE BINGO GAME ONLINE! Become a bingo winner, play live fun bingo games 🎉! Join our Bingo tournaments 🔮 and enjoy fun games for free!\r\n \r\nFind your lucky free bingo cards anywhere you go while playing one of the best free bingo games of online bingo or just some of your favorite offline bingo. Looking for cute cat bingo games free to play for leisure? Well, you’ve found your free online bingo heaven filled with all the best bingo board players, free bingo cards, and wheel of fortune!  Wait for the caller to call out our favorite bingo balls and win the free bingo games online! Play bingo online FREE @ Abradoodle! Feel free to spin to win!\r\n     \r\nWarning: Bingo by Abradoodle is a super addictive free bingo game online!  Why, you ask? Because we’ve got it all!  Cute cats, cuter dogs, free bingo cards, and oh so many absolute bingos! Blitz and bash out bingos with your friends on a wild and fun bingo adventure like there’s no tomorrow! \r\n\r\nAbradoodle Bingo is the free online bingo adventure game that lets you play bingo offline, anywhere, anytime you want, with or without internet. Wifi, no wifi -- who cares??  Not you, because you can play bingo both ways – play bingo offline or play bingo online free!  This online bingo game lets you get bingo hall action anytime you want, because bingo action is way more fun – online bingo and offline bingo games for everyone! Absolute bingos for everyone!  It's a bingo story waiting to be told! Gwmes away!\r\n\r\nWHAT THIS FREE BINGO GAME HAS TO OFFER - \r\n \r\n✪ FUN themes and rooms to explore\r\n✪ GET bingo tickets every 40 minutes\r\n✪ POWERUPS to boost your game\r\n✪ WIN! Great bingo odds\r\n✪ COLLECT daubers and avatars and stamps for bonuses\r\n✪ PLAY up to four bingo cards\r\n✪ MULTI bingo - get double, triple, and mega bingos\r\n✪ CHOOSE teams - are you on Team Hoops or Team Abradoodle?\r\n✪ FRIENDLY and FUN bingo! (Yes, yes we are!)\r\n\r\nIf you love online bingo and are ready to try a new bingo game that will knock your socks off, load up Abradoodle and get ready for the best bingo game experience.  Best of all, this is a free bingo game!  Pop on over and play this unique bingo game!\r\n\r\nSo gather up your friends, roll up your sleeves, spin to win, and have fun with the ultimate bingo showdown. This is a bingo journey you don't want to miss! Run, dash, surf, spin or slither on over and let's escape into some online absolute bingo magic! May the best bingo player and best set of bingo cards...bingo!\r\n\r\n\r\nFollow us to get news and updates:\r\nfacebook.com/abradoodlebingo\r\n\r\nGot feedback?  Have questions?  Just bored?  Our friendly and ALWAYS caffeinated team is ready to hear it.  Anytime you gotta get something off your chest just shoot our team an email - support@abradoodle.com or send us a message using our in game support center.  Try it out!   We actually respond!\r\n\r\nLove us?  We love you too!!  If you're having fun, please write a review.  We read every review and your nice comments gives us warm fuzzies. :)\r\n\r\nDon't love us?  Ouch.  Well let us know, because we want to improve!  Email us at support@abradoodle.com and we'll do our very best to make things right.  Or at least lose some sleep over thinking about how to. :)\r\n\r\nPlease note -\r\nThe games are intended for an adult audience.\r\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\nPractice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "READY TO PLAY THE #1 OFFLINE BINGO GAME? SPIN THE WHEEL FOR YOUR DAILY REWARD!",
  "installs": "1,000,000+",
  "score": 4.6212907,
  "ratings": 116296,
  "reviews": 44999,
  "price": 0,
  "IAPRange": "£0.89 - £58.28 per item",
  "developer": "Abradoodle Games - fun bingo games",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 28, 2017",
  "updated": 1583180729000,
  "version": "2.6.03",
  "recentChanges": "By popular request, leaderboards, challenges, and events will now end at 12pm midnight your time zone!<br><br><br>New room - Big City!<br><br>Lots of bug fixes and tweaks.",
  "appId": "com.abradoodle.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Holiday: Free Bingo Games",
  "description": "Welcome to Bingo Holiday, the #1 Classic & Special Bingo games!\r\nFREE Bonus every hour! Really? Amazing! Explore 30+ appealing scenes, Travel, Bingo, Send and receive gifts with friends, Challenge events and find all the Epic Collections! Awesome! Let's Play Bingo and enjoy never-ending fun anywhere, anytime!\r\n\r\nExclusive Game Features: \r\n★  Epic Power ups\r\nTry your luck with the unique power ups: Daub Hint, Shield, Triple Free, Instant Bingo, Bombs, Double EXP, Double Coins, Flash Cooling...Use Power ups to WIN BIG!\r\n★ Traditional Bingo 75\r\nPlay classic bingo games to have a fantastic exploration of World Tour with 20+ famous cities: New York, Paris, Dubai, London, Las Vegas, Tahiti, Bali, Santorini... Can’t wait to fly around the world and catch hold of the mysteries!\r\n★ Special Bingo styles\r\nMultiple Unique Bingo Styles bring you a bigger chance to win mega prizes! UK Jackpot, Slots Bingo, Blackout, Secret Garden, Dessert Master, Jackpot Blast, True Love...The greatly memorable scenes are right here waiting for you to experience!\r\n★ Thrilling Daily Tournament\r\nPlay with friends and compete with thousands of real-time multiplayers in the tournament, get thrills of the ranking entertainment! Collect tournament Jewelry puzzles to compose your Super Crown!\r\n★ Mystery Precious Collections\r\nTravel the world and find mystery Collection items! Accomplish the epic collections with a lot of fun! Two ways to earn your exclusive treasures either from shadow cards or puzzle pieces. \r\n★ Unprecedented Freebies\r\nSign in every day to collect your daily bonus and HOURLY freebies! Challenge with global players to win more rewards! The best choice to accompany with you and kill the long boring time!\r\n★ Social Friends System\r\nSharing is caring! Send and receive the gifts & collections with your friends! Spread out your fortune and double the happiness!\r\n\r\nEager to enjoy Big Win, Huge Win, Quick Win, Double Win? Play Bingo Holiday: FREE Bingo Games RIGHT NOW!\r\n\r\nAny suggestions? Having a fever for our Bingo app?\r\nWe would love to hear from you! You can reach us, the best Bingo games support team at:\r\ncustomer.support@bingoholiday.xyz\r\n\r\nAlready a big fan of Bingo Holiday: FREE Bingo Games? Like us on Facebook to catch more information and grasp your freebies!\r\nhttp://www.facebook.com/bingoholiday\r\n\r\nDisclaimer:\r\n*Bingo Holiday: FREE Bingo Games is intended for use for amusement purposes only. THERE IS NO REAL CASH PAYOUT YOU CAN EARN.\r\n*Bingo Holiday: FREE Bingo Games does not offer real money gambling or an opportunity to win real money.\r\n*Bingo Holiday: FREE Bingo Games uses Facebook as ads provider. Facebook and instagram likes wants to show ads relevant to you. For more information, please check https://m.facebook.com/ads/ad_choices.",
  "summary": "★ Enjoy the latest free Bingo game 2020 with 30+ rooms and epic collectables! ★",
  "installs": "1,000,000+",
  "score": 4.640842,
  "ratings": 109067,
  "reviews": 34593,
  "price": 0,
  "IAPRange": "£0.89 - £244.99 per item",
  "developer": "AE Magwin: Free Casino Slot Machines Bingo Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 22, 2016",
  "updated": 1587866736000,
  "version": "1.9.22",
  "recentChanges": "Enjoy your Bingo at home!<br>1.New Honor Collectibles -- Diamond, Legend, Supreme Scepters are added in the tournament! Win up to 300% scores now!<br>2.Do you know how to turn on/off the Auto Daub and Daub Hint? We have a more detailed guide now.<br>3.Background music has been upgraded. It&#39;s more relaxing and suitable for a journey now!",
  "appId": "com.arcadegame.games.bingo.holiday.free.slots.bash",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Story – Free Bingo Games",
  "description": "Welcome to Bingo Story, a fun & free bingo game with a friendly fairy tale twist! Blitz through our many puzzles and collect all our fun bingo collection pieces. Download now and enter bingo heaven!\r\n\r\nREAL-TIME FAIRY TALE BINGO\r\nOne of the best new Bingo games around the world! Bingo Story is the free bingo game that let’s you play exciting, live, online bingo against friends. Play bingo for a chance to collect board pieces and complete puzzles for your favorite fairy tale characters.\r\n\r\nPlay free bingo games all day long!\r\n\r\nIf you love fun, friendly bingo games, Vegas-style tournaments, bonus mini games, multi card board games or even fantastical fairy tale bingo, then download Bingo Story today!\r\n\r\nBINGO STORY FEATURES\r\n- 100% FREE bingo!\r\n- Live, real-time bingo games with friendly players\t\r\n- blitz through fantastical, fairly tale themed bingo boards to get a bingo\r\n- Play in real-time bingo tournaments with bingo players around the world\r\n- Collect treasure chests to win FREE power ups and MORE!\r\n- Play up to 4 fantastical, absolute bingo cards in fast-paced tournament-style game play\r\n- Collect and complete 30 unique fantastical puzzles for big rewards\r\n- Earn bonuses and play fun mini games to collect more\r\n- Play the Daily Spin to claim a free bingo prize\r\n- With hourly and daily FREE powerups, you’ll feel like you’re in bingo heaven!\r\n- Log in with Facebook, play as guest, and test your luck today!\r\n\r\nFAMILY BINGO FUN!\r\nBingo Story is a fun family game for all ages! Blitz the competition and bash your family and friends in friendly competition! Find puzzle pieces and try your luck with our fun mini games and get your absolute bingo on! \r\n\r\nFRIENDLY CLUBS\r\nWith our new and improved club system, there’s always a friendly face to help you along your bingo story. Club members can gift extra collection items and more, all you must do is ask a friendly club member!\r\n\r\n MINI GAMES\r\nTry our fun mini games, and with some luck, you can win big prizes! Our absolute bingo game offers a variety of mini games for players of all ages, and of course, our bingo is family friendly!\r\n\r\nFAIRY TALE PUZZLES\r\nIn addition to your absolute bingo experience, we’ve got fun, friendly fairy tale puzzles for you and your fellow bingo players to complete. With over 30+ puzzles to choose from, and new puzzles each month, there's tons of bingo fun in our free bingo game!\r\n\r\nCOLLECT THEM ALL!\r\nALL NEW collection items for our friendly bingo users to collect – each item being fantasy themed – and trade. With hundreds of fantastical collection items to collect, blitz to collect them all in Bingo Story!\r\n\r\nGLOBAL FUN \r\nOur global chat room is the hot spot for puzzle piece discussion and collection item trading! Friendly free bingo players are everywhere! It’s almost like bingo heaven in a chat!\r\n\r\nGET SOCIAL\r\nHave you already become one of the best free bingo game players in bingo town? Dub yourself the king of bingo and go to bingo heaven? Have you completed all the bingo puzzles, and are looking for more? Look no further: follow our Facebook page and Twitter page for up-to-date news on Bingo Story, the fantastical free bingo game, and for free daily rewards here:\r\n\r\nhttps://www.facebook.com/bingostorycommunity\r\nhttps://twitter.com/BingoStoryGame\r\n\r\nNeed help? Try our FAQ at https://www.clipwiregames.com/bingo-story-faq\r\n\r\nADDITIONAL INFORMATION:\r\nBingo Story offers optional in-app purchases for additional content and in-game currency. Success within this free Bingo game does not imply future success with real money gambling. Our mobile game does not offer real money gambling or any opportunities to win real money or prizes. Blitz your way to glorious bingo and bash the competition in this mobile game! Success within, and winning in friendly, absolute bingo heaven, in free bingo does not imply future success with real money gambling or casino games.",
  "summary": "Free bingo! Play bingo with fun puzzles, tournaments and bingo games!",
  "installs": "1,000,000+",
  "score": 4.548784,
  "ratings": 38426,
  "reviews": 12273,
  "price": 0,
  "IAPRange": "£0.99 - £199.99 per item",
  "developer": "Clipwire Games and Bingo",
  "genre": "Board",
  "contentRating": "PEGI 3",
  "released": "Dec 20, 2016",
  "updated": 1587995919000,
  "version": "1.18.1",
  "recentChanges": "Cinderella is headed to Bingo Story! Buckle up for brand new events from the famous fairy-tale The Little Glass Slipper!<br><br>Be on the look out for new events, puzzles and a brand new bingo room!",
  "appId": "com.clipwiregames.bingostory",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Cooking Delicious - Free Live BINGO Games",
  "description": "You are finally here! Find the ⭐MOST FUN and RELAXING⭐ BINGO GAME on Google Play!\r\n\r\nPlay✨Bingo Cooking Delicious - Free Live BINGO Games✨ with friends and millions of players around the world! Try classic bingo and other variations in 10+ Special Bingo Rooms! Enjoy an immersive bingo tour experience like never before -- traveling around world while cooking a variety of 🍩 local cuisines 🍩! \r\n\r\n ⏰Join us Now⏰! You can get 💰a large number of tickets💰 which can hardly be  used up! \r\n\r\nAll our BINGO games are FREE! Download now and enjoy:\r\n► Real high-quality graphics featuring 10+ unique city maps!\r\n► Professional and immersive voice of bingo caller! Various background music for each city!\r\n► Free tickets, bonus spins and extra power-ups every day! \r\n► Leaderboard for participants to get amazing awards every week!\r\n► Bingo 4 cards to win a jackpot prize! \r\n► Other exciting casino mini-games to play when you are tired of bingo!\r\n\r\n\r\nPlay Bingo With Friends Anytime, Anywhere: \r\n► Compete with friends in one room and see who can get the Bingo!\r\n► Participant in Leaderboard with friends! Climb to the top and get HUUUGE rewards!\r\n► Receive 💰FREE TICKETS💰 from friends every day!\r\n\r\n\r\nPlay as a Chef in this Relaxing and Fun Bingo Game!\r\n► Find fresh and yummy ingredients when playing Bingo and opening boxes!\r\n► COLLECT INGREDIENTS to make delicious local dishes!\r\n► Each cuisine can help you win a huge CUISINE COOKING PRIZE!\r\n\r\n\r\nFun and Balance Power-Ups Give You More Luck!\r\n► Use epic power-ups to double EVERYTHING you get in the round!\r\n► Use GAME-CHANGING POWER-UPS such as Instant Bingo and Double daub!\r\n► No CD Time! Use GAME-CHANGING POWER-UPS if you are lucky to daub enough numbers!\r\n\r\n\r\n————————————\r\nBingo Cooking Delicious - Free Live BINGO Games is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Play FUN casino BINGO games during COOKING And TRAVELING ALL AROUND the WORLD!！",
  "installs": "100,000+",
  "score": 4.7145185,
  "ratings": 6202,
  "reviews": 1800,
  "price": 0,
  "IAPRange": "£0.89 - £93.99 per item",
  "developer": "Gluon Interactive Ltd.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 14, 2018",
  "updated": 1588127253000,
  "version": "2.8.0",
  "recentChanges": "Feature:<br> - Performance improvements.<br> - Bug fixes.",
  "appId": "com.cooking.bingo.ldkwh",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo™",
  "description": "Play Bingo™ like never before! Play with your friends and use unique boosts for awesome effects like free daubs, extra coins and more! Every game grants rewards to level up and unlock new rooms! More cards than any other Bingo game! Slick controls let you easily switch between cards, daub called numbers and call out Bingo as soon as you have it! Do you have what it takes to play up to 8 or 12 cards at once? Find out now with Bingo™! \r\n\r\n-WIN using unique multi-level boosts to gain an explosion of free daubs, reveal upcoming numbers, and add bonus spaces to your cards! \r\n-COMPETE with friends and see who will get the most Bingos! \r\n-COLLECT Treasure Chests for great rewards such as coins, extra boosts, tickets and more! \r\n-COMPLETE fun, themed Collections in every room to get more tickets and play even more! \r\n-JOIN different rooms with unique themes!\r\n\r\nExcellent performance on your Android device. \r\n\r\nPlease note: Bingo™ is an online only game. Your device must have an active internet connection to play.\r\n\r\nPlease note that Bingo™ is free to play, but you can purchase in-app items with real money.  To delete this feature, on your device go to the Google Play Store, tap the Menu button, select Settings > Use PIN for purchase.  Then, set up the four-digit PIN on the option below. \r\n\r\n\r\nNote: READ_PHONE_STATE permission is used to help us remember your progress.\r\n\r\nThe game is intended for an adult audience. The game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\r\n\r\n\r\nFollow Storm8 Studios! \r\nhttp://www.storm8-studios.com\r\nfacebook.com/storm8 \r\ntwitter.com/storm8",
  "summary": "The #1 Bingo game for your Android device. Play FREE forever!",
  "installs": "5,000,000+",
  "score": 4.415562,
  "ratings": 99205,
  "reviews": 26052,
  "price": 0,
  "IAPRange": "£0.79 - £79.99 per item",
  "developer": "Storm8 Studios",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 8, 2014",
  "updated": 1580499958000,
  "version": "Varies with device",
  "recentChanges": "- Bug fixes<br>- Performance improvements",
  "appId": "com.sharkparty.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Blitz™️ - Bingo Games",
  "description": "Blitzers, we want to thank you all for your continued support over the last few months. We take great pride in knowing that Bingo Blitz is bringing our players joy, and relief, if only for a few moments of your day. We will continue doing our very best to improve the Bingo Blitz experience for our loyal community, and provide more fun opportunities for you to #playaparttogether and stay connected during these challenging times. Stay safe, and we wish good health to all. \r\nJoin Blitzy the Bingo cat for an all-out free bingo good time! Are you ready for the best bingo experience EVER? \r\n\r\nBingo Blitz has so much cool free stuff to keep you entertained BEYOND free bingo!\r\n\r\n🏆 Multiple card play: One bingo card is SO old-skool - play multiple free bingo games at the same time!\r\n🏆 Grab Powerups: Need a little extra? Grab powerups for even bigger bingo wins! \r\n🏆 Collect souvenirs: What’s a round the world trip if you don't have cool stuff to show for it? Grab souvenirs in every city you visit! \r\n🏆  Win special bingo cards: This is Bingo Blitz, free bingo with a difference - we do things a bit differently here. \r\n🏆  Play epic mini-games! Bingo Blitz is about more than just bingo - play mini-games while you wait for your next bingo game to start!\r\n🏆 Go with the seasons: Check out Blitzy’s awesome SEASONAL and FEATURED bingo rooms, for even bigger free bingo prizes, collection items and online bingo rewards!\r\n\r\nNew:\r\n🌾Feel the charm of the farm and join Blitzy in breaking new ground on his latest culinary conquest! Step into the soil & get your hands dirty   \r\n🌾Collect your ingredients, then, hit the new restaurant to cook up some delicious farm to table flavors, and taste the rewards of the organic hideaway!\r\n\r\nGet DAILY Extra Goodies - This is EPIC Free Bingo, Just For You! \r\n\r\nWe love our Bingo Blitz players, and we like to show you the love DAILY!\r\n\r\n🎱 Journey around the world for DAILY FREE COINS and CREDITS: free bingo games don't get better than this! \r\n🎱 Play epic bingo side games worldwide, including bingo slot machine spins and spin the bingo bonus wheel!\r\n🎱 Go on fun free bingo quests all around the world for epic bingo live prizes and bonuses, including extra credits, coins and power-ups! \r\n🎱 Play free bingo games tournaments, with DAILY wins!\r\n\r\nLooking for EPIC free bingo games with cool daily extras? You've got it all, in Bingo Blitz!\r\n\r\nLet’s Take Things Online: Bingo Online - Get Social and Play Online Bingo! \r\n\r\nInternational online bingo is SO much more fun with friends; free bingo doesn't get much better than this!\r\n\r\n🧑‍🤝‍🧑Chat away in the online bingo live chat room!\r\n🧑‍🤝‍🧑Invite your friends for even bigger free bingo bonuses!\r\n🧑‍🤝‍🧑 Trade cards from all of your bingo games, and complete your collections quicker for more rewards!\r\n🧑‍🤝‍🧑Share the love, and share your bingo pop wins with your friends!\r\n\r\nGet in touch: Tell us about playing the Best Free Bingo Game!\r\n\r\nWe would love to hear from you, wherever you are in the world! You can reach us at http://Bingoblitz.support.buffalo-studios.com.\r\nBINGO Blitz contains optional in-app purchases. This game is intended for an adult audience (21+) for amusement purposes only and does not offer ‘real money’ gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at ‘real money’ gambling.",
  "summary": "🌎Play Epic Free Bingo With All of These Cool Extra Features!🌎",
  "installs": "10,000,000+",
  "score": 4.529935,
  "ratings": 640456,
  "reviews": 198808,
  "price": 0,
  "IAPRange": "£0.62 - £299.99 per item",
  "developer": "Playtika Santa Monica",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 14, 2012",
  "updated": 1589289536000,
  "version": "Varies with device",
  "recentChanges": "NEW ROOM! Play BIG APPETITE now, and satisfy your hunger for huge rewards!",
  "appId": "air.com.buffalo_studios.newflashbingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Journey - Lucky Bingo Games Free to Play",
  "description": "Bingo Journey is a free classic bingo game with lots of free Cash and Power-ups to claim every day! Take a tour in Bingo Journey with your friends and family to join a free bingo world and enjoy an odyssey to places of interest around the world. \r\n\r\n# You will get 500 Cashes & 50 Power-ups to start the bingo journey. \r\n# Daily bonus of 180+ Cash for you to collect every day. The higher level you reach; the more daily bonus you can get. \r\n# In the club, you can complete quests in groups and send gifts to each other.\r\n# Free Power-ups and treasure boxes for you to collect every day!\r\n# Play against thousands of real players in real time. \r\n# Join Elite to challenge Elite Exclusive Quest.\r\n# Boost your cards for better rewards.\r\n# The more puzzles you complete, the more Cash you can claim as daily bonus. \r\n# Up to 7 various Power-ups to help you get more rewards.\r\n# The featured games are elaborately prepared with quality products and rewarding payout.  \r\n# Graphics are best quality among casino games and there are lots of featured bingo rooms for you to choose from.\r\n\r\nBingo Journey frequently updates and adds seasonal and featured bingo games. Our game is a good way to relax and de-stress you from the pressure of daily life. You can play with your family, friends and thousands of players around the world; You can play alone or group together in the club to complete quests! It is also a good way of socializing to play our game!\r\n\r\nThe game is designed for people 21 years of age or older and is for entertainment purposes only. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n\r\nOur official website: https://bingo-journey.com/\r\n\r\nFacebook: https://www.facebook.com/BingoJourney\r\nInstagram: https://www.instagram.com/bingo_journey/\r\nYouTube: https://www.youtube.com/channel/UC3dh2DEocAWJcXf87U49FRw?view_as=subscriber\r\nTwitter: https://twitter.com/bingojourney20",
  "summary": "★The #1 Bingo and Slots game. Enjoy BINGO party at Holiday! ★",
  "installs": "1,000,000+",
  "score": 4.5584617,
  "ratings": 104400,
  "reviews": 32753,
  "price": 0,
  "IAPRange": "£0.79 - £94.99 per item",
  "developer": "QY Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 14, 2018",
  "updated": 1588418951000,
  "version": "1.2.8",
  "recentChanges": "1. Newly added Card Castle system. Enjoy the thrill of collecting precious cards!<br>2.Bug fixed and game optimized.",
  "appId": "com.bingo.scape.android.free",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo at Home",
  "description": "Available for mobile, tablet and Android TV.\r\n\r\nThe \"Bingo at Home\" app is a bingo caller to play bingo at home, among family or friends.\r\n\r\nWhen a bingo game starts, the app begins to call the bingo balls. The game can be paused and restarted as needed, for example, to check if the line or bingo is correct, to check all the numbers already called, etc.\r\n\r\nThere are two game modes:\r\n\r\n- Automatic mode: The app begins to call the bingo balls until paused or until there are no more balls left. The app allows to configure the speed with which the balls are called.\r\n\r\n- Manual mode: The calling of the balls is made by tapping a button. Each time you tap the button, the app calls the next ball. If it is desired, you can silence the app so that the same person who is in charge of calling the balls is the one who announces the numbers.\r\n\r\nThe app can be used to play 90 balls bingo, the bingo variant that is played in Spain, and to play 75 balls bingo, the american bingo variant.\r\n\r\nIn the 90 balls bingo variant, the first one that completes a line is awarded with the line prize, and the first one that completes the whole bingo card is awarded with the bingo prize.\r\n\r\nIn the 75 balls bingo variant there is only one prize, the winner is the first who completes the shape currently in play in the bingo card. The app has several shapes to choose that you can complete. Every new game the shape changes, you can either start the game with this shape or select a new one.\r\n\r\nThe bingo cards to play at home can be printed for free from the Bingo.es website:\r\n\r\nhttp://www.bingo.es/cartones-bingo/ \r\n\r\nOr you can download our companion app \"Bingo Cards\" from:\r\n\r\nhttps://play.google.com/store/apps/details?id=es.bingo.cartonesbingo",
  "summary": "Bingo game to play at home among your family/friends. The app is a bingo caller.",
  "installs": "500,000+",
  "score": 4.4217687,
  "ratings": 1494,
  "reviews": 640,
  "price": 0,
  "developer": "CAB Magazine Online SL",
  "genre": "Casual",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 6, 2015",
  "updated": 1563390985000,
  "version": "3.3.1",
  "recentChanges": "- Added new languages: Catalan, Valencian, Euskera and Galician.",
  "appId": "es.cabmagazine.bingoencasa",
  "searchTerms": "bingo"
 },
 {
  "title": "Sky Bingo – Play Real Money Bingo & Slots",
  "description": "At Sky Bingo,we’re not just about playing online, real money bingo games. We have 100s of fantastic online slots,, as well as instant win scratch cards, all available on our exciting bingo app. ,\r\n\r\nOur real money bingo, slots and instant win games are big, bright, engaging, and fun. Some are recognisable, big names such as Rainbow Riches🍀,Deal Or No Deal💷, and Centurion. to name a few, and exclusive to Sky Bingo, games such as  Tipping Point Bingo & slots💰and Mystical Bingo🔮….But all of them are exciting.  \r\n\r\nWe offer exclusive promotions every month so play bingo with Sky for the chance to win exciting big prizes, rewards and jackpots🤑. Why not discover our newest promotion on the Sky bingo, app today, who knows you may even end up in one of our Bingo party rooms!\r\n\r\nYou will be offered the warmest welcome in our bingo, rooms☺️, even in the app you are able to chat to fellow players and our chat room hosts. Watch out for the extra prizes our chat room hosts share, all to ensure you have the best online bingo, experience, and keep things exciting. \r\n\r\nAlready have a Sky Vegas, Sky Bet, Sky Casino or Sky Poker account? Did you know you can log into any of these and play Sky Bingo, one account, one wallet, all with fingerprint log in and fast withdrawal?\r\n \t\r\n💜To try us today and discover your own favourite Bingo games, online slots, and instant wins and above all Expect Excitement! 💜\r\n\r\nNew Customers - Welcome Offer\r\nDeposit and spend £10 cash on bingo tickets and you’ll receive your £60 bonus. The £60 bonus will be split into two bonuses - £40 Bingo Bonus which can be spent in any of our Bingo rooms and a £20 Rainbow Riches Slots Bonus which can be used to play on our Rainbow Riches slots game. Key Terms: Staking Requirements Apply. Eligibility Restrictions Apply. £10 Must Be Spent On Bingo Tickets. £40 Bingo Bonus Carries x2 Wagering Requirement. £20 Rainbow Riches Slot Bonus Carries x20 Wagering Requirement. 30 Day Expiry Period Applies To Both Bonuses. Further T&Cs Apply: goo.gl/uCQtBA\r\n\r\nPrize Burst - Free to Play Every Day\r\nKey Terms: Opt In Required, Customers Will Be Opted Out After 28 Days of Inactivity, Prize Eligibility Restrictions Apply, Some Prizes Carry Wagering Requirements, Bonus Expiry Applies, Further T&Cs Apply: goo.gl/3SG9HU\r\n\r\nResponsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support in the United Kingdom please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/ and in Ireland please contact Gamble Aware at 1800 753 753 or visit http://www.gambleaware.ie/\r\n\r\nNeed some help and support? \r\nYou can contact our friendly team via phone, chat or email, check our support pages for details: https://support.skybingo.com\r\n\r\nThe Sky Bingo app is brought to you by Bonne Terre Limited, an Alderney registered company wholly owned by The Stars Group Inc. and licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Bingo is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group. The Sky trademarks used in the app are owned by the Sky UK Limited and its affiliated companies and are used under license. To place a bet with Sky Bingo you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Bingo. Customers located outside of the UK or Ireland will be prohibited from using this app.",
  "summary": "Join us for all the excitement of online Bingo, and real money jackpots",
  "installs": "100,000+",
  "score": 4.5059524,
  "ratings": 1686,
  "reviews": 734,
  "price": 0,
  "developer": "Sky Betting and Gaming Apps",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1553602046000,
  "version": "1.11.0",
  "recentChanges": "We’ve made some changes behind the scenes to improve the overall experience of our app and have some exciting changes coming soon, keep your eyes peeled. If you enjoy using Sky Bingo, please support us by leaving a review.",
  "appId": "com.skybet.app.skybingo",
  "searchTerms": "bingo"
 },
 {
  "title": "tombola bingo - Britain's Biggest Online Bingo",
  "description": "Come join the fun at tombola, Britain’s biggest bingo app. We’ve got all of the games you know and love like bingo90 and bingo80 as well as some of our own unique bingo and casino games.\r\n\r\nWhat’s more new players can get their hands on our welcome offer; if you deposit £25 we’ll give you a £50 BONUS or deposit £10 and get £20 extra to play with*\r\n\r\nIntroducing our new daily 1p game, Worlds. WIN cash prizes up to £1,000.\r\n\r\n…and remember if you win and want to withdraw any real money, there are no wagering requirements at all. Nada. So if you win money in any game you’re able to withdraw the full amount. 💷\r\n\r\nAlready a tombola player? Then simply download the app and login using your usual details and you can play all of the games you know and love on the move, in front of the TV or even on the loo if you so wish… you can’t do that with a desktop computer. 🍀🍀🍀\r\n\r\nOur games start from just 2p in bingo Lite and we have unique bingo games that you’ll not find anywhere else. If that still doesn’t tickle your fancy how about jackpots up to £20,000?!\r\n\r\nCommunity is at the heart of tombola bingo, all of our online bingo games have chat rooms attached to them so you can have a natter with other players and our friendly bunch of Chat Moderators, who you’ll see from time to time. Our Chat Mods are happy to answer all of your tombola questions and you can also win money in their chat games throughout the day. ⭐⭐⭐\r\n\r\nWe’re a gambling website but we want you to gamble responsibly, we want you to have fun while you play whilst making sure you stay in control of your spending. We’ve got a number of responsible gambling features to help you do so – from setting a deposit limit (don’t forget you get £1 bonus for doing this), freezing a game, cooling off and much more. Be sure to check out the “play responsibly” section in your account.\r\n\r\nThis is just another reason we’ve won Bingo Operator of the year (2018, 2017, 2016, 2014, 2013, 2012) and Best Overall Bingo Operator (2012)\r\n\r\nGet in touch:\r\n\r\nIf you need any help our Customer Service team are available 24/7 live chat,\r\n\r\ntelephone: 0800 29 888 73\r\n\r\nemail: support@tombola.com\r\n\r\nWe’d love to hear how you think we could improve our bingo app, send your comments or suggestions to feedback@tombola.com or leave a review.\r\n\r\nOver 18s only. This is a real money gambling app.\r\n\r\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/\r\n\r\n\r\n*Deposit £10-£25 and get 200% bonus money. First deposit only. Terms Apply.",
  "summary": "🍀 + 💰+ 🤑= tombola bingo ➡ the best online bingo!",
  "installs": "100,000+",
  "score": 4.402214,
  "ratings": 13569,
  "reviews": 6548,
  "price": 0,
  "developer": "tombola Ltd",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Aug 1, 2017",
  "updated": 1585303555000,
  "version": "Varies with device",
  "recentChanges": "Bug fixes and improvements",
  "appId": "air.com.tombola.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Showdown: Free Bingo Games – Bingo Live Game",
  "description": "#PlayApartTogether to win! WHO and SciPlay remind you to stay home and play it safe  Howdy, winners! It’s your lucky day! This showdown is about to start and you have front-row tickets! The free app Bingo Showdown will take you for a wild ride from the Wild West! This live bingo game is a celebration of thrilling prizes and awesome bingo live features! Enjoy the best bingo in town!\r\n\r\nLike playing online games with friends?\r\nThere’s nothing like a good ol’ board game, especially when it fits right in your pocket! The Android version for one of the all-time favorite board games makes it even easier and more exciting to play and win. \r\n\r\nSciPlay, the casino games giant behind mobile free casino slots like Monopoly Slots, Quick Hit Casino Slots and Jackpot Party Casino, as well as other free games for adults, hit the jackpot and managed to create another mega hit for players everywhere! \r\n\r\nMultiply the fun and double the thrill! \r\nAs you start playing free bingo games, you will immediately feel an urge to share this fun and play with friends. Well, guess what, cowboys and cowgirls? You've just downloaded one of the best multiplayer games! This free board game allows you to invite your friends to play in a live bingo tournament, and also play online with other bingo players from anywhere in the world! It’s the bingo age, start playing multiplayer games with friends right NOW. Get that bingo ball rolling and enjoy the best bingo live games for free!\r\n\r\nWin the FREE bingo game bonus bash! \r\nSciPlay brings you fun online games that are fun to play, and incredible to win! Playing bingo live is a journey full of surprises, bonuses, gifts, rewards, and challenges. Play bingo games for free, collect your daily bonus and win your way to the top of the tournament! You’ll feel like you’ve won the lottery with every lucky scratch. \r\n\r\nPlay Lucky Bingo Games! \r\nThis FREE bingo app has special minigames, card games, and challenges for every holiday, unique features that make it pop, and more. Play this bingo game with 1 to 5 cards in live bingo rounds simultaneously, and train your brain playing bingo games for free. \r\n\r\nGreat minds play mind games! \r\nBingo mania is a whole lot of fun, but it offers more than just entertainment! It’s a thinking brain game that will help you expand your mind and train your brain while you play relaxing free bingo games. This bingo live fun game has won the lotto of mobile entertainment and truly has it all. \r\n\r\nSave the town and have a blast! \r\nWe invite you to play sheriff and capture every outlaw in town! Complete the game’s Most Wanted puzzle book, win bingo cards, and bring peace and quiet back to the city. You’ll be everyone’s hero by playing bingo games free of charge, and win free bingo coins while you’re at it! What could be better?\r\n\r\nDownload the bingo live app and be a part of the bingo blitz party and enjoy the fun frenzy everyone’s talking about! Here in bingo heaven, freebies and huge wins are an everyday thing. Each one of the bingo rooms is full of surprises that you can only discover as you join an amazing bingo journey and play online bingo live games. It truly is the coolest bingo bash around. \r\n\r\nHere, every day is a special bingo holiday, celebrated with bingo balls and millions of players who love nothing more than to play bingo live. \r\n\r\n- LIKE Bingo Showdown @ Facebook.com/BingoShowdown\r\n- Log in with Facebook and sync your account with your PC and all your devices.\r\n- Enjoy the game directly on your PC through Facebook at\r\nhttps://apps.Facebook.com/Bingo-showdown.\r\n\r\n• The games are intended for an adult audience.\r\n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n• Practice or success at social casino gaming does not imply future success at \"real money gambling.”",
  "summary": "The Best Live Bingo Game! Play the Lucky Bingo Cards to Win a Free Bingo Bonus!",
  "installs": "5,000,000+",
  "score": 4.655685,
  "ratings": 588943,
  "reviews": 196555,
  "price": 0,
  "IAPRange": "£0.89 - £84.99 per item",
  "developer": "Spicerack Media",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Dec 11, 2014",
  "updated": 1587674933000,
  "version": "436.0.0",
  "recentChanges": "Yeehaw, Bingo Fans! We&#39;ve made several updates to Bingo Showdown to improve your daubing experience!",
  "appId": "air.com.spicerackmedia.bingoshowdown",
  "searchTerms": "bingo"
 },
 {
  "title": "Gala Bingo - Play Online Bingo Slots & Games",
  "description": "Welcome to Gala Bingo, experience the thrill of great casino gaming right in the palm of your hand to win real cash with over 80 great games including Slots, Table Games, Scratchcards and many more! Get a £30 WELCOME BONUS now and play Online Bingo, Slots & Games wherever and whenever you want! Join Gala Bingo today and get more prizes in our welcome bundle. \r\nDiscover more than 22 jackpot games including the popular Iron Man 2 & 3, Cleopatra, Clover Rollover, Beach Life and Adventures in Wonderland! Play today and enjoy exclusive Gala Bingo games such as Coronation Street, Coconut Island and Gourmet Ranch Riches!\r\nDownload Gala Bingo today, proud winners of ‘Brand of the year' and 'Innovation Bingo' at the 2017 EGR Awards as well as winning ‘Best Marketing Campaign’.\r\nFeatures:\r\n◆ You have more than 100 BIG MONEY slots and 21 Bingo Rooms at your fingertips – whenever you want, wherever you are. \r\n\r\n◆ You can enjoy games EXCLUSIVE to Gala, including the popular The Chase Bingo and famous Coronation Street Bingo, Slots and Casino games.\r\n\r\n◆ You can choose from the most imaginative and entertaining Slots on the market. Enjoy the exotic Cleopatra, The Greatest Train Robbery, Big Banker Slot, Rainbow Riches pick ‘n’ mix and explosive Dynamite Digger Jackpot.\r\n\r\n◆ Guaranteed Daily Jackpots must be won every day including the £2.5k ‘ticker’ jackpot \r\n\r\n◆ You can pre-buy tickets for ALL games 24/7! Snap up entry to the big games, then play at your leisure – either online or via the mobile App. \r\nWe KNOW you’ll love the Gala Bingo App, but are always looking to do things better. If you think we can improve, please send your feedback to mobilefeedback.gala@coral.co.uk.\r\n\r\n** £30 Welcome Bonus Terms and Conditions**\r\n18+. New online customers only. Certain countries only. Min first bingo deposit and spend £10 = £30 bingo bonus. Wagering reqs apply: 4 x. Bingo Bonus valid for 1 week after credit. T&Cs apply.\r\nDirect link for full T+Cs for the welcome bundle:\r\nhttps://www.galabingo.com/promotions/welcome-offer\r\n\r\nPromoter: Gala Interactive (Gibraltar) Limited, Regal House, Queensway, Gibraltar.\r\n18+, this is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please see below contact details for Gamble Aware in both UK and Ireland.\r\nUK: https://www.begambleaware.org and 0808 8020 133\r\nIreland: http://www.gambleaware.ie and 1800 753 753",
  "summary": "Play the best free online Bingo, Slots &amp; Games. Get a £30 welcome offer",
  "installs": "100,000+",
  "score": 4.3431373,
  "ratings": 2061,
  "reviews": 1159,
  "price": 0,
  "developer": "Gala Mobile Apps",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 31, 2017",
  "updated": 1584709222000,
  "version": "20.03.05",
  "recentChanges": "We regularly bring updates to the Google Play store so that you can continue to Play Happy :-)<br><br>The Gala Bingo Team",
  "appId": "com.gala.android.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "MONOPOLY Bingo!",
  "description": "Play MONOPOLY Bingo games FREE with the award-winning mobile bingo app! Combine classic MONOPOLY rules with bingo boards and VOILA! You get MONOPOLY Bingo! In our free online bingo game, you can play with MULTIPLE bingo cards – more than any other bingo game out there!\r\n\r\nWith over 5 million installs, we bet you’ll LOVE MONOPOLY Bingo too!\r\n\r\nEnter live bingo halls as you advance through the MONOPOLY game board. Land on your favorite classic MONOPOLY properties, wait for the bingo balls with your numbers and BINGO! You win! Soon your MONOPOLY money will grow and you can start building houses and hotels – just like the classic MONOPOLY game you know and ❤!\r\n\r\nMultiple Bingo Cards at a time\r\nPlay MONOPOLY Bingo with more bingo cards than any other bingo game! Try your luck by playing with up to 8 bingo cards simultaneously, using smooth controls to easily switch between them. Unlock more bingo cards by completing MONOPOLY game-themed collections!\r\n\r\nBingo Tournaments & Weekly Puzzle Events\r\nCompete against friends in our free MONOPOLY Bingo game’s tournaments! Play free games and see which of your friends can complete the most Bingo cards! With our multi-level boosts, you can see future bingo numbers, get free daubs, and bonus spaces on your bingo cards to help you win. If you ever run out, you can always use the MONOPOLY money you collected to buy more.\r\n\r\nFeatures\r\n-Collect Community Chests to gain coins, extra boosts, bingo tickets and more as you move along the MONOPOLY board.\r\n-Build houses and hotels by gaining experience in different rooms.\r\n-Visits your favorite MONOPOLY properties such as St. James Place, Electric Company, or Boardwalk.\r\n-Travel across classic MONOPOLY properties to reach places around the world.\r\n-Increase your MONOPOLY fortune!\r\n\r\nMONOPOLY Bingo is such a fun game to play! Classic MONOPOLY pieces combined with bingo cards makes for an irresistible, fun time! Play live bingo with other players from around the world. With more bingo cards than any other game, you’ve got AMAZING chances to win! So what are you waiting for?! Get out your bingo daubers and starting calling out “BINGO!”\r\n\r\nThe best looking, smoothest Bingo experience available on your Android device.\r\n\r\nPlease note: MONOPOLY Bingo! is an online only game. Your device must have an active internet connection to play.\r\n\r\nPlease note that MONOPOLY Bingo!  is free to play, but you can purchase in-app items with real money. To disable this feature, go to the Google Play app on your device, tap the Menu button, select Settings > Use password to restrict purchases. Then follow the directions to complete setup. In addition, MONOPOLY Bingo!  may link to social media services, such as Facebook, and Storm8 will have access to your information through such services.\r\n\r\nNote: READ_PHONE_STATE permission is used to help us remember your progress.\r\n\r\nThe game is intended for an adult audience. The game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\nStorm8 Studios is the #1 Mobile Social Game Developer on Android.\r\n\r\nUse of this application is governed by the Storm8 Studios Terms of Service. Collection and use of data are subject to Storm8 Studios Privacy Policy. Both policies are available at http://www.storm8-studios.com/terms/ and http://www.storm8-studios.com/privacy/\r\n\r\nThe MONOPOLY name and logo, the distinctive design of the gameboard, the four corner squares, the MR. MONOPOLY name and character, as well as each of the distinctive elements of the board and playing pieces are trademarks of Hasbro for its property trading game and game equipment. © 1935, 2014 Hasbro. All Rights Reserved.\r\n\r\nFollow Storm8\r\nhttp://www.storm8-studios.com\r\nfacebook.com/storm8 \r\ntwitter.com/storm8",
  "summary": "Strike it rich as you travel around the board in MONOPOLY Bingo!",
  "installs": "10,000,000+",
  "score": 4.2112164,
  "ratings": 188397,
  "reviews": 57526,
  "price": 0,
  "IAPRange": "£0.79 - £79.99 per item",
  "developer": "Storm8 Studios",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 18, 2015",
  "updated": 1579043571000,
  "version": "Varies with device",
  "recentChanges": "- Bug fixes and performance enhancements.",
  "appId": "com.sharkparty.monopolybingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo",
  "description": "Different way of playing BINGO game!\r\nWould you like to test your luck without the penalty for losing?\r\nThis BINGO app is the best way!\r\n\r\nThis BINGO game is very interesting.\r\nBest game to play when you just want to kill time.\r\n\r\n■Bingo Stage Mode\r\nBingo game that you have to meet the requirements that was set for each stage.\r\nChoose the ball that have the same number as the number appear above! If there is none, just keep moving on!\r\nCollect the skill to get a bingo turning chance!!  Store the skill gauge to use one of the three skills!\r\nThere are more than 2000 stages, and there will be more coming soon!\r\n\r\n■Bingo Battle mode\r\nSee who is the first to get BINGO!\r\nAccoring the rank the coin you gain can increase!\r\nLet's look forward to move to the higher level in the coin ranking!\r\n\r\n■Arena\r\nUsers with equal ability compete for the number of progresses of the stage.\r\nThe period is one week, if you enter the top ranking you will get a nice item!\r\nEvery week, the rankings are reset and re-matched so everyone has a chance!\r\n\r\n■Bingo Hard Stage game Mode\r\nIt is unsatisfactory in normal game mode! we prepared it for those who say.\r\nA large amount of gimmick comes out on stage.\r\nIt is a game mode for quite a bingo mania.\r\nThere are more than 700 stages, and there will be more coming soon!\r\n\r\n■Bingo Party game mode\r\nWith a lot of people, You guys compete BINGO 's speed with bingo card.\r\nLet's score points as you punch a hole and let's make a lot of holes on the BINGO cards.\r\nDo you not win the reward by ranking up?\r\nyou can play free of charge only once a day.\r\n\r\n■Bingo Challenge game mode\r\nChallenge is a game mode that lasts until you can not BINGO.\r\nAll users who participated in the number of BINGO cards in one week will compete.\r\nLet's battle with the number we were able to do.\r\nFrom the user who was able to do the most BINGO, you can get a trophy.\r\nYou can play free of charge only once a day.",
  "summary": "Lots of fun!!  This is a super exciting free BINGO game!!",
  "installs": "1,000,000+",
  "score": 4.333246,
  "ratings": 38772,
  "reviews": 10312,
  "price": 0,
  "IAPRange": "£0.58 - £47.49 per item",
  "developer": "Cross Field Inc.",
  "genre": "Card",
  "contentRating": "PEGI 3",
  "released": "Oct 5, 2012",
  "updated": 1581490103000,
  "version": "2.3.38",
  "appId": "com.crossfield.casinogame_bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "My Bingo Life - Free Bingo Games",
  "description": "Enjoy  unlimited  free  bingo games,  complete  daily  quests,  build  your  collection  of  cute  creatures,  play  mini  games  at  the  funfair  and  much,  much  more!  It’s  the  ultimate  game  for  bingo  lovers  as  you  travel  to  magical  worlds  and  embark  on  an  epic  bingo  adventure  in  Bingo  Life! \r\n\r\nYou  can  play  1,  2  or  4  card  bingo games  and  select  your  bet  per  card.  Simply  daub  your  numbers  as  the  bingo  caller  says  them  and  get  as  many  BINGOs  as  you  can  before  the  time  runs  out!  With  your  winnings  you’ll  be  able  to  unlock  lots  of  new  daubers,  bingo  animations  and  cute  avatars.  Fancy  a  more  relaxing  bingo game experience?  Take  it  easy  in  practice  mode! \r\n\r\nAs  you  play  you’ll  collect  funfair  tokens  which  you  can  use  to  play  mini  games  at  the  carnival  like  super  drop  and  duck  diver  to  get  more  coins  and  power  ups  to  help  you  get  those  BINGOs!  Collect  enough  high  roller  tokens  to  enter  a  special  high  stakes  bingo  room  where  the  rewards  are  massive!   \r\n\r\n-------------------------------------------------------\r\nBINGO  LIFE  –  AWESOME  FEATURES\r\n  ------------------------------------------------------\r\n⦁ Play  free  1,  2  or  4  card  bingo  \r\n⦁ Travel  to  the  funfair  to  play  mini  games  like  donkey  derby  and  duck  diver  \r\n⦁ Unlock  awesome  new  avatars  \r\n⦁ Collect  new  bingo  daubers,  bingo  animations  and  more\r\n⦁ Build  your  collection  of  cute  creatures  from  different  magical  worlds  \r\n⦁ Complete  special  events,  quests  and  rewards  \r\n⦁ Use  powerful  bingo  boosters  \r\n⦁ Earn  huge  rewards  in  the  high  roller  bingo  room!  \r\n⦁ Adjust  the  caller  speed",
  "summary": "Bingo game adventures await! Super fun bingo, collectibles, mini games &amp; more!",
  "installs": "500,000+",
  "score": 4.548558,
  "ratings": 13300,
  "reviews": 5036,
  "price": 0,
  "IAPRange": "£1.99 - £45.49 per item",
  "developer": "Beautiful Bingo Games by Difference Games LLC",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 19, 2018",
  "updated": 1586800593000,
  "version": "Varies with device",
  "recentChanges": "Bug Fix with card layout.",
  "appId": "com.dg.turbonuke.my.bingo.life",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo PartyLand 2 - Free Bingo Games",
  "description": "\"Best Bingo game with Friends! Crazy fun Power Up, Live Bingo Tournament and more!\" \r\n\r\n◆◆◆  Try your luck in Bingo PartyLand 2!! ◆◆◆  \r\n\r\n◆ REALTIME MULTIPLAYER Bingo competitions with FRIENDS and Bingo players around the world! \r\n◆ Compete in Bingo TOURNAMENT with Friends, and win in our global leaderboard!\r\n◆ STUNNING ANIMATIONS and HD graphics, smoothest Bingo Party experience! \r\n◆ INCREASE the BINGO FUN with the MOST VARIETY of MAGIC BOOSTS - Bomb Boost, Electric Boost, Instant Win, more and more! \r\n◆ BUILD your own Magical Bingo Heaven with COLLECTIBLE pieces you found! - who can find the last SUPER RARE piece?  \r\n◆ SURPRISED by Bingo MYSTERY REWARDS in Magic Eggs! \r\n◆ ENJOY FULLY THEMED BINGO ROOMS - fun daubs, Bingo balls, Bingo cards, every elements! - Sugar Rush, Prehistoric Bash, Pixelated Mania, Outlaw Showdown, Santa Tracker, Polar Blitz, NightClub Bingo Pop, The Lost Clue, Bingo City Hunter and more!\r\n◆ CHALLENGE yourself and play up to 8 BINGO CARDS!\r\n◆ UNLOCK new Bingo Hall and SECRET items as you play more and LEVEL UP! \r\n◆ MASTER your Bingo, Keno, Loteria, Video Bingo & Slingo skills in SPECIAL BINGO PARTY MODES! - Super Turbo, Crazy Bingo Patterns, Bingo Blackout and more!\r\n◆ JACKPOT REWARDS from WHEEL OF FORTUNE and more!\r\n◆ PLAY ANYWHERE - you don't need a Bingo machine or Bingo caller! Play on the go to win anytime & anywhere you want!\r\n◆ Bingo Games FREE to PLAY - free daily bonus & lucky spins! Get your Bingo DAUBERS ready & start your Bingo Adventure! \r\n\r\nAre you READYYYY? BINGO!!! \r\n\r\nThe game is intended for adult audience for amusement purposes only. The game does not offer “real money gambling” or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling”.\r\n\r\n\r\n~~~~~~~~~\r\nSUPPORT\r\n~~~~~~~~~\r\n\r\nLike us on Facebook: https://www.facebook.com/BingoPartyLand/\r\n\r\nBingo PartyLand is constantly updating the game with new features we think our players will DAUB for! \r\n\r\nWe listen to all players' feedbacks to create the best Bingo game! Contact us at hello@kingsify.com\"    \r\n\r\nThank you for playing & have FUN in the Bingo world!\r\n\r\n\r\nPlease note:\r\nAn internet connection is required when you play Bingo PartyLand.\r\nBingo PartyLand is free to play, but you can make in-app purchases with real money.",
  "summary": "FREE BINGO Games with Friends! Bingo Live Cards, Crazy Boosts, Tournament &amp; Daub",
  "installs": "500,000+",
  "score": 4.70317,
  "ratings": 20886,
  "reviews": 5378,
  "price": 0,
  "IAPRange": "£0.83 - £83.41 per item",
  "developer": "Kingsify LLC",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 21, 2016",
  "updated": 1588243066000,
  "version": "2.5.6",
  "recentChanges": "minor bug fix for smoother game play",
  "appId": "com.kingsify.bingopartyland",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Blaze -  Free Bingo Games",
  "description": "Join Bingo Blaze to play Bingo with friends and millions of players around the world. Play in 60+ bingo rooms anytime,  anywhere!\r\n\r\nFEATURES \r\n· 60+ unique game rooms with a variety of playstyles and rewards\r\n· Go through the world bingo tour, unlock city rooms and WIN BIG\r\n· Get free tickets and powerups every day\r\n· Join Tournaments and get special rewards\r\n· Challenges and Achievements offer free gifts\r\n· Cross platform with Facebook login. Play Bingo Blaze on any of your phones and tablets with the same account .\r\n· More events  and  festivals  incoming\r\n\r\nLet’s daub now!\r\n\r\nPlease note:\r\nAn internet connection is required when you play Bingo Blaze\r\nBingo Blaze is free to play, but you can make in-app purchases with real money.",
  "summary": "Enjoy the latest free Bingo game with multiple cards and new rooms!",
  "installs": "1,000,000+",
  "score": 4.689043,
  "ratings": 77969,
  "reviews": 17851,
  "price": 0,
  "IAPRange": "£0.79 - £92.99 per item",
  "developer": "Unstoppable games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 30, 2017",
  "updated": 1588141415000,
  "version": "2.3.9",
  "recentChanges": "1. Bug fixed and game optimized.<br>2. Newly added Advancement Pack for new players.",
  "appId": "com.bingo.blaze.free",
  "searchTerms": "bingo"
 },
 {
  "title": "AE Bingo: Offline Bingo Games",
  "description": "Yes, you can play the BEST Bingo games free offline, without wifi, without Internet.\r\n\r\nBest offline Bingo games free like never before! Different kinds of exciting bingo games rooms, two bingo games modes, more cards than any other Bingo Casino games and also vivid bingo caller sound!\r\nEvery bingo game grants rewards to level up and unlock new features! \r\n\r\n\r\nBingo for arcade game experience:\r\nAE Bingo: free video bingo games free has thrilling arcade-style game play features such as zombie boosts, collection items and lots of achievements. Be a bingo superstars and crush the bingo fever.\r\n\r\nTwo Bingo games modes\r\n\r\n1) Classic bingo games free mode:\r\nUse bingo tickets to buy bingo cards to enter bingo game. The offline bingo caller will call 32 bingo numbers total. Mark the called bingo numbers quickly! When you identify any one of the winning patterns on your card, tap the BINGO button to call the bingo! Take doubleu care, bad bingo calls will freeze the bingo card for a period time.\r\n\r\n2) Speed Bingo games free mode: \r\nBet to start a game. The bingo caller will automatically call 12 bingo numbers at once. Bingo Players will get different pays based on the number of bingos. This bingo hall mode is very fast and thrilling.\r\n\r\nCollection and Rewards in jackpot bingo free:\r\nTravel around the bingo island free world through different mysterious Bingo games rooms with unique dab collections items and get your bingo rewards!\r\nThis offline casual games is designed for bingo for kids.\r\nHoliday rio jungle drive lane scene for Easter, Valentine, Halloween, Thanksgiving and Christmas and bingo live 90.\r\n\r\nCustomer Daubers: \r\nYou can customize your bingo daubers in your profile page. A lot of special shapes can be used for your showdown Bingo Cards. To be the fashion guy and the price is right!\r\n\r\nHaving zingo bingo problems and need a bingo clue? Any suggestions? We would love to hear from you! You can reach us at bingo.offline@bingoholiday.xyz\r\n\r\nFor social online bingo to play with friends, or to play bingo tournament, you can download our online FREE Bingo Games from AE Magwin Casino Games FREE bingo and slot machines bingo monopoly games team\r\n\r\nEnjoy now and have bingo fun.\r\n\r\n\r\nDisclaimer:\r\n*AE Bingo: Offline Bingo Games bingo and slot games free is intended for use for amusement purposes only. THERE IS NO REAL CASH PAYOUT YOU CAN EARN.\r\n*AE Bingo: Bingo Offline does not offer real money gambling or an opportunity to win real money.\r\n*AE Bingo: Offline Games for free uses Facebook as ads provider.  Facebook and instagram likes wants to show ads relevant to you.  For more information, please check https://m.facebook.com/ads/ad_choices.",
  "summary": "Play the best Bingo offline free.<br>Awesome rewards.<br>Best Bingo Games.<br>!!!Bingo!!!",
  "installs": "1,000,000+",
  "score": 4.2250924,
  "ratings": 8177,
  "reviews": 3147,
  "price": 0,
  "IAPRange": "£1.20 - £60.25 per item",
  "developer": "AE Mobile Limited",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 12, 2014",
  "updated": 1556591005000,
  "version": "1.0.0.9",
  "recentChanges": "bug fix",
  "appId": "com.aemobile.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Pop - Live Multiplayer Bingo Games for Free",
  "description": "10,000,000+ players already LOVE BINGO POP - The best bingo game on Android! Enjoy bingo games free to play!!! If you enjoy playing bingo with friends then our bingo multiplayer feature is perfect for you. Our bingo games are always getting better with new events and collectibles. Customize your dauber - Have fun & PLAY BINGO TODAY!\r\n\r\nBingo Pop is a free bingo multiplayer game mixed with Huge Jackpots, Fast-Paced bingo live action at blitz speed, power-ups & more! Escape into the world of bingo pop where you can explore caves, plant tropical fruit, or even fly through the sky! Play the best live bingo games free to play by Jam City.\r\n\r\n★ Enter COLLECTION EVENTS to win BIGGER JACKPOTS!\r\n★ Increase your chances of winning by daubing 12 BINGO CARDS AT ONCE in our NEW Speed Bingo mode!\r\n★ Team up with friends in the new Clubs for more bingo multiplayer gameplay!\r\n★ Keep the fun going with the new bingo pop free Jackpot Minigames like Scratchers and Spinner!\r\n★ Enjoy endless live bingo games free to play!\r\n★ Win over 30 EXCLUSIVE dauber Pets and Coins from our bing pop Events!\r\n★ High-quality graphics featuring 15+ unique rooms & 900+ levels with Bonus content!\r\n★ Play on the go with our bingo offline feature to win anytime and anywhere you want!\r\n★ Join thousands of Bingo Pop lovers around the globe!\r\n★ Use GAME-CHANGING POWER-UPS such as Instant Bingo and Double Daub!\r\n★ Climb to the top of the leaderboard against your pop bingo FRIENDS AND FAMILY!\r\n★ Constant bingo game updates! NEW Collection Events and even more MASSIVE Jackpots soon!\r\n\r\nIf you are looking for bingo games to play at home or want to know what is bingo? Or how to play bingo? Bingo Pop is the best bingo app for you!\r\n\r\nFAST-PACED BINGO EXPERIENCE:\r\n\r\nIt’s time to add some spice to the bingo pop free app! Win BIG REWARDS at the shores of Havana Cabana or win even BIGGER BINGO JACKPOTS on the high-stakes bingo cards of Monte Carlo! Play your way through over 15+ rooms with over 900+ levels and bonus events! Start playing bingo today for FREE @ Jam City inc.\r\n\r\nCOLLECTION EVENTS:\r\n\r\nUnlock over 30 exclusive daubers and claim free coins as you complete each collection event! There’s always something new to discover in our bingo world. Stay tuned for our bingo promotions and live events that unlock collectibles. Join the best live bingo games free to play!\r\n Check in to find out what is happening in the world of bingo today & have a bingo blast!\r\n\r\nEXCLUSIVE OFFLINE MODE:\r\n\r\nPlay anytime anywhere! Bingo Pop is the only free Bingo game with an offline mode! Tons of bingo slingo fun on the go! We strive to be the best bingo game on android - play and discover the fun!\r\n\r\nWIN MORE WITH POWER-UPS:\r\n\r\nEarn free Power-Ups as you daub and bingo blast your way through hundreds of unique levels and bonus content that feature special themes, huge jackpots, and more! Play bingo today free of charge!\r\n\r\nCLIMB THE LEADERBOARDS:\r\n\r\nPlay alone or team up with your Club! and bet your bingo cards against friends, family, and thousands of others around the world as you climb to the top of the leaderboards! Enjoy multiplayer bingo app gameplay with one of the best and biggest Bingo world communities! Join the best live bingo games free to play!\r\n\r\nNEW FEATURES & CONTENT:\r\n\r\nBingo Pop is constantly updating the bingo app with new features and bingo promotions we think our players will DAUB for! We listen to all our player’s inputs in making the best free bingo games!\r\n\r\nDownload Bingo Pop for FREE today to play the best bingo game on Android!\r\n\r\nThe game is intended for an older audience. The game does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at real money gambling.\r\n\r\nPrivacy Policy:\r\nhttps://www.jamcity.com/privacy/\r\n\r\nTerms of Service:\r\nhttps://www.jamcity.com/terms-of-service/\r\n\r\nFacebook:\r\nhttps://www.facebook.com/bingopopgame/\r\n\r\nContact us using the game’s Feedback form or via email at bingopop@jamcity.com",
  "summary": "😷The Healthiest Bingo Game! 💊 See why Bingo Pop has earned its Crown! 👑",
  "installs": "10,000,000+",
  "score": 4.4836736,
  "ratings": 242519,
  "reviews": 72074,
  "price": 0,
  "IAPRange": "£0.61 - £244.70 per item",
  "developer": "Jam City, Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 24, 2014",
  "updated": 1587052023000,
  "version": "6.1.50",
  "recentChanges": "Bingo Lands are here!<br>✪ Build your monuments and defend them from would be attackers to earn rewards<br>✪ Take vengeance on your friends and others by attacking their monuments<br><br>Enjoy our two new Stages!<br>✪ Boxing Legends (High Roller lobby)<br>✪ The Nineties (Main lobby)<br><br>Collection Events now loop!<br>✪ Progress beyond the final tier to continually unlock more rewards<br>✪ Additionally, navigate with ease with the new paginated view",
  "appId": "com.uken.BingoPop",
  "searchTerms": "bingo"
 },
 {
  "title": "Wizard of Bingo",
  "description": "If you’re looking for bingo games free to play but you’re bored of those plain & boring designs that do not offer any extras or goodies? This is the bingo heaven for all the lovers of the game and intrigued by the mystical magic world of powerful wizards, fairies, and enchanted forests decorations.  Explore our several rooms & dungeons; you’ll be able to play online modes and also offline, so you’ll be able to play every time and everywhere you want. Enjoy our mix of Loteria bingo modality and have fun with other players around the world. Don’t worry; you can also spend tons of hours of fun with the classic bingo rules, video bingo, and many new modalities for keeping you entertained and enjoying the most trendy bingo fever classics. Come to live the best bongo experience available in the market!\r\n\r\n🎇💰🎇 Be ready for the best mix of bingo slots party! Dive into to the world of bingo maniacs to win incredible tournaments! Download NOW Wizard of Bingo-Bonus Magic for Free on Google Play Store!!! 🎇💰🎇\r\n\r\nLive the thrill & furor of the live action in our videobingo mode! Play online tournaments with players from around the world. With our always growing community, there will always be lots of players to enjoy the pop of the bingo screams! Setup private parties with your friends and family to arrange your own tournaments! Discover who the super lucky winner is! Try your luck in every single room of the tons of themed rooms available for you. No deposit is needed, you can enjoy the entire game absolutely with no cost. Our free social bingo offers you the chance to play & enjoy the blitz of super boosters and double ups so you can double your chances to win & increase your bets easily! Collect special charms, spells, and medals that you can trade for skins & themes for your bingo cards! Daub up to 4 cards at the same time if you dare! The witch of the north will try to enchant your numbers, making them barely visible, so watch out!  \r\n\r\n 🎊🔮🎊 Play in the most Fast-Paced number calls & Gameplay! Forget about those boring waiting times! Interact & chat with other users but don’t get distracted! A wrong call will take lots of coins and points! Download NOW Wizard of Bingo-Bonus Magicfor Free on Google Play Store!!! 🎊🔮🎊\r\n\r\nTo break the spells & move forward on the yellow brick road, you’ll have to gain experience and beat other players. Your anti spell protection will become stronger once you are closer to the castle. Our bingo bango bongo  VIP room is reserved for the high betting players, so be sure to gain good amounts of lucky charms to avoid losing all! We love our community of users, that’s why; we’ll be integrating soon our version of fringo, but with our magic & Oz particular touch. Daub up, double & split your cards or bets while enjoying our wonderful world full of magic and amazing characters! Give a rest to your eyes, our HD graphics, and big number cards will help you to spend unlimited hours of fun! Join to players in America, Europe, & the entire world! Begin your bingo craze career & be ready to claim your victory! \r\n\r\n👑🏰👑 Join our weekly special events & tournaments! Gain XP faster by climbing in our online leaderboards! Let the bash begin NOW withWizard of Bingo-Bonus Magic for Free on Google Play Store!!! 👑🏰👑\r\n\r\n*** Features of the Game***\r\n\r\n🎇 Totally FREE to play, no deposit required.\r\n🎇 Always New Content for you!\r\n🎇 Live Action 24/7! \r\n🎇 Tons of Thematic rooms & Game Modes\r\n🎇 Fast-Paced Action & Intuitive Controls\r\n🌟 Begin your bing games career while enjoying a world full of magic! Download: Wizard of Bingo-Bonus Magic FREE for a Short Period Only! 🌟\r\n\r\nThis game is intended for an adult audience (21+) for amusement purposes only and does not offer \"real money\" gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at \"real money\" gambling.",
  "summary": "Play NOW : Wizard of Bingo-Bonus Magic -  Join the biggest Hall of the World!",
  "installs": "1,000,000+",
  "score": 4.625,
  "ratings": 45079,
  "reviews": 13660,
  "price": 0,
  "IAPRange": "£0.89 - £139.99 per item",
  "developer": "Dynamic Games Ltd.",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Horror, Simulated Gambling",
  "released": "Aug 28, 2016",
  "updated": 1588169538000,
  "version": "7.2.6",
  "recentChanges": "A lot of minor improvements for you to enjoy a perfect Bingo game experience!",
  "appId": "com.blackcircleapps.halloweenbingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo:Love Free Bingo Games,Play Offline Or Online",
  "description": "Bingo Love is a free bingo game that's easy to learn and fun to play! Rich and varied gameplay,classic and popular love story,wonderful level design,you will love it.\r\n\r\nYou can play the popular Bingo games offline, anytime,anywhere,without WiFi, without Internet, or play with your Facebook friends. \r\n\r\nWanna get more bingos, Wanna be more fun,Just play Bingo Love!  a top popular BINGO app which will take you around the world while you play. Discover the hidden stories \r\nbehind each theme and enjoy HUGE rewards for every collection you complete.\r\n\r\nBingo for love experience:\r\nSpecial love story themes,you can play bingo with Romeo & Juliet,Cleopatra,Mermaid,Sleeping Beauty...,Or have a sweet honeymoon trip and build your own bingo love island.\r\n\r\nPlay bingo with Facebook Friends:\r\nInvite your friends to play and earn chips,win achievement,like them,and add thousands of new friends from around the world.\r\n\r\nExclusive Offline Mode:\r\nFree and fun bingo games that dont need wifi! Bingo Love is the best bingo game with an offline mode! Tons of bingo fun on the go!\r\n\r\nSpecial Bingo,Classic Bingo and Bingo Trip:\r\nExcluding 13 bingo ways,there are much special and new ways to win bingo. Collect gems,move to your lover,clear bubbles,find hidden objects,drop gifts...etc. and we will \r\ncontinue to add new ways to win bingo. Bingo Love is so cool.\r\n\r\nAchievement:\r\nComplete popular daily goals to win big prizes!\r\n\r\nTop 123:\r\nDaily,Weekly,All Time Top Rank. Playing top games with friends,and win rewards.\r\n\r\nClassic bingo games free mode:\r\nUse bingo chips to buy bingo cards to enter bingo game. The bingo caller will call 29 bingo numbers total. Mark the called bingo numbers as speed as you want! You can change the game speed too. When you identify any one of the winning patterns on your card,you don't need tap the BINGO button to call the bingo! for fun,it's so cool and no bad bingo calls. Much more than classic Bingo rules, brand new winning patterns in cool bingo are to be discovered. Pack up for your adventure now with big win in the best games 2018. \r\n\r\nCollection and Rewards in jackpot bingo free:\r\nTravel around the bingo island free world through different mysterious Bingo games rooms with unique dab collections items and get your bingo rewards! The games are \r\nintended for an adult audience.\r\n\r\nNew Features and Content\r\nBingo Games is constantly updating the game with new features we think our players will DAUB for! We listen to all our player's inputs in making the best bingo game! \r\n\r\nBingo Love Games FEATURES:\r\n1. Play Bingo like never before! \r\n2. FREE casino bingo games play,Your 2 hours' bonus,daily achievement,and all other rewards will be increased by your level up!\r\n3. FUN bingo rooms and mini games,Play bingo with love!\r\n4. Great casino bingo odds and GENEROUS payouts!\r\n5. Over 60 bingo rooms! We will be rolling out more rooms!\r\n6. PLAY up to 12 bingo cards\r\n7. Play bingo OFFLINE or play free online too! Games without WiFi\r\n8. CHANGE your game SPEED - play faster or slower as you like\r\n9. WIN power ups,gems,coins,keys in much ways\r\n10. Super High Quality Graphics & Friendly Music\r\n11. Complete kinds of puzzles to get BIG BONUS,made a love family while play bingo!\r\n12. Achievement and Top,challenge yourself or your Facebook friends!\r\n\r\nFree no wait casino bingo you can play online or offline with no WiFi! \r\n\r\nEnjoy now and have bingo fun. Bingo has never been better! Download Bingo Love for FREE today!",
  "summary": "Free bingo games like no other!  Play offline Or online bingo games with friends",
  "installs": "100,000+",
  "score": 4.88897,
  "ratings": 13802,
  "reviews": 4439,
  "price": 0,
  "IAPRange": "£0.89 - £92.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 21, 2018",
  "updated": 1557903855000,
  "version": "1.8",
  "recentChanges": "Fixed a serious crash bug on some machines;<br>Bingo Game Improvement;<br>Thank you play Bingo Love!",
  "appId": "com.sagafun.bingolove",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Win",
  "description": "Welcome to the #1 Free Bingo Games on Android: Bingo Win!\r\nJoin Winnie to start an interesting Bingo Journey now! Play bingo with friends and find mystery collections around the world! Find Unique Puzzles and win Huge Jackpot! It's the MOST FUN Bingo!\r\n\r\nTop free games 2018! Grandma's favorite online multiplayer bingo game!\r\n\r\nPlay Free Bingo Games with Awesome Features\r\n\r\nMore than 30 themed rooms with delicate art design and jolly BGM here. Just Choose your favorite Bingo Hall in lobby and enjoy bingo caller anytime, anywhere! Travel in famous cities and claim generous rewards while collecting iconic items. Play Bingo with friends & millions of players around the world with these exclusive features along the way:\r\n\r\n✪Merry Christmas! BRAND-NEW Christmas cover, enjoy your best winter Holiday with Bingo Win!\r\n✪EASY to PLAY - Classic Bingo 75 gameplay in World Tour Bingo Hall. It's very easy to play!\r\n✪ FREE CREDITS and COINS - collect your daily sign-in bonuses & Spin the Lucky Wheel to get FREE BONUS.\r\n✪ SPECIAL BINGO STYLES - Much more than classic Bingo rules, brand new winning patterns in Super Bingo are to be discovered. 90 Ball Bingo, Jackpot Bingo, Juice Fever, Castle at Night, Slingo and so on.\r\n✪ FUN DAILY EVENTS - it’s a bingo Holiday! Challenge yourself and win mega prizes in the daily event!\r\n✪ MINI GAMES in cities - interesting mini game styles with much fun and FREE GIFTS in some world tour cities.\r\n✪ VIP MEMBERSHIP - Improve your VIP Level to unlock higher level permissions. The More VIP level, the more bonus you will get :)\r\n✪ DAILY CHALLENGE - every day you will get a set of tasks to challenge. finish them to get BIG REWARDS.\r\n✪ PLAY MULTI CARDS - up to 8 CARDS each world tour round and enjoy fantastic bing rewards. Up to 12 CARDS in 90 Ball Bingo hall! The more cards you buy, the higher chance to call BINGO and WIN BIG! \r\n✪ POWER UPS and BINGO HINTS - even better are the various Power Ups that help double and boost your winning!\r\n✪ Daily Tournament Challenge - feel the thrill with this online multiplayer Bingo Games! Live tournament with multiplayer games online all around the world. Challenge yourself and see who gets the first BINGO! \r\n✪ Tournament Crown represents your glory! Play tournament to win Luxury jewelries and get your own crowns!\r\n✪ Customized daubers, Avatar Frames and bingo cards!\r\n✪ LUCKY WIN CASINO! - no matter you are a slots fan, or keno lottery lover, wait to be dazzled by Jackpot magic in Jackpot city slots. Spin the wheel and enjoy bonus game.\r\n✪ Scratch and offline games to be updated soon, no wifi required.\r\n\r\nBingo Win brings you more:\r\n- Free Daily Sign-in Bonus. Remember to check back your Free credits and coins EVERY day.\r\n- Spin Lucky Wheel every 24 hours\r\n- Classic fruit slot machine while waiting for the new round\r\n- Fantastic Jackpot prizes in the special bingo room\r\n- Holiday themed lobby with special offers\r\n- Level up Bonus as you unlock more rooms\r\n- Play with friends as in Bingo community. Send and request Gifts and Collection items\r\n\r\nReady to call \"BINGO\"? It's a fun bingo party! Come in NOW and jump for JOY! Have FUN!\r\n\r\nAny suggestions? \r\nWe would love to hear from you! You can reach us, the best support team at: bingowin.service@gmail.com\r\n\r\nAlready a big fan of Bingo Win? Make sure to LIKE us on Facebook: \r\nhttps://www.facebook.com/bingowingame/ \r\n\r\n\r\nDisclaimer:\r\n*Bingo Win is intended for use for amusement purposes only. \r\n*Bingo Win, which mean that practice or success at social casino gaming does not imply future success at real money gambling.\r\n*Bingo Win uses Facebook as ads provider. Facebook and Instagram likes wants to show ads relevant to you. For more information, please check https://m.facebook.com/ads/ad_choices.\r\n\r\n- The games are intended for an adult audience.\r\n- The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n- Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "Enjoy Live tournaments and amazing Jackpot Prize on the Best FREE Bingo game!",
  "installs": "1,000,000+",
  "score": 4.273632,
  "ratings": 16167,
  "reviews": 5071,
  "price": 0,
  "IAPRange": "£0.89 - £92.99 per item",
  "developer": "Best Bingo Casino Games",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 16, 2017",
  "updated": 1585791977000,
  "version": "1.2.6",
  "recentChanges": "ELEVEN! Awesome new rooms Barcelona, Toronto, Hawaii, Norway, Munich, Rio, etc... are added! :-D",
  "appId": "com.bingo.games.online.offline.free.slots.lotto.keno.casino.adventure",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Adventure - Free Game",
  "description": "Bingo Adventure is the newest Classic & Special Bingo Game with up to 8 cards to play at a time!! Bingo Adventure is the place where you can experience the highest chance to get your bingo win, awesome game features and thrilling challenges. Join over tons of players from across the globe on Bingo Adventure - Free Game. Enjoy the thrill of Bingo of varying levels of difficulty to challenge your skills. This game delivers the best Bingo gameplay experience with exciting animations and cool effects. Want to get some solid wins and have more fun? Bingo Adventure - Free game is the place you are looking for!\r\n\r\n***Multiple Bingo Cards at a time***\r\nPlay Bingo Adventure with more bingo cards than any other bingo game! Try your luck by playing with up to 8 bingo cards simultaneously, using smooth controls to easily switch between them and have fun!\r\n\r\n***Real-time Multiplayer***\r\nCompete against friends and other players around the world in our free Bingo Adventure game’s tournaments! Play free games and see which of your friends can complete the most Bingo cards and win the top Bingo!\r\n\r\n***Free welcome Bonus, Free daily gift and boost***\r\nHave a wonderful start with 500 free tickets as well as 30 power-ups. Tons of bonus giveaway every day. Free tickets, power-ups and more bonus are waiting for you to claim!\r\n\r\nTop Features:\r\n★ Realtime multiplayer! Play against other players and win top BINGOS!\r\n★ 8 Cards Opened! Winning more tickets & Level up faster!\r\n★ Chasing Tournament: each room has a chasing game. Play in chasing game and win more tournament scores to win big bonus!\r\n★ Crazy game play, really a kind of blitz!\r\n★ 500 Tickets & 10 Golden Tickets & 30 PowerUps just give you to start out!\r\n★ A beautiful world map to travel all over the globe! Enjoy your world trip with some insane BINGO reward!\r\n★ Every day you log in you will get a bonus gift of 150+ Tickets & 10+ Golden Tickets & 2+ Power-ups - you don’t want to miss a day at Bingo adventure – Free Game!\r\n★ Level up & finish puzzles to increase your daily bonus! Keep playing and win more!\r\n★ Each room has several puzzles to collect. Collect them all to win more bonus!\r\n★ 7 types of power-ups let you get rewards and have a higher chance of winning!\r\n★ Play in 30+ different Bingo game themes. We will be rolling out more rooms all the time!\r\n\r\nIf you love playing bingo game and want to try something new, Bingo Adventure is the best choice for you. Just have a rest out from Bingo Blitz & Bingo Bash, here we not only offer you the same game play experience but also with a better graphics and more fun features to play. If you used to play Bingo Showdown, here we delivers a even better version of Chasing Tournament! Download NOW and experience this fantastic NEW BINGO game: Bingo Adventure - Free Game! A whole new Bingo world is waiting for you to discover!\r\n\r\nDon’t hesitate to contact us at elestormcasino@gmail.com, if you have any questions or suggestion about Bingo Adventure – Free Games.\r\nThanks you for playing and have a wonderful adventure in this bingo world!",
  "summary": "★★★★★ The newest Free bingo game has arrived on Android! ★★★★★",
  "installs": "500,000+",
  "score": 4.6585693,
  "ratings": 29728,
  "reviews": 6891,
  "price": 0,
  "IAPRange": "£0.89 - £97.99 per item",
  "developer": "Elestorm Casino - Best Bingo Game",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Dec 29, 2016",
  "updated": 1588218619000,
  "version": "2.3.6",
  "recentChanges": "Optimize gaming experience",
  "appId": "com.elestorm.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Drive – Free Bingo Games to Play",
  "description": "BINGO DRIVE: THE #1 BINGO GAME to play!\r\nGet your bingo daubers ready for the best game of Bingo! Pop in and play our new FREE Bingo game! Celebrate seasonal events and any holiday in our various Bingo rooms, with FREE Casino Credits and bonuses!\r\n\r\nBingo Drive breaks the monopoly of big Casino mobile games and delivers a fresh, high-quality, bonus-packed online Bingo experience, like no free Bingo tournament games online you've seen before! It’s the ultimate, #1 Bingo experience.\r\n\r\nCelebrate and play with other free casino players across a huge variety of awesome Bingo Game Rooms, and WIN FREE Bingo Game Credits!\r\n\r\nA new bingo game mobile experience with each new online bingo Room! Play classic BINGO board games with different BINGO Patterns for endless hours of casino party games to play! These include: Collecting candy in the Sugar Rush room, looting lost treasures in Pillage & Plunder and many more…\r\n\r\nFREE BONUSES & CREDITS!\r\n❥ A multitude of Free Bingo Game Credits, Coins, and Power-ups to kickstart your path to bingo wins! Collect more every day!\r\n❥ Increase your Daily Bonuses even further by playing more online Bingo games and completing Rooms!\r\n❥ Play the Daily Spin for FREE and win incredible rewards and prizes in this bingo saga!\r\n❥ Customize your very own Car. Car Parts have special perks that provide you with even more party bonuses! Will you go for style or function?\r\n❥ Collect FREE cards and send these gifts to friends!\r\n❥ Enjoy our daily community Freebies - Entertainment is guaranteed!\r\nBecome a rich billionaire in these bingo tournaments!\r\n\r\nEnjoy this classic game and win a fortune!\r\n- POP IN NEW FREE BINGO ONLINE ROOMS EVERY WEEK!\r\n- Our Weekend Saga is a blast! Win amazing prizes, every weekend!\r\n- Play mini board games and win while you daub:\r\n• Spin our generous Wheel-O'-Fortune to win BIG while gambling in bingo tournaments!\r\n• Lucky Scratch Cards deliver huge rewards!\r\n• Pull the lever on our Slot Machine and score amazing rewards!\r\n- Win even more with Jackpot mode: Become a virtual billionaire!\r\n- An awesome community: ride alongside like-minded players, or against them ;)\r\n- Chat and complete Collections with the help of friends and other players!\r\n- LUCKY SCRATCH NUMBERS AND POWER-UPS!\r\n- Exclusive to Bingo Drive: Guess and pre-daub numbers on your lucky Cards to win even faster!\r\nPOP IN THIS CLASSIC BINGO MOBILE PARTY NOW AND ENJOY HOURS OF ENTERTAINMENT AS A BINGO PLAYER!\r\n\r\nNeed some help? Got a suggestion? Just want to talk? Get in touch with us at:\r\n- Support Hub: https://glidingdeer.zendesk.com/hc/en-us/requests/new\r\n- E-mail: support@glidingdeer.com\r\nLIKE us on Facebook, get in touch with the community, and collect Freebies:\r\n- Official App Page: https://www.facebook.com/bingodrive/\r\n\r\n* Bingo Drive is intended for mature audiences. The bingo game is a social casino game, made for entertainment purposes only and does not offer real money gambling or implies future success at real money gambling.\r\nGood luck!",
  "summary": "★★ The BEST Free Bingo game you&#39;ll ever play! Download now for hours of fun! ★★",
  "installs": "500,000+",
  "score": 4.476868,
  "ratings": 14154,
  "reviews": 4779,
  "price": 0,
  "IAPRange": "£0.99 - £244.99 per item",
  "developer": "Gliding Deer",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 23, 2016",
  "updated": 1589123076000,
  "version": "1.332.0",
  "recentChanges": "Version 332<br>* Quicker loading time<br>* Support Request Improved<br>* Nitro Room Issues Resolved<br>* NEW Sky High Bonus Collection<br>* NEW Room and Mini-Game!<br>* New Featured Rooms Layouts<br>* Quest Improvements<br>* Weekend Saga Fixes<br>* King of Swamp Mini-Game improvements",
  "appId": "air.com.glidingdeer.bingodrivemobile",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo - Offline Free Bingo Games",
  "description": "Play the most popular offline Bingo games for FREE. Bingo by SNG lets you enjoy the real deal a casino card game can offer. It is simple, beautiful and fun. It is the only Bingo game with online and offline game modes. If you like free games without wifi, try it now! \r\n\r\nLas Vegas casinos are not the only place where you can play Bingo. You can earn MILLIONS of daily chips FREE. Spin the wheel of fortune, or lucky wheel as some of you might know it, and again get rewarded with free chips. Do not miss it!\r\n\r\nFeatures:\r\n• Top free to play casino game\r\n• Detailed card design with a fast paced game flow.\r\n• Offline games (no wifi)\r\n• Online games \r\n• Games that don't need wifi \r\n• No banner ads \r\n\r\nSNG Games publishes free offline games that don't need wifi. Try our offline games such as Hearts offline, Solitaire Offline, Backgammon, Gin Rummy Offline and Rummy Offline totally free.\r\n\r\nThis free bingo app is intended for adult audiences and does not offer real money gambling or any opportunities to win real money or prizes. Success within this free Bingo game does not imply future success at real money gambling.\r\n\r\nHave fun with Bingo! Never give up on Bingo!",
  "summary": "Play the best offline Bingo game for Android devices. Wifi free Bingo games.",
  "installs": "500,000+",
  "score": 3.8967137,
  "ratings": 2231,
  "reviews": 864,
  "price": 0,
  "developer": "SNG Games",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 21, 2019",
  "updated": 1584105787000,
  "version": "1.10",
  "recentChanges": "Bingo!",
  "appId": "com.sngict.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo by Alisa - Free Live Multiplayer Bingo Games",
  "description": "★★★ Alisa Bingo – Best Bingo App with Daily Tournaments! Get this Free Bingo NOW! ★★★\r\n\r\nDo you love Bingo? Do you LIVE Bingo? Then what are you waiting for? Download and play NOW!\r\nThe classic multiplayer Bingo experience on your device, readily available! New Bingo rooms every other week, tons of Bingo games!\r\nCollect items across dozens of rooms with unique visuals, music and design!\r\nPlay with friends online or in the comfort of your cozy home, with mini-games such as awesome slots mini-game and scratch cards!\r\nMade by the team who is passionate and dedicated to bring you the best Bingo experience possible since 2013!\r\n\r\nAlisa Bingo features:\r\n★ High quality graphics and a wide variety of themes!\r\n★ Compete with thousands of people around the globe online!\r\n★ Play up to 4 bingo cards on tablets and smartphones!\r\n★ Dozens of unique rooms to explore!\r\n★ Awesome power-ups to help you through the game, such as Instant Win!\r\n★ Seamless progress synchronization with Facebook!\r\n★ High quality customer service, regular giveaways and freebies on Facebook!\r\n★ Huge prize pools - it's almost like a Bingo JACKPOT!\r\n\r\nPrivacy policy: http://alisacasino.com/privacy_policy.html\r\n\r\nPlease note that Alisa Bingo is completely free to play but some game items such as coins or tickets can be purchased with real money. You can turn off payments by disabling in-app purchases in your device settings.\r\nRemember that although you can play the game without Wi-Fi, a Wi-Fi connection is recommended for the best experience.\r\n\r\nLIKE US ON FACEBOOK! https://www.facebook.com/AlisaBingo/\r\n\r\nPlease note that Alisa Bingo features no “real money gambling” or any real world money or prizes.\r\nIt is intended for mature audiences for amusement and social entertainment.\r\nPractice or success at social casino gaming does not imply future success at real money gambling.",
  "summary": "Alisa Bingo – Best Bingo App with Daily Tournaments! Get this Free Bingo NOW!",
  "installs": "1,000,000+",
  "score": 4.611859,
  "ratings": 154198,
  "reviews": 40366,
  "price": 0,
  "IAPRange": "£0.79 - £62.23 per item",
  "developer": "Alisa Gaming",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jul 1, 2013",
  "updated": 1581479017000,
  "version": "1.25.18",
  "recentChanges": "Additional fixes due to resolution settings being changed on some devices with Android 10!",
  "appId": "air.com.alisacasino.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Dragon - Free Bingo Games",
  "description": "\"Best. Bingo. Ever.\" Welcome to Bingo Dragon! From the creators of Bingo PartyLand comes a live Vegas Bingo world starring the lovable Dragon Monster, Supercharged Cactus, Lava Shooter and much, much more - Nothing like other live Vegas Bingo games you’ve played! Get your DAUBERS & Bingo cards ready! \r\n\r\nWoohoo! Join the little monster’s adventure to discover magical islands and superpowered boost creatures! Bingo Dragon is full of new Bingo game modes, cinematic animations and crazy sound effects. Take on this magical multiplayer Bingo world alone or play Bingo with friends to see who can win the most Bingos!\r\n\r\n**WARNING! - This Free Bingo game is super-addictive!\r\n\r\n~~~~~~~~~~~~~~~~~~~~~~~~\r\nEXCITING BINGO FEATURES\r\n~~~~~~~~~~~~~~~~~~~~~~~~\r\n◆ REALTIME MULTIPLAYER - Play Bingo with Friends & thousands of Bingo Players around the world!\r\n◆ SUPERPOWERED BOOST CREATURES - Meet the Supercharged Cactus, Flame Chili, Fire Pepper, Lava Shooter and much, much more - You’ll love their craziness as the power-ups help you to get more bingos!\r\n◆ STUNNING ANIMATIONS and SUPER FUN BINGO SOUND EFFECTS - It’s eye candy!\r\n◆ ALL-NEW FULLY THEMED BINGO LEVELS - DAUB your way through a richly imagined, colorful world - Cards Kingdom Mania, Bubble Pop Pharaoh, Jelly Monster Rush, 70s Bingo Party, District-Z Blitz, Clue Hunter, Santa Bash and much more!\r\n◆ MASTER your Bingo, Keno & Loteria skills in SPECIAL BINGO PARTY MODES!\r\n◆ COLLECT MYSTERIOUS ITEMS from Dragon Eggs to build your own Magical Bingo heaven!\r\n◆ LOADS of ADDICTIVE BINGO TOURNAMENTS - Be the champion on Bingo leaderboards!\r\n◆ ACTION-PACKED GAMEPLAY - Challenge yourself to play tons of Bingo cards with our intuitive control!\r\n◆ SPIN the LOTTERY WHEEL to unlock more items - go on, give it a spin! Win the Mega Lotto Jackpot!\r\n\r\n\r\nTHAT’S NOT ALL -- Additional Bingo islands and exotic power-up creatures coming soon! \r\n\r\n\r\nThe game is intended for adult audience for amusement purposes only. The game does not offer “real money gambling” or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"\"real money gambling”.\r\n\r\n~~~~~~~~~\r\nSUPPORT\r\n~~~~~~~~~\r\n\r\nLike us on Facebook: https://www.facebook.com/BingoDragon/\r\n\r\nBingo Dragon is constantly updating the game with new features we think our players will DAUB for! \r\n\r\nWe listen to all players' feedbacks to create the best Bingo game! Contact us at hello+bingodragon@kingsify.com\"    \r\n\r\nThank you for playing & have FUN in the Bingo world!",
  "summary": "★#1 FREE BINGO Games! - Bingo Live Cards, Tournament, Crazy Powerup &amp; Daub! ★",
  "installs": "100,000+",
  "score": 4.711744,
  "ratings": 8453,
  "reviews": 2202,
  "price": 0,
  "IAPRange": "£0.79 - £84.99 per item",
  "developer": "Kingsify LLC",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 11, 2016",
  "updated": 1587093801000,
  "version": "1.4.0",
  "recentChanges": "Introduce our new Boost Pack! more Instant win when you purchase our special boost pack!",
  "appId": "com.kingsify.bingodragon",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Classic Game - Offline Free",
  "description": "Bingo game is free to play, simple and offline board game to play every day you want. \r\n\r\nThis bingo game has small size than other bingo games, it is ONLY 15 MB!\r\n\r\nYou will not need to delete this to make space in your phone thanks to small size, it is under 20 MB and you can have fun with all features like the others have.\r\n\r\nYou do not need internet to play, Bingo is now OFFLINE! Jackpot is waiting for you!\r\n\r\nBonuses make you surprise!\r\n\r\nFortune wheel and slot machine to play endless bingo will come!\r\n\r\nBesides classic bingo;\r\nThemes and colorful cards are in store!\r\nSTORE IS AVAILABLE NOW!\r\n\r\nJoin the Bingo party and have fun with this addictive offline, classic and free bingo game.\r\n\r\nPowerups will help you to increase your chance. \r\n\r\nThis classic game is old but gold and waits for players.\r\n\r\n*There is no cheating on our game, all balls are generated randomly. Your luck is the only key to win this game and also your choice!",
  "summary": "Offline Bingo is Ready! Let&#39;s have fun! - Free to play and Simple Classic Game",
  "installs": "100,000+",
  "score": 4.526923,
  "ratings": 2627,
  "reviews": 1176,
  "price": 0,
  "developer": "ALP G.",
  "genre": "Board",
  "contentRating": "PEGI 3",
  "released": "Jun 24, 2019",
  "updated": 1588806414000,
  "version": "2.3.2",
  "recentChanges": "- New red lines show old bingos<br>- Speed Control<br>- Quick Settings on Pause Panel <br>- Leaderboards<br>- Card and Background Themes<br>- Performance Improvements and Bug Fixes.",
  "appId": "com.alpg.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "DoubleU Bingo - Free Bingo",
  "description": "Travel around the world with your cute Pet and call Bingo!\r\nYour lovely Pet and Poweraisers will make the Bingo game even more exciting and heart-pounding!\r\nWhether it’s your first bingo game or you’re a veteran, the fascinating and diverse features of DoubleU Bingo will draw you in.\r\n\r\n\r\n✔ BINGO WONDERLAND\r\n- Your epic adventure begins on DoubleU Bingo where you can enjoy not only the classic Bingo games but also thrilling Featured Rooms with new rules.\r\n- With a variety of exotic cities and breathtaking graphics, DoubleU Bingo perfectly captures the hearts and minds of bingo lovers over the world.\r\n   \r\n✔ REAL-TIME MULTIPLAYER BINGO\r\n- Play Bingo against other players from all over the world in real-time!\r\n\r\n✔ WORLD TOUR\r\n- With your cuddly pet, embark on your journey to the world and discover unique collectibles!\r\n \r\n✔ PET\r\n- Be friends with various dogs and cats!\r\n- Dress up your Pet in pretty costumes that help you win Bingo!\r\n- Choose your Pet to play with!\r\n \r\n✔ PET ROOM\r\n- Customize your Pet Room with various pieces of furniture and decoration as you want!\r\n \r\n✔ POWERAISERS\r\n- Utilize the distinctive Poweraisers to increase your chances of winning Bingos.\r\n \r\n ✔ FREE DAILY TOURNAMENT\r\n- Compete with other players in free tournaments and climb to the top of the leaderboard for huge prizes!\r\n\r\n✔ COLLECTION ROOM \r\n- Complete the puzzle by collecting all pieces and win big rewards.\r\n\r\n✔ VARIED FEATURED ROOMS\r\n- We have not only regular Bingo games but also team competition games, auto Bingo games and many other special Bingo rooms.\r\n  Enjoy a variety of Featured Rooms!\r\n\r\n✔ VARIOUS DAILY BONUSES\r\n- Numerous daily bonuses such as Daily Stamp, Daily Spin, Gift Points, Random Box and many others.\r\n- Collect incredible bonuses every day!\r\n \r\n✔ AMAZING EVENTS \r\n- Seasonal and special events are the most important parts of DoubleU Bingo.\r\n- Christmas? Halloween? Even Thanksgiving! We've got it all covered!\r\n\r\n✔ MORE SPECTACULAR FEATURES WILL BE COMING SOON\r\n-  We always try to make the game better. Amusement guaranteed. Join now!\r\n\r\n\r\n\r\nPlay Now on Android!\r\n\r\n*DoubleU Bingo is intended for use by those 21 or older for amusement purposes only.\r\n*DoubleU Bingo does not offer real money gambling or an opportunity to win real money or prizes.\r\n*Practice or success at social casino gaming does not imply future success at real money gambling.\r\n\r\n\r\nContact Us\r\n\r\n- Support Email : support@doubleubingo.com\r\n\r\n- Fan Page: https://www.facebook.com/doubleubingo\r\n\r\n- Official Website: http://doubleubingo.com/",
  "summary": "The most addictive Bingo game on Android! Enjoy the best Bingo experience!",
  "installs": "1,000,000+",
  "score": 4.5913177,
  "ratings": 39033,
  "reviews": 11801,
  "price": 0,
  "IAPRange": "£0.99 - £93.99 per item",
  "developer": "DoubleUGames",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 24, 2015",
  "updated": 1564631406000,
  "version": "3.4.3",
  "recentChanges": "Hi DUB fans!<br><br>This is Tina. Here&#39;s a new update with fixes!<br><br>DUB Android is even better than before with this update and you&#39;re all good to go!<br><br>Have fun and good luck!",
  "appId": "com.doubleugames.doubleubingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Quest - Elven Woods Fairy Tale",
  "description": "IMMERSE YOURSELF IN THE FAIRY TALE WORLD OF BINGO QUEST: ELVEN WOODS\r\nBingo Quest: Elven Woods transports you back to a time when humans didn’t rule the Earth. A time when the world was home to mythical beings such as wood elves and fairies who would spread their magic and joy across mother Earth. \r\n\r\nThe mythical creatures who live in the Elven Woods look serene and beautiful - but they’re playful, too! Get to know the wood elves and wood fairies as you sit back, relax and play free bingo in a beautiful fairy tale world.\r\n\r\nEXPLORE MAGICAL LANDS WITH 80 LEVELS OF FREE BINGO\r\nAs you progress through our free bingo game, you’ll have the chance to explore new areas of the magical Elven Woods. Meet new wood elves and fairies to have fun with on your bingo journey and, with 80 levels of free bingo waiting for you in the woods, you’ll have hours of fun in this fairy tale land!  \r\n\r\nUNLOCK STUNNING BINGO QUEST: ELVEN WOODS ARTWORK\r\nCollect puzzle pieces as you play bingo with the mythical creatures of the woodland – use these puzzle pieces to unlock beautifully illustrated artwork of the otherworldly woodland realm. Collect graphics of detailed, realistic wood elves and fairies as you progress through the game. Can you collect them all? \r\n\r\nSPIN THE MAGICAL WHEEL OF FORTUNE\r\nEvery day you can visit the elven wheel of fortune – rumoured to give those who spin it a free reward every 24 hours. Receive extra daubers, coins, keys and more, so be sure to visit every day and claim your free prize!\r\n\r\n---------------------------------------------------------------------------------\r\nBINGO QUEST: ELVEN WOODS FAIRY TALE – HIGHLIGHTS\r\n---------------------------------------------------------------------------------\r\n★ Fun, free bingo game for all ages\r\n★ Play through 80 levels of fantastic free bingo\r\n★ Explore different parts of the otherworldly Elven Woods, each with their own dauber\r\n★ Unlock stunning artwork of the mythical creatures who live in the woodland\r\n★ Spin the magical wheel of fortune for free bingo prizes and rewards\r\n★ Collect free coins and use them to buy power ups to help on your bingo adventure\r\n★ Use your keys to unlock treasure chests at the end of each level – what could they contain?\r\n★ Change the bingo caller speed\r\n★ Play Bingo Quest offline – no internet connection required! \r\n\r\nFor a refreshing, fun and free bingo experience, look no further than Bingo Quest: Elven Woods Fairy Tale. Full of beauty and excitement, you’ll have hours of fun playing bingo with the mythical woodland creatures. Why play anywhere else? \r\n\r\n================================================================================\r\nCOME AND PLAY BINGO IN THE ELVEN WOODS – DOWNLOAD BINGO QUEST FOR FREE TODAY!\r\n================================================================================",
  "summary": "A magical bingo quest across the Elven Woods, filled with fun mythical creatures",
  "installs": "100,000+",
  "score": 4.6336718,
  "ratings": 11886,
  "reviews": 3233,
  "price": 0,
  "IAPRange": "£1.79 per item",
  "developer": "Beautiful Bingo Games by Difference Games LLC",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 11, 2017",
  "updated": 1588619482000,
  "version": "Varies with device",
  "recentChanges": "Bingo Quest Anniversary Special! <br>Ability to double your level earnings with a rewarded video.<br><br>--Other Recent Updates--<br>Improved Help System<br>Improved Screen Layouts<br>2 New Caller Speeds available so you can play at a pace you are comfortable.<br>Fix for keeping open the 3rd and 4th maps.<br>A few other small tweaks<br>Added a new world with a new 2-card and new 4-card map! <br>Text translations into many languages.<br>Bingo Callers Translated into German,French, Spanish and Portuguese!!",
  "appId": "com.dg.turbonuke.tradbingo.elvenwoods",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo My Home",
  "description": "BEST FREE BINGO GAME!\r\n\r\nEnjoy the best CLASSIC 75 BINGO's anytime, anywhere!\r\nCome join us on the biggest Bingo Party you will ever seen! Bingo my Home is waiting for you to start the party!\r\n\r\nEXPLORE 20+ BINGO ROOMS AND PLAY UP TO 8 BINGO CARDS!\r\n⭐️Explore Bingo Home while enjoying awesome Bingo games, progress through Bingo   Party Home!\r\n⭐️Choose your next power-up in the game to find all the Bingos , double your prize or even double your XP! It is all up to you, choose them wisely my dear friend!\r\n⭐️Find the hidden objects while finding all the BINGOS!\r\n⭐️Compete with the most challenging opponents become the number one Bingo Master\r\n⭐️Play with your friends and chat with your friends via Mail Box! Get social with Bingo my Home!\r\n\r\nFIND THE HIDDEN OBJECTS WHILE PLAYING BINGO\r\n⭐️ Explore Bingo House rooms with the Hidden Object Game!\r\n⭐️Play bingo rounds and find all the missing objects at the excitement of the party.\r\n⭐️ Earn awesome prizes while helping Max to tidying up the Home after the Bingo Party at  the Hidden Object game. More you play more objects you will find!\r\n\r\nDAILY LOGIN PRIZES\r\n⭐️ Receive FREE coins and daily bonuses\r\n⭐️ Login every day for your free bingo power-ups and coins!\r\n⭐️Complete daily quests for greater prizes! Complete quests in Bingo rooms while enjoying your game. Double DAUB your FUN!\r\n\r\n\r\nFeel free to get in touch with us via support@wixot.com\r\n\r\nBingo my Home contains optional in-app purchases. This game is intended for an adult\r\naudience (21+) for amusement purposes only and does not offer ‘real money’ gambling,\r\nor an opportunity to win real money or prizes based on game play. Playing or success in\r\nthis game does not imply future success at ‘real money’ gambling.",
  "summary": "Best free Bingo Game on Android! Packed with various different features!",
  "installs": "100,000+",
  "score": 4.373297,
  "ratings": 3725,
  "reviews": 1237,
  "price": 0,
  "IAPRange": "£1.79 - £47.99 per item",
  "developer": "Wixot Limited",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "May 21, 2019",
  "updated": 1587570224000,
  "version": "0.095",
  "recentChanges": "⭐️Overall game enhancements!<br>⭐️Minor fixes.",
  "appId": "com.wixot.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo: Classic Offline BINGO",
  "description": "Bingo: Classic Offline BINGO is a wonderful and special offline bingo game with Classic Bingo & UK Jackpot game plays. With 6 charming classic bingo scenes to explore, 90 balls and up to 24 cards to win jackpot, where intriguing themed scenes and exciting play ways await you to conquer! Can't wait to play now? Don't hesitate! Bingo: Classic Offline BINGO will never let you down!\r\n\r\nHere are the Appealing Features brought to you: \r\n\r\n- 6 fascinating scenes of Classic Bingo to bring you never-ending fun and entertainment!\r\n- Download and play anywhere and any time you’d love to, no need to log in online!\r\n- Win Bingos to experience the excitement together with happiness of prevailing in games!\r\n- Diving in the Epic and Supreme Collections World. Enjoying the new appealing collections with gripping stories. Amass all the collections to feel the fulfillment and uncover excellent bonuses!\r\n- Colorful graphics and delightful scenes display amazing feelings like never before!\r\n- Up to 24 cards with 90 balls of exciting surprise, who will be the lucky dog to win UK JACKPOT?\r\n- Free yourself with no need to circle the number, what a relaxing atmosphere!\r\n- Never say no to Free Gifts! Claim gratifying Free credits every day to move forward.\r\n\r\nDisclaimer:\r\n- The games are intended for use by those 17 or older for amusement purpose only.\r\n- The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n- Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\nWe would love to hear from you! Contact us at ukbingo.service@gmail.com\r\nLike us on Face book, @Bingo: Classic Offline BINGO\r\nhttps://www.facebook.com/Bingo-Classic-Offline-BINGO-176309736416423/",
  "summary": "Enjoy wonderful Classic Bingo &amp; Jackpot Victory in this BEST OFFLINE bingo game!",
  "installs": "100,000+",
  "score": 4.153595,
  "ratings": 3122,
  "reviews": 533,
  "price": 0,
  "IAPRange": "£0.89 - £87.99 per item",
  "developer": "Best Bingo Casino Games",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 15, 2018",
  "updated": 1535623991000,
  "version": "1.0.8",
  "recentChanges": "- Optimization to bring you better game experience!",
  "appId": "com.bingo.games.ukbingo.offline",
  "searchTerms": "bingo"
 },
 {
  "title": "GamePoint Bingo - Free Bingo Games",
  "description": "Pack your belongings and join our amazing Binky on his journey around the world of GamePoint Bingo🌎. The game is fun, easy and free to play for everyone! Experience unique themed Bingo locations where we travel to during our seasons! We want the best Bingo experience and adventure possible, so join us and get rewarded with FREE Bingo coins and bonuses daily.💰\r\n\r\nThere are awesome features inside the game that exceed your wishes✨! It makes GamePoint Bingo one of the most exciting and fun Bingo games to download! Immerse yourself into a fresh, fun and quality Bingo game that makes you feel like you are in a real Bingo hall. With our Free mobile app, playing with friends wherever and whenever is easy👫. Experience a social online Bingo game like never before!\r\n\r\nSome unique features:\r\n✯ HUGE welcome gift for new players and recurring gifts\r\n✯ DAILY gifts\r\n✯ WIN up to 6 prizes per card\r\n✯ FINISH your collections\r\n✯ COLLECT unique daubers. Find your lucky favorite!\r\n✯ ENJOY events like SuperBingo Jackpots, Bingo Millionaire, Golden Ball! \r\n✯ CHAT live with friends and players while playing Bingo\r\n✯ JOIN CLUBS to play together, win together!\r\n✯ BET multiple cards per round to double the fun!\r\n✯ EXPERIENCE a journey with our themed Bingo rooms\r\n✯ 5 EXCITING mini games\r\n\r\nGet the best classic traditional Bingo feeling. Join people from all over the world who share the same passion for Bingo as you! Have a blast while playing Bingo and earn awesome rewards and prizes, like coin bonuses every few hours and special daubers you can use on your Bingo Cards🍀!\r\n\r\nWin coins in 6 unique ways during the Bingo round! That's more chances to win than any other Bingo game out there! Earn rewards for getting the first vertical, horizontal, diagonal lines and the pattern! Win the big prize by filling in your whole card and call out BINGO!🎊\r\n\r\nBe a part of the growing GamePoint Bingo Community by playing and competing against friends. Battle against your friends or chat with other players and create new friendships! Unlock special chat emoji to make all your interactions with other players extra fun🎉!\r\n\r\nThe awesome feeling of winning Bingo is indescribable! Try your luck and use up to 15 cards per round. Choose your card wisely, listen to the Bingo caller while the Bingo Balls roll and daub the numbers on your Bingo cards! Winning = Big Rewards! Discover a wide range of manual and automated rooms.\r\n\r\nAchieve rewards by finishing your Collections🧩. Collect unique items such as cars, jewels, destination themed items and more during your Bingo adventure!\r\n\r\nPlay one of our five exciting extra Mini Games from GamePoint Casino to keep you entertained🎰! Royal Keno, Video Poker, Hi-Lo, Black Jack and Money Wheel! Play them for Free!\r\n\r\nGamePoint Clubs is a new way to make friends, especially when it comes with its own exclusive chat for you and your fellow club members. With Missions inside clubs, playing Bingo is now even more fun but TEAMWORK is fundamental! Play together, win together!💰\r\n\r\nLog in with your existing GamePoint account to find all your Bingo Coins and familiar Friends in the app!\r\n\r\nWant to play on a bigger screen? Check out our Bingo on Facebook which has all the same amazing features of our FREE Bingo app👍! Gift coins to friends on Facebook and invite them to play!\r\n\r\nGamePoint Bingo is a standard in the casino game genre. \r\n\r\nIn accordance with the delux tombola system, all numbers are sorted totally randomly, and every player has the same chance to win.\r\n\r\nThis game is intended for an adult audience. \r\n\r\nThis game does not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n\r\nPractice or success at social casino gaming does not imply future success at \"real money gambling”.\r\n\r\nAny questions about GamePoint Bingo?🙋\r\nReach us at support.android@gamepoint.com!",
  "summary": "Play The World Famous GamePoint Bingo the #1 FREE social Bingo game.",
  "installs": "1,000,000+",
  "score": 4.1221747,
  "ratings": 16484,
  "reviews": 4695,
  "price": 0,
  "IAPRange": "£0.99 - £189.99 per item",
  "developer": "GamePoint",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 18, 2015",
  "updated": 1588158362000,
  "version": "1.190.19850",
  "recentChanges": "Thank you for playing GamePoint Bingo! Here&#39;s what&#39;s new:<br>* Join a Club! Club icons are back in your profile and result screen.<br>* Fixed icon of push notifications",
  "appId": "com.gamepoint.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Super Bingo HD™: Best Free Bingo Games",
  "description": "★★★ Super Bingo HD – a super fun addictive Bingo game for your Android. Easy to play! Get it now for free! ★★★\r\n\r\nPlay your way through a variety of exotic locales. Earn Experience Points (XP) to level up and unlock exciting new locations to visit. Play in each location to collect an array of collectibles, earning your special awards as you complete your collections.\r\n\r\nFEATURES\r\n★ High-quality great graphics and a wide variety of themes\r\n★ Amazing Bingo community of Bingo Players around the World!\r\n★ Compete with thousands of people around the globe\r\n★ Play up to 4 bingo cards on tablets and smartphones\r\n★ Lots of amazing bingo rooms to explore\r\n★ Awesome boosters and power-ups to help you through the game\r\n★ Create your in-game profile, customize daubers\r\n★ Chat with players\r\n★ Multi-device support\r\n★ Free app updates!\r\n\r\nLike us on Facebook: https://www.facebook.com/superbingohd/\r\nInstagram: https://www.instagram.com/superbingohd/\r\n\r\nPLEASE NOTE! Super Bingo HD is free to download and play, however, some game items can also be purchased for real money.\r\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\nSupport\r\nQuestions? Contact our tech support at super-bingo-hd@playcus.com or check our FAQ https://superbingohd.support.playcus.com\r\n\r\nPrivacy Policy: \r\nhttps://www.playcus.com/privacy-policy\r\n\r\nTerms of Service:\r\nhttps://www.playcus.com/terms-of-service\r\n\r\nThanks for playing Bingo!",
  "summary": "Play the top BINGO Games for Free! Very Addictive! Join Millions of Players!",
  "installs": "1,000,000+",
  "score": 4.4675503,
  "ratings": 96005,
  "reviews": 22658,
  "price": 0,
  "IAPRange": "£0.50 - £151.99 per item",
  "developer": "Playcus LTD",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Apr 4, 2014",
  "updated": 1587493130000,
  "version": "2.061.210",
  "recentChanges": "Hi, Super Bingo fans!  Are you ready for a new update?!<br>- Performance improvements<br>- bug fixing<br>We always improve our product, for you! We will keep on doing our very best to make sure that your enjoyment never stops!<br>Please, contact us at super-bingo-hd@playcus.com if you have any questions or suggestions. With love, Playcus team!",
  "appId": "air.com.ievogames.superbingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Club",
  "description": "Bingo Club is a free classic bingo game with lots of free Credits & Power-Ups every day! Join Bingo Club to play Bingo with millions of players around the world. Play in kinds of bingo rooms anytime, anywhere!\r\n\r\nFEATURES \r\n* FREE daily gifts supply every day!\r\n* 30+ unique game rooms with kinds of play styles and rewards!\r\n* Go through the world bingo tour, unlock city rooms and WIN BIG!\r\n* Get free Credits and Power-Ups every day!\r\n* Complete daily tasks & WIN MORE!\r\n* More events and festivals incoming!\r\n\r\nLet's play now!\r\n\r\nPlease note:\r\nAn internet connection is required when you play Bingo Club.\r\nBingo Club is free to play, but you can make in-app purchases with real money.\r\nBingo Club does not offer \"real money gambling\" or an opportunity to win real money or prizes.",
  "summary": "New &amp; Fun Bingo Game!",
  "installs": "50,000+",
  "score": 4.7014923,
  "ratings": 3408,
  "reviews": 1064,
  "price": 0,
  "IAPRange": "£0.89 - £95.99 per item",
  "developer": "Bingo Club Games",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Feb 23, 2019",
  "updated": 1586342544000,
  "version": "1.2.1",
  "recentChanges": "WHAT&#39;S NEW: <br>  · New feature room!<br>  · New Event！<br>  · Legend Guide !<br>  · Goals!",
  "appId": "com.fggames.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Wonderland",
  "description": "Join other players in the unique magic bingo adventure that takes place in the strangest place of the world. It's time to go through the rabbit hole and join the craziest Bingo party in Wonderland!\r\n\r\nUnique set of features, with lots of interesting levels and enjoyment. You can chat with different users, play against them and simply enjoy this great game stress free. \r\n\r\nWe created Bingo Wonderland to offer unique and interesting entertainment in your lives and to offer great BINGO games to fans of this game. We believe that we got, what they’ve always wanted. Great credit, colorful surroundings, crisp HD graphics, and chips, with tons of variable bonuses that can be claimed at any time. \r\n\r\nFun and full of magic, we also added great sound effects that will keep you excited about Bingo and bingo games.\r\nGold, color blast, crazy bingos, there are tons of levels and bingo games that you have never seen before.\r\n\r\n*** BINGO FEWER ***\r\n\r\nWe believe that if you like magic stories time and bingo the game Bingo Wonderland is just what you need!, that you will adore Bingo Wonderland! The user interface is intuitive, the gameplay is easy to understand and basically anyone will get the games fast and enjoy them! \r\n\r\n*** Bingo Wonderland FEATURES ***\r\n\r\n- Crazy Wonderland bingo\r\n- Different Game Modes\r\n- FREE\r\n- Excellent Bonuses\r\n- HD Graphics\r\n- Stable Multiplayer Features\r\n- Intuitive UI\r\n- Easy to Understand\r\n- Great Professional Sound Effects",
  "summary": "Play and Enjoy Bingo Wonderland Now for FREE",
  "installs": "100,000+",
  "score": 4.599783,
  "ratings": 9267,
  "reviews": 2643,
  "price": 0,
  "IAPRange": "£0.89 - £139.99 per item",
  "developer": "Dynamic Games Ltd.",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Horror, Simulated Gambling",
  "released": "Dec 31, 2016",
  "updated": 1587754732000,
  "version": "7.2.6",
  "recentChanges": "A lot of minor improvements for you to enjoy a perfect Bingo game experience!",
  "appId": "com.blackcircleapps.wonderlandbingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Mecca Bingo – Fun Real Money Slots and Bingo Games",
  "description": "Calling all Bingo Lovers and Slots Fans: Welcome to the award-winning Mecca Bingo App! \r\n\r\nPlay today all your favourite casino slots games like Cleopatra, Da Vinci Diamonds and Reel King mini games as well as explore our many Mecca-exclusive bingo rooms and discover daily wins huge real money jackpots with fun, prize-packed promotions.\r\n\r\n\r\nAlready a Mecca player? Just log into your Meccabingo.com account to start playing your favourite live Mecca Bingo and Mecca Slots games now. We run daily promotions and featured games, making it even easier for you to win real money prizes and jackpots.\r\n\r\n\r\nFeatures:\r\n\r\n• Get in the bingo shape of your life with Mis-Shapes, our Mecca-exclusive pattern bingo room – try your luck for daily wins with tickets from just 5p.\r\n\r\n• Enjoy Slots Galore with Mecca Slots! Each spin could win real cash! All your favourite casino slots games including classics such as Rainbow Riches, Balloonies, Cleopatra, Da Vinci Diamonds, Reel King Potty and Clover Rollover. If it’s slots you want, it’s slots we got.\r\n\r\n• Hundreds of slots games to enjoy with new games added every week. There’s real money to be won on our slots every day with Daily Jackpots and Megajackpots up for grabs.\r\n\r\n• Supersonic, Deal or No Deal and the Best Odds Bingo rooms are just some of the rooms you can play in for the same jackpots and prizes as found on Meccabingo.com.\r\n\r\n• Emoji Bingo is the fun and fast bingo game you can only play exclusively at Mecca Bingo.\r\n\r\n• Our exclusive partnership with The X Factor means all you Mecca Bingo lovers have the chance to shine too.\r\n\r\n• Crack the real money community jackpot - how will you win Britain’s Got Talent Bingo? Win up to 6 cash prizes for the best in bingo talent.\r\n\r\n• BOB! The new name in bingo. Everyone has an equal chance at daily wins, in every game. BOB promises no more than 25 players in a room and everyone with the same number of tickets!\r\n\r\n• 75 Ball bingo games are now in the Lucky 7, Mis-Shapes and Deal Or No Deal rooms.\r\n\r\n• We’ve added the all-time club favourite Cashline bingo room, which features the finest pattern bingo around as well as all the fun from your local Mecca bingo club.\r\n\r\n• Great feature games like Roll on Bingo, Superbooks and 1TG & 2TG – plus lots more Mecca games for hours of fun.\r\n\r\n• Be up to date on all of Mecca’s promo action on our dedicated promotions page, updated daily with more prize-packed real money offers.\r\n\r\n• Chat to your Roomies while playing live bingo. Online or on their mobile, you can chat to them on the Mecca Bingo app.\r\n\r\n• Play live in up to 4 bingo rooms at the same time on our iPad app. Just use the + icon in the header of the bingo room to choose additional rooms for the mini lobby.\r\n\r\n• Find your nearest local Mecca club for the best in live bingo games with a real chance at daily wins!\r\n\r\n• Every time you play bingo games with Mecca you’ll earn Mecca PlayPoints. For every £1 you spend on bingo you’ll be awarded Play Points which can be exchanged for Bonus funds and to buy bingo tickets.\r\n\r\n• Never miss a bingo game again with a comprehensive schedule, get pre-buy tickets for upcoming live bingo games up to seven days in advance. It doesn’t matter if you’re not there when the game starts - your tickets will automatically count and any winnings paid into your account.\r\n\r\nMecca Bingo, Mecca Slots, Mecca Games, whatever fun you’re looking for, download the app now because each spin could bring you a cash win!\r\n\r\nThis is a real money gambling app. \r\n\r\nPlease gamble responsibly, only bet what you can afford. \r\n\r\nGamble Aware at https://www.begambleaware.org/ and 0808 8020 133.\r\n\r\nThe Mecca Bingo app is only available to customers over the age of 18. Customers must also be located in the UK or Republic of Ireland to access the app and will be blocked to those not located in these countries. GPS is used to determine the location of customers. Mecca Bingo is part of the Rank Group which is regulated and licensed by The Alderney Gambling Control Commission.",
  "summary": "Fun Real Money Bingo &amp; Slots Games. Play online with the Mecca Bingo &amp; Slots App",
  "installs": "100,000+",
  "score": 3.89,
  "ratings": 641,
  "reviews": 407,
  "price": 0,
  "developer": "Mecca Bingo Ltd",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Jul 28, 2017",
  "updated": 1586439616000,
  "version": "5.11.1",
  "recentChanges": "Your favourite bingo app just got even better! Our clever techy wizards have made a few small tweaks to make your experience a whole lot better. Come check it out!",
  "appId": "com.mkodo.meccabingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Tropical Beach Bingo World",
  "description": "Welcome to the Bingo heaven for all those who love bingo, and willing to relax playing your favorite game with nice environmental paradisiac islands. Play & explore our several rooms and enjoy offline or online modes, so you’ll be able to play every time and everywhere. Play Loteria bingo tournaments with other players around the world and have unlimited hours of fun with the classic bingo rules and many other new modalities to discover. Try our quick & friendly interface integrated into our online bingo; you’ll never suffer delays anymore! Enjoy a real bingo experience in the multiplayer bingo challenges, stay sharp and don’t miss a number! Try also the new bingo slots mix, where you’ll find the best of the Vegas world combined in just one app! \r\n\r\n🌴 🎰 🌸 Be ready for a Tropical Paradise Island Bingo Party! Enter to the world of bingo maniacs and begin to win amazing prizes! Download NOW Tropical Island Bingo World for Free on Google Play Store!!! 🌸 🎰 🌴 \r\n\r\nFeel the furor or all the live action in our videobingo mode, send gifts to your friends and invitations to participate in private parties you can setup. Challenge your family and discover who the real champion is! Have a bash with the intuitive in-game amenities, spin the daily wheel of fortune and earn amazing boosters to double your earnings each time you get a number! Try our free social bingo; our always growing community is always ready for playing 24/7. You’ll never skip a blitz action day! Change the colors & themes of your cards as you please, and unlock new amazing skins by earning medals and special achievements. Collect valuable items by making winning strikes. The more consecutive wins you manage to gather, the more rewards you’ll obtain! \r\n\r\n🌴☀💰 Juice up the fun! Play in Fast-Paced number calls, where you’ll have to put to tests your senses to avoid missing a number! Wrong call will make you lose your boosters & extra points! Let the fun begin today! Download NOW Tropical Island Bingo Worldfor Free on Google Play Store!!! 💰☀🌴\r\n\r\nDive into our offline rooms, where you’ll be able to play without having an internet connection. Play with no worries, as you can playbingo with no deposit requests, all the game is free! Pop the beach & pina colada hidden figures during the gameplay to earn some special bonus goodies. Stay tuned with our constant updates, as we will be integrating soon a fringo modality for you to play with delicious tropical fruits! If you think you can handle it, you can have fun daubing up to 4 cards to increase your chances of winning. You can make custom bets on each card. Double daub when you feel the lucky is on your side & be the biggest winner! Join the Havana special VIP club room, where the bets are higher, only for the best players daring to place huge bets!  Let the fun begin now!\r\n\r\n🌴☀💰 Feel the Paradisiac golden sun & be part of wild party bingo community! Join our weekly special events and climb our online leaderboards! Start playing NOW Tropical Island Bingo World for Free on Google Play Store!!! 💰☀🌴\r\n\r\n*** Features of the Game***\r\n☀ Absolutely FREE to play, no deposit required.\r\n🌴 New Content in Our Updates\r\n☀ Play alone & with players around the world\r\n🌴 Video Bingo Special Rooms\r\n☀ Super High Quality Graphics & Friendly UI\r\n\r\n🌟🌺 Begin your superstar career while enjoying the relaxing beaches! Download NOW FREE Tropical Island Bingo World for a Short Period Only! 🌺🌟\r\n\r\nThis game is intended for an adult audience (21+) for amusement purposes only and does not offer \"real money\" gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at \"real money\" gambling.",
  "summary": "FREE! Play NOW: Tropical Island Bingo World &amp; Have fun in our Caribbean Paradise",
  "installs": "1,000,000+",
  "score": 4.5584497,
  "ratings": 31569,
  "reviews": 9466,
  "price": 0,
  "IAPRange": "£0.89 - £139.99 per item",
  "developer": "Dynamic Games Ltd.",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Horror, Simulated Gambling",
  "released": "Aug 18, 2016",
  "updated": 1588169565000,
  "version": "7.2.7",
  "recentChanges": "A lot of minor improvements for you to enjoy a perfect Bingo game experience!",
  "appId": "com.blackcircleapps.tropicalbingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Heart Bingo: Real Money Bingo Games",
  "description": "Join the fun at the award-winning Heart Bingo and play Bingo, Slot, Instant Win and Casino games. We even have Box Bonanza prizes and Daily Free Games for all our players, you just need to deposit £10. \r\n\r\nNew players can get £50 of Free Bingo or 30 Free Spins on Paper Wins when you play £10*. \r\nThere are also no wagering requirements on what you win. \r\nAnd no caps on your winnings.\r\n\r\nWith Bingo and Slot game jackpots worth thousands to be won from as little as 1p, as well as super promotions to play online and in our Chat rooms, Heart Bingo has got everything you need!\r\n\r\nJoin Heart Bingo today, the 2018 WhichBingo winners of ‘Best Mobile Bingo Experience’, ‘Best Online Bingo Chat Team’ and for the second year in a row, ‘Best Online Bingo Site’.\r\n\r\nDaily Free Games \r\nTry Daily Paper, the Daily Free Game where you could win Free Spins on the popular Paper Wins slot game, or you can play the Doubly Bubbly Daily Free Game for a chance to win Cash or Free Spins on the Double Bubble Slot game. With a £750 top prize available, what are you waiting for? \r\nYou just need your first deposit to be £10 or more. \r\n\r\nBingo \r\nLove Bingo? There are cash prizes up for grabs 24 hours a day, 7 days a week with jackpots and Full House prizes up to £500. Choose from Bingo rooms like Candy Club, Goodybag, Session Bingo and more and enjoy Bingo offers, like 1p games, BOGOF Bingo, Evens Stevens and Free Bingo!\r\n\r\nEach game of 90-ball Bingo features a Progressive Jackpot which can be won by completing a Full House in 40 calls or less. There’s also a Community Super Jackpot to be won when calling ‘house’ on selected games within 38 calls. Each Super Jackpot offers a cash prize ranging between £5,000 and £25,000!\r\n\r\nSlots \r\nIf Slot games are your thing, then Heart Bingo’s got them. With titles such as Paper Wins Jackpot, Tiki Island Jackpot and Double Bubble, as well as casino classics: Rainbow Riches, Deal or No Deal, Cleopatra, Wheel of Fortune, DaVinci Diamonds and more.\r\n\r\nCasino \r\nFancy the bright lights of Vegas? Take a seat at the Casino table and enjoy casino classics like Blackjack, Roulette and Hi-Lo online.\r\n\r\nInstant Win \r\nPlay Pillars of Fortune and Blox Blitz or enter our Scratchcard shop to win thousands in Instant Win prizes.\r\n\r\nBest Chat and more \r\nYou’ll get a warm welcome from our friendly online Hosts in Chat, who will entertain you with fun quizzes, games and extra prizes. Plus take part in promotions to win cash and prizes.\r\n\r\nGet £50 of Free Bingo or 30 Free Spins on Paper Wins when you play £10*.\r\n\r\n\r\nRules apply. 18+ Please play responsibly. BeGambleAware.org.\r\n\r\nHeart Bingo is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.\r\n\r\n\r\n*Welcome Offer\r\n1. Choose 30 Free Spins (1p coin size, maximum lines) for the game Paper Wins or 50 Free Bingo Tickets for new members only who: a) register; b) opt in to this promotion then make a first deposit of at least £10 (no retrospective opt in); and c) wager at least £10 in cash on any games on site (“Qualifying Requirements”).\r\n2. You have 30 days from when you opt in and make your first deposit to complete the Qualifying Requirements and play any Free Spins/Tickets before they expire. Allow up to 72 hours for credit of Free Spins/Tickets.\r\n3. Free Bingo Tickets: max value £50 (if used to buy £1 tickets) and min value 50p (if used to buy 1p tickets), excludes Session Bingo and Bingo Winners Club. Ticket availability at maximum value is based on bingo game ‘max ticket’ restrictions per game, and game schedule. Free Tickets cannot be used to advance or bulk buy bingo tickets.\r\n4. One promotion entry per member – no multiple accounts.\r\n5. Your deposit balance (if any) and any winnings are withdrawable at any time during this promotion subject to section 5 of our website T&Cs.\r\n6. Full Welcome Offer Rules: https://www.heartbingo.co.uk/terms#welcomebonus.",
  "summary": "Play Bingo, Slot &amp; Casino games for the chance to win jackpots and cash prizes!",
  "installs": "100,000+",
  "score": 4.4260354,
  "ratings": 1698,
  "reviews": 799,
  "price": 0,
  "developer": "Gamesys Limited",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Jul 28, 2017",
  "updated": 1588938512000,
  "version": "11.25.0",
  "recentChanges": "We’ve made some improvements to give you the best gaming experience we can. Enjoy!",
  "appId": "com.gamesys.heartbingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Fun - 2020 Offline Bingo Games Free To Play",
  "description": "It's BINGO caller time!  Are you ready to call BINGO?  Play one of the best FREE Bingo games in the world 2020!  Get out your bingo daubers and starting calling out BINGO!\r\n\r\nBest of all, you can play Bingo Fun anywhere you want as the game can be played offline with no internet connection,  and have chance to win the Jackpot!  With tons of levels and exciting Bingo game play, Bingo Fun brings the Bingo Caller Parlor to your device in an android game app!  Bingo has never been better!  what are you waiting for 2020?\r\n\r\nDownload best Bingo Fun for FREE today!\r\n\r\nBingo Fun Features:\r\nBingo games casino,2020 Las Vegas style casino bingo game\r\nMULTI bingo - get double, triple, and mega bingos\r\nEnter COLLECTION EVENTS to win BIGGER JACKPOTS\r\nEnjoy endless bingo games free to play\r\nDistinctive bingo odds and FUN bingo rooms\r\nPlay offline or online too!  You can play anywhere, anytime\r\nPLAY up to four bingo cards\r\nCHANGE your game SPEED - play faster or slower as you please\r\nMini games and free bingo bonuses available every day\r\n\r\nIf you love bingo and are looking for a fun bingo game, this is the game for you.\r\n\r\nBEST BINGO EXPERIENCE\r\n\r\nWin BIG REWARDS and JACKPOTS on the jackpot-stakes cards!  Enjoy a variety of Featured Rooms!\r\n\r\nEXCLUSIVE OFFLINE MODE\r\n\r\nPlay anytime anywhere!  Bingo Fun is a Bingo game with an offline mode!  Tons of bingo fun on the go!\r\n\r\nWIN MORE WITH POWER-UPS\r\n\r\nEarn free Power-Ups as you daub your way through hundreds of unique levels and bonus content that feature special themes, huge jackpots, and more!\r\n\r\n\r\n\r\n\r\n\r\nAre you new to bingo?\r\nAmerican bingo is one of the most popular games out there for when you're bored!  75 card bingo is played on a 5x5 grid with numbers 5 across and 5 down. Each grid square contains a letter and a number. Match any 5 numbers across, down, or diagonal and call bingo to win! Try it out!\r\n\r\nThis free bingo games casino is intended for adult audiences and does not offer real money gambling or any opportunities to win real money or prizes. Success within this free to play bingo game app does not imply future success at real money gambling.",
  "summary": "Bingo Fun is an offline and free bingo game, Play best bingo offline games 2020",
  "installs": "50,000+",
  "score": 4.707483,
  "ratings": 1511,
  "reviews": 469,
  "price": 0,
  "IAPRange": "£0.89 - £90.99 per item",
  "developer": "Big Win Lab",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 8, 2020",
  "updated": 1584193799000,
  "version": "1.0.5",
  "recentChanges": "New Bingo Substance and Bugs Fixed",
  "appId": "com.bigwinlab.bingofun",
  "searchTerms": "bingo"
 },
 {
  "title": "Easter Bunny Bingo",
  "description": "Welcome to the best live bingo experience in the world! Because we know the Easter is blitz bliss, we proudly introduce you the totally renewed holyday themed game, with tons of Easter decorations, music, and animations to cheer your gameplay with your favorite holydayof the year! Play in our different hall rooms and enjoy playing with other Easter hunt enthusiasts the 365 days of the year! Don’t you want that Easter last a little bit longer?  Play Loteria bingo tournaments and have unlimited hours of fun with the classic bingo rules and different new modalities to discover. Try the real bingo experience in the multiplayer bingo challenges, the new bingo slots mix, and many other Easter Bunny gifts that are waiting to you! \r\n\r\nOur responsive & quick interface ensures a high quality gaming experience, with stunning St. Valentine's animations, themed bingo cards, gifts, and much more surprises! Pop & classic Easter Bunny Bingo festivale music will be playing in the background to complete the romantic sensation!  Earn special trophies & medals as special achievements; with them, you’ll be able to unlock more play rooms like Luna park bingo and many other funny animated bingo cards.\r\n\r\n\r\nWin amazing bonus, free chips & more while the color blast of Easter hunt amuse you! Are you ready to live the bingo! scream? Download NOW Easter Bunny Bingo on Google Play Store!!!\r\n\r\nDive into our offline rooms, where you’ll be able to play without having an internet connection. Play with no worries, as you can playbingo with no deposit requests, all the game is free!\r\n\r\n*** Features of the Game***\r\n\r\n- No deposit required, all content is free\r\n- Online Leaderboards\r\n- Several Rooms and a Lobby to Chat\r\n- Low battery & Memory Consumption\r\n- Offline Mode!",
  "summary": "Join the celebration of easter with new Bingo game for free!",
  "installs": "100,000+",
  "score": 4.613497,
  "ratings": 3299,
  "reviews": 1045,
  "price": 0,
  "IAPRange": "£0.89 - £139.99 per item",
  "developer": "Dynamic Games Ltd.",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Horror, Simulated Gambling",
  "released": "Mar 26, 2017",
  "updated": 1588079291000,
  "version": "7.2.7",
  "recentChanges": "Hello Bingo Fans!<br><br>Here&#39;s a new update with fixes to improve your game experience!",
  "appId": "com.blackcircleapps.easterbunny",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Bay - Free Game",
  "description": "Now people all around the world can enjoy the fun of Bingo!\r\nWelcome to Bingo Bay - Free Bingo Game!\r\n\r\nEnjoy a game of Bingo on the go. Anytime and anywhere. \r\nBingo Bay - Free Bingo Game's Grand Opening is today!\r\n\r\nBingo Bay - Free Bingo Game is an addictive game for men and women of all ages.\r\n\r\n▶ Bingo Bay - Free Bingo Game Official Fan Page : https://www.facebook.com/superbox01\r\n\r\n★ Enjoy Daily Tournament ★\r\n☞ View daily bingo scores and rankings. \r\n\r\n★ Fantastic Graphics and Themes ★\r\n☞ Shout out bingo while enjoying all the colorful and varied themes Bingo Bay offers. \r\n\r\n★ Compete with your Facebook Friends★\r\n☞ Invite your Facebook friends and compare to all people around the world.\r\n\r\n★ Supports up to 12 Bingo Cards ★\r\n☞ Experience a new challenge with up 12 Bingo cards at once.\r\n\r\n- This game is acceptable for purchasing the items partially. When purchasing the items, the additional costs could be occurred and limited Consumer Right of Defense according to the item types.\r\n\r\n▶ Let's Enjoy SUPERBOX ◀\r\n\r\n☆ SUPERBOX Official Website\r\n☞ http://superbox.kr\r\n\r\n☆ SUPERBOX Official Fan Page\r\n☞ https://www.facebook.com/superbox01\r\n\r\n☆ SUPERBOX Customer Center\r\n☞ E-Mail : help@superbox.kr",
  "summary": "Now people all around the world can enjoy the fun of Bingo Bay!",
  "installs": "100,000+",
  "score": 4.3920455,
  "ratings": 1780,
  "reviews": 554,
  "price": 0,
  "IAPRange": "£0.99 - £99.99 per item",
  "developer": "SUPERBOX.INC",
  "genre": "Board",
  "contentRating": "PEGI 3",
  "released": "Apr 5, 2017",
  "updated": 1546169634000,
  "version": "1.5.0",
  "recentChanges": "Now people all around the world can enjoy the fun of Bingo! Welcome to Bingo Bay - Free Bingo Game!<br><br>- Improved Game UI<br>- Improved Game Service.<br>- Game Optimization.<br><br>Got feedback? Leave a review or visit https://www.facebook.com/superbox01",
  "appId": "com.superbox.aos.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Big Spin Bingo | Best Free Bingo",
  "description": "Big Spins & Big Wins on Big Spin Bingo! Fortune's await when you spin the bingo wheel! B-9, O-62, I-28... BINGO! Blitz your way through our bingo rooms and bash your bingo dauber to start calling out BINGO! \r\n\r\nBig Spin Bingo offers:\r\n- Over 15 bingo rooms to play- from Classic Bingo to Festival Bingo!\r\n- 9 Power Ups to boost your game play including Instant Bingo!\r\n- Customized Daubers- daub & play your way! \r\n- Live games against players around the world!\r\n- Daily bonuses to keep you in the game for FREE! \r\n- Collectible items that earn you FREE energy!\r\n- Daub up to 4 bingo cards at once! \r\n- Connection to Facebook - your favorite bingo on any device! \r\n\r\nLike us on Facebook for chances at FREE energy, coins, and power ups! www.facebook.com/bigspinbingo\r\n\r\nThis game is for amusement purposes only.\r\nBig Spin Bingo is intended for players 21+ for entertainment purposes only and does not offer “real money gambling” or any opportunity to win real money through game play. \r\nPlaying Big Spin Bingo does not entail future success at “real money gaming”.",
  "summary": "Your new favorite FREE bingo! Easy to learn and tons of free fun!",
  "installs": "1,000,000+",
  "score": 4.5801125,
  "ratings": 28575,
  "reviews": 6449,
  "price": 0,
  "IAPRange": "£0.64 - £249.99 per item",
  "developer": "Ruby Seven Studios Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 16",
  "contentRatingDescription": "Use of Alcohol/Tobacco, Simulated Gambling",
  "released": "Mar 31, 2014",
  "updated": 1583215444000,
  "version": "4.1.0",
  "recentChanges": "Hey bingo players!<br>We have updated the app to improve your game experience.<br>All new with this update:<br>-Improved game performance.<br>-Game art changes.<br>We have also added brand new rooms so you can call B-I-N-G-O all day!<br>Download or update now to join the fun!",
  "appId": "com.rubyseven.bigspinbingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Black Bingo - Free Bingo Games",
  "description": "Black Bingo is one of the most exciting and fun to play free Bingo games.\r\n\r\nNew players are most welcome and the best bingo players will enjoy a different experience. You can play with or without WIFI. Play social bingo online and enjoy the fun of multiplayer gaming experience. Compete with other players from all over the world in Live Tournament. You will be able to pick free bingo cards and enjoy the classic bingo games with auto daubing feature!!.\r\n\r\nHuge Winnings\r\nYou will get Daily Bonus and  daily tournament rewards and level up rewards. This action paced bingo game will have you coming back every hour to collect your free tickets.\r\n\r\nBest Controls\r\nIt is a featured bingo game with  No Ads. You can play up to 8 cards when calling your lucky numbers on your way to a BLACKOUT bingo. Use the automatic dauber and play extra balls.  Also don't forget to check your lucky hours to be the \"Power Master\" to use unlimited power-ups for free.\r\n\r\nSpecial features :\r\n  # 8 cards\r\n  # Blackout\r\n  # Auto Daub\r\n  # Daily Tournament\r\n  # Fair-price: 1 ticket = 1 card\r\n  # Start out your bingo tour with 100 Gems and equivalent 30 free Bingo cards\r\n  # Log in with  Facebook and sync your account with all your devices\r\n\r\nBlack Bingo is one of the most exciting online Bingo Games. Use power-ups and daub in different themed rooms to enter a bingo world of endless possibilities! Daub away as if in a real-life Bingo Hall.\r\n\r\nBlack Bingo is intended for a mature audience. It is a free to play Game but contains In-App Purchases. We do not offer \"real money gambling\" or an opportunity to win real money or prizes. Past success at social casino gaming has no relationship to future success at \"real money gambling\".\r\n\r\nHave questions or suggestions about Black Bingo - Free Bingo Games?\r\nEmail us: black.bingo87@gmail.com",
  "summary": "Relax! To be happy, play free Bingo offline or live bingo Tournament and win big",
  "installs": "100,000+",
  "score": 4.4120603,
  "ratings": 4007,
  "reviews": 1440,
  "price": 0,
  "IAPRange": "£1.59 - £81.99 per item",
  "developer": "Black B Apps",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Nov 19, 2016",
  "updated": 1586495258000,
  "version": "4.9.53",
  "recentChanges": "Insta-Power!!!<br>Now you can activate Powerups instantly. <br>*****<br> 8 cards!<br>Auto Daub!<br>Blackout Bingo!<br>Live Leaderboard!<br>Daily Mystery Box!<br>Be the Power Master.",
  "appId": "com.blackapps.blackbingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Kingdom: Best Free Bingo Games",
  "description": "★ Bingo Kingdom – a super fun addictive Bingo game for your Android. Easy to play! Get it now for free! ★\r\n\r\nPlay your way through a variety of exotic locales. Earn Experience Points (XP) to level up and unlock exciting new locations to visit. Play in each location to collect episodes, earning you special awards as your complete your collections.\r\n\r\nFEATURES\r\n★ High-quality great graphics and a wide variety of themes\r\n★ Amazing Bingo community of Bingo Lovers around the World!\r\n★ Tournaments\r\n★ Quests\r\n★ Compete with thousands of people around the globe\r\n★ Play up to 4 bingo cards on tablets and smartphones\r\n★ Lots of amazing bingo rooms to explore\r\n★ Awesome boosters to help you through the game\r\n★ Create your in-game profile, customize daubers\r\n★ Chat with players\r\n★ Multi-device support\r\n★ Free app updates!\r\n\r\nLike us on Facebook: https://apps.facebook.com/bingokingdom/\r\n\r\nPLEASE NOTE! Bingo Kingdom is free to download and play, however, some game items can also be purchased for real money.\r\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\nSupport\r\nQuestions? Contact our tech support at bingokingdom@playcus.com or check our FAQ https://bingo-kingdom.helpscoutdocs.com\r\n\r\nPrivacy Policy: \r\nhttps://www.playcus.com/privacy-policy\r\n\r\nTerms of Service:\r\nhttps://www.playcus.com/terms-of-service\r\n\r\nThanks for playing Bingo!",
  "summary": "Play Bingo Kindom! WIN BIG! Enjoy online tournaments &amp; get free bonuses!",
  "installs": "100,000+",
  "score": 4.4085875,
  "ratings": 7248,
  "reviews": 1858,
  "price": 0,
  "IAPRange": "£0.79 - £75.99 per item",
  "developer": "Playcus LTD",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 2, 2017",
  "updated": 1587493207000,
  "version": "0.003.283",
  "recentChanges": "Hi Bingo lovers!  We have a new update for you all:<br> - performance improvements<br> - bugs fixing <br>We always improve our product, for you! Every update of Bingo Kingdom includes improvements and enhancements to make it better for you!<br>Please, contact us at bingokingdom@playcus.com if you have any questions or suggestions. We are always happy to hear from you. With love, Playcus team!",
  "appId": "air.com.playcus.bingokingdom",
  "searchTerms": "bingo"
 },
 {
  "title": "Free Bingo World - Free Bingo Games",
  "description": "★ Free Bingo World ★\r\n\r\n☛ A FREE Bingo journey like no other !!\r\n☛ PLAY a fast paced FREE Bingo game and find yourself in BINGO paradise!!\r\n☛ 2 Limited Brand New Rooms introduced every week !!\r\n\r\n\r\nOur Awesome Features:\r\n> Free Tickets given out every hour in our real Bingo world\r\n> Weekly Limited Rooms are open for only 7 Days\r\n>  22 Classic Rooms  &  26 Special Rooms  for you to play in\r\n> Regularly updated with new Features and Rooms\r\n> Blaze along in a traditional Bingo 75 Free Game!!\r\n> Every new Bingo player gets 100 Chips and 2000 Coins for free!\r\n> A live Bingo caller calls out the numbers similar to classic Bingo playing settings\r\n> Our Themed Bingo rooms will rejuvenate your love for a SUPER Bingo play!\r\n> Daub on multiple Bingo sheets and collect lots of free chips!\r\n> Pop all of the Bingo balls 2 rush 2 become the King of a Bingo land!\r\n> Crush all other Bingo players and play out a Blackout Bingo with all of your lucky Tickets\r\n> Play in special Bingo Rooms such as Xmas Bingo, Halloween and Wild West Bingo and other rooms such as Beach Bingo, Wild West Bingo, Forest, Haunted, Mystery, Treasure and Underwater.\r\n> Each special Bingo Room has a total of 24 unique collection pieces for you to collect!\r\n> Players will be part of a exciting team as they play in City after Bingo City\r\n> Bash each Bingo round  in our free Bingo online Game\r\n> Look out fans of Housie or Tombola! \r\n> The Best FREE Bingo Games have arrived and you can be part of a real Bingo team !\r\n\r\n\r\n** You will surely catch the Bingo bug as you spend your time matching pattern after Bingo pattern in our unique FREE Bingo Games. Play now to crush fellow Bingo fans and daub your way to become a winning Bingo popper!! \r\n\r\n** Drive yourself into a Bingo world and become the generator of the maximum number of Bingos. Rush 2 beat everyone else and generate a winning Bingo bang! \r\n\r\n** Be the best Bingo generator and bash a double win to have a super Bingo night!  The time is right for one of the best new family Bingo games\r\n\r\n** Play along towards making new bingo friends. Get an instant Bingo win by perfectly daubing your Bingo cards and completely bashing everyone else to win free Bingos!!  \r\n\r\n\r\nTutorial on how to play Bingo:\r\n\r\nMatch the winning Bingo patterns on up to four sheets at a time. Playing on multiple sheets increases your chances to pop a double win in the blingo world. Daub each space as the Bingo numbers are being called out. The live bingo announcer will call out each Ball, asking you to daub the correct number on your Bingo Card.  Use your GEMs to make the game call out more Bingo Balls at the end of each big Bingo  round. Pop out a winning Bingo Blackout!!\r\n\r\n\r\nWe bring to you a bashing Bingo Game that you can play with your lucky Bingo chips. Get your Bingo desire on and daub each and every Bingo board and have a blast playing the best Bingo Games.  PLAY the winning Bingo cards to monopolize Bingo and stroll into a SUPER Bingo REALM! \r\n\r\nHave an amazing family Bingo night. Spin out an instant Big Bingo Bonus in your own Bingo Universe. Win lots of PowerUps and monopolize the maximum number of Bingo Wins.\r\n\r\nStrike and crush your way to be the best Bingo dauber. Get your thumbs ready to daub spaces in this fun Bingo Game with thousands of new players from all over the world. Why wait? \r\n\r\nAny questions? Please feel to contact us at platsera.apps@gmail.com",
  "summary": "Are you ready to Bingo? The most addictive FREE Bingo games is here!!",
  "installs": "1,000,000+",
  "score": 4.3538084,
  "ratings": 4198,
  "reviews": 1108,
  "price": 0,
  "IAPRange": "£1.79 - £39.99 per item",
  "developer": "Platsera Apps",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 24, 2017",
  "updated": 1567840878000,
  "version": "1.4.10",
  "recentChanges": "The biggest update ever!! Double the number of Rooms along with other added features!!",
  "appId": "com.platsera.freebingoworld",
  "searchTerms": "bingo"
 },
 {
  "title": "Trivia Bingo - Free Bingo Games To Play Offline!",
  "description": "Want Bingo Games free to play? Play top Bingo Games offline or online!  Play bingo like never before! Enjoy Multiplayer Bingo games or play by yourself! \r\n\r\nWith over 70+ bingo games free to play, you'll be taken on a free bingo games  around the world!  Get your dauber and Bingo Cards ready and experience endless fun with one of the best free bingo games!\r\n\r\nTrivia Bingo Game Features:\r\n- No wait bingo, you don't need to wait other bingo players!\r\n- Offline bingo, you can play bingo without WIFI, you don't need internet connect!\r\n- Complete kinds of puzzles to win BIG BINGO BONUS!\r\n- 9 types of power-ups - Help you get more bingos!\r\n- Complete fun,collect chests to gain coins, extra boosts, bingo tickets and more!\r\n\r\nIf you love bingo and want to try a new one, Trivia Bingo is the best choice. Come experience the fantastic NEW BINGO game!\r\n\r\nDon't Wait and download now, a new Trivia Bingo is waiting for you!",
  "summary": "Free no wait BINGO,you can play bingo games online or offline with no WiFi!",
  "installs": "100,000+",
  "score": 4.737154,
  "ratings": 5093,
  "reviews": 1401,
  "price": 0,
  "IAPRange": "£0.89 - £86.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 18, 2018",
  "updated": 1558085076000,
  "version": "1.9",
  "recentChanges": "Fixed a serious crash bug on some machines;<br>Bingo Game Improvement;<br>Thank you play Trivia Bingo!",
  "appId": "com.sagafun.triviabingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Adventure - World Tour",
  "description": "Bingo Adventure is the newest Classic & Special Bingo Game with 8 CARD VERSION! Here is the best game experience with the highest chance to get bingo! Best features, exciting challenges, realtime multiplayer and continuously updated make it no wonder a best choice to play fun! Wanna get more bingos? Wanna be more fun? Just play Bingo Adventure!\r\n\r\nGame Features:\r\n★ Realtime multiplayer! Play against other players and win top BINGOS!\r\n★ 8 Cards Opened! Winning more tickets & Level Up faster!\r\n★ Chasing Tournament: each room has a chasing game. Play in chasing game and win more tournament scores to win big bonus!\r\n★ Crazy game play, really a kind of blitz!\r\n★ 500 Tickets & 10 Golden Tickets & 30 PowerUps just give you to start out!\r\n★ A big map to travel ALL OVER THE WORLD! Enjoy the adventure trip!\r\n★ Every day you log in you will get a bonus gift of 150+ Tickets & 10+ Golden Tickets & 2+ Powerups – you don’t want to miss a day!\r\n★ Level up & finish puzzles to increase your daily bonus! Keep playing and win more!\r\n★ Each room has several puzzles to collect. Collect them all to win big bonus!\r\n★ 7 types of power-ups let you get rewards and have a higher chance of winning!\r\n★ Play in 30+ different Bingo game themes. We will be rolling out more rooms all the time!\r\nIf you love bingo and want to try a new one, Bingo Adventure is the best choice. Just have a rest out from Bingo Blitz & Bingo Bash, here has the same game play and better graphics! Just have a rest out from Bingo Showdown, here has a better Chasing Tournament! Come experience the fantastic NEW BINGO game, we will not let you down!\r\nDon't Wait and download now, a new Bingo World is waiting for you!\r\n\r\nHave questions or suggestions about Bingo Adventure - World Tour?\r\nEmail your questions to elestormcasino@gmail.com.\r\n\r\nThank you for playing and have a wonderful bingo trip!",
  "summary": "Bingo Adventure is the newest &amp; hottest bingo game on android！",
  "installs": "100,000+",
  "score": 4.657605,
  "ratings": 15496,
  "reviews": 3710,
  "price": 0,
  "IAPRange": "£0.89 - £97.99 per item",
  "developer": "Elestorm Casino",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 22, 2016",
  "updated": 1588218437000,
  "version": "2.3.6",
  "recentChanges": "Optimize gaming experience",
  "appId": "com.elestorm.bingoadventure",
  "searchTerms": "bingo"
 },
 {
  "title": "CLUEDO Bingo!",
  "description": "Uncover clues and solve the mystery of who-done-it as you explore hidden corners and secret rooms in CLUEDO Bingo! With every game you unlock rewards that lead to new rooms to investigate! Explore iconic rooms like the Hall, or the Conservatory! Play with your friends and use unique boosts for awesome effects like free daubs, extra coins and more! Play with more cards than any other Bingo game, using smooth controls to easily switch between them, daub numbers, and call Bingo the second you have it!\r\n \r\n• EXPLORE classic rooms like the Library, the Kitchen, and the Cellar!\r\n• COMPETE with friends in tournaments to see who can get the most Bingos!\r\n• WIN using unique multi-level boosts to gain an explosion of free daubs, reveal upcoming numbers and add bonus spaces to your cards!\r\n• COLLECT CLUEDO Envelopes for great rewards such as coins, extra boosts, tickets and more!\r\n• COMPLETE fun, CLUEDO themed Collections in every room to get more tickets and play even more!\r\n• PLAY with more cards than any other Bingo game for extra challenge, up to 8 cards!\r\n\r\nThe best looking, smoothest Bingo experience available on your Android device.\r\n\r\nPlease note that CLUEDO Bingo is free to play, but you can purchase in-app items with real money. To disable this feature, go to the Google Play app on your device, tap the Menu button, select Settings > Use password to restrict purchases. Then follow the directions to complete setup. In addition, CLUEDO Bingo may link to social media services, such as Facebook, and Storm8 will have access to your information through such services.\r\n\r\nStorm8 Studios is the #1 Mobile Social Game Developer on Android.\r\n\r\nUse of this application is governed by the Storm8 Studios Terms of Service. Collection and use of data are subject to Storm8 Studios Privacy Policy. Both policies are available at http://www.storm8-studios.com/terms/ and http://www.storm8-studios.com/privacy/\r\n\r\nCLUEDO and all related characters are trademarks of Hasbro and used with permissions © 2015 Hasbro. All Rights Reserved.\r\n\r\nThe game is intended for an adult audience. The game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\nFollow Storm8 Studios!\r\nwww.storm8-studios.com\r\nfacebook.com/storm8 \r\ntwitter.com/storm8",
  "summary": "Explore Classic Rooms in the CLUEDO Mansion!",
  "installs": "500,000+",
  "score": 3.8340707,
  "ratings": 4547,
  "reviews": 1147,
  "price": 0,
  "IAPRange": "£0.79 - £79.99 per item",
  "developer": "Storm8 Studios",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Oct 14, 2015",
  "updated": 1579308366000,
  "version": "Varies with device",
  "recentChanges": "- Opportunities to earn new types of rewards through watching video ads in different parts of the game!<br>- Bug fixes and performance improvements.",
  "appId": "com.sharkparty.cluedobingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Christmas Bingo Santa's Gifts",
  "description": "Are you ready to scream BINGO!? Welcome to the best live bingo experience in the world! Because we know the Xmas spirit is blitz bliss, we proudly introduce you the totally renewed festivity themed game, with tons of Xmas decorations, music, and animated snow to cheer your gameplay with your favorite season of the year! Play in our different hall rooms and enjoy playing with other Christmas enthusiasts the 365 days of the year! Don’t you want that Xmas last a little bit longer?  The gifts, the traditional flavors, the smell of Christmas trees, lights everywhere and a peace sensation are more than enough reasons to love this holiday. Play Loteria bingo tournaments and have unlimited hours of fun with the classic bingo rules and different new modalities to discover. Try the real bongo experience in the multiplayer bingo challenges, the new bingo slots mix, and many other Santa’s gifts that are waiting to be unwrapped! \r\n\r\n✨🎄✨ Win amazing bonus, free chips & more while the color blast of Xmas lights amuse you! Are you ready to live the bingo! scream? Download NOW Santa's Christmas Bingo Free on Google Play Store!!! ✨🎄✨\r\n\r\nIt’s Christmas time! We can smell it in the air. Save this amazing season & recreate it anytime you want playing your favorite game with the most incredible features in the market. Play offline in those moments while coming back home, play online and experience the real bingo live excitement; stress free guarantee, as the connection won’t get lost in the middle of a game. Our responsive & quick interface ensures a high quality gaming experience, with stunning Xmas animations, themed bingo cards, gifts, and much more surprises! Pop & classic Xmas holyday music will be playing in the background to complete the Christmas sensation!  Earn special trophies & medals as special achievements; with them, you’ll be able to unlock more skins & themes like Biker Santa, Shiny nose Rudolph & many other funny animated bingo cards. \r\n\r\n❄🐧❄ Change the caller and use your favorite Xmas character! Have fun while snowman, Frosty, Rudolph, Santa, Santa’s wife, cute penguins and many other funny characters scream the numbers in Fast-Paced bingo action! Download NOW Santa's Christmas Bingo Free on Google Play Store!!! ❄🐧❄\r\n\r\nListen to all our funny sound effects, listen the pop of the balls falling. Use special Xmas markers & change the theme of your cards every time you want! Use power ups to increase your earnings, and increase your chances of winning by playing up to 4 cards! Have a favorite card with specific number sets? Save it and customize your own lucky card, bet, and play it as many times you want! Choose the amount of cards to daub and place custom bets for each card. Enjoy our HD graphics, plus all of the wonderful content to discover! \r\n\r\n💫 Play with no restrictions, no limits and with tons of rewards and bonuses! Be part of our community & play in special events! Start playing NOW Santa's Christmas Bingo Free on Google Play Store!!! 💫\r\n\r\n*** Features of the Game***\r\n\r\n☃ No deposit required, all content is free\r\n🎅 Online Leaderboards\r\n☃ Several Rooms and a Lobby to Chat\r\n🎅 Low battery & Memory Consumption\r\n☃ Offline Mode! \r\n\r\n🌟🎄 Become the Xmas superstar while enjoying the best themed game among other bingo games Download NOW Santa's Christmas Bingo Free 🎄🌟",
  "summary": "Play NOW: The BEST Santa&#39;s Christmas Bingo Free-Win &amp; Enjoy the Holidays Spirit",
  "installs": "500,000+",
  "score": 4.722424,
  "ratings": 16527,
  "reviews": 4829,
  "price": 0,
  "IAPRange": "£0.89 - £139.99 per item",
  "developer": "Dynamic Games Ltd.",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Horror, Simulated Gambling",
  "released": "Nov 17, 2016",
  "updated": 1587754687000,
  "version": "7.2.6",
  "recentChanges": "A lot of minor improvements for you to enjoy a perfect Bingo game experience!",
  "appId": "com.blackcircleapps.christmasbingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Craze",
  "description": "★ NEW THEMEs ADDED AGAIN! ★\r\n\r\n★ ★ ★ It's BINGO TIME!!! Try this NEW & EXCITING Bingo Game! ★ ★ ★ \r\nBingo Craze is no ordinary bingo game where you just daub all the way to a one bingo, in this bingo game you can use unique power-items like one, two free daubs, extra chips & coins, instant bingo and many more to maximize your score! As you level up you can move around the world for more bingo rooms to visit with greater rewards and bonuses! Can you perfect all the cards in a round to achieve ultimate reward in a game? Try now and daub all the way to get a Perfect Bingo on this Bingo Craze! \r\n\r\n★ PLAY REAL-TIME BINGO ★\r\n- You can play this FREE Bingo game on your smartphone anywhere and anytime LIVE with your friends!\r\n\r\n★ POWER-ITEMS ★\r\n- Use power-items to increase your chance of getting a bingo and boost your scores to the maximum!\r\n\r\n★ CHANGE CARD DURING PLAY ★\r\n- Having no luck on getting a BINGO? Now you can change your card during play for getting a better chance to get INSTANT BINGO!\r\n\r\n★ PERFECT BINGO ★\r\n- Can you perfect your score to get all BINGOS? Great Rewards for manias will be given to those who can PERFECT BINGO on each round! Mania players will love it!\r\n\r\n★ COLLECT PUZZLES ★\r\n- You can collect Puzzles through Treasure Chests in each Bingo rooms to receive EXTRA BONUS.\r\n\r\n★ TRAVEL AROUND THE WORLD ★\r\n- Travel around the world for many Bingo rooms with new collection items, goals and better rewards!\r\n\r\n★ ENJOY SLOT TOGETHER ★\r\n- Isn't it fantastic that you can make BINGOs and spin SLOTs in one game!\r\n\r\nBingo Craze welcomes whoever is crazy and mania for Bingo!",
  "summary": "★ IT’S BINGO TIME!!! Try this NEW &amp; EXCITING Bingo Game! ★ ★",
  "installs": "1,000,000+",
  "score": 4.354589,
  "ratings": 48281,
  "reviews": 18430,
  "price": 0,
  "IAPRange": "£0.99 - £97.99 per item",
  "developer": "BlackZen",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 25, 2013",
  "updated": 1578225799000,
  "version": "3.8.3",
  "recentChanges": "v. 3.8.3 ===================<br>- Fixed some bugs<br><br>v. 3.8.2 ===================<br>- Fixed some bugs<br><br>v 3.8.1 ===================<br>- New Theme added<br>- Minor bugs fixed",
  "appId": "com.blackzen.BingoMania",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Superstars: Best Free Bingo Games",
  "description": "BINGO SUPERSTARS: FREE BINGO GAMES!\r\n\r\nPlay The World’s Favorite App for Bingo Games!\r\nJoin the most popular FREE bingo game online!\r\n\r\nBingo Superstars is the best online game! Incredible graphics, realistic casino bingo gameplay, a huge selection of free bingo rooms and games and so many chances to WIN! \r\nBingo Superstars gives away so many FREE CREDITS, FREE COINS, and FREE BOOSTERS, it makes online games FUN and EASY!\r\n\r\nBingo Superstars does NOT contain any ads!\r\n\r\nBingo Superstars is a brand new game from the makers of the legendary Super Bingo HD.\r\nPlay and unlock exciting new locations to visit.\r\nPlay in each room to collect an array of Collection Items (Stickers), earning you special awards as you complete your Episodes.\r\nJoin Bingo Superstars today! It is the best vegas style Bingo game you'll ever find!\r\n\r\nFEATURES:\r\n\r\n✪ Easy to play, relaxing and friendly bingo game\r\n✪ Daily Bonuses\r\n✪ High-Quality Graphics and Sound\r\n✪ A wide variety of themes, boosters, collections\r\n✪ An amazing community of Bingo Lovers around the World!\r\n✪ Compete with millions of players and play bingo rounds\r\n✪ Spectacular boosters\r\n✪ Real-time Chat\r\n✪ Free app updates!\r\n\r\nYou will love Bingo Superstars, it's amazing!\r\n\r\nThanks for playing Bingo Superstars! We would love to hear your feedback!\r\n\r\n---------------------\r\nPLEASE NOTE! Bingo Superstars is free to download and play, however, some game items can also be purchased for real money.\r\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\nSupport\r\nQuestions? Contact our tech support at bingo-superstars@playcus.com or check our FAQ https://bingo-superstars.helpscoutdocs.com\r\n\r\nPrivacy Policy: \r\nhttps://www.playcus.com/privacy-policy\r\n\r\nTerms of Service:\r\nhttps://www.playcus.com/terms-of-service",
  "summary": "Play the #1 Free BINGO app loved by MILLIONS of players! Best FREE Bingo Games",
  "installs": "500,000+",
  "score": 4.4830694,
  "ratings": 36687,
  "reviews": 9359,
  "price": 0,
  "IAPRange": "£0.79 - £151.99 per item",
  "developer": "Playcus LTD",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Apr 21, 2016",
  "updated": 1587492731000,
  "version": "2.006.168",
  "recentChanges": "We hope you&#39;re having fun playing Bingo Superstars! <br>Download the latest version to get all new features!<br>- Increased stability <br>- Gameplay improvements<br>- Bug fixes <br>Let&#39;s Play!",
  "appId": "air.com.playcus.bingostars",
  "searchTerms": "bingo"
 },
 {
  "title": "Trophy Bingo",
  "description": "BOW-WOW bingo fans! Join Goldie on the bingo adventure of a lifetime to save her friends from the EVIL Trophy Hunter.\r\n\r\nRescue all the SUPER DOGS and unlock their special Power Plays to help you win more bingos!\r\n\r\nTrophy Bingo packs more fun and new twists into a bingo game than you can shake a stick at! Get combination bingos to multiply your score or win FREE spins on the wheel to complete your collections.\r\n\r\nAll your canine friends have been captured by the Trophy Hunter. It's up to YOU to bingo them to safety!\r\n\r\nAdventure Includes:\r\n• 164 levels of crazy bingo puzzles\r\n• All NEW bingo Power Plays\r\n• Over 100 doggone cool collection items\r\n• Daily challenges for super rewards\r\n• Live events\r\n\r\nIf you go barking mad for Trophy Bingo give us a shout out in the reviews and rate 5 STARS!\r\n\r\nAny issues please contact us at support@trophybingo.com\r\n\r\nLike us on Facebook • https://www.facebook.com/TrophyBingo/ \r\nFollow us on Twitter • https://twitter.com/TrophyBingo/\r\nFollow us on Instagram • https://instagram.com/trophybingo/\r\nVisit our Official Website • https://www.trophybingo.com\r\n\r\nNotes:\r\n• Trophy Bingo is compatible with all major Android phones and tablets.\r\n• Download Trophy Bingo today to embark on this fun-filled bingo adventure!\r\n• Finally a great big THANK YOU to all our wonderful Trophy Bingo players!",
  "summary": "Stop the EVIL Trophy Hunter in the bingo adventure of a lifetime!",
  "installs": "500,000+",
  "score": 4.372958,
  "ratings": 11050,
  "reviews": 2686,
  "price": 0,
  "IAPRange": "£0.79 - £79.99 per item",
  "developer": "Shoal Media (Canada) Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 22, 2014",
  "updated": 1535752783000,
  "version": "Varies with device",
  "recentChanges": "Goldie got groomed! Continue to play Trophy Bingo to rescue all the dogs!",
  "appId": "com.shoalmedia.trophybingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Blingo",
  "description": "Now you can Bingo wherever you go with Bingo Blingo by Rock You! Play in LIVE multiplayer Bingo tournaments with your friends and sync progress anywhere you play! FREE on iPhone, iPad, and iPod touch – you’ll be playing all day!\r\n\r\nThe hit Bingo game that took Facebook by storm is now in the palm of your hand! Team up with your friends and work together to earn more bonus rewards! Send and receive free gifts to watch your team soar to the top. Charged power ups give you the advantage to win big and unlock room after room of bling. Plus, come back every day to try your luck on the daily spinner and win free extras…just for playing!\r\n\r\n* PLAY live multiplayer bingo rounds against other players from around the globe \r\n* WIN tickets, coins and amazing collectable prizes \r\n* EARN fantastic rewards just for playing every day \r\n* COMPETE in free daily tournaments\r\n* EXPLORE many different exotic jewel-themed bingo rooms \r\n* UNITE with your Facebook friends for even more prizes and rewards \r\n* ENJOY the world's best bingo game... today!! \r\n\r\nFacebook: www.facebook.com/BingoBlingo \r\nTwitter: @bingoblingo\r\nSupport: http://bingoblingo.rockyou.com/Support/\r\nPrivacy: http://rockyou.com/privacy-policy/\r\n\r\nThis game is intended for mature audiences.  No real world prizes are available.  Practice or success in the game will not translate to real world success",
  "summary": "The best cross-platform Bingo game that goes wherever you do!",
  "installs": "1,000,000+",
  "score": 3.9902744,
  "ratings": 29712,
  "reviews": 8564,
  "price": 0,
  "IAPRange": "£0.62 - £63.94 per item",
  "developer": "The Games Platform Company ApS",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 9, 2012",
  "updated": 1569965506000,
  "version": "3.4.24",
  "recentChanges": "Bug fixes and optimizations.<br>Fixed issue with Facebook login.",
  "appId": "air.com.sgn.bingo.google",
  "searchTerms": "bingo"
 },
 {
  "title": "Jackpotjoy – Bingo, Casino and Slots Games",
  "description": "Enter a world of fun at the award-winning Jackpotjoy and play our fantastic Bingo, Slot, Instant Win and Casino games. \r\n\r\nThere's Bingo and Slot game jackpots worth thousands, which can be won from as little as 1p. As well as super promotions to play in our entertaining Chat rooms, Jackpotjoy is the place to be!\r\n\r\nPlay £10, get £50 of Free Bingo or 30 Free Spins on Double Bubble*\r\n\r\nSo join Jackpotjoy today, the proud winners of Global Gaming’s ‘Bingo Operator of the Year’ 2018. You can also play all your favourite Bingo, Slot, Instant Win and Casino games on the App – download it today!\r\n\r\nDaily Free Games\r\nTry the Daily Paper Daily Free Game where you could win Free Spins on the hugely popular Paper Wins Slot game, or you can play the Doubly Bubbly Daily Free Game for a chance to win Cash or Free Spins on the Double Bubble Slot game. With a £750 top prize available, it’s time to get playing! \r\n\r\nYou just need to have wagered £2 in the last 7 days and deposited a total of £10 or more in your lifetime. \r\n\r\nBingo\r\nWe’ve got loads of amazing 90, 80 and 75-ball Bingo games for you to play, as well as super Jackpots and Full House prizes for you to win! Choose from many Bingo rooms such as Sapphire, Bingo Royale, Session Bingo and more and enjoy exciting Bingo offers, like 1p games, BOGOF Bingo, Evens Stevens and Free Bingo!\r\n\r\n\r\nSlots\r\nIf you fancy a spin instead, Slots are where it’s at. Enjoy stunning titles such as Paper Wins Jackpot, Tiki Island Jackpot and Double Bubble, as well as the popular classics Rainbow Riches, Deal or No Deal, Cleopatra, Wheel of Fortune, DaVinci Diamonds and more.\r\n\r\nCasino\r\nPull up a chair at our fantastic range of Casino games, including Blackjack, Roulette, Hi-Lo and more.\r\n\r\nInstant Win\r\nPlay Pillars of Fortune and Blox Blitz or enter our Scratchcard shop to win thousands in Instant Win prizes.\r\n\r\nBest Chat and more\r\nYou’ll always be sure of a warm welcome, whenever you join the conversation in Chat with our Hosts. You can have a natter about the latest soap drama, your new pet, even who makes the tea at home! And if it gets lively, they’re ready to party just as hardy as you can! There’s loads of games and quizzes to play, and you could even win cash or physical prizes just for taking part!\r\n\r\nThat’s on top of all our exciting onsite promotions as well, which could give you the chance to win anything from a household kettle to a holiday to America and beyond!\r\n\r\nPlay £10, get £50 of Free Bingo or 30 Free Spins on Double Bubble*\r\n\r\n\r\nRules apply.18+ Please play responsibly. BeGambleAware.org\r\n \r\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.\r\n\r\n*Welcome Offer\r\n1. Choose 30 Free Spins (1p coin size, maximum lines) for the game Double Bubble or 50 Free Bingo Tickets for new members only who: a) register; b) opt in to this promotion then make a first deposit of at least £10 (no retrospective opt in); and c) wager at least £10 in cash on any games on site (“Qualifying Requirements”).\r\n2. You have 30 days from when you opt in and make your first deposit to complete the Qualifying Requirements and play any Free Spins/Tickets before they expire. Allow up to 72 hours for credit of Free Spins/Tickets.\r\n3. Free Bingo Tickets: max value £50 (if used to buy £1 tickets) and min value 50p (if used to buy 1p tickets), excludes Session Bingo and Playoff Palace. Ticket availability at maximum value is based on bingo game ‘max ticket’ restrictions per game, and game schedule. Free Tickets cannot be used to advance or bulk buy bingo tickets.\r\n4. One promotion entry per member – no multiple accounts.\r\n5. Your deposit balance (if any) and any winnings are withdrawable at any time during this promotion subject to section 5 of our website T&Cs.\r\n6. Full Welcome Offer Rules: https://www.jackpotjoy.com/terms#welcomebonus",
  "summary": "Play for real money jackpots on your favourite Bingo, Casino and Slots games!",
  "installs": "100,000+",
  "score": 4.6181817,
  "ratings": 1670,
  "reviews": 766,
  "price": 0,
  "developer": "Gamesys Limited",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Simulated Gambling, Real Gambling/Paid Contests",
  "released": "Jul 28, 2017",
  "updated": 1588938539000,
  "version": "11.25.0",
  "appId": "com.gamesys.jackpotjoy",
  "searchTerms": "bingo"
 },
 {
  "title": "Slingo Shuffle - Bingo & Slots",
  "description": "Slingo, the all-time classic game of slots matching fun returns with a new deck of twists! Slots meets bingo in this relaxing puzzle game where you must spin slot machine reels to make matches in the board below. Match five cards in any direction to get a Slingo and win tons of coins. Score a quadruple Slingo for big coin bonuses! Keep playing to unlock new decks with beautiful new themed backgrounds. Get ready to Slingo Shuffle!\r\n \r\nGame Features:\r\n \r\n- Over 1,200 levels to master\r\n- Fun Bingo and Slots combination game play!\r\n- Daily Quest to earn FREE coins!\r\n- 40 decks of themed art to unlock… more are coming soon!\r\n- 72 patterns to complete\r\n- Collect daily bonus coins every day!",
  "summary": "Slingo, the all-time classic game of slots matching fun returns!",
  "installs": "500,000+",
  "score": 4.6302295,
  "ratings": 37115,
  "reviews": 12928,
  "price": 0,
  "IAPRange": "£0.69 - £38.53 per item",
  "developer": "Blastworks Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 9, 2015",
  "updated": 1479417991000,
  "version": "1.19.4.0g",
  "recentChanges": "• We&#39;ve updated our customer support link in game!<br>• Minor fixes and gameplay improvements",
  "appId": "com.gamehouse.slingosolitairegp",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo 90 Live: Vegas Slots & Free Bingo",
  "description": "play FREE Vegas Slots and 90 ball Bingo online - UK bingo! \r\n\r\nBingo 90 Live HD plus FREE slots is a famous online bingo and Vegas slots for mobile and tablets. Play BINGO and FREE SLOT game and meet with players worldwide. Our 90 Ball Rooms offer everything any Bingo lover could ask for! \r\n\r\nYou'll find Huge Jackpots, Gorgeous graphics and all day FREE Bingo on android. There are 3 chances to win a prize with every ticket! Be the first to complete 1st line, 2nd line, or the full house to win the pot! We offer FREE to play online bingo with various rooms and friends, Wherever, Whenever. \r\n\r\n※ The games are intended for an adult audience.\r\n※ The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n※ Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\n\r\nHow to Play \r\nThe Lobby \r\n1. To enter a room simply double touch or two touch on the Room area in room list. \r\n2. The status of room is “Playing”, or time stamp of remained time to play \r\n3. There are 4 types of room, Emerald, Sapphire, Diamond and Ruby. \r\n4. Each room type requires the minimum tick price. For example, a ticket price in Emerald is 5P and Diamond ticket’s 1￡. \r\n\r\n\r\nThe Room \r\n1. When you fist visit a room, it’s divided into two columns. \r\n2. Right column is ticket list to buy. Another ticket list can be shown to swipe ticket list. \r\n3. Touch a ticket to buy, the status of ticket is changed to “Selected”. Touch “SELECT MAX TICKETS”, 18 tickets will be selected. \r\n4. Touch “BUY SELECTED TICKETS”, then all of tickets to be chose will be bought. \r\n\r\n\r\nThe Game \r\n1. One of the great things with online Bingo is that you won’t need to worry about marking your cards as you go, the computer will do all this for you. \r\n2. While you enjoy the game or chat with your friends, our automatic daubers will mark your cards and keep a record of how many correct calls you need to win \r\n3. We’ll also ensure that your most complete cards are pushed to the front so you can make sure you’re watching the front of the race! \r\n4. We’ll flag it up each time someone wins and automatically credit your account! \r\n\r\nThe Prize \r\n1st line pot : When All numbers of the first line on a ticket is called, you win 1st line pot \r\n2nd line pot : When All numbers of the second line on a ticket is called, you win 2nd line pot \r\nHOUSE : When All numbers of the all three line on a ticket is called, you win HOUSE Jackpot",
  "summary": "Live Bingo Game for playing with other Players. Download Now!",
  "installs": "500,000+",
  "score": 4.412829,
  "ratings": 12583,
  "reviews": 3460,
  "price": 0,
  "IAPRange": "£0.66 - £90.99 per item",
  "developer": "Fungrep Co Ltd",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 9, 2012",
  "updated": 1587952738000,
  "version": "16.50",
  "recentChanges": "Thanks for using Bing90! To make our app better for you, we bring updates to the App Store regularly.<br><br>Every update of our Bing90 app includes improvements for speed and reliability. As new features become available, we’ll highlight those for you in the app.",
  "appId": "kr.co.tk.game.bingo90.google",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Farm Ways: Best Free Bingo Games",
  "description": "Bingo Farm Ways: Free Bingo Game – Live Bingo is an addictive bingo game where you can win the most! Compete with players from around the world in a tournament-style game designed like farm and have a lot of fun. The high-quality graphics and animation will make you feel like you’re really there! \r\n\r\nPlay your way through the game and unlock exciting new episodes. Earn Experience Points (XP) to move up in the tournaments and Win Huge Rewards!\r\nEarn special awards as you complete a new episode. Farm adventures with cute animals are awaiting you. \r\n\r\nDOWNLOAD AND PLAY BRAND NEW BINGO NOW!\r\n\r\nFEATURES \r\n🐾 Tournament-style play \r\n🐾 High-quality graphics and animation\r\n🐾 Awesome boosters will help you to win back-to-back tournaments\r\n🐾 A lot of amazing episodes to collect \r\n🐾Tournament-style play \r\n🐾Live chat with players\r\n 🐾Compete with thousands of people around the globe in real-time multiplayer \r\n🐾An amazing community\r\n🐾Collect FREE Gifts and send them to friends!\r\n🐾Enjoy our daily community Freebies\r\n🐾Free app updates\r\n\r\nPLEASE NOTE! Bingo Farm Ways: Free Bingo Game – Live Bingo is free to download and play, however, some game items can also be purchased for real money.\r\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\nSupport\r\nQuestions? Contact our tech support at bingofarmways@playcus.com or check our FAQ https://bingo-farm-ways.helpscoutdocs.com\r\n\r\nPrivacy Policy: \r\nhttps://www.playcus.com/privacy-policy\r\n\r\nTerms of Service:\r\nhttps://www.playcus.com/terms-of-service\r\n\r\nBingo Farm Ways: Free Bingo Game – Live Bingo does NOT contain any ads!\r\n\r\nThanks for playing Bingo Farm Ways: Free Bingo Game – Live Bingo!\r\nWith love, Playcus Team",
  "summary": "The best bingo game mixed with fast-paced action, Power-Ups, Huge Awards &amp; more!",
  "installs": "50,000+",
  "score": 4.6165414,
  "ratings": 1358,
  "reviews": 424,
  "price": 0,
  "IAPRange": "£1.49 - £75.99 per item",
  "developer": "Playcus LTD",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 20, 2018",
  "updated": 1586413202000,
  "version": "1.3.741",
  "recentChanges": "Hello, BINGO FANS!<br>- Easter-themed<br>- Performance improvements<br>- Bugs fixing<br>We will keep on doing our very best to make sure that your enjoyment never stops!<br>Please, contact us at bingofarmways@playcus.com if you have any questions or suggestions. We are always happy to hear from you. With love, Playcus team!",
  "appId": "com.playcus.free.bingo.games.country.farm.game",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Pool - Free Bingo Games Offline,No WiFi Game",
  "description": "If you love bingo and want to try a new one, Bingo Pool is the best choice. Don't Wait and download now, a new Bingo World is waiting for you! \r\n\r\nPlay the CUTEST and MOST FUN BINGO game you’ll find on Store. \r\n\r\nTake a journey in Bingo Pool with your friends and family to join a free bingo world and enjoy an odyssey to places of interest around the world. This game a good way to help relax and de-stress you from the rigors of daily life. \r\n\r\nBingo Pool breaks a big Casino games and delivers a fresh, high-quality, bonus-packed Bingo experience, like no free Bingo games online you've seen before! It’s the ultimate, #1 Offline Bingo experience.\r\n\r\nCelebrate and play with other free casino players across a huge variety of awesome Bingo Game Rooms, and WIN FREE Bingo Game Credits!\r\n\r\nA new bingo game experience with each new bingo Room! Play Free BINGO games with different BINGO Patterns for endless hours of fun casino games to play! \r\n\r\nGame Features:\r\nFREE bingo play - get free coins to play every 2 hours\r\nCHANGE your game SPEED - play faster or slower as you want\r\nA multitude of Free Bingo Game Credits, Coins, and Power-ups to kick start your path to bingo wins! Collect more every day!\r\nIncrease your Daily Bonuses even further by playing more online Bingo games and completing Rooms!\r\nPlay the Daily Spin for FREE and win incredible rewards and prizes!\r\nCollect FREE Gifts and send them to friends!\r\nEnjoy our daily community Freebies\r\n\r\nThe game is designed for adult and is for entertainment purposes only. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.",
  "summary": "Bingo Pool is the top Classic &amp; Special Bingo Game,Offline &amp; Free Bingo Games!",
  "installs": "100,000+",
  "score": 4.7898192,
  "ratings": 6128,
  "reviews": 1885,
  "price": 0,
  "IAPRange": "£0.89 - £90.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Apr 7, 2019",
  "updated": 1577702199000,
  "version": "1.2.0",
  "recentChanges": "Fix Bugs;<br>Add more hourly bonus;<br>Bingo improvement;<br>Happy New Year!",
  "appId": "com.sagafun.bingopool",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Smash - Lucky Bingo Travel",
  "description": "Bingo smash is a FREE bingo game and you can play with 1, 2, 4 or 8 cards. Enjoy your fantastic Bingo Party around the world! Tons of bingo partyland rooms from tropical beach to country ways are waiting for you. Conquer bingo win and bingo showdown, start playing bingo live now! The fun of your bingo holiday is in the air!\r\n\r\nABOUT THE GAME\r\n- Enjoy different Bingo Party rooms around the world\r\n- Compete with worldwide Bingo players\r\n- Play Bingo win with cute and incredible mascots\r\n- Use special power ups and boosts to become bingo pop superstars\r\n- Tons of special game plays like jackpot & slots\r\n- Go up levels and win more bingo bash prizes\r\n- Complete kinds of bingo bloon puzzles and get rewards\r\n- Lots of Bingo achievements to challenge\r\n- Get bonus Bingo dragon ticket and increase your daily bonus\r\n\r\nSUPPORT\r\nIf you have any doubts or problems with the game, just send an email to bingo@prosorte.com\r\n\r\nA brand new Bingo Blitz World is waiting for you! Have a wonderful super bingo journey!",
  "summary": "Best Bingo game! Play in 30+ bingo rooms anytime, anywhere! Enjoy!",
  "installs": "100,000+",
  "score": 4.523697,
  "ratings": 4260,
  "reviews": 1392,
  "price": 0,
  "IAPRange": "£0.89 - £91.99 per item",
  "developer": "LuckyJoy",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 12, 2018",
  "updated": 1587197394000,
  "version": "19.0.21",
  "recentChanges": "Bug fixed and function optimized.",
  "appId": "com.quge.bingopowerball",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Vingo - Bingo & Slots!",
  "description": "★★ The Hottest Bingo & Slots Game on Android! ★★\r\n\r\nBingo Vingo is the best Bingo & Slots game you can get for your mobile or tablet! Compete and play with players from all around the world in rooms which are aesthetically designed to suit your taste!\r\n\r\nBingo Vingo comes with exciting Power Ups, Rewards, Collection Items and achievements to make the game very exciting! \r\nYou can chose to play with upto 4 cards at a time. Use the power ups to beat others and climb the ladder.\r\n\r\nEvery game gives you rewards to level up and unlock new rooms! The easy game play ensures a smooth experience.\r\n\r\nFEATURES :::\r\n\r\n★ Compete with people from all over the world!\r\n★ Play in more than 50 different Bingo game rooms with 22 beautiful themes!\r\n★ 7 power-ups to make the game exciting!\r\n★ Every room has special collectible items. Collect them all to win bonus bingo chips and coins.\r\n★ 3 Exciting Classic Slot Machines. Win Huge Jackpots!\r\n★ Slots Tournament! Compete for the glory!\r\n★ Chat with friends and your opponents while playing!\r\n★ Daily FREE bingo chips.\r\n★ Introducing a brand new power up - Super Space Filler which gives a huge edge during the game!\r\n★ More Bingo, More Fun!\r\n★ Cross Platform Play – Connect with Facebook and Mobile Devices.\r\n\r\nHave questions or feedback about Bingo Vingo?\r\nEmail us at contact@phonato.com",
  "summary": "#1 Bingo Game - The best Bingo &amp; Slots App on Android! Fast and clean interface!",
  "installs": "100,000+",
  "score": 4.6652174,
  "ratings": 6949,
  "reviews": 1358,
  "price": 0,
  "IAPRange": "£0.89 - £90.99 per item",
  "developer": "Phonato Studios Pvt. Ltd.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 14, 2014",
  "updated": 1558700948000,
  "version": "3.1.9",
  "recentChanges": "- Bugs fixes.<br>- Performance Enhancement.",
  "appId": "com.phonato.bingo.activities",
  "searchTerms": "bingo"
 },
 {
  "title": "Rainbow Bingo Adventure",
  "description": "Rainbow Bingo Adventure is an exciting new free bingo game for you to enjoy!\r\n\r\nPlace your daubs as numbers are called. \r\n\r\nMark your bingo card and complete rows to earn bingos and many other prizes!  Collect special powerups to earn even more!\r\n\r\nCollect picture tokens to pop open beautiful HD images and reveal them within the gallery.\r\n\r\nEach bingo land has three pictures you can unlock. The tokens you collect while playing bingo pop open the blocks hiding the pictures. Each picture you unlock grants a prize and also places it in the gallery.\r\n\r\nUnlock new lands as you progress through this bingo adventure game.\r\nEvery daub placed grants you XP and as you level up new lands are unlocked. Each new land has new pictures to reveal, music and graphics and additional modes of play.\r\n\r\nWill you be a Rainbow Bingo Adventure superstar?\r\n\r\n=====================\r\nRAINBOW BINGO ADVENTURE FEATURES:\r\n=====================\r\n\r\n★ Fun and exciting Bingo game for all ages.\r\n★ Enjoy beautiful background music while you play.\r\n★ Chill out and play Rainbow Bingo Adventure whenever and wherever you are.\r\n★ Free to play with no internet connection required\r\n★ Collect hidden treasures in each level\r\n★ Unlock beautiful HD artwork in each level.\r\n★ Enjoy a new super fun way get your bingo fix and feel the rush of victory!\r\n★ Catch the bingo fever as you gain XP, level up, discover new lands and open fabulous treasures.\r\n★ If you are feeling lucky spin the bingo wheel for extra prizes.\r\n★ Unlock new bingo callers.\r\n★ Tons of lands to explore\r\n★ Free Daily Awards\r\n★ Collect Gems from your own rainbow!\r\n★ Play with one to four cards\r\n★ Exciting new bingo game!\r\n★ Unlock custom daubers with special graphic for your Bingo cards\r\n★ Unlock themed bingo cards\r\n★ Use free Bingo money to win rewards and the best Bingo bonuses\r\n★ Choose your Power-ups: Standard, Uncommon, Rare and Epic\r\n★ Unlock free coins, gems and free bonuses through your Bingo journey\r\n★ Play your favorite Bingo game around the world with themed cards\r\n★ The more you play, the more you get to travel and win big at Rainbow Bingo Adventure\r\n\r\nRainbow Bingo Adveture can be played offline. It's free to play and no internet or wifi is needed in order to enjoy our free bingo game!\r\n\r\nWith tons of levels and exciting Bingo gameplay, what are you waiting for?!",
  "summary": "⭐ Travel to exciting lands on a fun, feature filled bingo adventure! ⭐",
  "installs": "100,000+",
  "score": 4.6037736,
  "ratings": 10669,
  "reviews": 2907,
  "price": 0,
  "IAPRange": "£0.89 - £93.99 per item",
  "developer": "Beautiful Bingo Games by Difference Games LLC",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 17, 2017",
  "updated": 1525272294000,
  "version": "1.264",
  "recentChanges": "Important bug fixes.",
  "appId": "com.dg.turbonuke.rainbowbingoadventure",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Friends - Play Free Bingo Games Online",
  "description": "If you are a bingo fan and you love pets, you will fall in love with Bingo Friends, your free Bingo Game online. Explore the cutest world and help your faithful partner to reunite all of his friends back together for play bingo free online. ! Let's call some Bingo!\r\n\r\nFunny pets \r\nLet the pets of your Bingo free online introduce themselves:\r\n\r\nSir Monty the Bingo Corgi: If you love exploring this amazing city of Bingo Online and looking for an amazing pal, I'm the one! Come with me and we will play bingo free together!\r\nJamie the Bingo Pug: There's nothing better than a fresh fish and chips ready to eat at the park!  ¿Are you in? Come on, Bingo Game is online!\r\nMaggie the Bingo Cat: I love warm cuddles and take a latte while I play Bingo Online with you. \r\nElvis the Bingo cockatoo: Hey buddy! Don't you love old rock 'n' roll music and Bingo Free? Because I would love you to join me to get some vinyl and rock this party while we play bingo free together!\r\nDarwin the  Bingo tortoise: Did you know that you can learn lots of awesome things at the museum while you call some Bingo? Let's go, the learning bus is on its way! Come one, play Bingo Game with me!\r\n\r\nAnd many more pets, come and discover them while enjoy bingo online free on Bingo online the best social bingo game.\r\n\r\nEntertaining  bingo rooms\r\nIn every bingo room on Bingo game you will unlock a funny collection that allows you to get a new bingo friend in your collection. Would you be able to get them all? Come on! Sir Monty needs you! Let's play Bingo Game together?\r\n\r\nPicnic Park Bingo Room. The cutest adventure starts on a fun picnic while you daub some cards to call Bingo! Help Sir Monty to find Jamie! \r\n\r\nCat Coffee Bingo Room. Who said that dogs and cats can't be friends? In the second room of Bingo Game, you can find the cat, one of Sir Monty's best friends. Do you want to play Bingo game with them?\r\n\r\nMuseum Bingo Room. Amazing bingos await you in the museum! Will you be able to find Darwin the tortoise? He has huge things to tell you! Play bingo free game with Darwin to discover it!\r\n\r\nVintage Day Bingo Room. You have arrived at Vintage Day.The cockatoo is waiting for you with a lot of Rock n’Roll and bingo cards! Will you find him?\r\n\r\nFun Fair Bingo Room.  The hamster is waiting for you with a lot of jokes and bingos!\r\n\r\nAnd many more bingo rooms, come and discover them on Bingo game\r\n\r\nCute Bingo collections\r\nDid you think that you can only play bingo game, had friends and bingo rooms? In Bingo game you will also find collectibles! They are so important, apart from being cute when you complete them, you will get a new bingo friend! Play at Bingo game if you want to know how to get them while you call some bingos!\r\n\r\nPowerful Bingo Power-Ups\r\nThe power-ups are what your friend needs to become powerful. Use them every time you can and be the first to call bingo!\r\n\r\nPractical Bingo bags\r\nThe bingo bags are even more useful than the power-ups. Play Bingo game to discover why you need them!\r\n\r\n✔ Principal features of Bingo Game free\r\n★Play Bingo free easily everywhere.\r\n★The better and entertaining bingo game.\r\n★Free bingo rewards every 3 hours.\r\n★The most charismatic and cute bingo pets.\r\n★Mini Slot to get entertained while you wait to start a new game begins.\r\n★Power ups that let you call bingo even faster.\r\n★Bingo Bags with mysterious prizes.\r\n\r\nFollow us on Facebook to know the latest news. If you have any doubts visit https://bingo-friends.com . Come on! Play Bingo online and help Sir Monty to get all of his friends together in Bingo Online, the best social bingo game.\r\n\r\nThis bingo game is intended for people over the age of 21 for entertainment purposes only. Success in social bingo games does not imply future success with games of chance using real money. These  bingo games are not “games of chance using real money” and they do not offer the chance to win real money or prizes.",
  "summary": "Play free Bingo Online and enjoy with pets! Bingo Friends - Your Free Bingo App",
  "installs": "50,000+",
  "score": 4.39,
  "ratings": 810,
  "reviews": 309,
  "price": 0,
  "IAPRange": "£0.99 - £19.99 per item",
  "developer": "Social Games Online",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 5, 2019",
  "updated": 1587380044000,
  "version": "1.4.2",
  "recentChanges": "Here&#39;s an update with new fixes to improve your game experience!<br><br>You can see a new summary animation and some changes on your bag rewards.<br><br>Have your discovered all friends? They&#39;re waiting for you!",
  "appId": "io.socialgamesonline.bingofriends",
  "searchTerms": "bingo"
 },
 {
  "title": "Halloween Bingo - Free Bingo Games",
  "description": "Ready to scream BINGO!? Join now to the best bingo live experience in the world! We know the Halloween spirit is always with the company of spooky but funny creatures, that’s why we include them all with blitz bliss and enthusiasm! We proudly introduce you the totally renewed Halloween theme game, with tons of animated spooky characters like Dr. Frankenstein, Scarecrow Junior, the Haunted Pumpkin, the Scary Witch with her lucky blocking spells and the most important: the Ghosts Gang! They will try to scare you no matter what, for distracting you from our fast-paced live action! Stay sharp, don’t let them cause you to miss your number daubing!  Play your favorite game perfectly blended and themed with your favorite holiday season! Let the darkness invade your device and get ready to scream! \r\n🕯 🙌 🕯 Get ready! The most shocking mix between bingos & Halloween is here and will stay with you the whole year! Download Halloween Bingo - The Jack O Lantern HolidayNOW! 🕯🙌 🕯\r\nIf you’re tired of playing bingo games free to play, but all the bingos out there run slowly or offer low quality gameplay, you should give us a try! This is the bingo heaven for all lovers of the season and super high quality fast-paced action. Explore our huge variety of rooms and halls, play live tournaments and unlock super lucky casino spells to use in private parties with your friends or solo mode! All the exclusive daubers and the unique Mr. Pumpkin special collection cards with the coolest designs of Jack O Lantern ever seen are available by unlocking achievements and increasing your score level. Have fun with our special room: The Day of the Dead; you’ll be able to play several loteria games with lovely decorated sugar skulls themed cards. \r\n 🕸️ 🕷️ 🕸️ Choose different live caller voices from our funny characters! Join this haunted party to win bonuses & prizes! Download NOW Halloween Bingo - The Jack O Lantern Holiday for Free on Google Play Store!!! 🕸️ 🕷️ 🕸️\r\nPlay online tournaments or special event parties, our community of players gets bigger every day to provide unlimited social fun every single day.  Our free social bingo offers you only & simply the best! Manage to avoid the Ghosts Gang distractions or turn them off in the settings for a relaxed gameplay. Collect as many special season cards, markers, and live caller voices! Daub up to 4 cards at the same time if you dare! \r\nHalloween Bingo - The Jack O Lantern Holiday Features\r\n👻 Totally FREE to play, no deposit required.\r\n💀 Special Events in our new Day of the Dead Loteria Bingo Room!\r\n⚰️ Best Halloween Holiday Themes in all games\r\n😈 Constant Tournaments & Game Mode Updates\r\n🎃 Fast-Paced Action & Responsive One-Touch Controls\r\n🦇 👹 🦇 Start playing with the most Fast-Paced number calls & forget about those boring waiting times! Halloween Bingo - The Jack O Lantern Holidayfor FREE for Limited time Only!!!! 🦇 👹 🦇",
  "summary": "🎃 Best Halloween Bingo Games free to play offline or online! 🦇Spooky daub fun!",
  "installs": "100,000+",
  "score": 4.6740856,
  "ratings": 6315,
  "reviews": 2119,
  "price": 0,
  "IAPRange": "£0.89 - £139.99 per item",
  "developer": "Dynamic Games Ltd.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Horror, Simulated Gambling",
  "released": "Oct 19, 2017",
  "updated": 1588084831000,
  "version": "7.2.7",
  "recentChanges": "bug fixes and stability improvements",
  "appId": "com.dynamicgames.bingohalloween",
  "searchTerms": "bingo"
 },
 {
  "title": "LOCO BiNGO! Play for crazy jackpots",
  "description": "Want to boggle your opponents and WIN BIG in the MOST VERSATILE, FUN, CRAZY Bingo out there?\r\n\r\nGo for it!!!\r\n\r\nPlay Loco BiNGO– the most pleasantly addictive social casino game, now for FREE. \r\nNever get bored with bingo again! \r\n\r\n \tEXPLORE a number of different casino game styles and themes\r\n\r\n \tPLAYyour favorite bingo in new, fresh, exciting settings.\r\n\r\n \tCONNECT and have fun with your friends playing bingo games without leaving the house. \r\n\r\n \tDISCOVER avariety of games:Play Bingo in the wildest settings and fall in love with high-quality visuals! Check out our crazy variations of bingo.\r\n\r\n \tWIN bonuses: Bash your way to victory using our awesomepower-ups without limits. Collect daily gifts and discover hidden treasures. \r\n\r\n \tPLAY Bonus games: Play special rounds for the extra boost of thrill.\r\n\r\n \tCHAT ONLINE: Talk with your fellow players while playing. Discuss your strategy, tease, tell jokes or just express yourself. Don’t forget to be the first one to shout out “BINGO!”\r\n\r\n \tSOCIALIZE: Join the biggest, friendliest community of bingo players now.\r\n\r\nCHOOSE your favorite bingo style:\r\n\r\n \tBingo75\r\n\r\nOur most otherworldly bingo experience. Immerse yourself in the magical setting or take a trip deep underwater. Anywhere you choose to go, you can expect surprising bonuses and hidden treasures.\r\n\r\n \tBingo 90\r\n\r\nTry our take on this Spanishvariation of automatic bingo. Earn a massive jackpot in one of the most thrilling cities in the world. Will you choose Miami or Buenos Aires? Pick among dozens of stunning destinations!\r\n\r\n \tTombola 90\r\n\r\nAre you in the mood for music or some humour? Pop by to one of our tombolabingo rooms andautomatically uncover plenty of huge bonuses and rewards.\r\n\r\nDon’t wait any longer! install now and start playing the best, fun and crazy Bingo now!\r\n\r\n• Loco Bingo Online! is intended for a mature audience.\r\n\r\n• Loco Bingo! does not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n\r\n• Past success at social casino gaming has no relationship to future success at \"real money gambling\".\r\n\r\nVisit our blog http://blog.playspace.com/",
  "summary": "Challenge yourself in our free bingo games. Meet new friends and chat online.",
  "installs": "1,000,000+",
  "score": 4.0601406,
  "ratings": 45693,
  "reviews": 16596,
  "price": 0,
  "IAPRange": "£0.59 - £299.99 per item",
  "developer": "Playspace",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 4, 2014",
  "updated": 1588749617000,
  "version": "2.54.3",
  "recentChanges": "- New Social Chat with Stickers, Emojis and much more!<br>- Chat with your friends and meet people around the world!<br>- Amazing Missions &amp; Challenges!<br>- Super Special Events to explore!",
  "appId": "com.mola.playspace.android.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Casino - Free Vegas Casino Slot Bingo Game",
  "description": "Download Bingo Casino for FREE! The best BINGO game on the mobile! Enjoy this exciting Bingo game with millions of players together! \r\n\r\nBingo Casino brings the exciting and original bingo game to your mobile. Use power ups, collect mysterious gifts, get free coins, all the fun and excitement you can imagine! \r\n\r\n* Five amazing Bingo rooms (More are coming!) \r\n* Play up to 4 cards at once \r\n* Amazing graphics\r\n* Five different exciting powerups, including Free Daubs and coins \r\n* Collections: 12 items to collect in each room to exchange for in-game cash and coins \r\n* Exciting Achievements for great rewards \r\n* Cute Avatars \r\n* Generous Daily Bonus \r\n\r\nThis game is intended for those 21 or above for entertainment only.",
  "summary": "Bingo like in Vegas! Power ups, mysterious gifts, free coins, and FREE Casinos!",
  "installs": "100,000+",
  "score": 4.473881,
  "ratings": 5602,
  "reviews": 1148,
  "price": 0,
  "IAPRange": "£1.21 - £61.02 per item",
  "developer": "Hana Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 15, 2014",
  "updated": 1573461198000,
  "version": "1.2.1",
  "recentChanges": "Bug Fixes",
  "appId": "com.hanamobiles.bingocasino",
  "searchTerms": "bingo"
 },
 {
  "title": "Happy Bingo: Fantasy Journey",
  "description": "Welcome to the Happy Bingo: Fantasy Journey,this is one of the best and most popular bingo game for you!\r\n\r\nPlay Bingo with friends and find mystery collections around the world! The fashionable New York, the romantic Paris, the classic London, the modern Moscow, the rich Dubai and the beautiful Bali in the Happy Bingo.Win the grand prize!Find your lucky bingo cards anywhere!\r\n\r\nGame features:\r\n★The most fun free bingo game -Log in every day to receive rewards, and receive free gold coins every 4 hours. The best choice is with you, killing the long boring time!\r\n\r\n★More bingo cards-A variety of bingo cards are online at the same time to test your reaction ability, up to 4 cards!\r\n\r\n★Good luck and magical props-smudge tips,instant bingo cards, double coins... use magical props to win the game!\r\n\r\n★Mysterious debris cards-journey around the world and collect mysterious debris cards! Complete the task with fun! Get mysterious debris cards from the treasure chest and unlock more gameplay.\r\n\r\n★You can play bingo anywhere, anytime you want, with or without internet.NO wifi!!Don't worry!\r\n\r\nHappy Bingo: Fantasy Journey is a super addictive free bingo game! WHY? Because we’ve got it all!! A wide variety of bingo travel cities, a variety of unexpected mysterious props, only you can't think of. . .\r\n\r\nHappy Bingo: Fantasy Journey does not offer \"real\r\nmoney gambling\" or an opportunity to win real money or prizes.\r\nPractice or success at social gaming does not imply future success at \"real money gambling.\"",
  "summary": "Welcome to the Happy Bingo: Fantasy Journey.",
  "installs": "10,000+",
  "score": 4.15,
  "ratings": 244,
  "reviews": 76,
  "price": 0,
  "IAPRange": "£1.89 - £47.49 per item",
  "developer": "JOYNOWSTUDIO",
  "genre": "Board",
  "contentRating": "PEGI 3",
  "released": "Dec 19, 2018",
  "updated": 1545291857000,
  "version": "1.0.2",
  "recentChanges": "fixed bug",
  "appId": "com.googleplay.free.bingo.holiday",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Dice - Free Bingo Games",
  "description": "Join the world's biggest Bingo community and enjoy classic Bingo game, infinitely rewarding city building game and daily live tournaments online. A City Builder game along with the online Bingo game guarantees insane amounts of fun and allows you to win incredible prizes while competing against players around the world!\r\n\r\nGAME FEATURES:\r\n* Build Cities by constructing buildings and earn Treasure Chests\r\n* Realtime multiplayer! Play with thousands of players at a time!\r\n* Enter free DAILY TOURNAMENT to win BIGGER JACKPOTS\r\n* Play upto 4 Bingo Cards in one game and win big\r\n* 10 exciting power-ups that increase your chances to win\r\n* High-quality graphics featuring 30 unique cities & 100 levels with lot of Bonus content!\r\n* Welcome bonus of 5000 in-game cash, 50 bingo tokens and 40 power-ups\r\n* FREE Fortune wheel spin that lets you claim bigger rewards\r\n* Climb to the top of the leaderboard against your FRIENDS AND FAMILY!\r\n* VIP Subscription\r\n\r\nFAST PACED GAMEPLAY:\r\nBingo dice is a quick and fast-paced game, and you will be guaranteed to get a lot of FUN and BEST EXPERIENCE! It's an addictively fun time killer to play when you have idle time like waiting in the lines, on the way to work in train/bus/carpool and whenever you have free time. You can compete with your friends too, to prove you are the best.\r\n\r\nCITY BUILDER:\r\nProgress through the game by constructing buildings in each City using the Collection Items that you get from doing Bingo. Each city offers various collection items. By completing a City, you get Treasure Boxes as reward which contains awesome prizes like in-game Cash, Daubers, Avatars and Frames.\r\n\r\nEXCLUSIVE DAILY TOURNAMENTS:\r\nDaily tournament is a best of 5 rounds of the classic Bingo game. Players having the highest points will top the leaderboard. Tournament participants can see opponents'  scores in real time. Participants can use power-ups in-game to improve their chances of winning. Players with top scores will win the mega prizes everyday.\r\n\r\nPOWER UPS AND BOOSTS:\r\nThere are 10 power-ups and 4 boosts in Bingo Dice game. Power-ups strategically improve the chance of winning nevertheless using right power-up at the right moment can be game-changing. Boosts, on the other hand, are like helpmates in-game. Players can take advantage of various boosts to make their gameplay much simpler and straightforward.\r\n\r\nDAILY BONUS AND WHEEL OF FORTUNE\r\nHead start everyday with a huge boost of rewards. Be sure to stop by and collect your daily bonus of tokens and in-game cash. Wait! The fun is not over, along with daily bonus players also get a free spin of Fortune Wheel to unlock massive rewards.\r\n\r\nREGULAR UPDATES:\r\nWe provide regular free updates with loads of new content and features. Do let us know what you love to see in the game. Together we can make Bingo Dice the best Bingo game for everyone to play and have fun.\r\n\r\nGo ahead and download Bingo Dice for FREE! And you will absolutely love the Bingo game.\r\n\r\nPlease note: Bingo Dice is an online only game. Your device must have an active internet connection to play.\r\n\r\nThe game is intended for an older audience. The game does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at real money gambling.",
  "summary": "#1 Free Online Bingo Game",
  "installs": "10,000+",
  "score": 4.27,
  "ratings": 881,
  "reviews": 305,
  "price": 0,
  "IAPRange": "£0.99 - £49.99 per item",
  "developer": "Time Plus Q Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 22, 2018",
  "updated": 1589211147000,
  "version": "1.1.34",
  "recentChanges": "↑ ★ ★ ★ ★ ★ ↑<br>Love the game? Keep us inspired by giving a 5-star rating!<br>[v1.1.34]<br>* Minor bug fixes",
  "appId": "com.timeplusq.bingodice",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Quest - Summer Garden Adventure",
  "description": "AYOH - Shout out a cheer! Bingo Quest SUMMER Garden is here!  Featuring ALL NEW artwork showcasing the beauty of the season!\r\n\r\nTravel along the map into 4 picturesque Summer worlds. Walk through manicured flower gardens, unruly and mysterious forests, and even with the occasional beautiful beast! Are you ready to discover all that the newest Bingo Quest has to offer? \r\n\r\nIMMERSE YOURSELF IN THE BLOOMING WORLD OF BINGO QUEST - SUMMER GARDEN ADVENTURE! \r\nBingo Quest Summer Garden will take you on an adventure through the hot summer sun featuring beautiful artwork and relaxing scenery. An excellent free and fun bingo game featuring offline play!\r\n\r\n\r\nADVENTURE THROUGH BEAUTIFUL LANDS WITH 80 LEVELS OF FREE BINGO\r\nAs you progress through our free bingo game adventure, you’ll have the chance to explore new areas in the land of four seasons.  Adore the summer birds and waterfalls along your bingo journey and, with 80 levels of free bingo waiting for you in the gardens, you’ll have hours of fun in this beautiful garden land! You can even play offline!\r\n\r\nUNLOCK STUNNING FREE BINGO QUEST: SUMMER ADVENTURE ARTWORK\r\nCollect puzzle pieces as you play bingo with the the summer babies – use these puzzle pieces to unlock beautifully illustrated artwork of the otherworldly garden realm. Collect graphics of detailed, beautiful gardens and flowers as you progress through the game. Can you collect them all? \r\n\r\nSPIN THE MAGICAL WHEEL OF FORTUNE\r\nEvery day you can visit the wheel of fortune – rumored to give those who spin it a free reward every 24 hours. Receive extra daubers, coins, keys and more, so be sure to visit every day and claim your free prize!\r\n\r\n---------------------------------------------------------------------------------\r\nBINGO QUEST SUMMER GARDEN ADVENTURE – HIGHLIGHTS\r\n---------------------------------------------------------------------------------\r\n\r\n★ Fun, free bingo game for all ages\r\n★ Play through 80 levels of fantastic free bingo\r\n★ Explore different parts of the beautiful garden worlds, each with their own dauber\r\n★ Unlock stunning artwork of the wondrous gardens and flowers\r\n★ Spin the magical wheel of fortune for free bingo prizes and rewards\r\n★ Collect free coins and use them to buy power ups to help on your bingo adventure\r\n★ Use your keys to unlock treasure chests at the end of each level – what could they contain?\r\n★ Change the bingo caller speed\r\n★ Play Bingo Quest offline – no internet connection required! \r\n\r\nFor a refreshing, fun and free bingo experience, look no further than Bingo Quest Summer Garden Adventure!. Full of beauty and adventure, you’ll have hours of fun playing bingo in the beautiful garden paradise. Why play anywhere else? \r\n\r\n\r\n========================================================================\r\nCOME AND PLAY BINGO IN THE SUMMER GARDENS – DOWNLOAD BINGO QUEST FOR FREE TODAY!\r\n========================================================================",
  "summary": "Oh no summer is over!  But it doesn&#39;t have to be!  Come play Summer Bingo!",
  "installs": "1,000,000+",
  "score": 4.383333,
  "ratings": 18153,
  "reviews": 6421,
  "price": 0,
  "IAPRange": "£1.79 per item",
  "developer": "FGL Indie Showcase",
  "genre": "Board",
  "contentRating": "PEGI 3",
  "released": "Jul 12, 2018",
  "updated": 1588266498000,
  "version": "Varies with device",
  "appId": "com.dg.turbonuke.bingo.quest.summer.garden",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Pets Party: Dog Days",
  "description": "Join in the Bingo Pets Party fun in our new, free bingo game! Enjoy hours of super bingo fun as you adventure to magical worlds, collect & craft rare treasures, unlock lots of HD artwork and much more! If you’re a fan of bingo and you want a relaxing game you can play anywhere – look no further!\r\n\r\nOVER 75 LEVELS OF BINGO PETS FUN!\r\nOur new bingo pets game has over 75 amazing levels for you to enjoy! Build your collection of awesome bingo daubers, unlock stunning HD artwork, craft rare treasures and more! With so much to do and more content added regularly, the fun never stops at Bingo Pets Party! \r\n\r\nUNLOCK HD BINGO PETS ARTWORK!\r\nReady for a cuteness overload? Hidden throughout the levels are secret puzzle pieces. If you can collect all of these puzzle pieces you’ll unlock stunning HD artwork of cute animals. Frame it, save it or send it to you friends – it’s yours to keep!\r\n\r\nSPIN THE WHEEL OF FORTUNE\r\nThere’s a magical wheel of fortune at Bingo Pets Party! Every day you can come and spin it to receive guaranteed rewards and prizes. From chests of gold coins to extra keys, there are lots of different prizes to win. Make sure to check back every day for a spin! \r\n\r\n-------------------------------------------------------\r\nBINGO PETS PARTY - HIGHLIGHTS\r\n-------------------------------------------------------\r\n★ An exciting variation of classic 75 and 90 ball bingo\r\n★ Play through over 75 levels of fun, free bingo\r\n★ Lots of exciting new maps added every month\r\n★ Unlock beautiful HD artwork of cute animals\r\n★ Unlock funky new daubers & more\r\n★ Spin the wheel of fortune to earn free gifts, coins, daubers and more!  \r\n★ Collect free coins and use them to buy power ups to help on your bingo quest\r\n★ Use your keys to unlock treasure chests at the end of each level – what could they contain?\r\n★ Change the bingo caller speed to suit your playing style\r\n★ Play bingo offline – no wifi needed! \r\n\r\nSit back, relax and immerse yourself in the sunny world of Bingo Pets Party. Explore stunning locations, play exciting, free bingo and enjoy new maps released regularly. With so much epic bingo in one game, why play anywhere else?!\r\n\r\nJOIN THE FUN AT BINGO PETS PARTY – DOWNLOAD FREE TODAY",
  "summary": "Love unlimited free Bingo? Join in the Bingo Pets Party fun today!",
  "installs": "100,000+",
  "score": 4.5707545,
  "ratings": 2158,
  "reviews": 687,
  "price": 0,
  "IAPRange": "£1.79 per item",
  "developer": "Beautiful Bingo Games by Difference Games LLC",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 13, 2018",
  "updated": 1588624561000,
  "version": "Varies with device",
  "recentChanges": "Small updates and fixes.",
  "appId": "com.dg.turbonuke.bingo.quest.pets.party.dogs",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Gem Rush Free Bingo Game",
  "description": "★★★★★ PLAY BINGO GEM RUSH TODAY AND ENJOY UNLIMITED FREE CARDS! ★★★★★\r\n\r\nBingo Gem Rush is a free to play bingo game with an exciting new twist.  Race against the clock and compete against your friends.  If you are tired of the same old bingo games you'll love Bingo Gem Rush!\r\n\r\nGame Features:\r\n► Play for FREE: No card limits or game limits. Play when and where you want.\r\n► Play where you want, when you want! No internet required!  \r\n► Level up to unlock powerups  like the Multi-Daub, Freeze Time, or the awesome Instant Bingo! Discover combos to skyrocket your scores and crush the competition!\r\n► Use Facebook Connect to compete for leaderboard rank! \r\n\r\n\r\nCheck out what other players have said about our Bingo game:\r\n★★★★★  \"A bingo game with lots of extra neat stuff definitely not just your usual boring bingo I love it!!!\"\r\n★★★★★ \"Absolutely the best bingo game.. And i have played a lot of them.\" \r\n★★★★★ \"Can't stop playing This is so fun once you start you have trouble putting it down\"\r\n\r\nIf you enjoy great free bingo games, then you'll have tons of fun playing Bingo Gem Rush!\r\n\r\nQuestions?\r\nE-mail us at: bingogemrushsupport@playrocketgames.com",
  "summary": "Bingo Gem Rush is a free to play bingo game with unlimited cards! Play today!",
  "installs": "100,000+",
  "score": 4.7939067,
  "ratings": 11202,
  "reviews": 2910,
  "price": 0,
  "IAPRange": "£0.59 - £59.93 per item",
  "developer": "Rocket Speed - Casino Slots Games",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Aug 14, 2014",
  "updated": 1409357633000,
  "version": "1.0.4",
  "recentChanges": "- Fix for interacting with daily bonus/reward video button while game options menu is open.<br>- Minor bug fixes",
  "appId": "com.RocketGames.BingoGemRush",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Cute:Free Bingo Games, Offline Bingo Games",
  "description": "You can play the BEST Bingo games free offline, without wifi, without Internet. Feeling lucky? Try your luck in the best Free Bingo Games on Android: Bingo Cute!\r\n\r\nBest offline Bingo games free like never before! Different kinds of exciting bingo games rooms, more cards than any other Bingo Casino games and also vivid bingo caller sound!\r\n\r\nIf you love bingo and are looking for a free bingo game, this is the best bingo game for you.\r\n\r\nBingo for math game experience\r\nBingo Cute: free video bingo games free has thrilling math game play features such as bingo boosts, collection items and lots of achievements. Be a bingo superstars and crush the bingo fever.\r\n\r\nClassic bingo games free mode\r\nUse bingo chips to buy bingo cards to enter bingo game. The offline bingo caller will call 29 bingo numbers total. Mark the called bingo numbers as speed as you want! You can change the game speed too. When you identify any one of the winning patterns on your card,you don't need tap the BINGO button to call the bingo! for fun,it's so cool and no bad bingo calls.Much more than classic Bingo rules, brand new winning patterns in cool bingo are to be discovered. Pack up for your adventure now with big win in the best games 2017. \r\n\r\nExclusive Offline Mode\r\nPlay anytime anywhere! Bingo Cute is the best bingo game with an offline mode! Tons of bingo fun on the go!\r\n\r\nCollection and Rewards in jackpot bingo free\r\nTravel around the bingo island free world through different mysterious Bingo games rooms with unique dab collections items and get your bingo rewards! This offline casual games is designed for bingo for kids and adults too.\r\n\r\nYourself Daubers\r\nYou can customize your bingo daubers in your profile page. A lot of special shapes can be used for your showdown Bingo Cards. To be the fashion guy and the price is right!\r\nIt's BINGO time! Play one of the best FREE Bingo games on Android! Bingo Cute is free to play with lots of bonuses and coins. Best of all, you can play this Free Bingo \r\n\r\nGames anywhere you want as the game can be played offline with no internet connection.\r\n\r\nNew Features and Content\r\nBingo Cute is constantly updating the game with new features we think our players will DAUB for! We listen to all our player's inputs in making the best bingo game! \r\n\r\nPlay with multiple cards, up to 6 each round and enjoy fantastic bingo rewards. The more cards you buy, the higher chance to call BINGO and WIN BIG! Even better are the various Power Ups that help double and boost your winning!\r\n\r\nExperience a thrilling Bingo adventure like no other! Are you ready to Bingo?\r\n\r\nBINGO CUTE FEATURES\r\n\r\n1.FREE bingo games play - get free coins to play every 4 hours\r\n2.FUN bingo rooms and mini games\r\n3.Great bingo odds and GENEROUS payouts\r\n4.PLAY up to 6 bingo cards\r\n5.Play OFFLINE or play free online too! Games without wifi\r\n6.CHANGE your game SPEED - play faster or slower as you please\r\n7.WIN powerups in the special casino slots game (unlocked at higher levels)\r\n8.Super High Quality Graphics & Friendly Music\r\n\r\nFree no wait BINGO you can play online or offline with no WiFi! \r\n\r\nEnjoy now and have bingo fun. Bingo has never been better! Download Bingo Cute for FREE today!",
  "summary": "Play the free offline Bingo games.Fun bingo casino rewards.Best free bingo games",
  "installs": "100,000+",
  "score": 4.82947,
  "ratings": 6062,
  "reviews": 1833,
  "price": 0,
  "IAPRange": "£0.89 - £88.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 14, 2017",
  "updated": 1557980825000,
  "version": "1.09",
  "recentChanges": "Fixed a serious crash bug on some machines;<br>Bingo Game Improvement;<br>Thank you play Bingo Cute!",
  "appId": "com.sagafun.bingocute",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Happy : Casino  Board Bingo Games Free & Fun",
  "description": "Are you ready to scream BINGO? Welcome to the best bingo game experience in the world! Get out your bingo daubers and starting calling out BINGO!\r\n\r\nWith tons of levels and exciting Bingo game play, Bingo has never been better! what are you waiting for?\r\n\r\nDownload Bingo Happy for FREE today!\r\n\r\nFREE BINGO GAMES\r\nBingo games free to play.Play free bingo games offline or online.With over 30+ bingo games free to play, you'll be taken on a free bingo games adventure around the world.\r\n\r\nCASINO BINGO\r\nBingo like in Las Vegas! The best casino bingo game on the mobile! Enjoy this exciting casino bingo game with millions of players together.  \r\n\r\nBINGO WIN\r\nPlay bingo happy to win as much bingos as you can.it's your best gambling bingo games.Pack up for your adventure now with bingo win in the best bingo games 2018.\r\n\r\nFUN BINGO\r\nLove to play fun bingo games! download and play this fun free popular games.\r\n\r\nBINGO OFFLINE\r\nYes, you can play the BEST Bingo games free offline, no wifi, without Internet.Best offline Bingo games free like never before.\r\n\r\nNEW GAMES\r\nNew free bingo games added monthly.Bingo Happy is the world's most beloved card game, introduces a new free bingo experience.\r\n\r\nBOARD GAMES FOR FREE\r\nGather your family or friends and get ready for this globetrotting variation on a classic board game.with bingo board games you can enjoy all-time games within your \r\n\r\nandroid, with an accurate design and playability.\r\n\r\nGAMES FOR ADULTS\r\nBingo Happy is designed for all ages, perfect for kids & adults.Both adults and kids will love this amazing new trivia bingo game.\r\n\r\nFree no wait BINGO you can play online or offline with no WiFi! \r\n\r\nEnjoy now and have bingo fun. Bingo has never been better! Download Bingo Happy for FREE today!",
  "summary": "Bingo Happy is a fun and free bingo game,play bingo offline like never before!",
  "installs": "100,000+",
  "score": 4.3954425,
  "ratings": 7479,
  "reviews": 1922,
  "price": 0,
  "IAPRange": "£0.89 - £88.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 2, 2018",
  "updated": 1557043106000,
  "version": "1.12",
  "recentChanges": "Fix a crash bug!",
  "appId": "com.sagafun.bingohappy",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Star - Bingo Games",
  "description": "⭐⭐⭐⭐⭐ The Best Bingo Game! ⭐⭐⭐⭐⭐\r\n\r\nGet ready to discover the wonderful world of BINGO STAR - one of the best live bingo games in the world! \r\n\r\nBingo Star is the FREE bingo game you need to play!\r\n\r\nLive tournament bingo bash. Choose how many bingo live cards to play - play it safe with 1, or boost your bingo party with 4!\r\nCheck the numbers called out during the bingo blitz games - and daub away!\r\nWatch out for goodies! Hit the flashing bingo live Instant win to activate extra goodies - including early bingo pop wins, extra coins and extra power ups!\r\nKeep playing until ‘Bingo!’ is called..then discover which awesome items you've won, and level up!\r\n\r\nThe most exciting free bingo game is just a click away!\r\n\r\nHave a BLAST in this FREE BINGO JOURNEY \r\nMagical star, takes players on a bingo journey around the world with friends. Hear the bingo caller, play special lucky bingo cards in real time and spin the bonus wheel in an online bingo app adventure that combines absolute skills with fortune!\r\n\r\nIt’s absolute bingo heaven and showdown!\r\n\r\nYou pick how many bingo cards to play: start small with 1 card or go all out with 4 card games. Check the numbers called out during bingo games and play until you win! Ready for the next round?\r\n\r\nFree Bingo Goodies and Prizes Galore!\r\nAs you advance, COLLECT ITEMS and BONUSES hiding on bingo cards and in treasure chests. Collect them all to complete quests and unlock more exciting locations! Claim DAILY BONUSES - Spin bonus wheel to find out your prize! \r\n\r\nCompete in BINGO TOURNAMENTS - Your lucky numbers will turn you into a daily winner!\r\n\r\nGet Social with All Your Facebook Friends For an Epic Bingo Bash \r\n\r\nBingo Star is a bingo holiday like no other - and it's even better when you invite your friends to play in bingo heaven too!\r\n\r\nGet FREE BINGO BLITZ GAMES BONUSES for inviting friends to play! Connect your Facebook to easily send invites and save your bingo games progress!\r\n Chat away before each free bingo game with your friends while you're waiting for the next bingo live round to play, and even trade cards!\r\nShare the love, share the free bingo game wins! This is a rewarding bingo bash with your friends!\r\n \r\nFreebies and Fun Galore in Bingo Heaven!\r\n \r\nWhat’s better than awesome bingo games? Rewarding, FREE bingo games!\r\n \r\nReceive FREE bingo blitz games coins and DAILY CREDITS! Login every day for your free bingo live goodies - what’ll it be today?\r\nGo on epic quests for even MORE free bingo games credits! Complete awesome missions in each bingo holiday city for extra bonuses as you play!\r\nJoin an epic free bingo tournament! Turn those lucky numbers into HUGE DAILY bingo party wins!\r\nWin even BIGGER prizes and other cool, free bingo bash rewards in the awesome seasonal and featured bingo rooms! Get playing these cool, limited-time games before they disappear!\r\n \r\nPLUS: Complete your free bingo games collections in each bingo room you visit for even more bingo prizes!\r\n\r\nWe would love to hear from you! You can reach us at bingostar@playcus.com. \r\nBINGO Star contains optional in-app purchases. This game is intended for an adult audience (21+) for amusement purposes only and does not offer ‘real money’ gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at ‘real money’ gambling.",
  "summary": "Explosive Bingo Games! Real People, Real Bingo, Real Fun! Play Now!",
  "installs": "100,000+",
  "score": 4.0842104,
  "ratings": 1926,
  "reviews": 620,
  "price": 0,
  "IAPRange": "£3.79 - £75.99 per item",
  "developer": "Playcus LTD",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "May 24, 2019",
  "updated": 1583854480000,
  "version": "1.1.13",
  "recentChanges": "HELLO, BINGO FANS! <br>- PERFORMANCE IMPROVEMENTS <br>- BUG FIXES<br>We will keep on doing our very best to make sure that your enjoyment never stops! <br>Please, contact us at bingostar@playcus.com if you have any questions or suggestions. We are always happy to hear from you. With love, Playcus team!",
  "appId": "com.playcus.bingostar",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo 75 & 90 by GameDesire",
  "description": "Would like to have some good fun and meet interesting people at the same time? There is probably no better place to start your adventure than by playing Bingo 75 & 90 by GameDesire. Try your luck out and see how quick you are when it comes to hitting BINGO!\r\n\r\nAwesome features:\r\n\r\n• Two game modes: Bingo 75 and Bingo 90\r\n• Hundreds of players available to play with at any time\r\n• Great user interface to make your experience even more flawless\r\n• Handy chat to share your Bingo joy with others\r\n• Variety of tables available to suit your needs best\r\n• Loads of achievements, jackpots and special bonuses\r\n• Happy hours! 50% more GameChips for every purchase\r\n• 8 different languages available - Polish, English, German, Turkish, Russian, Spanish, French and Brazilian.\r\n\r\nCheck-out these other games by GameDesire™:\r\nTiffany's Bingo 💎  https://play.google.com/store/apps/details?id=com.gamedesire.mcbingo  \r\nMahjong Tale   https://play.google.com/store/apps/details?id=com.gamedesire.mahjong \r\n\r\n--------------\r\n\r\n- The game is intended for an adult audience.\r\n- The game does not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n- Practice or success at online social casino gaming does not imply future success at \"real money gambling\".\r\n",
  "summary": "Keen eye and quick reflexes? Try your hand at Bingo 75 &amp; 90 by GameDesire!",
  "installs": "100,000+",
  "score": 3.985,
  "ratings": 4026,
  "reviews": 1296,
  "price": 0,
  "IAPRange": "£0.59 - £49.99 per item",
  "developer": "GameDesire",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Nov 14, 2012",
  "updated": 1549791390000,
  "version": "2.4",
  "recentChanges": "* occasional progressive offers - up to 300% more chips!<br>* smaller improvements and bug fixes",
  "appId": "eu.ganymede.bingohd",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo City 75: Free Bingo & Vegas Slots",
  "description": "Bingo City is a famous online bingo and Vegas SLOT games for mobile and tablets. Play BINGO, SLOT and Video Poker game and meet with players worldwide. Our 75 Ball Rooms offer everything any Bingo lover could ask for! \r\n\r\nYou'll find Huge Jackpots, tons of BONUS, gorgeous graphics and all day FREE Bingo. \r\n\r\nIt is very EASY TO PLAY. As each number is called, find and match numbers on your card and click it. \r\n\r\nIf your card matches for the pattern correctly, just call BINGO. \r\n\r\nBe careful! If you call Bingo 2 times incorrectly, you will lose your card. \r\n\r\nAfter the first player calls bingo, there will be 5 extra balls drawn to give everyone else a chance to get bingo. \r\n\r\n※Tips : \r\n①You don't need to mark the number on your card to call bingo. \r\nIt helps you to make sure of the called number. \r\n②You can on/off AUTO DAUB (Hint)\r\n\r\n※ The games are intended for an adult audience.\r\n※ The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\n※ Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "summary": "Live Bingo game playing with people NOT machine. ^^ Why Don&#39;t you download NOW!",
  "installs": "500,000+",
  "score": 4.305921,
  "ratings": 12851,
  "reviews": 3616,
  "price": 0,
  "IAPRange": "£0.75 - £90.99 per item",
  "developer": "Fungrep Co Ltd",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 13, 2012",
  "updated": 1587953048000,
  "version": "12.50",
  "recentChanges": "Thanks for using Bing75! To make our app better for you, we bring updates to the App Store regularly.<br><br>Every update of our Bing75 app includes improvements for speed and reliability. As new features become available, we’ll highlight those for you in the app.",
  "appId": "kr.co.tk.game.bingo75.google",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo World - FREE Game",
  "description": "Explore Bingo World, the #1 social Bingo game on Facebook and Mobile Devices! Use special Power-Ups that win you bonuses, treasures, collectibles, and rewards in our fast-paced and thrilling update to classic Bingo. Fly around the world to exotic cities with your friends and call a Bingo in Bingo World today!\r\n\r\nWe would really appreciate it if you would give us a star rating or review for our game. Thank you for using Bingo World!",
  "summary": "Play the #1 free, fun, and social Bingo game on your Android tablet or phone.",
  "installs": "500,000+",
  "score": 4.2080226,
  "ratings": 10757,
  "reviews": 2024,
  "price": 0,
  "IAPRange": "£0.59 - £132.50 per item",
  "developer": "Playsino, Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 9, 2013",
  "updated": 1498252964000,
  "version": "2.13.0",
  "recentChanges": "Various fixes and improvements",
  "appId": "air.com.playsino.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Country Ways: Best Free Bingo Games",
  "description": "Bingo - Country Ways is the most addictive Bingo!\r\nPlay your way through the country and unlock exciting new episodes. Earn Experience Points (XP) to move up in the tournaments and win huge rewards.\r\nEarn special awards as you complete a new episode.\r\n\r\nFEATURES\r\n✪ Tournament-style play\r\n✪ A lot of amazing episodes to collect\r\n✪ High-quality graphics \r\n✪ Compete with thousands of people around the globe in real-time multiplayer\r\n✪ Awesome boosters will help you to win in back-to-back tournaments!\r\n✪ An amazing community of Bingo Lovers around the World!\r\n✪ Chat with players\r\n✪ Free app updates!\r\n\r\nThanks for playing Bingo - Country Ways!\r\nWe would love to hear your feedback!\r\n\r\nPLEASE NOTE! Bingo Country Ways is free to download and play, however, some game items can also be purchased for real money.\r\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\r\n\r\nSupport\r\nQuestions? Contact our tech support at bingocountryways@playcus.com or check our FAQ https://bingo-country-ways.helpscoutdocs.com\r\n\r\nPrivacy Policy: \r\nhttps://www.playcus.com/privacy-policy\r\n\r\nTerms of Service:\r\nhttps://www.playcus.com/terms-of-service",
  "summary": "The Most Addictive Bingo! Play Now and WIN!",
  "installs": "100,000+",
  "score": 4.4898877,
  "ratings": 8921,
  "reviews": 2487,
  "price": 0,
  "IAPRange": "£1.49 - £75.99 per item",
  "developer": "Playcus LTD",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jul 10, 2017",
  "updated": 1580219123000,
  "version": "1.62.49",
  "recentChanges": "We have a new update for you all:<br> - PERFORMANCE IMPROVEMENTS <br> - BUG FIXES<br>Please, contact us at bingocountryways@playcus.com if you have any questions or suggestions. We are always happy to hear from you. With love, Playcus team!",
  "appId": "air.com.playcus.bingocountryways",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Pets Mania: Cat Craze",
  "description": "Explore the cutest world ever in our newest bingo pets adventure! Explore tropical paradise islands and visit crazy carnivals full of cats! If you’re a fan of 75 or 90 ball bingo, you’ll love our exciting variation full of rare treasure, stunning artwork and lots of fun features to enjoy! \r\n\r\nTime for a cute, cat filled bingo adventure! Are you ready?\r\n\r\nOVER 75 LEVELS OF BINGO PETS FUN!\r\nWe have over 75 amazing free bingo levels for you to enjoy, rare treasures to collect and funky new daubers to unlock. With more maps and awesome features added regularly, the fun never stops at Bingo Pets Mania – Cat Craze! \r\n\r\nUNLOCK HD ARTWORK OF CUTE CATS!\r\nHidden in the sand, throughout the jungle and the rest of the island are secret puzzle pieces. Collect these pieces as you play bingo and you can unlock stunning HD artwork. Save the images on your phone, share them on social media or send them to your friends. \r\n\r\nSPIN THE PETS MANIA MAGIC WHEEL\r\nA magical wheel sits on the beach at Cats Island – you can spin it once per day. Spin the wheel to receive lots of free rewards and prices. From extra keys to chests of gold coins, there are so many free prizes to win! Make sure to check back every day for another spin!\r\n\r\n-------------------------------------------------------\r\nBINGO PETS MANIA - HIGHLIGHTS\r\n-------------------------------------------------------\r\n★ An exciting variation of classic 75 and 90 ball bingo\r\n★ Play through over 75 levels of fun, free bingo\r\n★ Lots of exciting new maps added every month\r\n★ Unlock beautiful HD artwork of super cute cats\r\n★ Spin the wheel of treasure to earn free gifts, coins, daubers and more!  \r\n★ Collect free coins and use them to buy power ups to help on your bingo quest\r\n★ Use your keys to unlock treasure chests at the end of each level – what could they contain?\r\n★ Change the bingo caller speed to suit your playing style\r\n★ Play bingo offline – no wifi needed! \r\n\r\nSit back, relax and immerse yourself in the sunny world of Bingo Pets Mania. Explore stunning locations, play exciting, free bingo and enjoy new maps released regularly. With so much epic bingo in one game, why play anywhere else?!\r\n\r\nCOME AND PLAY BINGO IN PET PARADISE – DOWNLOAD FREE TODAY",
  "summary": "The world&#39;s cutest bingo game! Unlimited free bingo &amp; lots of cute cats await!",
  "installs": "100,000+",
  "score": 4.6199093,
  "ratings": 2236,
  "reviews": 725,
  "price": 0,
  "IAPRange": "£1.79 per item",
  "developer": "Beautiful Bingo Games by Difference Games LLC",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jul 15, 2018",
  "updated": 1588622879000,
  "version": "Varies with device",
  "recentChanges": "Small updates and fixes.",
  "appId": "com.dg.turbonuke.bingo.quest.mania.pets.cat.craze",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Cowboy Story",
  "description": "Be the Cowboy you have always read about in books and watch in westerns as he conquest wild lands in Bingo Cowboy Story. Play the bingo, pick up the golden cards and don’t miss your chance to win big cash.\r\n\r\nWe created Bingo Cowboy Story to offer unique and interesting entertainment in your lives and to offer great BINGO games to fans of this game. We believe that we got, what they’ve always wanted. Great credit, colorful surroundings, crisp HD graphics, and chips, with tons of variable bonuses that can be claimed at any time. \r\n\r\n*** Bingo Cowboy Story FEATURES ***\r\n\r\n- Cowboy Bingo Games\r\n- Different Interesting Environments\r\n- Different Game Modes\r\n- FREE\r\n- Excellent Bonuses\r\n- HD Graphics\r\n- Stable Multiplayer Features\r\n- Intuitive UI\r\n- Easy to Understand\r\n- Top Notch Sound Effects \r\n- 30 exciting bingo games",
  "summary": "Сome to the wild west!  Ride mustangs and play bingo for free.",
  "installs": "100,000+",
  "score": 4.655689,
  "ratings": 3351,
  "reviews": 900,
  "price": 0,
  "IAPRange": "£0.89 - £139.99 per item",
  "developer": "Dynamic Games Ltd.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Horror, Simulated Gambling",
  "released": "Aug 28, 2016",
  "updated": 1588088517000,
  "version": "7.2.7",
  "recentChanges": "Bug fixes and stability improvements",
  "appId": "com.blackcircleapps.cowboybingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Smile - Free Bingo Games",
  "description": "Are you ready to scream BINGO?  Welcome to the best bingo game experience in the world!  You can play the Bingo games free, different kinds of exciting bingo rooms,without \r\nWiFi, without Internet. Try your luck in the best Free Bingo Games on Android: Bingo Smile!\r\n\r\nGet out your bingo daubers and starting calling out BINGO! With tons of levels and exciting Bingo game play,Bingo has never been better! \r\n\r\nwhat are you waiting for?\r\n\r\nClassic bingo games mode\r\nUse bingo chips to buy bingo cards to enter bingo game. The offline bingo caller will call 29 bingo numbers total. Mark the called bingo numbers as speed as you want! You can change the game speed too. When you identify any one of the winning patterns on your card,you don't need tap the BINGO button to call the bingo! for fun,it's so cool and no bad bingo calls.Much more than classic Bingo rules, brand new winning patterns in cool bingo are to be discovered. Pack up for your adventure now with big win in the best games 2018. \r\n\r\nExclusive Offline Mode\r\nPlay anytime anywhere! Bingo Smile is the best bingo game with an offline mode!\r\n\r\nGAMES FOR ADULTS\r\nBingo Smile is designed for adults, but perfect for kids & adults.Both adults and kids will love this amazing new bingo game.\r\n\r\nNew Features and Content\r\nBingo Smile is constantly updating the game with new features we think our players will DAUB for! We listen to all our player's inputs in making the best bingo game! \r\n\r\nPlay with multiple cards, The more cards you buy, the higher chance to call BINGO and WIN BIG! Even better are the various Power Ups that help double and boost your winning!\r\n\r\nAre you ready to Bingo?\r\n\r\nBINGO Smile FEATURES:\r\n1.FREE bingo games play - get free coins to play every 2 hours\r\n2.FUN bingo rooms and mini games\r\n3.Great bingo odds and GENEROUS payouts\r\n4.PLAY up to 6 bingo cards\r\n5.Play OFFLINE or play free online too! Games without wifi\r\n6.CHANGE your game SPEED - play faster or slower as you please\r\n7.WIN powerups in the special casino slots game (unlocked at higher levels)\r\n8.Super High Quality Graphics & Friendly Music\r\n\r\nFree no wait BINGO you can play online or offline with no WiFi! \r\n\r\nEnjoy now and have bingo fun. Bingo has never been better! Download Bingo Smile for FREE today!",
  "summary": "Bingo Smile is a fun and free bingo games,play the best bingo games offline now!",
  "installs": "100,000+",
  "score": 4.6115484,
  "ratings": 3825,
  "reviews": 1086,
  "price": 0,
  "IAPRange": "£0.89 - £85.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Apr 26, 2018",
  "updated": 1558058485000,
  "version": "1.5",
  "recentChanges": "Fixed a serious crash bug on some machines;<br>Bingo Game Improvement;<br>Thank you play Bingo Smile!",
  "appId": "com.sagafun.bingosmile",
  "searchTerms": "bingo"
 },
 {
  "title": "Our Bingo - Video Bingo",
  "description": "Now you can play Our Bingo from your mobile device and enjoy this addictive Bingo with your friends! DOWNLOAD the game for free and call Bingo from anywhere! We give you 5000 coins if you're new to Our.com!!  \r\n\r\nEnjoy playing this really fun Bingo in real time with other players from around the world. If you've played Our Bingo on Facebook or on the web, you'll keep your coins and your progress, whether you play on your mobile device or your computer.\r\n\r\nVersion includes:\r\n\r\n-MULTIPLAYER Bingo in real time\r\nPlay from anywhere in the world with your friends or with other players in real time.\r\n\r\n-Choose between THREE GAME MODES\r\nYou can choose between Classic Bingo, with 75 or 90 balls, the Trips room where you can obtain pieces and shout for lots of prizes or Video Bingos, quick games with themed rooms and extra balls\r\n\r\n-CHAT\r\nTalk to other players in real time. If you don’t feel like typing, use voice recognition to send messages. Just direct your voice toward the mobile device instead of writing!\r\n\r\n-AUTOMATIC MARKING\r\nYou don’t have to worry about checking off the numbers. Our Bingo does it automatically!\r\n\r\n\r\n-LOTTERY DRAWING\r\nJust by playing, you will have the opportunity to participate in a lottery draw where you can win thousands of coins.\r\n\r\n\r\n-AUTOMATIC PURCHASE\r\nBuy your cards automatically for the next games so you don’t have to worry about buying them every time.\r\n\r\n- SHARE and PUBLISH YOUR PRIZES IN FACEBOOK\r\nOur Bingo is linked with the major SOCIAL NETWORKS, Facebook and Twitter, where you can share your achievements.\r\n\r\n-LANGUAGES\r\nYou can choose from six languages: English, Spanish, French, Italian, Portuguese and German.\r\n\r\n-ACHIEVEMENTS AND COLLECTIONS\r\nEarn achievements and complete the different and fun collections offered which you can redeem for free coins.\r\n\r\n\r\nWe are working to add new features to the game. There will be more news coming soon!\r\n\r\nMinimum requirements to play:\r\n\r\n1. Internet connection (with 3G velocity, WIFI recommended)\r\n2. 1 GB of RAM\r\n3. 100 MBs of additional free space on SD card\r\n4. Minimum screen resolution of 800x480 pixels\r\n\r\nFollow us on our social networks and stay informed about all the NEW FEATURES AND COIN GIVEAWAYS:\r\n\r\nhttps://www.facebook.com/OurBingo/\r\nhttps://twitter.com/our_com\r\nhttps://www.youtube.com/user/OurPerson\r\n\r\nDo you have any problems? Visit the Our.com Support Centre: http://es.our.com/faq/",
  "summary": "Play Our Bingo with your friends from your mobile device!",
  "installs": "100,000+",
  "score": 4.2971096,
  "ratings": 8690,
  "reviews": 2513,
  "price": 0,
  "IAPRange": "£0.84 - £150.00 per item",
  "developer": "Our.com",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 25, 2013",
  "updated": 1554296928000,
  "version": "Varies with device",
  "recentChanges": "More options for winning prizes, quick games and fun, different themes in the new Video Bingos",
  "appId": "air.com.our.bingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Infinity™️ - Free Casino Slots & Bingo Games",
  "description": "From the makers of the smash hit, Bingo Pop, comes Bingo Infinity! A free award-winning classic bingo game mixed with Fast-Paced action, Power-Ups, Auto-Daub & more! \r\n \r\nBingo has never been better! Download Bingo Infinity for FREE today!\r\n\r\nBingo Infinity’s AWESOME Features: \r\n★ Experience FAST-PACED Bingo gameplay with Auto-Daub Mode\r\n★ Limited Time Event Bingo Rooms with HUGE Progressive Jackpots!\r\n★ Unlock RARE DAUBERS and earn INCREASED DAILY REWARDS!\r\n★ Increase your chances of winning by daubing up to 15 CARDS AT ONCE!\r\n★ Bingo meets SLOTS!\r\n★ Quick 3 Bingo call gameplay!\r\n★ Join thousands of Bingo Lovers around the globe!\r\n★ Use GAME-CHANGING POWER-UPS such as Instant Bingo and Double Daub!\r\n★ Raise your bets and win EVEN MORE with MULTI-BINGO\r\n \r\nFAST-PACED BINGO EXPERIENCE\r\n \r\nIt’s time to add some spice to your life! Win BIG REWARDS in the skies of Olympus or even BIGGER in Pharaoh's Tomb with Room Specific WIN PATTERNS. Start playing Bingo for FREE with no deposits required! \r\n \r\nHANDS-FREE AUTO-DAUB\r\n \r\nNever miss a call with  AUTO-DAUB! It’s simple, we do the daubing and you claim the winnings!\r\n \r\n15 CARD BINGO\r\n \r\nIncrease your chances of winning by daubing up to 15 CARDS AT ONCE! More Bingo cards for more wins!\r\n \r\nMULTI BINGO\r\n \r\nDaub UP TO 4 WINS on each card for more rewards! Experience the thrill of getting a MEGA BINGO!\r\n \r\nNEW FEATURES & CONTENT\r\n \r\nBingo Infinity is constantly updating the game with new features we think our players will DAUB for! We listen to all our player’s inputs in making the best bingo game! \r\n \r\nDownload Bingo Infinity today!\r\n \r\nThe game is intended for an older audience. The game does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at real money gambling.\r\n \r\nPrivacy Policy:\r\nhttps://www.jamcity.com/privacy/\r\n \r\nTerms of Service:\r\nhttps://www.jamcity.com/terms-of-service/",
  "summary": "🎰 Play the Only Casino Slots + Bingo Game! 🤑 Claim Your $3M Free Coins NOW!",
  "installs": "500,000+",
  "score": 4.3011584,
  "ratings": 5206,
  "reviews": 1884,
  "price": 0,
  "IAPRange": "£0.89 - £92.99 per item",
  "developer": "Jam City, Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jun 22, 2017",
  "updated": 1569956939000,
  "version": "2.2.45",
  "recentChanges": "Notable Additions:<br>∞ Improved stability and performance<br>∞ New exciting content",
  "appId": "com.uken.bingo_infinity",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo DreamZ - Free Online Bingo & Slots Games",
  "description": "Download NOW!\r\n\r\nWelcome to Bingo DreamZ, the best free online bingo game!\r\n\r\nBingo DreamZ is alive! Donwload now and know before no one all the news about the new bingo game online! Download now the game and enjoy!\r\n\r\nExplore the different worlds with free daily bonuses and rewards. The dream game has come true! \r\n\r\nIt is BINGO time! Play the best FREE bingo games on Android! Bingo DreamZ is free to play with lots of bonuses and coins.\r\n\r\nDo you want the best free bingo games, free to play and with free daily coins? Play the best Bingo Casino App, Bingo Dreamz!\r\n\r\nHere is the best online bingo experience in the world for you! Play the world’s #1 FREE BINGO GAME with the best online bingo players. The casino app Bingo DreamZ allows you to win lots of bonuses & prizes! Download it NOW and enjoy yourself. \r\n\r\nJoin millions of live bingo players from around the world. Play in different free bingo rooms with many ways to win and call bingo! Play multiple bingo cards at the same time and make those bingos pop right out.\r\n\r\nCompete in real time against millions of live bingo players & WIN BIG.\r\n\r\nPlay with powerUps to win huge rewards daubing all the bingo balls. Play online bingo and wait for the bingo caller to say your bingo ball number. \r\n\r\nPlay for free with friends and chat while you are playing bingo with them. Enjoy playing the minislots! Max slots jackpots!\r\n\r\nDo you know the special games? Play special bingo cards to collect more rewards, use fantastic new features to play the best bingo app like in the real Las Vegas casinos.\r\n\r\nPlay the best Bingo dreams for free, challenge to your friends and be the best. The bingo game of your dreams is here!\r\n\r\nNew Features for the Bingo DreamZ game\r\n- FREE COINS and CREDITS – get spins and daily bonuses.\r\n- Spin the bingo slot machine and get a bonus Wheel for free. \r\n- Mini games can be played for prizes while waiting for your rounds to start.\r\n- Play bingo games for free in new amazing Dreams – Conquer every single Dream playing each one of its stages, which offer new ways to win bigger prizes.\r\n- Win more with powerUps – Unique levels and bonus content that feature special themes, huge jackpots and more!\r\n- Gifts and surprises every day\r\n- Hourly bonus to get more free coins\r\n- Tournaments and more special events coming soon\r\n- Real Time multiplayer with friends and bingo players around the world while you are chatting with them\r\n- Play the bingo app casino anywhere!\r\n- Unlock exclusive bingo rooms and Dreams – Exclusive BIGGER JACKPOTS\r\n- Boosts and bingo points! It is amazing!\r\n\r\nBingo DreamZ is the best social casino app on Android! A new bingo experience is possible with each new bingo room! \r\n\r\nDownload Bingo DreamZ for FREE today!\r\n\r\nBingo Dreamz is intended for a mature audience.\r\nBingo DreamZ does not offer \"real money gambling\" or an opportunity to win real money or prizes.\r\nPast success at social casino gaming has no relationship with future success at \"real money gambling\".\r\nNow, enjoy the game!\r\n\r\nComing soon!",
  "summary": "⭐️ Play The #1 Bingo game with friends! Enjoy tournaments and bingo games! ⭐️",
  "installs": "100,000+",
  "score": 3.75,
  "ratings": 1102,
  "reviews": 397,
  "price": 0,
  "IAPRange": "£0.99 - £164.99 per item",
  "developer": "Playspace",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 5, 2018",
  "updated": 1584129935000,
  "version": "3.0.0",
  "recentChanges": "Fixed connection and download issues",
  "appId": "com.playspace.bingodreamz.free.jackpot",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Vegas™",
  "description": "Welcome to Bingo Vegas! \r\n\r\nIt is not only casino games such as slots, big wheel of fortune, pokers, blackjack or roulette in Vegas now, but also Bingo! \r\n\r\nWe Startlight Interactive presents you the most fascinating Bingo game you have never had before! \r\n\r\nLets stroll down to Vegas strip and try all the special Bingo features! \r\n\r\nDoes other Bingo games give you hard time to get Bingos? \r\n\r\nDon't worry now, you can use your strategy like swapping Bingo cards or using power items! \r\n\r\nWhat are you waiting for? Lets rock and roll in Vegas strip, gather all the special collection and get more rewards! \r\n\r\nHere are some features: \r\n\r\n\r\n* PLAY REAL-TIME BINGO * \r\n\r\n* POWER-ITEMS * \r\n\r\n* CHANGE CARD DURING PLAY * \r\n\r\n* GORGEOUS GRAPHICS* \r\n\r\n* FASCINATING VIEW AND COLLECTION*",
  "summary": "Welcome to Bingo Vegas! Meet all the fantastic Casinos in Vegas Strip!",
  "installs": "100,000+",
  "score": 4.4731183,
  "ratings": 3789,
  "reviews": 565,
  "price": 0,
  "IAPRange": "£1.25 - £62.50 per item",
  "developer": "Starlight Interactive",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 2, 2014",
  "updated": 1579233685000,
  "version": "1.2.3",
  "recentChanges": "===== v 1.2.3 =====<br>- Fixed bugs",
  "appId": "com.starlight.BingoVegas",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Quest Winter Wonderland Garden",
  "description": "IMMERSE YOURSELF IN THE SEASONS\r\nFree Bingo Quest will take you on an adventure through all four seasons featuring beautiful artwork and relaxing scenery.  An excellent free and fun bingo game featuring offline play!\r\n\r\n\r\nADVENTURE THROUGH BEAUTIFUL LANDS WITH 80 LEVELS OF FREE BINGO\r\nAs you progress through our free bingo game adventure, you’ll have the chance to explore new areas in the land of four seasons. Meet Jack Frost and Spring chicks to have fun with on your bingo journey and, with 80 levels of free bingo waiting for you in the gardens, you’ll have hours of fun in this beautiful garden land! You can even play offline!\r\n\r\nUNLOCK STUNNING FREE BINGO QUEST: Winter Wonderland Garden ADVENTURE ARTWORK\r\nCollect puzzle pieces as you play bingo with the the spring babies – use these puzzle pieces to unlock beautifully illustrated artwork of the otherworldly garden realm. Collect graphics of detailed, beautiful snowy landscapes as you progress through the game. Can you collect them all? \r\n\r\nSPIN THE MAGICAL WHEEL OF FORTUNE\r\nEvery day you can visit the Christmas wheel of fortune – rumored to give those who spin it a free reward every 24 hours. Receive extra daubers, coins, keys and more, so be sure to visit every day and claim your free prize!\r\n\r\n---------------------------------------------------------------------------------\r\nBingo Quest Winter Wonderland Garden- FOUR SEASONS ADVENTURE – HIGHLIGHTS\r\n---------------------------------------------------------------------------------\r\n\r\n★ Fun, free bingo game for all ages\r\n★ Play through 80 levels of fantastic free bingo\r\n★ Explore different parts of the beautiful garden worlds, each with their own dauber\r\n★ Unlock stunning artwork of the wondrous gardens and flowers\r\n★ Spin the magical wheel of fortune for free bingo prizes and rewards\r\n★ Collect free coins and use them to buy power ups to help on your bingo adventure\r\n★ Use your keys to unlock treasure chests at the end of each level – what could they contain?\r\n★ Change the bingo caller speed\r\n★ Play Bingo Quest offline – no internet connection required! \r\n\r\nFor a refreshing, fun and free bingo experience, look no further than Bingo Quest Winter Wonderland Garden. Full of beauty and adventure, you’ll have hours of fun playing bingo in the beautiful garden paradise. Why play anywhere else? \r\n\r\n========================================================================\r\nCOME AND PLAY BINGO IN THE SPRING GARDENS – DOWNLOAD BINGO QUEST FOR FREE TODAY!\r\n========================================================================",
  "summary": "Explore the Beautiful Seasons in a fun Free Bingo Game Adventure World! 💐",
  "installs": "100,000+",
  "score": 4.5377645,
  "ratings": 6651,
  "reviews": 1982,
  "price": 0,
  "IAPRange": "£1.79 per item",
  "developer": "FGL Indie Showcase",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 22, 2017",
  "updated": 1588688434000,
  "version": "1.56",
  "appId": "com.dg.turbonuke.bingo.quest.winter.garden.seasons",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Run - Free Bingo Games",
  "description": "Enjoy the latest free Bingo game with multiple cards and new rooms!\r\n\r\nIf you love bingo and are looking for a fun bingo game, Bingo Run is a best choice. Come experience the fantastic NEW BINGO game, we will not let you down! It's BINGO time! Play one of the best FREE Bingo games on Android!\r\n\r\nWelcome to the Bingo Run for all those who love bingo, and willing to relax playing your favorite game with nice paradise island. Ready for a Island Bingo Party! Enter to the world of bingo casino and begin to win amazing prizes!\r\n\r\n◆◆◆ Try your luck and skills in Bingo Run!! ◆◆◆ \r\n\r\nGame Features:\r\n# No wait BINGO,Play Free Bingo Games Offline or Online!\r\n# Play in over 70 free Bingo rooms with 13 different ways to win!\r\n# Experience Bingo like never before in our special Bingo cards!\r\n# Go through the world bingo tour, unlock city rooms and WIN BIG!\r\n# 100 Tickets & 22 powerups to start off. Every 4 hours you have another 30+ tickets to continue the bingo trip. Don't miss it!\r\n# Great bingo odds and GENEROUS payouts!\r\n# Your daily bonus will increase by your level up!\r\n# Complete kinds of puzzles to get BIG BINGO BONUS!\r\n# 12 types of power-ups - Help you get more bingos!\r\n\r\nAre you ready to Bingo?\r\n\r\nDon't Wait and download now, a new Bingo World is waiting for you!",
  "summary": "Bingo Run is the #1 Special Bingo Game, Play Free Bingo Games Offline or Online!",
  "installs": "10,000+",
  "score": 4.25,
  "ratings": 602,
  "reviews": 150,
  "price": 0,
  "IAPRange": "£1.69 - £84.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Feb 26, 2018",
  "updated": 1534403596000,
  "version": "1.05",
  "recentChanges": "Fix loading bugs and other bugs;<br>Bingo game improvement!",
  "appId": "com.sagafun.bingorun",
  "searchTerms": "bingo"
 },
 {
  "title": "Happy Bingo",
  "description": "Happy Bingo is a classic casino bingo game with easy gameplay and vivid images!\r\nJust try to win unexpected prizes in the crazy bingo fun! \r\n\r\nFeatures:\r\n\tObtain ordinary daily gifts for Free\r\n\tUnlock rooms in different cities via the world bingo travel and win the big prize\r\n\tVivid BGM\r\n\tComplete routine tasks and earn gifts\r\n\tEnjoy the various events and festivals in the game\r\n\r\nLife is a game. Go have some fun!\r\nTry this happy bingo game and let’s see if you’re the big winner!",
  "summary": "Enjoy the real fun in Happy Bingo!",
  "installs": "10,000+",
  "score": 4.52,
  "ratings": 154,
  "reviews": 31,
  "price": 0,
  "IAPRange": "£0.89 - £189.99 per item",
  "developer": "Lion Kingdom",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 5, 2019",
  "updated": 1559734305000,
  "version": "1.1.1",
  "appId": "com.aesarslotsreelotachinesandasinoamesmicheals",
  "searchTerms": "bingo"
 },
 {
  "title": "Lightning Bingo World",
  "description": "Lightning Bingo World is an exciting new free bingo game where your skill helps you win more! \r\n\r\nOnce a number is called you decide if it's on your cards. Accept or reject the number and then another will be presented. The faster you make the decision the more daubs you will be able to place. If a number won't help you towards a bingo, then bash it away and hopefully the next one will be on your cards! Mark your bingo card and complete rows to earn bingos and many other prizes! Race against the clock to place as many daubs as possible. \r\n\r\nCollect special powerups like the time extender and score multiplier. \r\n\r\nCollect picture tokens to pop open beautiful HD images and reveal them within the gallery. Each bingo land has three pictures you can unlock. The tokens you collect while playing bingo dash open the blocks hiding the pictures. Each picture you unlock grants a prize and also places it in the gallery. Unlock new lands as you progress through this bingo adventure game. Every daub placed grants you XP and as you level up new lands are unlocked. Each new land has new pictures to reveal, music and graphics and additional modes of play. Will you be a Bingo Dash superstar? \r\n\r\n===================== Lightning Bingo World FEATURES: ===================== \r\n★ Fun and exciting Bingo game for all. \r\n★ Enjoy beautiful background music while you play. \r\n★ Chill out and play Lightning Bingo World whenever and wherever you are. \r\n★ Free to play with no internet connection required \r\n★ Collect hidden treasures in each level \r\n★ Unlock beautiful HD artwork in each level. \r\n★ Enjoy a new super fun way get your bingo fix and feel the rush of victory! \r\n★ Catch the bingo fever as you gain XP, level up, discover new lands and open fabulous treasures. \r\n★ If you are feeling lucky spin the bingo wheel for extra prizes. \r\n★ Collect 6 keys during a round and you can bash open a treasure chest revealing secret prizes. \r\n★ Unlock new bingo callers. \r\n★ This is the best new bingo game you will play in 2018! \r\n★ Tons of lands to explore \r\n★ Free Daily Awards \r\n★ Collect Gems from your own mine \r\n★ Play with one to four cards \r\n★ Exciting new bingo game! \r\n★ Unlock custom daubers with special graphic for your Bingo cards \r\n★ Unlock themed bingo cards \r\n★ Use free Bingo money to win rewards and the best Bingo bonuses \r\n★ Choose your Power-ups: Standard, Uncommon, Rare and Epic \r\n★ Unlock free coins, gems and free bonuses through your Bingo journey \r\n★ Play your favorite Bingo game around the world with themed cards \r\n★ The more you play, the more you get to travel and win big at Bingo Dash World \r\n\r\nBingo Dash World can be played offline. It's free to play and no internet or wifi is needed in order to enjoy our free bingo game! With tons of levels and exciting Bingo gameplay, what are you waiting for?!",
  "summary": "Lightning Bingo World is an exciting new fast paced free bingo game!",
  "installs": "50,000+",
  "score": 4.5277777,
  "ratings": 1452,
  "reviews": 387,
  "price": 0,
  "IAPRange": "£0.89 - £35.49 per item",
  "developer": "Beautiful Bingo Games by Difference Games LLC",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 10, 2018",
  "updated": 1516025586000,
  "version": "1.03",
  "recentChanges": "Changed name to Lightning Bingo World",
  "appId": "com.dg.turbonuke.bingo.dash.world",
  "searchTerms": "bingo"
 },
 {
  "title": "BINGO! World Tour",
  "description": "Play the FREE BINGO! WORLD TOUR 2019 today, travel and explore the world playing cards in exotic rooms and collecting postcards and collectible souvenirs which can be turned in for rewards and tickets. \r\nUse powerful power-ups to increase your prizes!\r\n\r\nBINGO! WORLD TOUR FEATURES\r\n-Play up to 100 cards in a room at once.  Forget Bingo games that limit you to just 4 cards.\r\n-100% percent Free to Play Bingo!\r\n-Totally new gameplay for 2019\r\n-Fantastic quality graphics for each unique room.\r\n-TRAVEL and EXPLORE 10 countries, with more being released soon!\r\n-COLLECT and COMPLETE over 30 postcards\r\n-COLLECT and COMPLETE over 90 collection items and turn them in for prizes.\r\n-PROGRESS through over 50 levels as you travel the world.\r\n-COLLECT treasure chests and open them for FREE! tickets, cards, coins and MORE!\r\n-USE a variety of power-ups to help you play and win more prizes!\r\n-Multiply your payouts by 100x by playing ultra bingo cards every room!\r\n-EASY to learn and play\r\n-Daily free tickets!\r\n\r\nReady to play to best free bingo game of 2019, download now and get started!  Don't forget, this is the only Bingo game that lets you play 100 cards at the same time in any room.  There are plenty of tickets to be won.  Free tickets every day, every time you level up and every time you complete your daily challenge.\r\n\r\nThis bingo game is intended for adult audiences and does not offer real-money gambling or any opportunities to win real money or prizes.\r\nSuccess within this free bingo game does not imply future success with real money gambling.",
  "summary": "Get lucky &amp; play! Win free tickets, the best 2019 Bingo game. Play 100 Cards!",
  "installs": "100,000+",
  "score": 4.35533,
  "ratings": 1984,
  "reviews": 560,
  "price": 0,
  "IAPRange": "£2.89 - £194.99 per item",
  "developer": "Clipwire Games and Bingo",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Oct 21, 2016",
  "updated": 1559853254000,
  "version": "2.0.2",
  "recentChanges": "Bug Fixes &amp; Performance Improvements",
  "appId": "com.clipwiregames.bingoworldtour",
  "searchTerms": "bingo"
 },
 {
  "title": "Lua Bingo online",
  "description": "Lua Bingo is a 75 and 90 balls bingo game. Play online with your facebook friends or play offline with Lua and its friends. Travel around the world visiting famous cities such as Barcelona, Paris, New York, Roma, Sydney, Berlin, Beijing, London, Bangkok or Rio de Janeiro, and more coming soon. Use the boosters to increase your chances of claiming bingos and winning credits. Raise your game level, get objectives, complete collections and win extra prizes. Get it now for free!\r\n \r\nFEATURES\r\n✔ It’s free to play!\r\n✔ Bingo 75 and 90!\r\n✔ Play online with your Facebook friends.\r\n✔ Play offline without Internet connection with Lua & friends, meet all cats!\r\n✔ FREE tickets for you every day!\r\n✔ Travel all around the world and play in 20 different rooms.\r\n✔ Collect items on every city.\r\n✔ Chat with your friends playing bingo.\r\n✔ Play from Facebook or your Android device.\r\n\r\nDownload it completely FREE and have fun playing with Lua or your friends on your mobile phone, tablet and browser!\r\n\r\nEnjoy Lua Bingo on your PC at https://apps.facebook.com/luabingo/\r\n\r\nLIKE US @ www.facebook.com/luabingo\r\nFOLLOW US @ www.twitter.com/luabingo\r\n\r\nAny suggestions? You can reach us at contact@luabingo.com\r\n\r\nThis game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.",
  "summary": "Include 75 &amp; 90 free online bingo rooms and offline free bingo vs Lua &amp; Friends",
  "installs": "100,000+",
  "score": 4.3224754,
  "ratings": 3084,
  "reviews": 1436,
  "price": 0,
  "IAPRange": "£1.99 - £99.99 per item",
  "developer": "Lua Bingo Free Casino Online",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Jan 1, 2016",
  "updated": 1584188041000,
  "version": "1.26.3",
  "recentChanges": "We fixed some bugs and make the game faster. ヽ(´▽`)/",
  "appId": "com.luabingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Mother's Day Bingo",
  "description": "Mother’s Day is a day for many people to show their appreciation towards mothers and mother figures worldwide. We've create this special Bingo game to honor this holiday.\r\n\r\nSave this amazing season in your heart and play this free game of bingo it anytime you want with the most incredible features in the market. Play offline in those moments while coming back home, play online and experience the real bingo live excitement; stress free guarantee, as the connection won’t get lost in the middle of a game. Our responsive & quick interface ensures a high quality gaming experience, with stunning Mother's Day animations, themed bingo cards, gifts, and much more surprises!  Earn special trophies & medals as special achievements; with them, you’ll be able to unlock more skins & themes like Valley of Flowers, white carnations & many other funny animated bingo cards. \r\n\r\nListen to all our funny sound effects, listen the pop of the balls falling. Use special Mother's Day markers & change the theme of your cards every time you want! Use power ups to increase your earnings, and increase your chances of winning by playing up to 4 cards! Have a favorite card with specific number sets? Save it and customize your own lucky card, bet, and play it as many times you want! Choose the amount of cards to daub and place custom bets for each card. Enjoy our HD graphics, plus all of the wonderful content to discover! \r\n\r\n*** Features of the Game***\r\n\r\n- No deposit required, all content is free\r\n- Online Leaderboards\r\n- Several Rooms and a Lobby to Chat\r\n- Low battery & Memory Consumption\r\n- Offline Mode! \r\n\r\nPlay with no restrictions, no limits and with tons of rewards and bonuses! Be part of our community & play in special events! Start playing NOW Mother's Day Bingo on Google Play Store!!!",
  "summary": "It&#39;s Brand new bingo game for very special day!",
  "installs": "100,000+",
  "score": 4.661017,
  "ratings": 2401,
  "reviews": 695,
  "price": 0,
  "IAPRange": "£0.89 - £139.99 per item",
  "developer": "Dynamic Games Ltd.",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Horror, Simulated Gambling",
  "released": "May 4, 2017",
  "updated": 1588086251000,
  "version": "7.2.7",
  "recentChanges": "Hello Bingo Fans!<br>Here&#39;s a new update with fixes to improve your game experience!",
  "appId": "com.dynamicgames.motherday",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Arena - Offline Bingo Casino Games For Free",
  "description": "Are you ready to scream BINGO? Welcome to the best bingo game experience in the world! Get out your bingo daubers and starting calling out BINGO!\r\n\r\nWith tons of levels and exciting Bingo game play,Bingo has never been better!  what are you waiting for?\r\n\r\nDownload Bingo Arena for FREE today!\r\n\r\nBingo Arena Features:\r\nFree bingo play - get free coins to play every 4 hours\r\nDistinctive bingo odds and generous payouts\r\nPlay offline or online too! You can play anywhere, anytime\r\nPlay up to 6 bingo cards\r\nMini games and free bingo bonuses available every day\r\n\r\nIf you love bingo and are looking for a fun bingo game, this is the game for you.\r\n\r\nBEST BINGO EXPERIENCE\r\n\r\nWin BIG REWARDS and JACKPOTS on the jackpot-stakes cards! Enjoy a variety of Featured Rooms!\r\n\r\nEXCLUSIVE OFFLINE MODE\r\n\r\nPlay anytime anywhere! Bingo Arena is a Bingo game with an offline mode! Tons of bingo fun on the go!\r\n\r\nWIN MORE WITH POWER-UPS\r\n\r\nEarn free Power-Ups as you daub your way through hundreds of unique levels and bonus content that feature special themes, huge jackpots, and more!",
  "summary": "Bingo Arena is a fun and free bingo game,play Bingo Offline like never before!",
  "installs": "100,000+",
  "score": 4.626087,
  "ratings": 3480,
  "reviews": 987,
  "price": 0,
  "IAPRange": "£1.99 - £98.99 per item",
  "developer": "Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 17, 2017",
  "updated": 1534403472000,
  "version": "20.0",
  "recentChanges": "Fix Loading Bugs;<br>Bingo game improvement!",
  "appId": "com.sagafun.bingoarena",
  "searchTerms": "bingo"
 },
 {
  "title": "Wild Party Bingo FREE social",
  "description": "* True realtime multiplayer gameplay with real people!\r\n* Excellence in Gaming Award Nominated! \r\n* Our unique Teams feature allows you to join friends and co-operate, or compete with them!\r\n* We've added two main improvements to the classic game of Bingo; Booster Party and Power Ups.\r\n* With the Booster Party, your teamwork triggers a shower of goodies that improve your chances to Bingo!\r\n* PowerUps offer another level of gameplay, giving you 6 exciting ways to mix things up!\r\n* PowerUps add strategy, excitement and wild swings:\r\n\r\n\tFalling behind?  No problem, play a Free Daub!\r\n\tDid your team fall back?  Give them a \"helping hand\" and feel the love!\r\n\tDid you miss a ball that past?  Use the Spotter and find ones to catch up!\r\n\tGot 'bad numbers'?  Use Swap to get new numbers on those cards!\r\n\tFeeling stressed, or phone rings?  Play a Coffee Break and sit back to relax!\r\n\tSomeone in your #1 position?    DISRUPT them!  Being bad can be so fun!\r\n\r\nThe game features:\r\n\r\n- play 1 to 6 cards \r\n- 16 progressively difficult levels\r\n- Booster Party bonus events\r\n- 6 unique powerups\r\n- teams or solo play\r\n- chat\r\n- persistent user profiles with stats\r\n- unique friends lists\r\n- gifting\r\n- achievements\r\n- unique locations to party around the globe including Brazilian Carnival, Vegas, French Versailles and Kid's Party!\r\n- special Blackout mode\r\n- '1-click' social interactions\r\n- wide selection of party music\r\n- SessionM integration for real-world rewards.  US Only.\r\n\r\nWild Party Bingo is easy to learn, but deep enough to keep you hooked.  This game is focused on creating a truly social experience providing many ways to interact with your fellow Bingo players!  Come join the Party!\r\n.\r\n*internet connection required*",
  "summary": "World&#39;s most social Bingo game!  Play w/ friends and make new ones!",
  "installs": "100,000+",
  "score": 4.4895396,
  "ratings": 4798,
  "reviews": 1184,
  "price": 0,
  "IAPRange": "£0.59 - £59.47 per item",
  "developer": "Asylum Labs",
  "genre": "Puzzle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Aug 12, 2014",
  "updated": 1557424194000,
  "version": "1.3.17",
  "recentChanges": "- Need a break from Bingo, or just waiting for the next round to begin?  Play some Video Poker and win Chips and Diamonds!<br>- Bug fixes for Party Time related to very high number of parties completed.",
  "appId": "air.com.asylumlabsinc.wpbingo",
  "searchTerms": "bingo"
 },
 {
  "title": "Bingo Treasure Quest - Paradise Island Riches",
  "description": "While on holiday to Paradise Island, you find an ancient looking treasure map! As you play bingo, you’ll explore the beaches, jungle and other amazing locations on a quest to find the riches hidden on the island. \r\n\r\n\r\nOVER 75 LEVELS OF PARADISE ISLAND FUN!\r\n\r\nJourney through Paradise Island and hunt for treasure in custom designed, stunning maps that’ll make you feel like you’re on holiday! Meet a whole bunch of new friends to play bingo on your island quest. With over 75 levels – and more added each month – there’s no end to the fun you can have playing our hottest new bingo game! \r\n\r\n\r\nUNLOCK STUNNING TREASURE ISLAND ARTWORK\r\n\r\nPlay bingo and collect puzzle pieces to unlock HD artwork showcasing the best of Paradise Island. Use the artwork as a HD phone background, save to your gallery, share with friends and more – it’s yours to keep! From pirate ships to secret coves, can you collect them all?\r\n\r\n\r\nSPIN THE TIKI WHEEL OF TREASURES\r\n\r\nThe tribe living on Paradise Island has a magical wheel, guaranteed to give you treasure every 24 hours! Come and spin the wheel every day to receive a free gift to help you on your bingo quest. Receive extra daubers, coins, keys and more – make sure to visit every day!\r\n\r\n\r\n---------------------------------------------------------------------------------\r\nBINGO TREASURE QUEST - HIGHLIGHTS\r\n---------------------------------------------------------------------------------\r\n★ Fun, free bingo game for all ages\r\n★ Play through 80+ levels of bingo on Paradise Island\r\n★ More exciting maps added every month\r\n★ Explore a stunning world full of sandy beaches, jungles, forests and more!\r\n★ Unlock beautiful HD artwork of pirate ships, treasure coves and more\r\n★ Spin the Tiki Wheel of Treasure every 24 hours for a free gift \r\n★ Collect free coins and use them to buy power ups to help on your bingo journey\r\n★ Use your keys to unlock treasure chests at the end of each level – what could they contain?\r\n★ Change the bingo caller speed to suit your playing style\r\n★ Play Bingo Treasure Quest offline – no internet connection required! \r\n\r\n\r\nTransport yourself to an idyllic island and hunt for treasure hidden by pirates long ago. Explore long, sandy beaches and other stunning locations – with more maps added regularly, why play anywhere else?!\r\n\r\n\r\nCAN YOU FIND THE TREASURE ON PARADISE ISLAND? FIND OUT TODAY!",
  "summary": "Hunt for treasures on a journey across Paradise Island in our bingo quest game!",
  "installs": "100,000+",
  "score": 4.5263157,
  "ratings": 3837,
  "reviews": 1145,
  "price": 0,
  "IAPRange": "£1.79 per item",
  "developer": "Beautiful Bingo Games by Difference Games LLC",
  "genre": "Board",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 30, 2017",
  "updated": 1588620249000,
  "version": "Varies with device",
  "recentChanges": "Small tweaks and program updates.<br><br>--Other Recent Updates--<br>Bingo Quest Anniversary Special!  <br>Ability to double your level earnings with a rewarded video.<br>Bug fixes and other small improvements based on your feedback!<br>Improved Help System<br>Improved Screen Layouts<br>Extra sparkles!<br>2 New Caller Speeds available so you can play at a pace you are comfortable.<br>Happy Bingos! :)<br>Launch!  Join 100,000s of bingo players who love Bingo Quest!",
  "appId": "com.dg.turbonuke.bingo.quest.treasure.paradise.island",
  "searchTerms": "bingo"
 }
]