[
 {
  "title": "The National Lottery - Lotto, EuroMillions & more",
  "description": "The Official National Lottery app is where you can play: \r\n\r\nLotto\r\n•\tThe one. The only. The original National Lottery game.\r\n•\tIt’s the nation’s game, with thousands winning prizes in every draw.\r\n•\tLotto tickets cost £2 per play, with draws every Wednesday and Saturday.\r\n\r\nEuroMillions\r\n•\tThere’s big and then there’s EuroMillions big!\r\n•\tThis is the game with out of this world jackpots, creating new millionaires every week.\r\n•\tEuroMillions tickets cost £2.50 per play, with draws every Tuesday and Friday.\r\n\r\nSet For Life\r\n•\tDig out your bucket list! You could win £10,000 every month for 30 years* with Set For Life.\r\n•\tPay just £1.50 per line and play up to 4 weeks in advance.\r\n•\tDraw days every Monday and Thursday.\r\n\r\nThunderball \r\n•\t£1 might make your night. Win £500,000* for just £1!\r\n•\tDraws every Tuesday, Wednesday, Friday and Saturday.\r\n\r\nOr play an Instant Win Game\r\n•\tIn just a few taps, you could win anything from a few pounds to a life-changing million.\r\n•\tWith prizes that never run out, there’s an Instant Win Game for everyone!\r\n•\tGames cost from £1 to £5 to play.\r\n\r\nLotto HotPicks & EuroMillions HotPicks\r\n•\tBigger prizes for fewer numbers\r\n•\tPick and match winning balls from the main draws or choose a Lucky Dip® for randomly selected numbers. \r\n\r\nAnd don't forget, every time you play a National Lottery game you help support Good Causes all over the UK. In fact, £30M is raised on average each week**.\r\n\r\nBesides playing, managing how you do so has never been easier:\r\n\r\n•\tEnable Fingerprint Recognition and sign-in to your account instantly.\r\n•\tSave your lucky numbers and enter draws at the tap of a button.\r\n•\tIn a rush? Scan your paper tickets in seconds to see if you’re a winner.\r\n•\tLink your bank account details to add and withdraw funds at any time.\r\n•\tSet limits to manage fund levels and how many games you can play per day.\r\n\r\nDownload now and play The National Lottery from the palm of your hand.\r\n\r\nTo improve the app experience, we collect anonymous information about browsing behaviour. More information is available in our Privacy Policy at https://www.national-lottery.co.uk/privacy-policy\r\n \r\nIf you have a suggestion, a bug to report or a new feature for us to consider, we want to know! Email app@camelotgroup.co.uk.\r\n\r\nPlease note whilst available for download for tablet, the app is best used on mobile devices.\r\n \r\nPlayers must be 18 or over to download this app. App Ts&Cs apply.\r\n \r\n*Prizes are fixed, subject to capping.\r\n**Around £30 million raised weekly is an average based on April 2018 - October 2019.\r\n \r\n \r\nIf you're worried about yourself, or someone you know, speak in confidence to the people at GamCare on 0808 8020 133 or visit www.gamcare.org.uk. You can find out more about our approach to responsible play on the Responsible Play page, found in the app menu.",
  "summary": "Feeling lucky? Play your favourite games and check the latest lottery results",
  "installs": "1,000,000+",
  "score": 3.8320754,
  "ratings": 10661,
  "reviews": 4837,
  "price": 0,
  "developer": "Camelot UK Lotteries Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests",
  "released": "Oct 12, 2017",
  "updated": 1587043748000,
  "version": "7.3.0",
  "recentChanges": "- Play the games you love with The National Lottery app! 🤞<br>- To improve your National Lottery experience, we have given our Transaction History in My Account a refresh.<br>- There are now exclusive games that are only available on our app. Come and give them a try! <br>- We have integrated with GAMSTOP. If you&#39;ve registered for the national gambling self-exclusion scheme, you will no longer be able to play Instant Win Games on the app.",
  "appId": "uk.co.theofficialnationallotteryapp.android.play",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Results",
  "description": "Check Lotto, Raffle, Euromillions, Irish, Thunderball & Hotpicks results with the  UK's No. 1 Lottery Results App - available on both mobile & tablet.\r\n \r\nOver 2 million downloads - get it now and check your lottery numbers on the move!\r\n\r\n\"Brilliant app. All the lottery numbers. Excellent.\"\r\n\r\n\"You can't improve on an app that's perfect\"\r\n\r\nCheck the latest draws and past results for the following game:\r\n\r\n★ LOTTO\r\n★ LOTTO RAFFLE\r\n★ LOTTO HOTPICKS\r\n★ EUROMILLIONS\r\n★ EUROMILLIONS RAFFLE\r\n★ THUNDERBALL\r\n★ HEALTH LOTTERY\r\n★ IRISH LOTTO\r\n★ POWERBALL\r\n★ MEGAMILLIONS\r\n \r\nLottery Results Features:\r\n \r\n★  Updated Lottery Results available right after the draw\r\n★  Prize Breakdown for every draw!\r\n★  Record your numbers\r\n★  Automatically check if your numbers win\r\n★  Lucky Dip? Use the Number Generator to create your very own lucky dip\r\n \r\n\r\nIn addition to providing fast and accurate lottery results, the app also offers other unique and handy features:\r\n \r\nSAVE & CHECK YOUR NUMBERS\r\nA convenient way to record the numbers you have played and the app will automatically check if you win.\r\n \r\nNUMBER GENERATOR\r\nFeeling lucky? Can't decide what numbers to play? Let the app pick the numbers for you using the Number Generator and save them directly into \"My Numbers\".\r\n \r\nLOTTERY NEWS \r\nGet the latest lottery news headlines, gossip, tips and success stories.\r\n \r\nLOTTERY STATS\r\nFind out which numbers are most likely to win with our unique Lottery Number Frequency. \r\n \r\n**  The Lottery Results app requires a Wi-Fi or Data network for some of its content. Please ensure you have an Internet connection before launching this application**\r\n \r\n\r\nWe want to make Lottery Results app better for our users so please feel free to send us your comments and suggestions using the Feedback form within the app.\r\n\r\nVisit the Lottery Results website (http://www.lotterytickets.me) or follow us on Twitter @LotteryResultsUK(https://twitter.com/lotteryresultuk) or Facebook (https://www.facebook.com/LotteryResultUK)\r\n \r\n\r\nDisclaimer:-\r\n\r\n- Always check your tickets with the official lottery service provider to confirm any possible winnings.\r\n \r\n- All descriptions, names, characters, locations, imagery and videos in this application are copyright of their respective owners.\r\n\r\n\r\nBy downloading the Lottery Results App you are indicating acceptance of Red Knight Interactive’s Terms and Conditions and Privacy Policy www.redknightapps.com/privacy.php. If you would like Red Knight Interactive to remove any data we have relating to you and your use of the Lottery Results App service, please email support@redknightapps.com",
  "summary": "Lotto, Euromillions,Raffle, Thunderball, Irish, Hotpicks, MegaMillions,PowerBall",
  "installs": "1,000,000+",
  "score": 3.9587157,
  "ratings": 5196,
  "reviews": 1102,
  "price": 0,
  "developer": "Red Knight Apps",
  "genre": "Books & Reference",
  "contentRating": "PEGI 3",
  "released": "Oct 21, 2010",
  "updated": 1546235972000,
  "version": "5.0",
  "recentChanges": "Bug fixes &amp; improvements for the Lottery Results app",
  "appId": "com.brightai.lottery",
  "searchTerms": "lottery"
 },
 {
  "title": "National Lottery Results",
  "description": "Get the latest UK Lottery results within seconds of the draws taking place. This easy-to-use app shows the National Lottery numbers, prize breakdown information and jackpots for the following lotteries:\r\n\r\nLotto\r\nEuroMillions (including UK and European Millionaire Maker)\r\nThunderball\r\nSet For Life\r\nLotto HotPicks\r\nEuroMillions HotPicks\r\n\r\n\r\nThe following features are also included:\r\n\r\n\r\nQR Ticket Scanner\r\n--------------------------------------\r\nFor lottery tickets purchased in shops, simply scan the QR code printed on your ticket using your phone’s camera to see if you have won a prize.\r\n\r\n\r\nTicket Checker\r\n--------------------------------------\r\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\r\n\r\n\r\nCustomisable Notifications\r\n--------------------------------------\r\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\r\n\r\n\r\nRandom Number Generator\r\n--------------------------------------\r\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on Lucky Dip numbers!\r\n\r\n\r\nResults Archive\r\n--------------------------------------\r\nAccess to the full archive of results dating back to the first draw of each lottery.\r\n\r\n\r\nSettings\r\n--------------------------------------\r\nCustomise which lotteries display in the app and in which order.\r\n\r\n\r\nSupport\r\n--------------------------------------\r\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at support@lottery.co.uk.",
  "summary": "UK lottery results for Lotto, EuroMillions, Thunderball, Set For Life &amp; HotPicks",
  "installs": "100,000+",
  "score": 4.5441175,
  "ratings": 1399,
  "reviews": 496,
  "price": 0,
  "developer": "The Lottery Company Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Oct 29, 2012",
  "updated": 1580910402000,
  "version": "Results 2.0.4 (325)",
  "recentChanges": "This version includes bug fixes and performance improvements.",
  "appId": "uk.co.lottery.multiapp",
  "searchTerms": "lottery"
 },
 {
  "title": "🇬🇧 UK Lotto & Euromillions & 49s Results",
  "description": "NEW:\r\n49's Lunchtime and Teatime Results! \r\n\r\nTired of waiting for Lotto Results? Get notified as soon as the latest results are available! \r\n\r\nWe support the following UK Lottery games in one handy app:\r\n\r\n★ Lotto & Lotto HotPicks Results\r\n★ EuroMillions, Euro HotPicks & Millionaire Raffle Results\r\n★ Set For Life Results\r\n★ Thunderball Results\r\n★ The Health Lottery Results\r\n★ 49s Lunch & Tea results\r\n\r\nMAIN FEATURES:\r\n\r\n✔ Latest and past draw results for all games, including a full prize breakdown!\r\n✔ Save your Numbers - Have them checked automatically every time there's a new draw.\r\n✔ Statistics - See you how many times each number has been drawn as well as which ones are overdue. \r\n✔ Notifications -  We'll notify you when the latest results are available\r\n✔ Number Generator - Get numbers instantly chosen for you.\r\n✔ Works Offline - You can access downloaded results even when a connection isn't available.\r\n\r\nDownloaded over 200,000 times with a rating of 4.6/5\r\n - Discover why this is the best way to check your Lottery ticket!\r\n\r\n\r\nPlease note:\r\n\r\n- This app does not allow you to purchase lottery tickets or place bets and is for informational purposes only.\r\n\r\n- You must be over 16 in order to play National Lottery games. http://www.gambleaware.co.uk/\r\n\r\n\r\nDisclaimer: Please check your ticket at an official outlet before discarding. We cannot guarantee the accuracy of the results provided. Errors or omissions may occur.",
  "summary": "UK Lotto, Euromillions, 49s Lunch &amp; Teatime &amp; Health Lottery Results",
  "installs": "100,000+",
  "score": 4.432,
  "ratings": 3774,
  "reviews": 1217,
  "price": 0,
  "IAPRange": "£0.99 - £9.99 per item",
  "developer": "SLICE Digital",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Sep 14, 2012",
  "updated": 1575074850000,
  "version": "3.8.4",
  "recentChanges": "Bug Fixes",
  "appId": "ie.slice.mylottouk",
  "searchTerms": "lottery"
 },
 {
  "title": "Lucky Lottery Scratchers",
  "description": "Lucky Lottery Scratchers is the most realistic and authentic scratch-off lottery ticket game on Google Play!\r\n\r\nIf you like instant win scratch-off tickets, you will love Lucky Lottery Scratchers!\r\n\r\nThere are many types of scratch-off games and scratcher cards to play including \"Double Dollar,\" \"Money Rain,\" \"Lucky 777,\" \"Diamond Millions,\" and more!\r\n\r\nUse your finger to \"scratch\" card surface to match winning numbers to your numbers, or to reveal bonus multipliers.\r\n\r\nGame types include special Bingo cards and also bonus games.\r\n\r\nFree hourly and daily bonus credits are awarded just for playing!\r\n\r\nOur VIP program provides rewards to the best players.\r\n\r\nNo Internet connection is required to play -- offline play is supported!\r\n\r\nThere are hundreds of game levels to play and Lucky Lottery Scratchers is designed to work with phones and tablets.\r\n\r\nDownload Lucky Lottery Scratchers today and let us know what you think by leaving a review!\r\n\r\n\r\nPlease Note:\r\nLucky Lottery Scratchers is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes.  Practice or success at social casino gaming does not imply future success at real money gambling.  Lucky Lottery Scratchers is for entertainment purposes only and offers only a simulated gambling experience.",
  "summary": "The Best and most realistic Instant-Win Scratch-Off Lottery Ticket Game",
  "installs": "50,000+",
  "score": 4.6216216,
  "ratings": 2630,
  "reviews": 836,
  "price": 0,
  "IAPRange": "£0.89 - £189.99 per item",
  "developer": "41 Games",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Nov 8, 2019",
  "updated": 1573171648000,
  "version": "1.0.2",
  "recentChanges": "Introducting Lucky Lottery Scratchers!",
  "appId": "com.FortyOneGames.Scratchers",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery and Lotto Games by Lottoland",
  "description": "Bet on lottery and win real cash with Lottoland, the lotto betting app featuring the best lottery jackpots including US Powerball, Irish Lotto and Thunderball. Bet on EuroJackpot and MegaMillions for your chance to become a millionaire! Check the latest lotto draw results every week and find out if you’ve hit the lucky lotto numbers! \r\n\r\nOur new lotto widget allows you to bet on international lottery draws such as Keno and SuperEnalotto at your fingertips. Bet quicker than ever using the pre-set QuickPick buttons. Get fast and accurate raffle results and be the first to know if your lotto lines hit the jackpot! \r\n\r\nPrizes await! Play scratchcards and win real money. Our great variety of games includes the best Blackjack, Slots, Texas Hold’em online poker, French roulette games and more! \r\n\r\nDownload the Lottoland lotto betting app today!",
  "summary": "Real Cash Lottery Draws &amp; Results – Irish Lotto, EuroJackpot &amp; more",
  "installs": "100,000+",
  "score": 4.33,
  "ratings": 922,
  "reviews": 411,
  "price": 0,
  "developer": "EU Lotto Ltd",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Aug 2, 2017",
  "updated": 1587370689000,
  "version": "Varies with device",
  "recentChanges": "We regularly update our app to make your Lottoland experience better, faster and more fun. If you have any suggestions about our latest update, please do get in touch via email at support@lottoland.co.uk",
  "appId": "co.uk.lottoland.app",
  "searchTerms": "lottery"
 },
 {
  "title": "🇮🇪 Irish Lottery Results (Lotto Ireland)",
  "description": "My Lotto Ireland has the latest results, a number checker, number generator & statistics for all the major Irish Lottery games in one handy app:\r\n\r\n- Lotto, Lotto Plus 1, Lotto Plus 2 & Lotto Raffle\r\n- EuroMillion & EuroMillions Plus\r\n- Daily Million & Daily Million Plus\r\n\r\nDownloaded over 250,000 times with a rating of 4.5/5 - Discover why this is the best way to check your Lottery ticket!\r\n\r\nMAIN FEATURES\r\n\r\n★ DRAW RESULTS - Latest and past draw results for all games including a full prize breakdown so you always know how much you've won.\r\n\r\n★ SAVE LINES - Save your numbers so that you can check them quickly and easily after a draw - leave your tickets at home and check on the go! You can also save lines with 1-5 numbers which is handy if you bet on the results. Save up to 50 lines at once with the PRO version of this app! (very handy if you run a lotto syndicate). You can choose if you want to include Plus draws or not.\r\n\r\n★ STATISTICS - Ever wonder what numbers appear the most? Or which numbers haven't appeared in a long time? Now you can find out with our statistics for each game that shows you how many times each number has been drawn as well as which ones are overdue. \r\n\r\n★ NOTIFICATIONS - Select which games you play from the Settings menu and we'll notify you when the latest results are available and let you know what the next Jackpot is. This feature requires an internet connection. Of course, if you don't want notifications you can simply turn them off and check whenever is convenient for you!\r\n\r\n★ JACKPOT DETAILS - You'll always know how much the next Jackpot is for each game. Swipe left on the feature graphic on the home screen to see the details for each game.\r\n\r\n★ NUMBER GENERATOR - Struggling to pick your own numbers? Let the handy number generator do the hard work for you. It generates up to 5 lines of completely random numbers for the game of your choice, which you can then save if you like.\r\n\r\n★ WORKS OFFLINE - Results are stored on your device, so you'll have access to them even when a connection isn't available.\r\n\r\nUpgrade to PRO and benefit from the following:\r\n\r\n- No Ads! (Free version is Ad supported)\r\n- Browse all previous draw results (Free version is limited to 30 draws)\r\n- Save up to 50 lines (Free version is limited to 5 lines)\r\n\r\nBy upgrading to PRO you will help to support this app and keep it improving and up to date.\r\n\r\nIf you have enjoyed using this app please give it a good rating!  :)\r\n\r\n------------------------------------------------------------\r\nWant to be the first to know of future updates? Join Us on:\r\n\r\nFacebook: https://www.facebook.com/MyLottoIreland\r\nTwitter: https://twitter.com/MyLottoApp\r\nWebsite: http://www.mylottoapp.net/ireland/\r\n------------------------------------------------------------\r\nDisclaimer: Please check your ticket at an official outlet before discarding\r\n\r\nPlease note that this app does not officially support \"small\" screen devices or versions of Android prior to 6.0\r\nYou must be over 18 in order to play National Lottery Ireland games",
  "summary": "Join the fun! Irish Lottery Results direct to your mobile",
  "installs": "100,000+",
  "score": 4.4075146,
  "ratings": 3511,
  "reviews": 996,
  "price": 0,
  "IAPRange": "£0.79 - £4.99 per item",
  "developer": "SLICE Digital",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Apr 13, 2012",
  "updated": 1576845011000,
  "version": "3.7.2",
  "recentChanges": "Bug Fixes",
  "appId": "ie.slice.mylottoireland",
  "searchTerms": "lottery"
 },
 {
  "title": "Lotto Lens: Scan National Lottery Tickets",
  "description": "Simply scan your Lotto, EuroMillions, Thunderball, Set For Life and HotPicks tickets to find out instantly if you’ve won a prize. Lotto Lens will tell you how many numbers you matched and how much money you’ve won. It also checks those pesky Raffle numbers for you.\r\n\r\nThe best bit? You can scan your tickets as soon as you purchase them and Lotto Lens will check the ticket automatically once the draw has taken place and send you an alert if you’ve won a prize. Never worry about forgetting to check your ticket again!\r\n\r\nIf you manage a syndicate, Lotto Lens will help you keep track of who's paid and help you remind those who haven't. A Widget is also included showing the latest lottery results at a glance. You can also receive the latest results in a push notification.\r\n\r\nLotto Lens is fast, fun and incredibly useful. You can trial the app by scanning 3 tickets for free; a small one-time in-app purchase is required to scan an unlimited number of tickets.\r\n\r\nA note on privacy: your ticket details never leave your device and we don't have any visibility of whether you win or lose. We require internet access to download results and prizes, but your information never leaves your device.\r\n\r\nLotto Lens is not associated with The National Lottery or Camelot UK Lotteries Limited. You should claim any prizes from your National Lottery retailer as normal (so keep your tickets in a safe place after scanning them because you still need them to claim!). It is your responsibility to check your tickets before discarding them.",
  "summary": "Lotto and EuroMillions ticket scanner - find out instantly how much you&#39;ve won!",
  "installs": "50,000+",
  "score": 4.13,
  "ratings": 254,
  "reviews": 159,
  "price": 0,
  "IAPRange": "£4.99 per item",
  "developer": "JohnMackay",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Sep 16, 2017",
  "updated": 1566923817000,
  "version": "4.4.0",
  "recentChanges": "Thanks for using Lotto Lens! This update changes the way you add your Syndicate tickets. Pull to refresh will now download the latest results and check your tickets. To add future tickets for Syndicates, simply tap and hold on the Scan Ticket button. Good luck when scanning your tickets!",
  "appId": "com.johnmackay.lottolens",
  "searchTerms": "lottery"
 },
 {
  "title": "Private Lottery Machine",
  "description": "It is the first lottery random numbers generator based on physical emulation.\r\n\r\nMake your own draw at your phone or tablet and get total random numbers. You can shake balls by shaking your device or by touching screen with your finger. \r\n\r\nNow you can define your own lottery rules!\r\n\r\nIt works with lotteries like:\r\n* $100,000 Cash Game\r\n* 2by2\r\n* Badger 5\r\n* Bonus Match 5\r\n* California SuperLotto Plus\r\n* CA$H4\r\n* Cash 5\r\n* Cash Winfall\r\n* Decades of Dollars\r\n* Dakota Cash\r\n* DC Daily 6\r\n* Double Play Daily\r\n* El Gordo de la Promotiva\r\n* Euro Millons\r\n* EuroJackpot\r\n* EZ2 Lotto\r\n* Fantasy 5\r\n* Florida Lotto\r\n* Florida Mega Money\r\n* Grand Lotto\r\n* Health Lottery\r\n* Hit 5\r\n* Hot Lotto\r\n* Joker\r\n* Kaskada\r\n* Keno!\r\n* La Primitiva Lotto\r\n* Little Lotto\r\n* Loto\r\n* Lotto Texas\r\n* Lotto Max\r\n* Lucky4Life\r\n* Lucky 5\r\n* Mass Cash\r\n* Match 6\r\n* Megalotto\r\n* Megaucks Doubler\r\n* Mega Millions\r\n* Mini Lotto\r\n* Mix & Match\r\n* Montana Cash\r\n* Multi Multi\r\n* Multi-Match\r\n* Multi-Win\r\n* New York Sweet Million\r\n* Oz Lotto\r\n* Quick Draw\r\n* Pick 10\r\n* Powerball\r\n* Roadrunner Cash\r\n* Rolling Cash 5\r\n* Show Me Cash\r\n* SuperCash!\r\n* SuperEnalotto\r\n* Super Lotto\r\n* Take 5\r\n* Texas Two Step\r\n* Texas Cash Five\r\n* Tri-State Megabucks\r\n* Tri-State Megabucks Plus\r\n* Thunderball\r\n* Tresure Hunt\r\n* Viking Lotto\r\n* Weekly Grand\r\n* Wild Money\r\n* Win For Life\r\n\r\nPowered by LibGDX and Box2D engines.   \r\n\r\nTags:raffle, lottery shaker, shake, rand, picker, lucky dip, pick numbers, quick pick, easy pick, random number generator, mobilotto, mobi, lotto simulator, real physics, Box2d, lucky number generator.",
  "summary": "Physics based lottery emulator",
  "installs": "100,000+",
  "score": 4.291498,
  "ratings": 2810,
  "reviews": 1002,
  "price": 0,
  "developer": "Jezaraf",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Aug 30, 2011",
  "updated": 1552326419000,
  "version": "1.8",
  "recentChanges": "bug fix",
  "appId": "jezaraf.machine",
  "searchTerms": "lottery"
 },
 {
  "title": "Results for Euromillions",
  "description": "Do you play Euromillions ? This application is your ideal partner ! It provides a myriad of features, such as the latest Euromillions draw results or the automatic calculation of your winnings.\r\n\r\nTo do so, nothing simpler. You just have to save your lottery grids into the application. As soon as new results are available, update the application and discover your Euromillions winnings ! \r\n\r\nYou can check :\r\n-The next jackpot at stake\r\n-The detailed results of Tuesday and Friday draws\r\n-Specific codes\r\n-The last three months draws\r\n\r\nManage your tickets :\r\n-Save your playing lottery tickets into the application\r\n-Manage your subscriptions\r\n-Predictive text input\r\n \r\nYou can be notified :\r\n-When jackpot exceeds an amount that you set\r\n-When your subscription comes to an end\r\n-When new draw results are available\r\n\r\nThe application does not allow to play Euromillions lottery.\r\n\r\nDisclaimer :\r\n-Always check your tickets with the official organization in order to confirm your winnings.\r\n-Descriptions and names are the property of their respective owners",
  "summary": "The ideal tool for Euromillions players : results, winnings,…",
  "installs": "500,000+",
  "score": 4.460285,
  "ratings": 9848,
  "reviews": 3068,
  "price": 0,
  "developer": "Maxmalo Mobile App",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Mar 17, 2016",
  "updated": 1587501964000,
  "version": "3.2",
  "recentChanges": "- Statistics<br>- Probabilities",
  "appId": "com.maxmalo.euromillions",
  "searchTerms": "lottery"
 },
 {
  "title": "Lucky Night - Free Lottery Games, Real Rewards",
  "description": "Play your way to a lucky night. \r\n\r\nLucky Night is a free mobile gaming app that allows users to win rewards and prizes, no purchase is necessary.\r\n\r\nLucky Night is the best way to try your luck and collect rewards by playing all your favorite games. \r\n\r\nLucky Night is 100% free with no deposits or purchases required to play or win.\r\n\r\nSo, let loose with the hottest scratchers, lottos, raffles, mini games, daily challenges, and more. There's always a way to win prizes, rank up on the leaderboard, or entertain yourself with amusing games & goodies. \r\n\r\nHere's what you can do with Lucky Night:\r\n✔ Play 100% free scratchers with instant rewards \r\n✔ Pick your lucky lotto numbers every day\r\n✔ Enter raffles daily, weekly, and monthly for the chance to win big cash prizes\r\n✔ Exchange your Lucky Night Tokens for gift cards to your favorite brands & merchants (like Amazon, Target, Walmart, and more)\r\n\r\nYou can't win if you don't play. So, what are you waiting for? Download Lucky Night and get ready for more winning moments. We win when you win.\r\n\r\nRemember:\r\n- Nothing in the app costs real money. No purchases are necessary. It's 100% free to play. That means no micro transactions.\r\n- The sweepstakes are non-gambling promotions for entertainment. They're only intended for adult audiences.\r\n- Our game is fun to play, but it doesn't imply future success with \"real money gambling\".\r\n- The brands represented aren't sponsors of the rewards or affiliated with the companies.\r\n\r\n*Google Inc. does not sponsor, nor is any way affiliated with Lucky Night and/or the sweepstakes prizes.",
  "summary": "Try your luck to win rewards with 100% free scratch card games on Lucky Night!",
  "installs": "1,000,000+",
  "score": 4.280313,
  "ratings": 15526,
  "reviews": 5964,
  "price": 0,
  "developer": "Lucky Games Studio",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Dec 5, 2019",
  "updated": 1587579156000,
  "version": "1.5.4",
  "recentChanges": "Welcome to Lucky Night! To improve our app for you, we bring updates to Google Play regularly.<br>- Try your luck with daily scratchers <br>- Enjoy playing for free daily",
  "appId": "com.luckynight.app",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Generator & Statistics",
  "description": "This is one of the best Lotto generator application from the market. It is very customizable.\r\nApplication uses a special algorithm using statistics of games around the world, to generate special numbers for each draw. Statistics can be selected to generate numbers in a specific range.\r\nThis lottery application allows you to generate numbers for different lottery games around the world and you can save your own game if is not in the list.\r\nIt has the popular games like US Power Ball, Mega Millions Pick 3, Pick 4, and more\r\nIt has the feature to let you save your Favorite numbers and Excluded numbers in the option menu.\r\nYou can Share your numbers with somebody else when you hit the button Share (with the envelope on it).\r\nEvery time you generate numbers it will save the numbers in a history and save the numbers with date for future use.        \r\nYou can delete the draws from history that you don't want one by one or all.\r\nIn the menu is an Option button where you can add the Favorite numbers and Excluded numbers or to delete all history.\r\nYou can save your games. When you rename a game will become the first in the list.\r\nAdd the History option where you can see the previous generated numbers.\r\nIn help is an explanation of all buttons in the application without a name.\r\nAdd Statistics of game played and the official games from all around the world.\r\nSave to Favorites (played) games. \r\nImproved interface\r\nAvailable languages:         \r\nБългарски        中国简化        Čeština        Deutsch        Ελληνικά        English\r\n        Español        Français        हिन्दी        Italiano        日本語        한국어        Magyar        Polski\r\n        Português        Română        Русский        Türkçe        Tiếng Việt         Українська\r\nIf you have any questions or suggestions please send it to me.",
  "summary": "Best lottery application to generate numbers and check statistics of games.",
  "installs": "100,000+",
  "score": 4.2786884,
  "ratings": 1851,
  "reviews": 734,
  "price": 0,
  "IAPRange": "£0.89 - £299.99 per item",
  "developer": "GEORGE",
  "genre": "News & Magazines",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Feb 22, 2013",
  "updated": 1582733124000,
  "version": "3.2.103o",
  "recentChanges": "Add translation. Fix bugs.",
  "appId": "com.logan19gp.loterry_generator.free",
  "searchTerms": "lottery"
 },
 {
  "title": "UK Lottery Live",
  "description": "~Always Good Luck\r\n~Now With Immediate Live Result\r\n~Best view in Mobile and Tablet\r\n\r\nWe cover the following lottories in UK.\r\n\r\n+ Lotto\r\n+ EuroMillions  \r\n+ Thunderball\r\n+ Lotto HotPicks\r\n+ Health Lottery\r\n \r\n+ Free Small & lightweight\r\n+ Fastest results\r\n+ Jackpot Accumulated Prize As per Vendor website\r\n+ Past results\r\n+ Beautiful design and User friendly for reading",
  "summary": "UK Lottery app, provide the Immediate Live fatest result of major UK lotteries.",
  "installs": "50,000+",
  "score": 4.21,
  "ratings": 163,
  "reviews": 55,
  "price": 0,
  "developer": "whoseapps.com",
  "genre": "Lifestyle",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 6, 2017",
  "updated": 1585720913000,
  "version": "Varies with device",
  "recentChanges": "Upgrade to Android 10.",
  "appId": "net.my4d.uk_lottery",
  "searchTerms": "lottery"
 },
 {
  "title": "Lotto Scratch – Las Vegas",
  "description": "No.1 Free lottery scratch tickets app by Las Vegas casino.\r\nTons of scratch offs you can scratching.\r\n\r\nInclude:\r\nCrossword scratch ticket, Mahjong scratch-offs, Blackjack scratcher, Super Slots and 777, Cashword, 10X scratch off, Wild Cherry scratchcard, Gold Rush scratchcard, 3X big cash lotto scratch cards and more.\r\n\r\nIf you like instant lottery(instant games), you’ll definitely like this scratch-its game. \r\n\r\nMore update lottery tickets: \r\n1. Crossword\r\n2. Loteria\r\n3. Pinball \r\n4. BlackJack 21\r\n5. Bingo\r\n6. Hold'em Poker\r\n\r\nand more other lottery scratch cards like Homerun scratch-off, Bonus Hearts, Mother's Day scratchies, and Dragon Boat Festivel lottery ticket...etc.\r\n\r\nMore scratchers will be release soon. Try your luck today with Bunny Scratch!!\r\n\r\nOnly for entertainment purpose and could not win real money from this game.\r\n\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Las Vegas Lotto Scratchers.<br>Best national lottery scratch cards game ever.",
  "installs": "1,000,000+",
  "score": 4.6806765,
  "ratings": 81303,
  "reviews": 20796,
  "price": 0,
  "IAPRange": "£0.79 - £184.99 per item",
  "developer": "Lotto Scratch Powerball",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "May 31, 2015",
  "updated": 1579370555000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.bunny_scratch.las_vegas",
  "searchTerms": "lottery"
 },
 {
  "title": "Lucky Day - Win Real Money",
  "description": "Lucky Day is a 100% Free Sweepstakes App! \r\n\r\nLucky Day is a free mobile gaming app that allows users to win money and prizes, no purchase is necessary.\r\n\r\nLucky Day offers free scratcher, lotto, and raffle games for a chance to win real money and rewards. With daily opportunities to win up to $100,000 in cash instantly, earn rewards, or enter raffles! \r\n\r\nLucky Day is a free lifestyle experience on your mobile device. We change lives daily by offering hundreds of games for our players to scratch and have a chance to win real money instantly.\r\n\r\nPlay your free daily lotto and scratch cards for a chance to win real money and prizes. New scratch cards are available daily for your chance to win up to $10,000 instantly. You can also enter sweepstakes contests, raffle giveaways, and the daily lotto. \r\n\r\nOur mission is to give everyone a free chance to have a Lucky Day because we believe you shouldn’t have to risk losing for the chance to win! \r\n\r\nLucky Day is 100% free to download and play with no in-app purchases or deposits. \r\n\r\nLucky Day Features: \r\n\r\nWIN REAL MONEY\r\n✔ Win the jackpot prize of $100,000 by entering the daily lotto!\r\n✔ Win up to $10,000 by matching 3 winning symbols on the instant win scratch cards!\r\n\r\nEARN REWARDS \r\n✔ Earn gift cards from top brands including Amazon, Walmart, Dunkin Donuts, Target, etc.\r\n✔ Enter cool raffle giveaways to win HUGE prizes! \r\n\r\nENJOY PLAYING DAILY\r\n✔ Enter the daily lotto and reveal the results at 7 pm PT for your chance to win!  \r\n✔ New scratch cards daily at 12 am PT.  \r\n✔ Bonus scratch cards daily at 10 am PT and 6 pm PT.  \r\n✔ Play Lucky Day for 5 minutes a day to test your luck and get lucky.  \r\n\r\nOver $5 Million in cash and rewards have been awarded to Lucky Day players, and we have 30,000 new winners every week! Lucky Day brings you free scratchers, lotto, and raffle games for a chance to win cash and prizes. With thousands of real winners daily, you could be next!\r\n\r\nCongratulations to some of our recent winners:\r\n♥ Christopher E. from Albuquerque, NM who won the $1,000 Raffle in December 2018\r\n♥ Luis V. from Waterbury, CT who won the $1,250 Lucky Night Scratcher in January 2019\r\n♥ Jayda P. from Atlanta, GA who won the $400 Raffle in January 2019\r\n\r\nDownload Lucky Day and see if today is your lucky day!\r\n\r\nFor all the latest news and exclusive winning opportunities, make sure to Like and Follow Lucky Day on social media!\r\nFacebook: @luckydayapp\r\nInstagram: @luckydayapp\r\nTwitter: @luckydayapp\r\nFor feature requests or feedback, please send us an email to support@luckydayapp.com. \r\n\r\nThese sweepstakes are devised as non-gambling promotions and are intended solely for entertainment purposes. \r\n\r\n*Google Inc. does not sponsor, nor is any way affiliated with Lucky Day and/or the sweepstakes prizes.",
  "summary": "Win money &amp; prizes with your free daily lotto and scratch cards on Lucky Day!",
  "installs": "10,000,000+",
  "score": 4.3792768,
  "ratings": 923696,
  "reviews": 384851,
  "price": 0,
  "developer": "Lucky Day Entertainment, Inc.",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 30, 2015",
  "updated": 1588705384000,
  "version": "6.8.2",
  "recentChanges": "Thanks for playing Lucky Day! To improve our app for you, we bring updates to Google Play regularly.<br>- Improved User Experience <br>- Performance Improvements <br>- Bug Fixes",
  "appId": "com.luckyday.app",
  "searchTerms": "lottery"
 },
 {
  "title": "scratch lottery-online lottery-scratch lotto-lotto",
  "description": "【Real Excited Scratchers Experience】 \r\nLots of free slot games and Scratch lottery games. Authentic vegas casino feel. lots of free lottery game coins and exciting lottery bonus. \r\nWelcome to the exciting and free scratch lottery tickerts! have ever wish you won the lottery jacket? Well it's the time! \r\nfeel the excitement as playing real scratchers. \r\nDownload and sign in scratch lottery app,free lottery game coins to collect.\r\n\r\n【Scratchers】\r\n● Caribbeankitty,classic casino slot game.\r\n● Lucky draw,free slot game to collect lottery game coins,once per chance.\r\n● Treasure Chest.interesting scratch lottery game.guess which Chest has a prize.\r\n● Jackpot 777,real casino slot game,very fascinating.\r\n● Cash,easy scratch lottery game.\r\n● Millionaire，classic casino slot game.\r\n● Christmas 777,Christmas version of slot machine,very interesting.\r\n● Lucky 5，interesting scratch lottery game.each game has 20 chances to win.\r\n● Magic Stone，surrounded by dazzling gems, looking for bonuses in gems.\r\n\r\n【Other features】\r\n● Easy to win big!\r\n● Real scratch off tickets experience! \r\n● If you win, you could BET to get DOUBLE prize! \r\n● Get reward $10 when invite friends play.\r\n● Paly more,return more.\r\nDOWNLOAD AND SPIN RIGHT NOW! DON’T MISS YOUR HUGE WINS!!!\r\nTHE BEST SLOTS & CASINO GAMES\r\nVegas at your fingertips! With incredible graphics and some of the coolest twists, our slots offer a unique experience! From nostalgic classics to modern originals, our slot games are guaranteed to provide you with loads of fun! It’s not just slots we offer, either! Check out other card games for even more chances to become a Billionaire!\r\nThis vegas casino slot games and scratch lottery app is intended for adult use - by those 18 or older – and for amusement purposes only.\r\n\r\nScratch lottery game is just for fun,alse bring you some lucky surprise.\r\nOur games are for entertainment only. All points in the game stay in the game and all game points have no cash value. Although in-game currency can be purchased for real money or won during gameplay, none of the items in the game have any cash value. Our games are intended for adult audiences only.\r\nIf you have any scratches games problem,contact us:shuangmianshen@gmail.com\r\nour app is scratch lottery tickets and scratch lottery ticket scanner games.if you like scratch lotto tickets or scratch lotto mania app.our lotto  machine give you scratch lottery tickets win real money feeling.like scratch logo quiz game,our app with scratch lotto australia .",
  "summary": "free Scratch Lottery and online scratch lottery and Scratch Lottery tickets",
  "installs": "10,000+",
  "score": 4.67,
  "ratings": 178,
  "reviews": 76,
  "price": 0,
  "IAPRange": "£4.69 - £299.99 per item",
  "developer": "Lucky Game Company",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jan 8, 2019",
  "updated": 1583838817000,
  "version": "4.0.0.4",
  "recentChanges": "scratch lottery: repair login bug.",
  "appId": "chance.program.liumin.scratchlottery",
  "searchTerms": "lottery"
 },
 {
  "title": "Scratch Tickets - Super Lottery",
  "description": "Welcome to Scratch off Tickets - Lotto Scratchers! Prepare your lucky fingers!\r\n\r\nTry your luck and win in the most realistic online loteria scratch off card game!\r\nBuy a ticket and start scratching. It's so fun and easy.\r\n...and do you know what is the biggest deal ? It is 100% free to play so you don't have to spend real money! Just scratch it and win huge!\r\n\r\n\r\nHOW TO PLAY \r\n1. Swipe right to show list of scratchers\r\n2. Click \"buy ticket\" (for virtual in-game currency)\r\n3. Pick a card and scratch it to show if you are instant winner\r\n\r\n\r\nFeatures\r\n• 10+ unique & beautiful lottery scratch off themes\r\n• The most realistic scratching effect\r\n• Get a free loteria ticket every day as a bonus\r\n• Super Scratch - Lotto Tickets game is completely free and you won't spend a single dollar\r\n• Analytics at the back of the scratching card to track your game progress\r\n• Fun and stress free game to play anywhere / anytime\r\n\r\nList of scratchcards:\r\n• Happy money - Florida Lottery scratch-off type\r\n• Poker - Texas Lottery style\r\n• Wanted - cash reward\r\n• Hockey match - Ontario, Canada type\r\n• Eldorado - Aztec pyramid raspar\r\n• Devil's numbers - California Scratchers simulation\r\n• \"Lucky slots\" 777 - Michigan Lotto type\r\n• Homerun Baseball league - sport scratchoff\r\n• Cash vault - Colorado Lottery style\r\n• BIG money - scratch it & win big\r\n• Valentine Lottery - do you have \"love\" luck?\r\n• Coffee pause - reward loteria ticket\r\n\r\n- Scratch it now!\r\n\r\n\r\nSo what are you waiting for? Start scratching tickets now!\r\nGOOD LUCK!\r\n\r\nNOTE\r\n\r\nScratch Tickets - Super Lotto is intended for an adult audience & for entertainment purposes only. Success in this game does not imply future success in real world lotto cash gambling. This game has only virtual online money currency and scratchers which cannot be cashed out or redeemed for real money.",
  "summary": "Lucky day? Get real scratch off lotto ticket experience. Just scratch it &amp; win!",
  "installs": "50,000+",
  "score": 4.086093,
  "ratings": 1515,
  "reviews": 649,
  "price": 0,
  "IAPRange": "£1.69 - £41.49 per item",
  "developer": "VIVUGA GAMES",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Dec 5, 2019",
  "updated": 1583326625000,
  "version": "1.1.6",
  "recentChanges": "We&#39;ve added spanish language and did some optimizations. Happy scratching!",
  "appId": "com.vivuga.scratchtickets",
  "searchTerms": "lottery"
 },
 {
  "title": "Bravospeed: The Free $5,5 Million Lottery",
  "description": "Win up to $5,5 Million in cash with our ad-funded lottery.\r\nPlay grids for free, watch the draw live and win the Jackpot – or one of many prizes!\r\n\r\nFrom the creators of Bravoloto (boasting 9 million players and $1,000,000 in cash paid out), Bravospeed invites you to step up a gear!\r\n• At least 1 draw every 3 minutes, 32 every hour and 768 every day!!!\r\n• 4 Jackpot tiers from $5,500, $55,000 and $550,000 to $5,5 Million\r\n• 100s of free grids every day (YES! Hundreds!)   \r\n• 19 winning tiers and 1/3 odds of winning a prize with each grid played! \r\n• Dozens of prizes in cash, gift cards and points to redeem in our store full of attractive offers! \r\n\r\n=> More than ever before, fortune is at your fingertips! \r\n\r\nThe Bravospeed app is supervised by the bailiff’s office and is for over-18s only. The randomness of the draw has been certified by an independent evaluation company.",
  "summary": "A Jackpot of $5,5 Million in CASH, with draws every 3 minutes!",
  "installs": "100,000+",
  "score": 3.9908535,
  "ratings": 3340,
  "reviews": 1051,
  "price": 0,
  "developer": "Marketluck",
  "genre": "Casual",
  "contentRating": "PEGI 3",
  "released": "Dec 12, 2019",
  "updated": 1589276375000,
  "version": "1.27.11",
  "recentChanges": "Check out our contests: they’re free and give you a chance to win some pretty amazing prizes! Head to the game menu to participate!",
  "appId": "com.marketluck.bravospeed",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Machine UK",
  "description": "Lottery machine simulator to draw random numbers for UK lottery using physic. Best lottery number generator for UK lotto or lottery. \r\n\r\n❖EUROMILLIONS\r\n❖LOTTO/LOTTO HOTPICKS\r\n❖THUNDERBALL\r\n❖HEALTH LOTTERY\r\n❖LUNCH TIME/TEA TIME 49",
  "summary": "Lottery machine simulator to draw random numbers for UK lottery using physic.",
  "installs": "10,000+",
  "score": 4.35,
  "ratings": 133,
  "reviews": 70,
  "price": 0,
  "developer": "Nature Droid",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Sep 16, 2017",
  "updated": 1589022636000,
  "version": "1.0.0",
  "recentChanges": "Most complete UK lottery machine! Download this app today!<br>Rate 🌟🌟🌟🌟🌟 if you like this app! Thanks &amp; Stay Blessed.",
  "appId": "com.naturedroid.lottomachineuk",
  "searchTerms": "lottery"
 },
 {
  "title": "Powerball lottery results and statistics",
  "description": "This application is very customizable. It allows to set statistics options when you generate lucky numbers.\r\nYou can check the results in the app when you set the numbers you played.\r\nApplication uses a special algorithm using statistics of games, to generate special numbers for each lottery draw (results).\r\nThis lottery application allows you to generate numbers for different lottery games around the world and you can save your own game if is not in the list.\r\nIt has the popular games like US Power Ball, Mega Millions, and from many countries around the world with results updated after each game.\r\nIt has the feature to let you save your Favorite numbers and Excluded numbers.\r\nYou can Share your numbers with somebody else when you hit the button Share (with the envelope on it).\r\nEvery time you generate numbers it will save the numbers in a history and save the numbers with date for future use.\r\nYou can delete the draws from history that you don't want one by one or all.\r\nIn the menu is an Option button where you can add the Favorite numbers and Excluded numbers or to delete all history.\r\nYou can save your games. When you rename a game will become the first in the list.\r\nAdd the History option where you can see the previous generated numbers.\r\nIn help is an explanation of all buttons in the application without a name.\r\nAdd Statistics of game played and the official games from all around the world.\r\nSave to Favorites (played) games.",
  "summary": "Generate Lottery number from your phone for your favorite games",
  "installs": "100,000+",
  "score": 4.344156,
  "ratings": 1553,
  "reviews": 634,
  "price": 0,
  "IAPRange": "£0.99 - £299.99 per item",
  "developer": "GEORGE",
  "genre": "Education",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 10, 2016",
  "updated": 1582732944000,
  "version": "1.4.103u",
  "recentChanges": "Add translation. Fix bugs.",
  "appId": "com.logan19gp.loto_usa_generate_stats_results",
  "searchTerms": "lottery"
 },
 {
  "title": "Health Lottery",
  "description": "Download the official Health Lottery Mobile app to play a variety of Health Lottery games on the go – AND support vital health-related charities across Great Britain!  \r\n\r\n· £100,000 FREE prize draw every Wednesday & Saturday.\r\n· £77,777 to be won instantly on scratch cards.\r\n· £25,000 jackpot draws every 3 minutes.\r\n· Over £150 Million won in prizes so far.\r\n· 20% of every play goes to health-related causes.\r\n· Over £112M given to charity, changing over 500,000 lives.\r\n· Register in seconds.\r\n· Play scratch cards from as little as 5p\r\n\r\n\r\nOur new app remembers your details, so you only need to log-in once and your wins will be automatically shown. You can also check the winning numbers in all of our five weekly charity lottery jackpot draws for tickets bought in retail.\r\n\r\nEasily set up a subscription to play lottery by Direct Debit so you never miss a draw and take advantage of all our latest promotions – whether that be free tickets, raffles, or cashback bonuses.\r\n\r\nTickets for our draws cost only £1 and our draws take place every Tuesday, Wednesday, Thursday, Friday and Saturday).  Each ticket you buy on Wednesday and Saturday draws earns you an automatic entry into our Free Prize Draw ehere you can win £100,000\r\n\r\nSince we launched in 2011, we’ve given away over £150 million in prizes to our players.\r\n\r\n \r\nQuickWin\r\nOur revolutionary QuickWin game runs a lottery draw every 3 minutes! You’re playing for a £25,000 jackpot in each draw. \r\n\r\nScratch Cards\r\nWe run a wondrous array of online Scratch Cards, each with their own odds and INSTANT jackpots up to £77,777!  You can play for as little as 5p.\r\n\r\nThe Health Lottery is not a national lottery.  We operate on behalf of 12 Community Interest Companies (CICs), managing 12 society lotteries in rotation.  Each is licensed by the Gambling Commission and represents multiple local authority areas across Great Britain – raising money for health-related good causes within their respective areas. Each month a different regional society takes a turn at participating in the draws so that every area in England, Scotland and Wales gets an appropriate share of the monies raised.  Since inception in 2011, over £113 million has been raised for good causes through The Health Lottery – which has supported nearly 3,000 projects.\r\n\r\nFor details of when each society lottery is running, see the location of each society, or to find out more about The Health Lottery, please click on the link below.  \r\nhttps://www.healthlottery.co.uk/about-us/\r\n \r\nTo improve the App, we collect anonymous information about browsing behavior.  For more information on our Privacy Policy, please visit our website at https://www.healthlottery.co.uk/privacy-policy/\r\n\r\nGames Rules and Procedures apply.  Players must be 16 or over and be physically located within Great Britain (England, Scotland, and Wales).\r\n \r\nWhat’s new in Version 1.1.4\r\n- General performance improvements and bug fixes\r\n- Payment gateway enhancements\r\n\r\nYou can follow us on:\r\n \r\nFacebook - https://www.facebook.com/healthlottery\r\nYouTube - https://www.youtube.com/user/HealthLottery\r\nTwitter - https://twitter.com/HealthLottery\r\nInstagram - https://www.imstagram.com/healthlottery\r\n\r\nThe Health Lottery are firm supporters of BeGambleAware and GamCare - the UK's leading providers of information and support for the prevention and treatment of problem gambling to  help protect players, and offer practical advice to promote happy, responsible play. We’re committed to ensuring Health Lottery participants play responsibly, we also encourage you to make sure your gaming is appropriate to your circumstances. For more information, please visit https://www.begambleaware.org/ or call Freephone 0808 8020 133",
  "summary": "Play a variety of Health Lottery games on the go",
  "installs": "10,000+",
  "score": 2.7313433,
  "ratings": 67,
  "reviews": 44,
  "price": 0,
  "developer": "Health Lottery",
  "genre": "Entertainment",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests",
  "released": "Aug 30, 2019",
  "updated": 1586447120000,
  "version": "1.1.4",
  "recentChanges": " - General performance improvements and bug fixes<br> - Payment Gateway Enhancements",
  "appId": "com.thehealthlottery",
  "searchTerms": "lottery"
 },
 {
  "title": "UK National Lottery",
  "description": "This is an application for viewing the UK National Lottery results.\r\n\r\nCurrent Features\r\n• Lotto results\r\n• Euro Million results\r\n• Lotto Hot Picks results\r\n• Thunderball results\r\n\r\n\r\nDo email me if you have any suggestions on how to make the app better  :)\r\n\r\n\r\nDisclaimer\r\n• The author of this app is not affiliated to http://www.national-lottery.co.uk/ and does not advocate excessive gambling/betting.\r\n• No warranty is given with regards to the accuracies or availability of the results as the app is fully dependent on the contents published at  http://www.national-lottery.co.uk/",
  "summary": "Simple app to check UK national lottery results",
  "installs": "10,000+",
  "score": 3.59375,
  "ratings": 64,
  "reviews": 7,
  "price": 0,
  "developer": "Wee Jim",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Nov 19, 2013",
  "updated": 1560074869000,
  "version": "1.4.6",
  "recentChanges": "1.4.6<br>• bug fixes for various lottery pages<br>• added Set For Life results<br><br>1.4.3<br>• updated link to privacy statement",
  "appId": "com.weejim.app.uklottery",
  "searchTerms": "lottery"
 },
 {
  "title": "UK Lottery result check",
  "description": "UK Lottery  results checker  support Lottery in UK \r\n\r\n UK Lotto   ( Millionaire Raffle 1 2 )\r\n EuroMillions  ( Millionaire Maker ) \r\n Health Lottery\r\n HotPicks\r\n ThunderBall\r\n UK 49's\r\n\r\nand Functions \r\n\r\n The latest lottery results\r\n Results History\r\n Check number\r\n Statistics\r\n Numbers Management \r\n\r\nThis is the best APP for the lottery fans to get the lottery information. It let you quickly and easily check the latest lottery results of UK Lotto, EuroMillions, Health Lottery, Hot Picks, ThunderBall and UK 49's. It's also provided with purchase management function and numbers select function. \r\n\r\nSo you must have this APP if you play lottery in UK !\r\n\r\n\r\n[Function List Descriptions]\r\n\r\n· The latest lottery automatic notification\r\n\r\nYou can set personal needs to accept the lottery automatic notification.\r\n\"Do you worry to forget the important date for check the winning numbers? If you subscribe the notice, after the lottery updates, notification will be sent to your cell phone, lest you forget the lottery.\"\r\n\r\n\r\n· The latest lottery results\r\n\r\nProvide the latest winning numbers and detailed information of UK Lotto, EuroMillions, Health Lottery, Hot Picks, ThunderBall and UK 49's. \r\nYou can check the latest winning numbers.\r\nThe APP information synchronously updates almost at the same time with the lottery terminals .\r\n\r\n\r\n· Results History \r\n\r\nIncluding the latest one, you can see the last 50 draw lottery winning numbers. \r\n( It's the best way to checking the correct numbers. )\r\n\r\n\r\n· Check number\r\n\r\n You can key-in the lottery numbers, the system can help you check the winning numbers information (in the last 50 draw). \r\n It quickly check your input numbers if they won the prize of which period.\r\n\r\n\r\n· Statistics\r\n\r\nTo view the common digital ranking from the past winning numbers. It contain:\r\n* Top number  - the most frequently occurring digital \r\n* Top Pairs  - the most frequently occurring pairs\r\n* Top Triplets - the most frequently occurring triplets \r\nTry to forecast the winning numbers in the future by this data. \r\nThis feature is only for UK Lotto, EuroMillions, Hot Picks and ThunderBall.\r\n\r\n\r\n· Numbers Management \r\n\r\nit can help you to see how many balls you have matched in the latest draw. You can effectively manage your lottery tickets.\r\nThis feature is only for UK Lotto, EuroMillions, Health Lottery, Hot Picks and ThunderBall.\r\n\r\n\r\n★ ★ corresponding lottery list\r\n UK Lotto, EuroMillions, Health Lottery, Hot Picks, ThunderBall, UK 49's\r\n\r\nWelcome to use this APP as a lottery management tool.\r\n\r\n( Notice : APP data is for reference only.  In the event of any dispute, the official websites shall prevail. )",
  "summary": "UK Results of  Lotto,EuroMillions,Health Lottery ,ThunderBall,HotPicks,49&#39;s",
  "installs": "10,000+",
  "score": 4.05,
  "ratings": 60,
  "reviews": 24,
  "price": 0,
  "developer": "AVAXN",
  "genre": "Finance",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Sep 25, 2016",
  "updated": 1478186808000,
  "version": "1.1.0",
  "recentChanges": "update idk",
  "appId": "com.hans.lotto.uk.nloot",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Machine",
  "description": "This application is the machine simulation used to draw the winning numbers for a lottery. It is transparent so the balls are visible throughout the entire process. And you can make your own draw.\r\nBesides the simple design, this random number generator is useful because of its 2D physics engine.\r\n\r\nNOTE: Technical problems may occur regarding to the specification of your mobile.\r\n\r\nPowered by JBox2D",
  "summary": "Best Lotto &amp; Lottery number picker",
  "installs": "100,000+",
  "score": 4.48,
  "ratings": 820,
  "reviews": 231,
  "price": 0,
  "developer": "KHTSXR",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Dec 5, 2016",
  "updated": 1585643154000,
  "version": "12.0",
  "appId": "oops.lottomachine",
  "searchTerms": "lottery"
 },
 {
  "title": "Las Vegas Scratch Ticket",
  "description": "This Las Vegas scratch-off game is suitable for passing time.\r\n\r\nYou will have REAL lottery scratch card experience.\r\n\r\nLots of lotto scratch-offs you can scratching with Las Vegas theme.\r\n\r\nAll the lottery tickets you can play for free. Include Crossword, Blackjack, Vegas slots, Cashword, Diamond 777 scratchers...\r\n\r\nIf you like to play instant lottery, DO NOT miss this game.\r\n\r\nOnly for entertainment purpose and could not win real money from this game.\r\n\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "This Las Vegas Scratch Card Game will bring you real lotto scratcher experience",
  "installs": "1,000,000+",
  "score": 4.545323,
  "ratings": 62403,
  "reviews": 14989,
  "price": 0,
  "IAPRange": "£0.89 - £184.99 per item",
  "developer": "SHOCKTECH",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Jun 15, 2014",
  "updated": 1574651534000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.shocktech.scratchfun_lasvegas",
  "searchTerms": "lottery"
 },
 {
  "title": "Lotto Draw Machine",
  "description": "It is the machine simulator used to draw the winning numbers for a lottery. \r\nIt is the random number picker with 2D physics engine.\r\nYou can make your own lottery rules. And you can add 5 phases.\r\nIt is easy to use.\r\n\r\nNOTE: Technical problems may occur regarding to the specification of your mobile.\r\nPowered by JBox2D",
  "summary": "Best Lotto mixer &amp; Lottery number generator",
  "installs": "500,000+",
  "score": 4.255319,
  "ratings": 2830,
  "reviews": 1017,
  "price": 0,
  "developer": "KHTSXR",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Mar 8, 2017",
  "updated": 1585899236000,
  "version": "5.0",
  "appId": "oops.lottomachine2",
  "searchTerms": "lottery"
 },
 {
  "title": "Lotto Number Generator",
  "description": "This program offers number generators for multi-country lotteries,\r\nincluding:\r\n\r\n\r\n[North America]\r\nUSA,\r\n\r\n\r\nCanada→Ontario, Quebec;\r\n\r\n\r\n[Europe]\r\nUnited Kindom, Germany, Spain, Italy, Ireland, France, EuroMillions and Eurojackpot;\r\n\r\n\r\n[Asia]\r\nRussia, Japan, China, Taiwan, India, Philippine;\r\n\r\n\r\n[Africa]\r\nCôte d\\'Ivoire(Ivory Coast), Ghana, Nigeria, South Africa;\r\n\r\n\r\n[Oceania]\r\nAustralia, New Zealand.\r\n\r\n\r\nWhen you are in the country mentioned above and want to buy some kind of lotteries, you can get specific lottery numbers by this program.\r\n\r\n\r\nAdditionally, you can check lotto winning numbers by lotto result looking up function, requesting lotto result pages from specific lotto websites.\r\n\r\n\r\nAccording to google play content policy 「Gambling: We don’t allow content or services that facilitate online gambling ...」, pages of lotto winning numbers this app offered - even though the lotto official web site - might be treated as 「online gambing site」, so some buttons(for looking up lotto results) do NOT directly link to lotto winning number pages. I am so sorry for the inconvenience. \r\n\r\n\r\n[Instructions]\r\n1.You can decide to generate lotto numbers or look up lotto results in the entrance.\r\n\r\n\r\n2.Lotto numbers generation:\r\n(1)First select the region of the lotto,then press the lotto button.\r\n(2)Pick your own numbers and exclude numbers (that you don't want them to be generated) in the bottom of \"Rotators Zone\". Self picked numbers and excluded numbers will not be generated by number generator. Notice: you don't have to exclude self picked numbers in the excluded numbers sections, the program will do it well.\r\n(3)Start Rotating: In the rotating zone, click the \"start rotating\" button, or press middle block (keep its background in yellow) then shake your device to rotate all balls (Please hold your device tightly while shaking). If there were no accelerometer included in your device, just use \"start rotating\" button. \r\n   Stop Rotating: Click \"Manual Stop\" button whenever you want to stop the next rotating ball(Manual), or click \"Auto Stop\" button to stop rotating balls in turn automatically.(Auto)\r\n   Loop Rotating: Slide the middle horizontal bar or input a number into the right field to decide how many times to rotate, then click the \"Start Loop\" button or press the middle block (keep its background in yellow) then shake your device, to rotate all balls then stop them in turn automatically. While auto \"rotate-then-stop\" goes on, you can press the \"Home\" button of the device to leave temporarily to do somthing else, then go back to this program to watch generated numbers statistics whenever you want. If you leave this \"Lotto Number Generator\" page by pressing the \"Back\" button of the device or some \"non-Home\" buttons else, the statistics will be cleared.\r\n(4)After all numbers have been generated,they will automatically be sorted by ascend below. If you want to sort them in another way,you can click either \"Ascend\" of \"Descend\" radio button.\r\n(5)You can check the latest 20 sets of generated numbers by switching to the \"Records Zone\" tab, and decide to list them from new to old or from old to new, and numbers sorted by generated order or from small to big. Records will always be reserved until you delete them, even though this app is shut down.\r\n(6)You can watch statistics for generated numbers by switching to the \"Statistics Zone\" tab, and decide to list them by \"ball number\" from small to big or by \"generated times\" from many to few. The generated numbers in the statistics zone will not be saved, and will be cleared once you \"quit\" the \"Lotto Number Generator\" page.\r\n\r\n\r\n3.Lotto results looking up:\r\n(1)First select the region of the lotto,then press the lotto button.\r\n(2)It will link to a specific lotto result page. After some content of the page appeared, you can press \"ok\" button to close the popped up progress dialog.",
  "summary": "This application offers number generators for multi-country lotteries.",
  "installs": "100,000+",
  "score": 4.04,
  "ratings": 813,
  "reviews": 221,
  "price": 0,
  "developer": "ActMan",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Nov 7, 2011",
  "updated": 1556015602000,
  "version": "Varies with device",
  "recentChanges": "v3.0.0: (1)New function 「pick number(s) by tapping ball(s)」 was added.(2)Florida Jackpot Triple Play,Pennsylvania KENO,Ohio The Lucky One,Arizona Triple Twist,Kentucky Quick Bucks,New Mexico Pick 4,Europe EuroMillions HotPicks,UK Set for Life,Ontario HIT OR MISS were added.(3)Ranges of numbers of Texas Cash Five,North Carolina Cash 5,Canada LOTTO MAX and Québec Max were updated.(4)URLs of draw result pages of many lottos were updated.(5)Draw times of many lottos were updated.(2019/04/23)",
  "appId": "tw.actman.android.tools.lottoplayer.free",
  "searchTerms": "lottery"
 },
 {
  "title": "Lucky Lottery Number Generator",
  "description": "Lucky Lottery Number Generator app by LotteryNumberGenerator.net\r\n\r\n- lets you generate random lottery numbers, scramble lottery numbers, generate multiple combinations, and truly lucky ball shuffler for a magical touch.\r\n- tune numbers to your Horoscope, Lucky Charms, or Numerology numbers\r\n- generate lottery numbers for any lotto\r\n- shuffle balls and use your lucky touch to reveal lucky numbers\r\n- scramble lottery numbers \r\n- generate number combinations with multiple lines\r\n- use ranges like 1-50, 1-100, etc,\r\n- separate numbers using comma, dots, tabs, spaces\r\n- Include/Exclude certain numbers",
  "summary": "Lottery Number Generator app - lets you generate, pick or scramble lotto numbers",
  "installs": "50,000+",
  "score": 4.15,
  "ratings": 160,
  "reviews": 74,
  "price": 0,
  "developer": "Michael Vij",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "May 6, 2016",
  "updated": 1575512968000,
  "version": "Varies with device",
  "recentChanges": "- new features<br>- bug fixes<br>- grant Storage permission if you need to download large list of numbers",
  "appId": "net.lotterynumbergenerator.lngapp",
  "searchTerms": "lottery"
 },
 {
  "title": "Irish Lottery",
  "description": "Best view in Mobile and Tablet\r\n\r\nWe cover the following lottories in UK.\r\n\r\n+ Lotto\r\n+ EuroMillions  \r\n+ Daily Millions \r\n \r\n+ Free Small & lightweight\r\n+ Fastest results\r\n+ Jackpot Accumulated Prize As per Vendor website\r\n+ Past results\r\n+ Beautiful design and User friendly for reading",
  "summary": "Irish Lottery app, provide the fatest result of major Ireland lotteries.",
  "installs": "5,000+",
  "score": 3.6363637,
  "ratings": 11,
  "reviews": 11,
  "price": 0,
  "developer": "whoseapps.com",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Dec 7, 2018",
  "updated": 1585721042000,
  "version": "1.8",
  "recentChanges": "Upgrade to Android 10.",
  "appId": "net.my4d.irish_lottery",
  "searchTerms": "lottery"
 },
 {
  "title": "NY Lottery Results",
  "description": "Get the latest New York lottery results within minutes of the draws taking place. This easy-to-use app includes the following lotteries:\r\n\r\nNY Lotto\r\nPowerball\r\nMega Millions\r\nCash 4 Life\r\nNY Take 5\r\nNY Numbers\r\nNY Pick 10\r\nNY Win\r\n\r\nNY Lotto, Powerball and Mega Millions also include a full breakdown displaying the number of winners and amount paid out for each prize level.\r\n\r\n\r\nThe following features are also included:\r\n\r\n\r\nTicket Checker\r\n----------------------------\r\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\r\n\r\n\r\nCustomizable Notifications\r\n----------------------------\r\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\r\n\r\n\r\nRandom Number Generator\r\n-----------------------------\r\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on house numbers and anniversary dates!\r\n\r\n\r\nResults Archive\r\n----------------------------\r\nAccess to the full archive of results dating back to the first draw of each lottery.\r\n\r\n\r\nSettings\r\n----------------------------\r\nCustomise which lotteries display in the app and in which order.\r\n\r\n\r\nSupport\r\n----------------------------\r\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at contact@lottery.net.\r\n\r\n\r\n----------------------------\r\nPlayers must be 18 or over to download this app. App Terms and Conditions apply.\r\n\r\nGambling can be addictive. Play responsibly.",
  "summary": "Lottery results for Powerball, Mega Millions and New York lottery games",
  "installs": "1,000+",
  "score": 4.625,
  "ratings": 8,
  "reviews": 3,
  "price": 0,
  "developer": "The Lottery Company Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Jul 20, 2018",
  "updated": 1581688178000,
  "version": "NY Lottery 2.0 (10002)",
  "recentChanges": "The New York lottery results app has been completely rewritten from the ground up, making it much quicker than the previous version, accompanied with a fresh redesign to make the app easier to use.<br><br>The latest results now appear almost instantly after a draw.",
  "appId": "net.lottery.newyork",
  "searchTerms": "lottery"
 },
 {
  "title": "Thai National Lottery",
  "description": "Never Miss a Jackpot! \r\n\r\nThe lottery app makes it quick and easy to:\r\n. check your numbers \r\n. keep up to date with the latest thailand lottery jackpot information\r\n. never miss fresh draws and update of thailand lottery result!\r\n\r\nAlso supporting Thai and English languages.\r\nefd47f484a",
  "summary": "Play the biggest lottery in Thailand from the palm of your hand!",
  "installs": "100,000+",
  "score": 4.4,
  "ratings": 769,
  "reviews": 159,
  "price": 0,
  "developer": "CrystalWeb Asia Co.Ltd.",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Jun 23, 2018",
  "updated": 1587720713000,
  "version": "1.0.0.34",
  "recentChanges": "Are you ready for your lucky number? Wait the notification, select it, play and win!",
  "appId": "com.limestudio.lottery.thailand",
  "searchTerms": "lottery"
 },
 {
  "title": "EuroMillions",
  "description": "Get the latest EuroMillions results within seconds of the draw taking place. This easy to use app shows the EuroMillions numbers (including associated draws like the Millionaire Maker, Irish Raffle and EuroMillions Plus) and full prize breakdowns including number of winners and prizes paid. \r\n\r\n\r\nThe following features are also included:\r\n\r\n\r\nQR Ticket Scanner (UK only)\r\n--------------------------------------\r\nFor lottery tickets purchased in UK shops, simply scan the QR code printed on your ticket using your phone’s camera to see if you have won a prize.\r\n\r\n\r\nTicket Checker\r\n--------------------------------------\r\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket. Only play EuroMillions on certain days every Friday or Tuesday? Not a problem, you can exclude your checked tickets from draws you do not play.\r\n\r\n\r\nCustomisable Notifications\r\n--------------------------------------\r\nGet notified instantly when the latest EuroMillions results and prize breakdowns become available. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\r\n\r\n\r\nRandom Number Generator\r\n--------------------------------------\r\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on Lucky Dip numbers!\r\n\r\n\r\nEuroMillions Results Archive\r\n--------------------------------------\r\nAccess to the full archive of results dating back to the first draw which took place in 2004. \r\n\r\n\r\nMultilingual Support\r\n--------------------------------------\r\nThis app is available in the following languages: English, French, Portuguese, Spanish, Dutch, Chinese, German, Italian, Polish, Swedish and Russian.\r\n\r\n\r\nSupport\r\n--------------------------------------\r\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at support@euro-millions.com.",
  "summary": "Stay up to date with the latest EuroMillions winning numbers and raffle codes.",
  "installs": "5,000+",
  "score": 4.484375,
  "ratings": 64,
  "reviews": 28,
  "price": 0,
  "developer": "The Lottery Company Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 9, 2020",
  "updated": 1583749020000,
  "version": "Results 1.0 (6)",
  "recentChanges": "First release of the app.",
  "appId": "com.euro_millions.results",
  "searchTerms": "lottery"
 },
 {
  "title": "Scratcher & Clicker",
  "description": "Scratcher & Clicker is a free cash scratch off game. Test your luck by playing 50+ lottery scratch cards!\r\nPlay all your favorite lottery scratch offs without having to lose real money!\r\n\r\nFeatures:\r\n• 50+ lottery scratcher tickets\r\n• Real scratching effect\r\n• Instant win ticket analytics\r\n• You will never lose pocket money by playing these free cash lottery scratchers \r\n• Spin the free gift  machine and redeem gift bonus per 100 scratch tickets scratched\r\n• Spin bet machine to increase earnings\r\n• Play fun clicker game, defeat pirates and become super clickers\r\n• Best time passer & pressure reducer\r\n\r\nList of scratch off tickets:\r\nCrossword\r\nBingo\r\nHold'em Poker\r\n7-11-21\r\n100X The Cash\r\nMoney Money Money\r\nBlackjack\r\nCashword\r\nVegas Slots\r\nLotto money\r\nLoteria\r\nHalloween\r\nZodiac\r\nTic Tac Toe\r\nSet for Life\r\nDid I Win?\r\nNeon 9's\r\nJewel 7's\r\nPinball\r\nFlorida flamingo...more lotto tickets will be available soon.\r\n\r\nInstant lottery (instant games) lovers don't miss this lottery scratchers game.\r\nTry your luck today with Bunny Scratch!\r\nOnly for entertainment purpose and could not win real money or real prize from this game.\r\n\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Free lottery scratch off game<br>50+ lotto scratchers as playing real scratch offs",
  "installs": "1,000,000+",
  "score": 4.6223426,
  "ratings": 26613,
  "reviews": 8006,
  "price": 0,
  "IAPRange": "£0.79 - £179.99 per item",
  "developer": "Lotto Scratch Powerball",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 22, 2015",
  "updated": 1581060367000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.bunny_scratch.fl",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Scanner",
  "description": "lottery scanner\r\n\r\nLottery Scanner and Barcode Scanner app is a powerful barcode scanner scanner it will scan multiple barcode at a time, Scan any barcode it is completely free app. \r\n\r\nBarcode scanner- which allows you to scan instantly any barcode and show you valuable information on your smartphone. You can scan lottery ticket of barcode, it has capability to scan multiple barcode at a time. lottery scanner code scanner and barcode lottery scanner scan very fast and easy to use, seem less and incredibly functional reading of any qr code, barcode, matrix info for you. Barcode Scanner application is a very small, powerful lottery reader and qrcode scanner app and lottery scanner which scan lots of barcode. \r\n\r\nSAVE MONEY barcode scanner app to scan code fast and decode its code gives you information about exclusive deals, extra coupons, compare prices as per your need. \r\n\r\nFAST SCAN Make use of the scan qr code and it will direct auto to websites and Wi-Fi networks and it will find next store around you. code reader app provide you to get the contact info from anywhere in network. \r\n\r\nGET THE PRODUCT INFORMATION Scan any barcode or qr code and know amount the products information in details know more information about the scanned item, scan barcode, urls, images, cards and many many more within a touch. \r\n\r\nFAST DECODER OF BARCODE easy to use scanner. scan any barcode by using this lottery scanner scan barcode in lot. Advance decoding technology is integrated in this app. It will decode and barcode and QR Code, Data Matrix, Aztec, PDF417, 1D, 2D and new barcode. \r\n\r\nSCANNER FEATURES: \r\n\r\n✓ Easy to use. \r\n✓ Scan in lots. \r\n✓ Advance and Powerful search feature to find item quickly. \r\n✓ Multiple scan at a time. ✓ Find details in web. \r\n✓ offline worked \r\n\r\nHow does it work : \r\nSimply Point and focus the camera on barcode or QR Code it will scan immediately and display the scanned details. \r\n\r\nFree!",
  "summary": "Lottery Scanner scan multiple barcode of lottery ticket, fast and light scanner.",
  "installs": "50,000+",
  "score": 3.94,
  "ratings": 289,
  "reviews": 215,
  "price": 0,
  "developer": "fastscanner",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Jul 12, 2019",
  "updated": 1588255725000,
  "version": "3.1",
  "recentChanges": "Enhanced UI",
  "appId": "com.lotterscanner.fastbarcodescanner",
  "searchTerms": "lottery"
 },
 {
  "title": "NY Lottery Results",
  "description": "The simplest FREE way to view New York lotto draw game results for\r\n\r\n* Powerball\r\n* Mega Millions\r\n* Lotto\r\n* Cash4Life \r\n* Take 5\r\n* Numbers\r\n* Win 4\r\n* Pick 10\r\n\r\nQuickly and easily scroll through all New York lotto draw game results - no need to navigate through multiple menus to find the latest game results. \r\n\r\nHistory - Results from past drawings\r\nGenerate Quick Picks - Randomly generate picks for games\r\nPayouts - See the number of prize winners for Powerball, Mega Millions, and many others\r\nFrequency - See how many times a ball was drawn for 20, 50, or 100 draws\r\n\r\nAd supported",
  "summary": "NY Lottery draw game results in a single, easy-to-read list. Quick Accurate Free",
  "installs": "50,000+",
  "score": 4.1676645,
  "ratings": 1677,
  "reviews": 541,
  "price": 0,
  "developer": "Matthew Saavedra",
  "genre": "Entertainment",
  "contentRating": "PEGI 16",
  "contentRatingDescription": "Strong Language",
  "released": "Mar 7, 2013",
  "updated": 1588275743000,
  "version": "3.13",
  "recentChanges": "Many were reporting issues with the new UI crashing, so the app has been reverted to the previous UI",
  "appId": "com.matcho0.nylotto",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Ticket Numbers",
  "description": "Find your lucky Lottery Ticket Numbers for any lottery today. Use this application in order to find out your lucky numbers for any lottery in the world. Never let the lottery machine pick ticket numbers for you. Use this application to find good lucky numbers.\r\n\r\nMain Lotteries Included in Lottery Ticket Numbers:\r\n\r\nUnited States Powerball\r\nUnited States Mega Millions\r\nArizona The Pick\r\nConnecticut Lotto!\r\nFlorida Lotto\r\nFlorida Lucky Money\r\nIllinois Lotto\r\nIndiana Hoosier Lotto\r\nKansas Super Kansas Cash\r\nMassachusetts Megabucks\r\nMichigan Classic Lotto 47\r\nMissouri Lotto\r\nNew Jersey Pick 6 XTRA\r\nNew York Cash4Life\r\nNew York Lotto\r\nOhio Classic Lotto\r\nOregon Megabucks\r\nUnited States Hot Lotto\r\nVermont Megabucks Plus\r\nWashington Lotto\r\nWisconsin Megabucks\r\nAustralia Monday Lotto\r\nAustralia Wednesday Lotto\r\nAustralia Saturday Lotto\r\nAustralia Powerball Lotto\r\nAustralia Oz Lotto\r\nAustria Lotto\r\nBelgium Lotto\r\nBrazil Dupla Sena\r\nBrazil Mega Sena\r\nBrazil Quina\r\nCanada BC/49\r\nCanada Lotto 649\r\nCanada Lotto Max\r\nCanada Quebec 49\r\nCanada Western 6/49\r\nCanada Lottario\r\nCanada Ontario 49\r\nColombia Baloto\r\nEurope EuroJackpot\r\nEurope EuroMillions\r\nFinland Lotto\r\nFrance EuroMillions\r\nFrance Loto\r\nGermany Lotto\r\nGreece Joker\r\nGreece Lotto\r\nHong Kong Mark Six\r\nHungary Hatoslotto\r\nHungary Otoslotto\r\nIreland Lotto\r\nIsrael Lotto\r\nItaly SiVinceTutto\r\nItaly SuperEnalotto\r\nItaly SuperStar\r\nJapan Loto 6\r\nLouisiana Lotto\r\nMexico Melate\r\nMexico Melate Retro\r\nNew Zealand Powerball\r\nPoland Lotto\r\nRomania Lotto 6/49\r\nRussia Gosloto 6/45\r\nRussia Gosloto 7/49\r\nSouth Africa Lotto\r\nSouth Africa Powerball\r\nSpain BonoLoto\r\nSpain El Gordo\r\nSpain La Primitiva\r\nSweden Lotto\r\nSweden Viking Lotto\r\nSwitzerland Lotto\r\nTurkey Lotto 6/49\r\nTurkey Super Lotto 6/54\r\nUkraine Megalot\r\nUkraine Super Loto\r\nUnited Kingdom EuroMillions\r\nUnited Kingdom Lotto\r\nUnited Kingdom Lotto HotPicks\r\nUnited Kingdom Thunderball\r\nCalifornia SuperLotto Plus\r\nColorado Lotto\r\nKenya Lotto\r\nAustria EuroMillions\r\nFinland Viking Lotto\r\nIsrael Double Lotto\r\nItaly Lottomatica\r\nNew Jersey Cash 5\r\nSpain EuroMillions\r\nKenya Toto Lotto\r\nKenya Charity Sweepstake\r\nGhana Lotto\r\nGhana daily Pick 3\r\nLoto Tradicional\r\nDouble Draw\r\nPick 3\r\nPick 4\r\nMega 6\r\nSuper Lotto\r\nDaily Grand\r\nPick 2\r\nMega Dice\r\nChile Lotto\r\nPowerball\r\nLoto Plus\r\nPega 2\r\nPega 3\r\nPega 4\r\nLotto\r\n5 De Oro\r\nChance El Dorado\r\nLotto Super 7\r\nGana Diario\r\nTinka\r\nVikinglotto Lotto\r\nChispazo\r\nMelate\r\nTris Clasico\r\nTris Extra\r\nTris Half Dia\r\n4D\r\nToto\r\nLoto pool\r\nLoto Mas\r\nLoto\r\nChina Welfare\r\nChina Sports Lucky 7\r\nLoto 7\r\nLoto 6\r\nMini Loto\r\nLotto 6/45\r\nSayısal Loto\r\nSüper Loto\r\nŞans Topu\r\nJackpot Mega 6/45\r\nPower 6/55\r\nSportka\r\nEuromiliony \r\nEuroJackpot\r\nEkstra Pensja\r\nTOTO 2 6/49\r\nTOTO 2 6/42\r\nTOTO 2 5/35\r\nTOTO 2 5/50\r\nPICK 5\r\nFANTASY 5\r\nLucky Money\r\nand more...",
  "summary": "Find your Lucky Lottery Ticket Numbers for any lottery today.",
  "installs": "100,000+",
  "score": 4.19,
  "ratings": 489,
  "reviews": 241,
  "price": 0,
  "developer": "IvisionX",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Dec 18, 2015",
  "updated": 1561313519000,
  "version": "3.2",
  "recentChanges": "Best Number Generator for lottery tickets. (Numbers Generations Algorithm Improved)<br>Automatic Updates for Algorithms and New Lotteries. (You must to Accept android.permission.INTERNET to conect to Internet to Allow Automatic Updates)<br>Fast Numbers Generations<br>Support 32 bit and 64 bits<br>New Countries Added",
  "appId": "ivisionx.lotteryticketnumbers",
  "searchTerms": "lottery"
 },
 {
  "title": "Scratch-a-Lotto Scratch Card Lottery FREE",
  "description": "Scratch-a-Lotto the NEW and BEST Scratch Card Lotto game from Mobile Amusements!\r\n\r\nWith a HUGE SELECTION of Scratch Card games, UNLIMITED FREE COINS and Mega prize payouts, try to win as much cash as possible by also playing bonus prize gambling features such as Roulette, Higher or Lower Cards and Lucky Dice to accumulate virtual credit prizes.\r\n\r\nAs you progress to the locked higher priced Scratch Cards, you'll be able to win and unlock even more fantastic higher prize payouts.\r\n\r\nFeeling lucky? Welcome to Scratch-a-Lotto and attempt to win BIG!\r\n\r\nGood Luck!\r\n\r\nFeatures:\r\n\r\n* Exciting collection of new themed Scratch Cards.\r\n* Enjoy the Scratch Card experience without losing real money.\r\n* Gamble winning payouts to gain even more cash.\r\n* Win MEGA BIG!\r\n* Easy to pick up and play scratch lotto fun.",
  "summary": "Scratch-a-Lotto the NEW and BEST Scratch Card Lotto game from Mobile Amusements!",
  "installs": "50,000+",
  "score": 4.28,
  "ratings": 237,
  "reviews": 79,
  "price": 0,
  "developer": "Mobile Amusements",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Mar 20, 2017",
  "updated": 1563617513000,
  "version": "14.0",
  "recentChanges": "Latest improved version.",
  "appId": "com.mobileamusements.ScratchaLottoFREEFREE",
  "searchTerms": "lottery"
 },
 {
  "title": "Florida Lottery Results",
  "description": "Get the latest Florida lottery results within minutes of the draws taking place. This easy-to-use app includes the following lotteries:\r\n\r\nFlorida Lotto\r\nPowerball\r\nMega Millions\r\nCash4Life\r\nJackpot Triple Play\r\nFantasy 5\r\nPick 5\r\nPick 4\r\nPick 3\r\nPick 2\r\n\r\nFlorida Lotto, Powerball and Mega Millions also include a full breakdown displaying the number of winners and amount paid out for each prize level.\r\n\r\n\r\nThe following features are also included:\r\n\r\n\r\nTicket Checker\r\n----------------------------\r\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\r\n\r\n\r\nCustomizable Notifications\r\n----------------------------\r\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\r\n\r\n\r\nRandom Number Generator\r\n-----------------------------\r\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on house numbers and anniversary dates!\r\n\r\n\r\nResults Archive\r\n----------------------------\r\nAccess to the full archive of results dating back to the first draw of each lottery.\r\n\r\n\r\nSettings\r\n----------------------------\r\nCustomise which lotteries display in the app and in which order.\r\n\r\n\r\nSupport\r\n----------------------------\r\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at contact@lottery.net.\r\n\r\n\r\n----------------------------\r\nPlayers must be 18 or over to download this app. App Terms and Conditions apply.\r\n\r\nGambling can be addictive. Play responsibly.",
  "summary": "Lottery results for Powerball, Mega Millions and Florida lottery games",
  "installs": "1,000+",
  "score": 5,
  "ratings": 11,
  "reviews": 7,
  "price": 0,
  "developer": "The Lottery Company Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Feb 7, 2020",
  "updated": 1581070207000,
  "version": "FL Lottery 1.0 (325)",
  "recentChanges": "First release of the app.",
  "appId": "net.lottery.florida",
  "searchTerms": "lottery"
 },
 {
  "title": "Irish National Lottery",
  "description": "Get the latest Irish Lottery results within seconds of the draws taking place. This easy-to-use app shows the National Lottery numbers, prize breakdown information and jackpots for the following lotteries:\r\n\r\nLotto (including Plus 1, Plus 2 and Lotto Plus Raffle)\r\nEuroMillions (including EuroMillons Plus, Irish Raffle and European Millionaire Maker)\r\nDaily Million (including Daily Million Plus)\r\nTelly Bingo\r\nLotto 5-4-3-2-1 (including Plus 1 and Plus 2)\r\n\r\n\r\nThe following features are also included:\r\n\r\n\r\nTicket Checker\r\n--------------------------------------\r\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\r\n\r\n\r\nCustomisable Notifications\r\n--------------------------------------\r\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\r\n\r\n\r\nRandom Number Generator\r\n--------------------------------------\r\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on Quick Pick numbers!\r\n\r\n\r\nResults Archive\r\n--------------------------------------\r\nAccess to the full archive of results dating back to the first draw of each lottery.\r\n\r\n\r\nSettings\r\n--------------------------------------\r\nCustomise which lotteries display in the app and in which order.\r\n\r\n\r\nSupport\r\n--------------------------------------\r\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at contact@national-lottery.com.",
  "summary": "Irish Lottery results for Lotto, EuroMillions, Daily Million, Telly Bingo, 54321",
  "installs": "5,000+",
  "score": 3.0555556,
  "ratings": 18,
  "reviews": 14,
  "price": 0,
  "developer": "The Lottery Company Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 18, 2020",
  "updated": 1585658563000,
  "version": "Results 1.0.1 (4)",
  "recentChanges": "Improvements to how Daily Million results display the time of the draw.",
  "appId": "com.national_lottery.irish.results",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Statistics UK",
  "description": "key features:\r\n- the recent lotto draw numbers\r\n- updating data shortly after the draw\r\n- enter you individual numbers\r\n- shows your winnings\r\n- lottery-tip-generator (random numbers)\r\n- history of all drawn numbers\r\n- Home-Screen-Widget shows the recent draw\r\n\r\nstatistics:\r\n- most frequently numbers\r\n- least frequently numbers\r\n- numbers not drawn for a long period of time",
  "summary": "A must-have tool for lotto gamblers!",
  "installs": "10,000+",
  "score": 4.17757,
  "ratings": 107,
  "reviews": 33,
  "price": 0,
  "developer": "Matthias Müllner",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Nov 29, 2011",
  "updated": 1567614140000,
  "version": "1.5.4",
  "recentChanges": "improved UI",
  "appId": "at.muellner.matthias.lotto6aus49uk",
  "searchTerms": "lottery"
 },
 {
  "title": "3D Lottery / Bingo Machine",
  "description": "3D Lottoery / Bingo Machine\r\n\r\nBased on real physics\r\n\r\nUser can draw up to 20 balls from up to 100 total",
  "summary": "3D Lottery / Bingo Machine",
  "installs": "1,000+",
  "score": 4.847826,
  "ratings": 46,
  "reviews": 28,
  "price": 0,
  "developer": "Koby Zada",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Nov 28, 2019",
  "updated": 1582739104000,
  "version": "2.05",
  "recentChanges": "3D Lotto Machine<br>מכונת לוטו תלת-מימד<br>Added:<br>[15/12/2019]<br>- Camera Zoom In/Out<br>- Camera Rotation<br>[20/12/2019]<br>- Ball numbers are now smaller and inside the balls<br>- Press Back to EXIT application<br>- Auto Size for Buttons depending on Device<br>[04/01/2019]<br>- Added Exit button<br>- New Slider UI :-)<br>[11/01/2020]<br>- UI slider is a bit bigger now for more easy use<br>[26/02/2020]<br>- Save/Load Drawing parameters to file",
  "appId": "com.kobyzada.lottomachine",
  "searchTerms": "lottery"
 },
 {
  "title": "California Lottery Results",
  "description": "Get the latest California lottery results within minutes of the draws taking place. This easy-to-use app includes the following lotteries:\r\n\r\nSuperLotto Plus\r\nPowerball\r\nMega Millions\r\nFantasy 5\r\nDaily 4\r\nDaily 3\r\nDaily Derby\r\n\r\nSuperLotto Plus, Powerball and Mega Millions also include a full breakdown displaying the number of winners and amount paid out for each prize level.\r\n\r\n\r\nThe following features are also included:\r\n\r\n\r\nTicket Checker\r\n----------------------------\r\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\r\n\r\n\r\nCustomizable Notifications\r\n----------------------------\r\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\r\n\r\n\r\nRandom Number Generator\r\n-----------------------------\r\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on house numbers and anniversary dates!\r\n\r\n\r\nResults Archive\r\n----------------------------\r\nAccess to the full archive of results dating back to the first draw of each lottery.\r\n\r\n\r\nSettings\r\n----------------------------\r\nCustomise which lotteries display in the app and in which order.\r\n\r\n\r\nSupport\r\n----------------------------\r\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at contact@lottery.net.\r\n\r\n\r\n----------------------------\r\nPlayers must be 18 or over to download this app. App Terms and Conditions apply.\r\n\r\nGambling can be addictive. Play responsibly.",
  "summary": "Lottery results for Powerball, Mega Millions and California lottery games",
  "installs": "500+",
  "score": 3.625,
  "ratings": 8,
  "reviews": 5,
  "price": 0,
  "developer": "The Lottery Company Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Feb 13, 2020",
  "updated": 1581595474000,
  "version": "CA Lottery 1.0 (325)",
  "recentChanges": "First release of the app.",
  "appId": "net.lottery.california",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Scratch Off - Mahjong",
  "description": "Lottery Scratch Off - Mahjong is a free scratch off game.\r\n\r\n40 scratchers free to play: Mahjong, Roll the dice, Red envelope scratch ticket…and more.\r\n\r\nIf you like lottery game, especially instant game, try Lottery Scratch Off - Mahjong and scratch big win prize!\r\n\r\nOnly for entertainment purpose and could not win real money from this game.\r\n\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "Scratch ticket for Lunar New Year.<br>Lots of instant scratchoff to play &amp; win big!",
  "installs": "500,000+",
  "score": 4.573563,
  "ratings": 26196,
  "reviews": 4784,
  "price": 0,
  "IAPRange": "£0.79 - £41.99 per item",
  "developer": "YouSee Design",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Jan 24, 2015",
  "updated": 1579708638000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.yousee.scratchfun_chinese_new_year",
  "searchTerms": "lottery"
 },
 {
  "title": "Scratch 2 Win: Lottery Tickets",
  "description": "Can you turn a measly $50 into $1,000,000? Find out in Scratch 2 Win: Lottery Tickets!\r\n\r\nYou are given $50 which you can use to buy scratch tickets and cards. Can you turn that $50 into $1,000,000? How about $1,000,000,000? Find out in Scratch 2 Win and get that lotto jackpot!\r\n\r\nScratch 2 Win brings the excitement of winning the scratch lottery like in Las Vegas! The more you scratch the cards, the more lottery cards that you can buy and win!\r\n\r\nScratch 2 Win has a variety of cards that you can play, including match 3, lucky number and a whole lot more! Try to collect more cards and scratch your way to lotto victory! \r\n\r\nTry and make your fortune by playing more scratch cards lottery! The more you play the more you win! Scratch those tickets for huge bucks! \r\n\r\nIf you know how to play and like scratch lottery cards, you’ll definitely love Scratch 2 Win! \r\n\r\nBe the high roller Las Vegas big shot that you dreamed of! \r\n\r\nHope you enjoy playing our little game as much as we've enjoyed creating it!\r\n\r\nFeatures: \r\n- Simulate real-life scratch off lottery tickets Las Vegas scratch style!\r\n- A variety of colorful scratch lotto ticket games\r\n- Feel the thrill of winning a scratch off lottery ticket game! \r\n\r\nDeveloped by Popsicle Games!",
  "summary": "Can you turn $50 into $1,000,000? Scratch your way to success &amp; find out!",
  "installs": "50,000+",
  "score": 3.66,
  "ratings": 196,
  "reviews": 91,
  "price": 0,
  "IAPRange": "£0.80 - £13.49 per item",
  "developer": "Popsicle Games",
  "genre": "Casual",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Apr 25, 2016",
  "updated": 1511254589000,
  "version": "1.2.4",
  "recentChanges": "- Minor bug fixes! Good luck and scratch your way 2 millions!",
  "appId": "com.popsicle.scratch",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery DreamBook",
  "description": "This app is designed to provide you options to enter words from your dream or have random numbers generated for you.\r\nWe designed this app around variations of the Chaldean & Indian Numerology algorithms to generate your lucky 3 digit and 4 digit numbers.\r\nThere is a minimum of 3 letters that must be entered and we ask that you enter no more than 3 to 4 words of your dream (i.e. fire in the basement, car accident, etc).",
  "summary": "Generate 3 &amp; 4 digit lottery numbers from your dreams.",
  "installs": "10,000+",
  "score": 3.72,
  "ratings": 50,
  "reviews": 21,
  "price": 0,
  "IAPRange": "£4.29 per item",
  "developer": "Dwayne Anderson",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Nov 25, 2017",
  "updated": 1576142713000,
  "version": "1.22",
  "recentChanges": "Fixed the payment issue",
  "appId": "com.dwaynewrld.Dreambook",
  "searchTerms": "lottery"
 },
 {
  "title": "Irish Lottery Results",
  "description": "By using the application Irish Lottery Results you can view real-time results of draws for Lotto, Euromillions, Dialy Million, TellyBingo, Lotto 5-4-3-2-1 and Millionaire Raffle.\r\n\r\nIrish Lottery Results gives you the possibility to consult the history of all ireland lottery games.\r\n\r\n\r\nThe Irish Lottery Results application supports the following games:\r\n\r\n- Irish Lotto.\r\n- Irish Dialy Million.\r\n- Irish TellyBingo.\r\n- Irish Lotto 5-4-3-2-1.\r\n- Irish Millionaire Raffle.\r\n- Ireland lottery.",
  "summary": "Get the latest numbers of the Irish Lottery games.",
  "installs": "500+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "Ultra Lotto",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Jan 30, 2020",
  "updated": 1580391603000,
  "version": "1.3",
  "appId": "com.irish.national.lottery",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery generator based on stats",
  "description": "This is one of the best lottery application from the market. It is very customizable.\r\nApplication uses a statistics algorithm to generate special numbers for each game.\r\nThis lottery application allows you to generate numbers for different lottery games around the world and you can save your own game if is not in the list.\r\nIt has the popular games like US PowerBall, Mega Millions Pick 3, Pick 4, for most of the states in US and from all around the world.\r\nIt has the feature to let you save your Favorite numbers and Excluded numbers in the option menu.\r\nYou can Share your numbers with somebody else when you hit the button Share (with the envelope on it).\r\nEvery time you generate numbers it will save the numbers in a history and save the numbers with date for future use.         \r\nYou can delete the draws from history that you don't want one by one or all.\r\nIn the menu is a half full heart button where you can add the Favorite numbers and Excluded numbers or to delete all history.\r\nYou can save your games. When you rename a game will become the first in the list.\r\nAdd the History option where you can see the previous generated numbers.\r\nIn help is an explanation of all buttons in the application without a name.\r\nAdd Statistics of game played and the official games from all around the world.\r\nSave to Favorites (played) games. \r\nImproved interface to adjust statistics and add new games that are not in the app.\r\nAvailable languages:         \r\nБългарски        中国简化        Čeština        Deutsch        Ελληνικά        English\r\n        Español        Français        हिन्दी        Italiano        日本語        한국어        Magyar        Polski\r\n        Português        Română        Русский        Türkçe        Tiếng Việt         Українська\r\nIf you have any questions or suggestions please send me an email.",
  "summary": "Best application to generate lottery numbers and check statistics of games.",
  "installs": "100,000+",
  "score": 4.171642,
  "ratings": 2709,
  "reviews": 1045,
  "price": 0,
  "IAPRange": "£0.99 - £299.99 per item",
  "developer": "GEORGE",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 26, 2014",
  "updated": 1582732710000,
  "version": "4.5.103n",
  "recentChanges": "Add translation. Fix bugs.",
  "appId": "com.logan19gp.lottogen",
  "searchTerms": "lottery"
 },
 {
  "title": "Super pick 3&4 Lottery",
  "description": "Super 3&4 App\r\n\r\nThe SUPER Pick 3&4 Lottery App 'they' Don't Want You to know About...\r\n\r\nWin Pick 3&4 Lottery  The Easiest Way Ever to Win Pick 3&4\r\n\r\nNow ANYONE Can Win the Pick 3&4\r\n\r\n\r\nA powerful Pick 3&4 lottery App proven to work on ALL U.S.A Pick 3&4 games. Super 3&4 works to reduce your odds and put the game more in your favor not theirs! \r\n\r\nPut the Pick 3&4 lottery on auto-pilot by letting the App do most the work. The Super 3&4 is the only lottery App to turn the Pick 3&4 to an easy to win and fun game.\r\n\r\nSuper 3&4  does most of the work for you to win the Pick 3&4 lottery time and time again and it's NOT rocket science. You don't need to be a mathmetician  No effort is needed no system to learn. The app does most the work for you. We also added 9 full systems that shows its Performance Statistics. How many times they come out. The average longest gap it took to come out. Thats the longest it took the system to come out in 365 days/draws  Straight and Box statistics. Also we have notification trackers for all systems. Now it has gotten way easier to win using all the trackers. One you just have to set all the trackers for pick 3 and pick 4 midday and evening . You will get notification when any system is 5 draws from its longest gap. Play no more than 10 draws in case the System has gone cold. So set all the trackers sit back and play lottery on autopilot. You will find a good up hill rhythm.  \r\n\r\nPlease read below \r\n\r\n Best part is you can test when you suscribe for a 30 day free trial . You cancel any time before your 30 days.",
  "summary": "The SUPER Pick 3&amp;4 Lottery App &#39;they&#39; Don&#39;t Want You to know About...",
  "installs": "10,000+",
  "score": 3.85,
  "ratings": 172,
  "reviews": 97,
  "price": 0,
  "IAPRange": "£2.94 per item",
  "developer": "Milzyparadise",
  "genre": "Entertainment",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 6, 2014",
  "updated": 1584698837000,
  "version": "54",
  "appId": "cubi.rafi.super34sub",
  "searchTerms": "lottery"
 },
 {
  "title": "Pick 3 lottery",
  "description": "You just add one up to four last draws and let the device to do the job.\r\n- No Internet connection required.\r\n\r\nIncludes four processing systems for pick 3:\r\n\r\n- Generates a list of random draws with the sum from 1 to 26.\r\n- It calculates each new row in the list from the last draws.\r\n- It Calculates once to produce a list from the last draws.\r\n- Just generates a random list of numbers.\r\n\r\n\"ATTENTION\"\r\nRun tests with old winning numbers from Pick 3 and Cash 3 before playing with real money, I don't guarantee that everyone will win. This app just helps to pick some numbers rather picking\r\nrandomly or can't decide which numbers to play by yourself.  \r\n\r\n*Rate this app wisely*\r\n\r\nYou can run a test from old picks to see which lottery system suits you,\r\nalso, the numbers may come in exact order or any order.\r\n\r\nAlso, you can make combinations, like inserting data every two or three draws.\r\n\r\n** New update **\r\n-New system added-\r\nCalculates the numbers each other and produce a list of 10 draws.",
  "summary": "Powerful lottery generator for pick 3 Cash 3 that depends on the last draws.",
  "installs": "50,000+",
  "score": 4.35,
  "ratings": 127,
  "reviews": 50,
  "price": 0,
  "developer": "Mertzsoft",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "May 8, 2017",
  "updated": 1558268499000,
  "version": "2.5",
  "recentChanges": "Minor fixes.",
  "appId": "com.mertzlos.pick3",
  "searchTerms": "lottery"
 },
 {
  "title": "Results for Powerball Megamillions",
  "description": "Do you play Powerball or Mega Millions ? This application is your ideal partner ! It provides a myriad of features, such as the latest draw results or the automatic calculation of your winnings.\r\n\r\nTo do so, nothing simpler. You just have to save your lottery grids into the application. As soon as new results are available, update the application and discover your Powerball / Mega Millions winnings ! \r\n\r\nYou can check :\r\n-The next jackpot at stake\r\n-The detailed results of every draws\r\n-The last three months draws\r\n\r\nManage your tickets :\r\n-Save your playing lottery tickets into the application\r\n-Manage your subscriptions\r\n-Predictive text input\r\n \r\nYou can be notified :\r\n-When jackpot exceeds an amount that you set\r\n-When your subscription comes to an end\r\n-When new draw results are available\r\n\r\nPowerball and Mega Millions results, once downloaded, are stored on your device. You have access to the latest results even when a connection isn't available.\r\n\r\nTickets for Powerball or Megamillions cannot be purchased from within the app.\r\n\r\nDisclaimer :\r\n- Always check your tickets at an official outlet before discarding\r\n- Descriptions and names are the property of their respective owners\r\n- This app is not affiliated with the Multi-State Lottery Association (MUSL)",
  "summary": "The perfect tool for Powerball / Mega Millions players: results, winnings &amp; more",
  "installs": "10,000+",
  "score": 4.62,
  "ratings": 314,
  "reviews": 142,
  "price": 0,
  "developer": "Maxmalo Mobile App",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Jul 14, 2016",
  "updated": 1555011181000,
  "version": "1.7",
  "recentChanges": "Minor bug fix",
  "appId": "com.maxmalo.usabiglottery",
  "searchTerms": "lottery"
 },
 {
  "title": "Lotto Girl - Lottery machine simulator",
  "description": "- 3D realistic lottery machine\r\n- Applicable to any lottery system\r\n.  UK National Lottery, EuroMillions, Euro Jackpot, Lotto6 aus 49, Bonoloto, Vietlott Mega645, Korea 6/45, France 5/49, ToTo Singapore, Turkey, Australia Oz Lotto, Philippine PCSO Lotto, etc. \r\n.  Presets : 1/10, 1/14, 2/12, 5/34, 5/49, 5/50, 5/90, 6/42, 6/45, 6/49, 6/54, 6/55, 6/58, 6/59, 6/100, 7/45, 22/80\r\n- enable/disable specific number\r\n- change number of pick-out balls\r\n- change number of game\r\n- camera zoom in/out, rotation\r\n- cute lotto girl",
  "summary": "Make your lucky numbers with a cute lotto girl",
  "installs": "10,000+",
  "score": 4.23,
  "ratings": 168,
  "reviews": 113,
  "price": 0,
  "developer": "Brainting",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Jan 10, 2019",
  "updated": 1589261286000,
  "version": "0.33",
  "recentChanges": "Fixed bugs",
  "appId": "joa.eolssa.venus",
  "searchTerms": "lottery"
 },
 {
  "title": "Euromillions 🇬🇧 Millionaire Maker 🇬🇧 euResults",
  "description": "With this app you can now get both the Euromillions and 🇬🇧 Millionaire Maker lottery results very quickly and easily!\r\n\r\nFeatures:\r\n - Check the latest Euromillions draw and related list of prizes\r\n - Consult the past draws (and their prizes)\r\n - You can save your numbers and the app will check to see if they match any of the Euromillions results.  Therefore you will always be aware of any potential prizes you may have won!\r\n - Receive optional push notifications to notify you when a new result is available, also when the next Prize value is available and more importantly will inform you have won by checking your saved numbers. \r\n - Share the Euromillions results with your friends and family (Email, SMS, Facebook, Twitter etc)\r\n - App is available to use offline to avoid unnecessary data usage \r\n - And there will be more features coming soon!\r\n\r\nPlease feel free to get in contact, if you have any suggestions or feedback\r\n\r\nGood luck! :)\r\n\r\n-------------------------------------\r\nThis application does not perform online betting. And this application is not linked to, or affiliated with, or approved by any of the European Operators of the EuroMillions lottery game (for example, The National Lottery, or the SLE).",
  "summary": "🇬🇧 Quick and easy to use Euromillions Results and Prize Checker 🇬🇧",
  "installs": "50,000+",
  "score": 4.3893805,
  "ratings": 1141,
  "reviews": 539,
  "price": 0,
  "developer": "Dan Fernandes",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Mar 13, 2017",
  "updated": 1588753487000,
  "version": "1.5.6",
  "recentChanges": "Thanks for using euResults! This release includes stability and performance improvements. Let us know what you think. Please send your feedback and ideas to feedback@euromillionsapp.com",
  "appId": "com.euresults",
  "searchTerms": "lottery"
 },
 {
  "title": "Diamond Sky Casino – Classic Vegas Slots & Lottery",
  "description": "Welcome to the world of Diamond Sky Casino games, the fastest growing app for sloto games and  scratch off games! If you want one source for the best free to play classic slot games, scratch off games, VIP slots, 777 slots and free daily lottery, then look no further than Diamond Sky! Our casino is filled with amazing slot machine games from real casinos (both video slots and classic stepper slots) and free lottery ticket games to give you the graphics and sounds you love from classic Vegas casinos! With more games and more features than ever, you’ll enjoy bonus slots, jackpots, wilds, free spins, progressives, immersive videos and bonuses galore!\r\n\r\nDIAMOND SKY SLOTS FEATURES:\r\n• 125+ free to play classic slots, video slots and scratch off games!\r\n• New sloto games added every two weeks \r\n• Scratch off games - scratch and win coins!\r\n• Free Daily Lottery - play the lottery every day for a chance to win billions!\r\n• Up to 10,000,000 coins daily and even more for VIP Slot Players.\r\n• More ways to win: Daily Wheel Spins, Daily Bonus, Friends Bonus, 4-hour Bonuses, Free Daily Lottery, Gifting, Scratch Off Games and more!\r\n• VIP Slot Games with better bonuses, bigger wins and exclusive games!\r\n\r\nCLASSIC SLOTS - THE BEST 777 SLOTS:\r\n• Star Spangled Stacks\r\n• Triple Crown\r\n• Wild Shift\r\n• And more!\r\n\r\nTRIPLE DIAMOND FAN FAVORITES - OUR BEST SLOTO GAMES:\r\n• Diamonds Sapphires and Rubies\r\n• Cabaret Cash\r\n• Golden Grand\r\n• Petsburgh\r\n• Armadillo Artie\r\n• And more!\r\n\r\nSCRATCH OFF GAMES!\r\n• On the Hook\r\n• Golden Grand\r\n• 3X a Lady\r\n• JaXPot 7s\r\n• Fire Company 5\r\n• Blitz Bucks\r\n• Groundhog Pays\r\n\r\nVIP SLOTS - FOR THE HIGH ROLLERS\r\n• Komodo Dragon\r\n• Shifting Hearts\r\n• Ocean Riches\r\n• Golden Cheetah\r\n\r\nFREE DAILY LOTTERY\r\n• Get 10 chances each day in our free lottery!\r\n• Daily lottery drawings \r\n\r\nDownload our sloto game app today start enjoying the best free to play classic slots, scratch off games and free daily lottery right from your own phone or tablet! \r\n\r\nThis game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money prizes. Practice or success at social gambling does not imply future success at real money gambling.",
  "summary": "Free to play classic VIP slots &amp; 777 slots, scratch off games &amp; daily lottery.",
  "installs": "100,000+",
  "score": 4.334764,
  "ratings": 2351,
  "reviews": 711,
  "price": 0,
  "IAPRange": "£0.89 - £299.99 per item",
  "developer": "Design Works Studios",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 9, 2016",
  "updated": 1579562452000,
  "version": "3.72",
  "recentChanges": "Our first table game, Baccarat, is here for a limited time (starting 1/21) Download the latest version so you can access the latest games, features and deals! <br>JOIN OUR COMMUNITY FOR SPECIAL OFFERS AND THE LATEST INFO! <br>Like us on Facebook: www.facebook.com/DiamondSkyCasino",
  "appId": "com.DesignWorks.DscAndroid",
  "searchTerms": "lottery"
 },
 {
  "title": "Results for Powerball Megamillions",
  "description": "Do you play Powerball or Mega Millions ? This application is your ideal partner ! It provides a myriad of features, such as the latest draw results or the automatic calculation of your winnings.\r\n\r\nTo do so, nothing simpler. You just have to save your lottery grids into the application. As soon as new results are available, update the application and discover your Powerball / Mega Millions winnings ! \r\n\r\nYou can check :\r\n-The next jackpot at stake\r\n-The detailed results of every draws\r\n-The last three months draws\r\n\r\nManage your tickets :\r\n-Save your playing lottery tickets into the application\r\n-Manage your subscriptions\r\n-Predictive text input\r\n \r\nYou can be notified :\r\n-When jackpot exceeds an amount that you set\r\n-When your subscription comes to an end\r\n-When new draw results are available\r\n\r\nPowerball and Mega Millions results, once downloaded, are stored on your device. You have access to the latest results even when a connection isn't available.\r\n\r\nTickets for Powerball or Megamillions cannot be purchased from within the app.\r\n\r\nDisclaimer :\r\n- Always check your tickets at an official outlet before discarding\r\n- Descriptions and names are the property of their respective owners\r\n- This app is not affiliated with the Multi-State Lottery Association (MUSL)",
  "summary": "The perfect tool for Powerball / Mega Millions players: results, winnings &amp; more",
  "installs": "10,000+",
  "score": 4.62,
  "ratings": 314,
  "reviews": 142,
  "price": 0,
  "developer": "Maxmalo Mobile App",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Jul 14, 2016",
  "updated": 1555011181000,
  "version": "1.7",
  "recentChanges": "Minor bug fix",
  "appId": "com.maxmalo.usabiglottery",
  "searchTerms": "lottery"
 },
 {
  "title": "Lucky Numbers - Lottery",
  "description": "Do you need a lucky number? This app can help you generate a lucky number for free, give it a try!\r\nNo internet, no cost, simple app operation, very easy to use.\r\nYou can use this app to generate numbers to make \"decisions\", which is a good tool for buying lottery numbers.\r\nWhen you are hesitant, try this simple app.\r\nWish you the lucky prize today!",
  "summary": "Determine you Lucky Numbers using this app",
  "installs": "100,000+",
  "score": 4.3,
  "ratings": 247,
  "reviews": 81,
  "price": 0,
  "developer": "QBee520",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Dec 23, 2013",
  "updated": 1489858427000,
  "version": "2.1",
  "appId": "com.qbee.luckynumber",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Target",
  "description": "Lottery Target Numbers app with daily price\r\n\r\nNew Lottery Target : A android free application of Nagaland State Lottery and West Bengal State Lottery result publish, Also time to time of Morning Lottery - 11:55 AM, Day - 4:00 PM and Night - 8:00 PM.\r\n\r\nDisclaimer :\r\nThis Lottery Target not the official or not connected the all State Lottery results Boards,\r\nwe just collect this results from opensource third party sites, we also suggest to you please double check the results with official published results. This app also use your own risk, if any problem or dispute you faced that's not our responsibility.\r\n\r\nWish you have a nice day!!",
  "summary": "Lottery Target Numbers",
  "installs": "5,000+",
  "score": 4.388889,
  "ratings": 36,
  "reviews": 24,
  "price": 0,
  "developer": "TechnoHelps",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Dec 10, 2019",
  "updated": 1575966611000,
  "version": "1.0.0",
  "recentChanges": "Initial Realease",
  "appId": "com.technohelps.lotterytarget",
  "searchTerms": "lottery"
 },
 {
  "title": "National Lotto 123",
  "description": "We are Providing the All Details of Thai Lottery King Thai Lottery Facebook Thai Lottery 3up Tips Magic Tips Vip Tips, 3up Sure Number 3up Result Today Thai Lottery 4pc Paper, Formula Thai Lottery Chart, Sixine Thai Lottery Result Thail Lottery Ticket Thailand Lotto Result Etc. \r\n\r\nThailand National Lottery 123 tips  but not offering any Tips on winning the lottery. There are a lot of other websites and apps that offer Thailand Lottery Tips but always use it at your own risk. In Thailand it is very common to believe in Lottery Tips which are derived from different methods or analysis.",
  "summary": "Thailand National Lottery 123 tips  but not offering any Tips on winning the",
  "installs": "5,000+",
  "score": 4.909091,
  "ratings": 22,
  "reviews": 19,
  "price": 0,
  "developer": "infotechpro",
  "genre": "Business",
  "contentRating": "PEGI 3",
  "released": "May 30, 2019",
  "updated": 1573992426000,
  "version": "5.0",
  "appId": "com.nationallotto123",
  "searchTerms": "lottery"
 },
 {
  "title": "Lotto UK:Best algorithm ever to win the UK lottery",
  "description": "Lotto UK: New best algorithm ever to win the lottery in UK National Lottery.\r\n\r\nMain features:\r\n- All 9 lottery games are available in one app.\r\n- Increases your chances of winning the jackpot with highly specialized algorithms developed with high mathematics.\r\n- It is fast and easy for use.\r\n- Optimized and small size.\r\n- No complicated keys and combinations.\r\n- You can handle everything with just one button.\r\n\r\nHere are the games:\r\n1. 49s Teatime\r\n2. 49s Lunchtime\r\n3. Euromillions\r\n4. Euromillions Hotpick\r\n5. Health Lottery\r\n6. Lotto\r\n7. Lotto Hotpicks\r\n8. Set For Life\r\n9. Thunderball",
  "summary": "Find lucky numbers via best algorithm to win big prize in UK National Lottery",
  "installs": "100+",
  "score": 4.8333335,
  "ratings": 6,
  "reviews": 5,
  "price": 0,
  "developer": "xmaxsoft",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Nov 6, 2019",
  "updated": 1579244356000,
  "version": "2",
  "recentChanges": "1. Bug fixes.<br>2. Changed 49s game selection rules and 49s Teatime and 49s Luchtime games added.<br>3. Added animations.<br>4. Optimized games icons.<br>5. Layout adjustments.<br>6. Thunderball image is changed.<br>7. Algorithms improved.<br>8. Redundant codes cleared and size reduced.",
  "appId": "xmaxsoft.lottouk",
  "searchTerms": "lottery"
 },
 {
  "title": "Irish Lottery",
  "description": "Get the latest Irish Lottery results within seconds of the draws taking place. This easy-to-use app shows the National Lottery numbers, prize breakdown information and jackpots for the following lotteries:\r\n\r\nLotto (including Plus 1, Plus 2 and Lotto Plus Raffle)\r\nEuroMillions (including EuroMillons Plus, Irish Raffle and European Millionaire Maker)\r\nDaily Million (including Daily Million Plus)\r\nTelly Bingo\r\nLotto 5-4-3-2-1 (including Plus 1 and Plus 2)\r\n\r\n\r\nThe following features are also included:\r\n\r\n\r\nTicket Checker\r\n--------------------------------------\r\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\r\n\r\n\r\nCustomisable Notifications\r\n--------------------------------------\r\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\r\n\r\n\r\nRandom Number Generator\r\n--------------------------------------\r\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on Quick Pick numbers!\r\n\r\n\r\nResults Archive\r\n--------------------------------------\r\nAccess to the full archive of results dating back to the first draw of each lottery.\r\n\r\n\r\nSettings\r\n--------------------------------------\r\nCustomise which lotteries display in the app and in which order.\r\n\r\n\r\nSupport\r\n--------------------------------------\r\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at support@irishlottery.com.",
  "summary": "Irish Lottery results for Lotto, EuroMillions, Daily Million, Telly Bingo, 54321",
  "installs": "100+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "The Lottery Company Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 31, 2020",
  "updated": 1585657448000,
  "version": "Results 1.0 (2)",
  "recentChanges": "First release",
  "appId": "com.irishlottery.results",
  "searchTerms": "lottery"
 },
 {
  "title": "Health Lottery Results",
  "description": "Get the latest results for the UK Health Lottery draws with this free app.\r\n\r\nFeatures:\r\n\r\nResults – get the latest results within minutes of the draw taking place. \r\n\r\nResults Checker – enter your ticket to see if you have matched any prizes for the last 180 days.\r\n\r\nTicket Generator – if you are short of inspiration for choosing your Health Lottery numbers, you can make use of the Random Ticket Generator, rather than relying on Quick Pick numbers.\r\n\r\nResults Archive – view all results for each draw, dating back to the very first draw in 2011.",
  "summary": "Health Lottery results delivered directly to your Android device.",
  "installs": "10,000+",
  "score": 3.19,
  "ratings": 162,
  "reviews": 46,
  "price": 0,
  "developer": "The Lottery Company Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Aug 2, 2013",
  "updated": 1424260799000,
  "version": "2.8 Play",
  "recentChanges": "Added results for Quick Pick draws.<br>Resolved small bug which may force a restart on exit.",
  "appId": "uk.co.lottery.health_lottery",
  "searchTerms": "lottery"
 },
 {
  "title": "Thai Lottery 3UP",
  "description": "Thai Lottery 3up App for Saudi Arabia and  Thai Lottery 3up Tips for Kuwait  All about Thai Lottery 3up Direct Sets Lucky Numbers Thai Lottery 3up 1 Set Thai Lotto free Tips Android App for Lotto Lovers.\r\n\r\nIf You are Thai Lotto Lovers then this Android App Thai Lottery 3UP is very useful to you.this is up to date app can provide you daily new tips and master tips and lucky numbers for win thai lottery results.\r\n\r\nthis app also provide you Live thai lottery results video and Thailand Lottery VIP Tips King Result Thai Lottery 3up Tip sixline, www thai Lotto Tip 123 4pc Fast 2nd Last Papers.\r\n\r\nSo Download this android app and write your good reviews and give us 5 star rating on play store and share with your friends and facebook groups and whatsapp and other social media.",
  "summary": "Thai Lottery 3up Saudi Arabia , Thai Lottery 3up Kuwait",
  "installs": "10,000+",
  "score": 4.796296,
  "ratings": 54,
  "reviews": 28,
  "price": 0,
  "developer": "infotechpro",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Nov 4, 2018",
  "updated": 1586684532000,
  "version": "7.0",
  "appId": "com.thai.lottery3up",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Results: US Lottery Winning Numbers",
  "description": "Lottery Results: US Lottery Winning Numbers powered by TheLottoPro.com gives you powerful access to the latest lottery results and Predictions! Gain easy access to the Latest jackpots, winning numbers, drawing history, prizes and payouts!  \r\n\r\nWinning Numbers also provides access to Multi-State games like Powerball, Mega Millions, Cash4Life, and more. \r\n\r\nThe Lotto Pro also offers Daily and Monthly Predictions for Cash 3, Pick 3, Pick 4, Cash 4, and More.  \r\n\r\nSupported States and territories: \r\n\r\nArizona (AZ) Lottery Results\r\nArkansas (AR) Lottery Results\r\nCalifornia (CA) Lottery Results\r\nColorado (CO) Lottery Results\r\nConnecticut (CT) Lottery Results\r\nDelaware (DE) Lottery Results\r\nDistrict of Columbia (DC) Lottery Results\r\nFlorida (FL) Lottery Results\r\nGeorgia (GA) Lottery Results\r\nIdaho (ID) Lottery Results\r\nIllinois (IL) Lottery Results\r\nIndiana Hoosier (IN) Lottery Results\r\nIowa (IA) Lottery Results\r\nKansas (KS) Lottery Results\r\nKentucky (KY) Lottery Results\r\nLouisiana (LA) Lottery Results\r\nMaine (ME) Lottery Results\r\nMaryland (MD) Lottery Results\r\nMassachusetts (MA) Lottery Results\r\nMichigan (MI) Lottery Results\r\nMinnesota (MN) Lottery Results\r\nMississippi (MS) Lottery Results\r\nMissouri (MO) Lottery Results\r\nMontana (MT) Lottery Results\r\nNebraska (NE) Lottery Results\r\nNew Hampshire (NH) Lottery Results\r\nNew Jersey (NJ) Lottery Results\r\nNew Mexico (NM) Lottery Results\r\nNew York (NY) Lottery Results\r\nNorth Carolina (NC) Lottery Results\r\nNorth Dakota (ND) Lottery Results\r\nOhio (OH) Lottery Results\r\nOklahoma (OK) Lottery Results \r\nOregon (OR) Lottery Results\r\nPennsylvania (PA) Lottery Results\r\nRhode Island (RI) Lottery Results\r\nSouth Carolina (SC) Lottery Results\r\nSouth Dakota (SD) Lottery Results\r\nTennessee (TN) Lottery Results\r\nTexas (TX) Lottery Results\r\nVermont (VT) Lottery Results\r\nVirginia (VA) Lottery Results\r\nWashington (WA) Lottery Results\r\nWest Virginia (WV) Lottery Results\r\nWisconsin (WI) Lottery Results\r\nWyoming (WY) Lottery Results\r\nPuerto Rico (PR) - Powerball and Local Games Lottery Results\r\nUS Virgin Islands (VI) - Mega Millions and Powerball Only Lottery Results\r\nPowerball Lottery Results\r\nMega Millions Lottery Results\r\n\r\nFeatures include: \r\nUser Profile \r\nState Default\r\nDaily Lottery predictions\r\nMonthly Lottery predictions\r\n\r\nThelottopro.com",
  "summary": "Mega Millions, Powerball, Pick 3, Cash 3, Pick 4, and State Lottery Results!",
  "installs": "100+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "IAPRange": "£0.89 - £2.79 per item",
  "developer": "Yorre LLC",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Mar 7, 2020",
  "updated": 1583599948000,
  "version": "1.0.0.2",
  "appId": "com.thelottopro.lottopro",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Machine US",
  "description": "Lottery machine simulator to draw random numbers for US lottery using physic. Best lottery number generator for US lotto or lottery. \r\n\r\n❖2by2\r\n❖5 card cash\r\n❖All or Nothing\r\n❖Badger 5\r\n❖Bank a Million\r\n❖Big Sky Bonus\r\n❖Bonus Match 5\r\n❖Cash 25\r\n❖Cash 3\r\n❖Cash 4\r\n❖Cash 5\r\n❖Cash4Life\r\n❖Cashball\r\n❖Classic Lotto\r\n❖Cowboy Draw\r\n❖Daily 3\r\n❖Daily 4\r\n❖Dakota Cash\r\n❖Easy 5\r\n❖Fantasy 5\r\n❖Georgia FIVE\r\n❖Gimme 5\r\n❖Gopher 5\r\n❖Hit 5\r\n❖Jumbo Bucks Lotto\r\n❖Keno\r\n❖Kino\r\n❖Loto Plus\r\n❖Lotto\r\n❖Lotto America\r\n❖Lotto Texas\r\n❖Lucky Day Lotto\r\n❖Lucky For Life\r\n❖Lucky Links\r\n❖Lucky Money\r\n❖Mass Cash\r\n❖Match 4\r\n❖Match 6\r\n❖Mega Millions\r\n❖Megabucks\r\n❖Midday 3\r\n❖Midday 4\r\n❖Montana Cash\r\n❖Multi Match\r\n❖Natural State Jackpot\r\n❖Northstar Cash\r\n❖Numbers\r\n❖Palmetto Cash 5\r\n❖Pick 2\r\n❖Pick 3\r\n❖Pick 4\r\n❖Pick 5\r\n❖Pick 6\r\n❖Pick 10\r\n❖Play 3\r\n❖Play 4\r\n❖Poker Lotto\r\n❖Poker Pick\r\n❖Powerball\r\n❖Quick Draw\r\n❖Quickster\r\n❖Revancha\r\n❖Road Runner Cash\r\n❖Rolling Cash 5\r\n❖Show Me Cash\r\n❖Super Cash\r\n❖Super Kansas Cash\r\n❖Super Lotto PLUS\r\n❖Take 5\r\n❖Tennessee Cash\r\n❖Texas Triple Chance\r\n❖Texas Two Step\r\n❖The Pick\r\n❖Treasure Hunt\r\n❖Very Own Megabucks\r\n❖Weekly Grand\r\n❖Wild Money\r\n❖Win 4\r\n❖Win For Life\r\n❖World Poker Tour.\r\n\r\nNote: The information contained on this app is for reference purposes only. We make no guarantee or representation as to the accuracy and/or reliability. All brands and product names referenced herein are the trademarks or registered trademarks of their respective holders. This app is not affiliated to any of the organisations linked or described.",
  "summary": "Lottery machine simulator to draw random numbers for US lottery using physic.",
  "installs": "10,000+",
  "score": 4.43,
  "ratings": 444,
  "reviews": 218,
  "price": 0,
  "developer": "Nature Droid",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Jul 11, 2017",
  "updated": 1588520032000,
  "version": "1.0.3",
  "recentChanges": "New updates to Lottery Machine US!<br><br>❖Revise Lotto to Lotto Plus for Colorado<br>❖Add Jackpot Triple Play for Florida<br>❖Add Cash Pop for Georgia, Kentucky &amp; New Jersey<br>❖Add 5 Stars Draw for Idaho<br>❖Add Lucky for Life for Nebraska<br>❖Add Pick 4 for New Mexico<br>❖Add All or Nothing for Wisconsin<br><br>Download this app and pick your own numbers today! <br>KINDLY HELP TO RATE 🌟🌟🌟🌟🌟 FOR THIS APP! <br>STAY SAFE &amp; BLESSED ALWAYS! BEST LUCK!",
  "appId": "com.naturedroid.lottomachineus",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Machine",
  "description": "Draw random lottery number for jackpot,lottery,lotto using 2D physic machine.\r\n\r\nBest custom lottery random numbers generator.\r\n\r\nYou can set your own lottery rules and generate random numbers using lottery machine simulator with 2D physics engine.\r\n \r\nEasy to use. Good luck!\r\n\r\nDisclaimer:\r\nThis app is not affiliated to any of the lottery organisation. The information contained on this app is for reference purposes only. We make no guarantee or representation as to the accuracy and/or reliability.",
  "summary": "Draw random lottery number for jackpot,lottery,lotto using physic machine.",
  "installs": "10,000+",
  "score": 3.94,
  "ratings": 233,
  "reviews": 118,
  "price": 0,
  "developer": "Nature Droid",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Jul 22, 2017",
  "updated": 1589099642000,
  "version": "1.0.2",
  "recentChanges": "Download this app today to generate random numbers!<br>Let us know if you love this app!  Stay blessed!",
  "appId": "com.naturedroid.lotterymachine",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Mills",
  "description": "Lottery Mills gives you various features which you can use to win more. You can check lottery results, find frequency & ranks of Pick 3 or Pick 4 digits, get instant notifications when your number comes up in a draw, save the history of your draws, play a game simulating actual lottery potential earnings and post your winnings on Facebook...\r\n\r\nHere are the features of this app:\r\n- Get latest pick 3 & 4 draw results\r\n- Calculate frequency and ranks of the digits 0-9 for all states, based on last 10 draws \r\n- Calculate numbers from a given rank\r\n- Show your lucky number (for pick 3 and pick 4)\r\n- Track your games, save the history of all draws you have made, your winnings and wagers\r\n- Get notification when your number comes up in a draw\r\n- Post your winnings to facebook\r\n- Find all combinations of pick 3 or pick 4 numbers\r\n- Find all permutations of pick 3 or pick 4 numbers\r\n- Create, edit or delete notes",
  "summary": "Lottery Mills gives you various features which you can use to win more",
  "installs": "5,000+",
  "score": 4.677419,
  "ratings": 62,
  "reviews": 22,
  "price": 0,
  "IAPRange": "£0.79 - £0.89 per item",
  "developer": "Milzyparadise",
  "genre": "Entertainment",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Aug 10, 2013",
  "updated": 1585182173000,
  "version": "6",
  "appId": "cubi.rafi.lotto",
  "searchTerms": "lottery"
 },
 {
  "title": "Today Lucky Numbers",
  "description": "Your Today Lucky Numbers are calculated based on your date of birth. Determine your Lucky numbers, Lucky colours, Lucky dates and Lottery numbers using this App. Enter your date of birth and press 'Show My Number'.\r\n\r\nPS: This App also provides Daily Horoscopes Free for Every Zodiac Sign",
  "summary": "Determine your Lucky numbers using this App",
  "installs": "500,000+",
  "score": 4.3786077,
  "ratings": 5930,
  "reviews": 2611,
  "price": 0,
  "developer": "TVAGroup",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Jul 1, 2013",
  "updated": 1583954443000,
  "version": "1.0.0",
  "appId": "com.luckynumber",
  "searchTerms": "lottery"
 },
 {
  "title": "My Lottery App",
  "description": "To randomly generate lottery numbers and you can enter past winning numbers to show you the most used numbers",
  "summary": "To randomly generate lottery numbers",
  "installs": "10,000+",
  "score": 3.7857144,
  "ratings": 42,
  "reviews": 19,
  "price": 0,
  "IAPRange": "£0.79 per item",
  "developer": "BLAM Apps",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Feb 16, 2018",
  "updated": 1560247839000,
  "version": "1.0.1",
  "recentChanges": "updated so you can add past winning numbers to show you the most used numbers in the past",
  "appId": "com.leadconcept.lottery",
  "searchTerms": "lottery"
 },
 {
  "title": "Mega Millions Lottery Result",
  "description": "About Mega Millions Lottery \r\n-----------------------------------------------------------------\r\n\r\nMega Millions began on August 31, 1996 under the name of Big Game. The first draw took place on September 6, 1996, with the participation of six states: Georgia, Illinois, Maryland, Massachusetts, Michigan and Virginia.\r\n\r\nAfter an exciting growth of the game in 1997, a draw was added on Tuesday in February 1998. Players had a greater choice of numbers and a \"cash payment\" option in January 1999. In May 1999, New Jersey became the seventh Member State.\r\n\r\nIn May 2002, the multi-state game received the new name of \"Mega Millions\". New York and Ohio became Member States. The game's matrix and prize amounts were modified to give players more excitement.\r\n\r\nIn September 2002, Washington became the 10th Member of the League, followed by Texas in December 2003. In June 2005, the California was on the 12th anniversary, consolidating Mega Millions in that country's most-played multi-stage jackpot game.\r\n\r\nOn January 31, 2010, 23 other state lotteries joined Mega Millions following the signing of a historic cross sell agreement between Mega Millions and Powerball. With the addition of additional lotteries since, Mega Millions is now played in 46 jurisdictions: 44 states plus the District of Columbia and the US Virgin Islands.\r\n\r\nOn March 30, 2012, Mega Millions made history by winning the world's largest prize of all jackpot games: $ 656 million. The jackpot was I spotted in three games, winning tickets in Illinois, Kansas and Maryland. This record in the lottery industry lasted nearly four years until it was overshadowed for a jackpot of $ 1.586 billion in Powerball in January 2016; Mega Millions joins the $ 1 billion club on October 23, 2018.",
  "summary": "Mega Millions Lottery Result App",
  "installs": "10,000+",
  "score": 4.5,
  "ratings": 68,
  "reviews": 29,
  "price": 0,
  "developer": "Fab App Solutions",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Jan 6, 2019",
  "updated": 1586251701000,
  "version": "2.1.2.0",
  "recentChanges": "Fixed Bugs",
  "appId": "com.Mega.Millions.Lotto.Result.usa",
  "searchTerms": "lottery"
 },
 {
  "title": "Pick 3 Lottery Wheeler",
  "description": "Win More with the New and Improved Pick 3 Lottery Wheeler!\r\n\r\nPick 3 Lottery Wheeler is a wheeling system for Pick 3 style lotteries, where players pick 3 numbers for a chance to win. \r\n\r\nFully customizable, Pick 3 Wheel allows you to select between 1 and 10 numbers and generates all the ticket combinations from the selected numbers.\r\n \r\nInclude or exclude duplicate and triples in your wheeled numbers such as 3-2-2 or 3-3-3.\r\n\r\nUse the Quick Pick feature to automatically have Pick 3 Lottery Wheeler generate number combinations for you.\r\n\r\nSave your favorite picks with memorable names to replay those lucky numbers that can't seem to lose.\r\n\r\nShare you wheeled lottery picks with friends directly from the app.\r\n\r\nTicket combinations can be copied directly from the app by long pressing and pasted into other applications such as email, facebook, SMS/MMS, etc.\r\n\r\nSamsung Multi Window Compatible!\r\n \r\nPick 3 Lottery Wheeler is for Entertainment Purposes Only. Pick 3 Lottery Wheeler does not guarantee the winning of any lottery, but it does allow you to play tickets in a way that MAY increase your odds of winning.",
  "summary": "Win More with the New and Improved Pick 3 Lottery Wheeler!",
  "installs": "50,000+",
  "score": 4.25,
  "ratings": 220,
  "reviews": 73,
  "price": 0,
  "developer": "Big Dog APK",
  "genre": "Productivity",
  "contentRating": "PEGI 3",
  "released": "Jun 30, 2013",
  "updated": 1377827137000,
  "version": "1.03",
  "recentChanges": "6/30/2013 - v1.01: Improvements to Multi Window Support<br>6/30/2013 - v1.00: Initial Release with support for Samsung Multi Window",
  "appId": "com.bigdogapk.pick3lotterywheeler",
  "searchTerms": "lottery"
 },
 {
  "title": "TCHALAM: Lottery with Haitian Spiritual Numbers",
  "description": "TCHALAM merges Haitian cultural and ancestral methods of Numerology with mobile technology to improve your odds at winning the lottery.\r\n\r\nTCHALAM uses your dreams and provides a numerical meaning to each element they contain with the help of a list known as \"tchala\". This interpretation reveals valuable messages hidden in your premonitory dreams that can be used to play number games such as the lotto, and raffles. The application also displays the latest lottery results, and a history of lottery drawings. A statistics section displays the attraction between different cosmic numbers to better predict future winning numbers.",
  "summary": "Using premonitory dreams and the list of tchala to win prizes",
  "installs": "100,000+",
  "score": 4.4507575,
  "ratings": 2663,
  "reviews": 1252,
  "price": 0,
  "developer": "Kasik Software",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Aug 24, 2017",
  "updated": 1585401868000,
  "version": "1.7.6",
  "recentChanges": "Bugs fix.",
  "appId": "com.innovlab.tchalam",
  "searchTerms": "lottery"
 },
 {
  "title": "Online Lottery and Lotto Jackpot News",
  "description": "Lottery News is a mobile lottery app that provides coverage of lottery drawings, lottery winnings, Powerball, Mega Millions, Lottery Sambad, Pick 3, Pick 4, Pick 5, plus other lottery and lotto products, including lotto odds, lotto jackpots, lottery syndicates, online lotteries and lotto bets.\r\n\r\nAs a lottery information news source, we provide live coverage of lottery, lotto and loto news (terminology varies). In the US, we cover state lotteries like the FL lottery (Florida lottery), AZ lottery (Arizona lottery), AR lottery (Arkansas lottery), CA lottery (California lottery), CO lottery (Colorado lottery), CT lottery (Connecticut lottery), DE lottery (Delaware lottery), DC lottery (Washington DC lottery), GA lottery (Georgia lottery), ID lottery (Idaho lottery), IL lottery (Illinois lottery), IN lottery (Indiana lottery), IA lottery (Iowa lottery), KS lottery (Kansas lottery), KY lottery (Kentucky lottery), LA lottery (Louisiana lottery), ME lottery (Maine lottery), MD lottery (Maryland lottery), MA lottery (Massachusetts lottery), MI lottery (Michigan lottery), MN lottery (Minnesota lottery), MI lottery (Mississippi lottery), MO lottery (Missouri lottery), MT lottery (Montana lottery), NE lottery (Nebraska lottery), NH lottery (New Hampshire lottery), NJ lottery (New Jersey lottery), NM lottery (New Mexico lottery), NY lottery (New York lottery), NC lottery (North Carolina lottery), ND lottery (North Dakota lottery), OH lottery (Ohio lottery), OK lottery (Oklahoma lottery), OR lot tery (Oregon lottery), PA lottery (Pennsylvania lottery), PR lottery (Puerto Rico lottery),RI lottery (Rhode Island lottery), SC lottery (South Carolina lottery), SD lottery (South Dakota lottery), TN lottery (Tennessee lottery), TX lottery (Texas lottery), USVI lottery (U.S. Virgin Islands lottery), VT lottery (Vermont lottery), VI lottery (Virginia lottery), WA lottery (Washington lottery), WV lottery (West Virginia lottery), WI lottery (Wisconsin lottery) and the WY lottery (Wyoming lottery).\r\n\r\nLottery games we cover: Mega Millions, Powerball, joint U.S. lotteries: 2by2, All or Nothing, Cash4Life, Lotto America, Lucky for Life and the Tri-State Lottery (Megabucks Plus, Pick 3 (Day & Night), Pick 4 (Day & Night), Fast Play) offered in Maine, New Hampshire and Vermont.\r\n\r\nIn Australia, we cover Lott and Lotterywest Australian lotteries, including: Saturday Lotto, Tattslotto, Gold Lotto, X Lotto,Monday & Wednesday Lotto, Oz Lotto, Super 7's Oz Lotto, Oz 7 Lotto and Australian Powerball. We also feature games by South Australian Lotteries: Lucky Keno, SA Lotteries Keno, Keno Racing and Set For Life, Australia's newest lottery plus Super 66, Lotto Strike, State Lotto Draws like Lotto Strike, Cash 3, as well as Draw Lotteries (Lucky Lotteries, LuckySA Lottery), former lottery games like SA Lotto, previously known as Cross Lotto or X Lotto, Wednesday Tattslotto, Wednesday Gold Lotto, Casket  (or the $2 Casket), Tatts 2, Tatts Keno, Intralot, Lucky Bingo Star, Lucky Lines, Lucky 5 Red or Black, Lucky 3, Lucky Keno, Australian Soccer Pools. Australian lottery companies offer \"Scratchies\", Superdraw and Prize Home Lottery.\r\n\r\nOther lottery markets: Lotto 6/49, Lotto Max, Lotto Super 7, Daily Grand, Millionaire Life (Canada); the Spanish Christmas Lottery, SuperEna Lotto (Italy), Mifal HaPayis (Israel), the Liechtenstein Lottery; Lotto 6aus49, Super6, Spiel77 and Glücksspirale (Germany); the Thai lottery, the Mexican Lotería Nacional, the National Lottery (Lotto Hotpicks, Thunderball, Set For Life, EuroMillions, EuroMillions HotPicks,UK Millionaire Maker) and The Health Lottery in the UK as well as discontinued games (Lotto Extra, Dream Number, Daily Play, Lotto Plus 5, Vernons Easy Play, Big Draw and Millionaire Raffle); Indian Lottery: Lotto India, Karunya Plus, Dear Treasure Morning, Jaldi 5, Jaldi 5 Double, Lottery Sambad (lottery sambad nagaland, rajshree lottery sambad) Kerala lottery, Goa State lottery, Sikkimv lottery, Playwin lottery and Punjab lottery.",
  "summary": "Online Lottery News is a mobile lottery app that provides lottery news coverage.",
  "installs": "10,000+",
  "score": 4.3809524,
  "ratings": 63,
  "reviews": 33,
  "price": 0,
  "developer": "Mobcast Ltd.",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Sep 16, 2019",
  "updated": 1572014488000,
  "version": "5.4.3",
  "recentChanges": "Updated UX",
  "appId": "co.lotterynews",
  "searchTerms": "lottery"
 },
 {
  "title": "Lucky Lotto UK WIN REAL MONEY It's your LUCKY DAY!",
  "description": "Lucky Lotto is a new FREE game where you can WIN REAL MONEY. See if today is your lucky day! If you dream of a big cash payout from EURO Millions,  Mega Millions, Keno, Powerball, and scratchers, this daily lottery sweepstakes game is for you! It’s from the makers, of Lucky Scratch, so you know it’s legit and pays out real money daily. \r\n\r\nLucky Lotto is 100% free to download and play with no in-app purchases or deposits to win real cash. \r\n\r\nLucky Lotto Features:\r\n✔ Free to play\r\n✔ WIN REAL MONEY up to £10,000\r\n✔ HUGE jackpots\r\n✔ Choose 4 lucky lotto numbers every day\r\n✔ Fast and fun random number picker\r\n✔ Enter 2nd Chance Sweepstakes to win your choice of real gift cards from top brands like: VISA, Mastercard, Dunkin Donuts, Dominos Pizza, Amazon, and many more!\r\n✔ The TRUSTED daily lottery app because it’s from the makers of Lucky Scratch\r\n\r\nBe sure to follow us on social media for more fun and sweet prize giveaways!\r\nFacebook: @luckylottoapp\r\nInstagram: @luckylottoapp\r\n\r\nFor support please email us at:  support@luckylottoapp.com\r\n\r\nThese sweepstakes are devised as non-gambling promotions and are intended solely for entertainment purposes.\r\n\r\n*Google Inc. does not sponsor, nor is any way affiliated with Lucky Lotto and/or the sweepstakes prizes.",
  "summary": "Play the UK&#39;s Free Daily Lottery to win real money up to £10,000",
  "installs": "10,000+",
  "score": 3.64,
  "ratings": 123,
  "reviews": 41,
  "price": 0,
  "developer": "Lucky Scratch & Other Apps by Fort Mason Games",
  "genre": "Casino",
  "contentRating": "PEGI 3",
  "released": "Nov 11, 2019",
  "updated": 1574726207000,
  "version": "5.0.0",
  "recentChanges": "Play every day to win big!",
  "appId": "com.luckylottoapp.free.lotto.winrealmoney.luckyday.daily",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Machine for EuroMillions",
  "description": "Generate number for Euromillions lottery using physic lottery machine.\r\nThe machine will draw 5 numbers from 1 to 50 and 2 Lucky Stars from 1 to 12.\r\n\r\nYou can adjust the time you want for each draw.\r\n\r\nDon't know what number to buy? Generate your lucky number today. Good luck.\r\n\r\nDisclaimer:\r\nAll brands and product names referenced herein are the trademarks or registered trademarks of their respective holders. This app is not affiliated to any of the organisations linked or described. The information contained on this app is for reference purposes only. We make no guarantee or representation as to the accuracy and/or reliability.",
  "summary": "Generate lottery number for Euromillions lottery using physic lottery machine.",
  "installs": "5,000+",
  "score": 4.2714286,
  "ratings": 70,
  "reviews": 32,
  "price": 0,
  "developer": "Nature Droid",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Jul 30, 2017",
  "updated": 1519485483000,
  "version": "1.0.0",
  "recentChanges": "Download today and try to draw random number for Euromillions lottery using physic lottery machine.<br>Rate 🌟🌟🌟🌟🌟 if you like this app! Thanks &amp; Good luck!",
  "appId": "com.naturedroid.euronumber",
  "searchTerms": "lottery"
 },
 {
  "title": "lottery number generator uk",
  "description": "UK lottery number generator app.\r\nQuick and fast to use, helps to pick your lottery numbers.\r\n\r\nFor better odds of winning the lottery this app will pick 6 numbers at random for your lottery ticket.\r\n\r\nGood luck!",
  "summary": "Helps to pick your lottery numbers 1-59",
  "installs": "10,000+",
  "score": 4.5,
  "ratings": 26,
  "reviews": 7,
  "price": 0,
  "developer": "Cosmicbuzz-Studio",
  "genre": "Casual",
  "contentRating": "PEGI 3",
  "released": "Feb 14, 2017",
  "updated": 1489081594000,
  "version": "1.0",
  "appId": "couk.Cosmicbuzz.LottoNumbers",
  "searchTerms": "lottery"
 },
 {
  "title": "LotteryHUB - Powerball Lottery",
  "description": "Full Description:\r\n\r\nLotteryHUB for Powerball, Mega Millions and US Lottery Games\r\n- Track Mega Millions, Powerball, and state lottery results easily\r\n- Enter your Mega Millions and Powerball tickets into the app for tracking and convenient display of winning numbers\r\n- Jackpot information at your fingertips\r\n- Catch up on missed lottery drawings and winning results\r\n\r\nDec. 27, 2018 -- Version 5.2.3 \r\n- Updated API/Backend for Ticket Tracking\r\n- Bug Fixes",
  "summary": "LotteryHUB - Powerball, Mega Millions &amp; US Lottery Games",
  "installs": "500,000+",
  "score": 3.8676236,
  "ratings": 6311,
  "reviews": 2235,
  "price": 0,
  "developer": "Shoutz Inc",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Feb 9, 2013",
  "updated": 1545947809000,
  "version": "5.2.5",
  "recentChanges": "Bug Fixes.",
  "appId": "com.shoutz.shoutzapp",
  "searchTerms": "lottery"
 },
 {
  "title": "DC Lottery Results",
  "description": "Get the latest DC lottery results within minutes of the draws taking place. This easy-to-use app includes the following lotteries:\r\n\r\nPowerball\r\nMega Millions\r\nLucky for Life\r\nDC2\r\nDC3\r\nDC4\r\nDC5\r\n\r\nPowerball and Mega Millions also include a full breakdown displaying the number of winners and amount paid out for each prize level.\r\n\r\n\r\nThe following features are also included:\r\n\r\n\r\nTicket Checker\r\n----------------------------\r\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\r\n\r\n\r\nCustomizable Notifications\r\n----------------------------\r\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\r\n\r\n\r\nRandom Number Generator\r\n-----------------------------\r\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on house numbers and anniversary dates!\r\n\r\n\r\nResults Archive\r\n----------------------------\r\nAccess to the full archive of results dating back to the first draw of each lottery.\r\n\r\n\r\nSettings\r\n----------------------------\r\nCustomise which lotteries display in the app and in which order.\r\n\r\n\r\nSupport\r\n----------------------------\r\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at contact@lottery.net.\r\n\r\n\r\n----------------------------\r\nPlayers must be 18 or over to download this app. App Terms and Conditions apply.\r\n\r\nGambling can be addictive. Play responsibly.",
  "summary": "Lottery results for Powerball, Mega Millions and DC lottery games",
  "installs": "100+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "The Lottery Company Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Feb 12, 2020",
  "updated": 1581694679000,
  "version": "DC Lottery 1.0 (10002)",
  "recentChanges": "First release of the app.",
  "appId": "net.lottery.dc",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Wheeling",
  "description": "Lottery Wheeling allow you to choose a large group of lottery numbers and play scientific combinations of those numbers to get a specific win guarantee if some or all of the winning lottery numbers are in that group.\r\n\r\nThis is the only tool designed to help boost your chances to win easier.\r\nThis Lottery Wheeling system works with ALL Pick-5, 6, 10 and 15 lotto games.\r\n\r\nIf you already like to use lottery wheeling systems, you are going to love using this APP. \r\n\r\nThen why use lottery wheeling systems?\r\nSerious lotto players use lottery wheeling systems to lower their odds against dramatically in hopes of winning. \r\nThe main point is you need to use a lottery system, it’s just fact.\r\n\r\nMake sure you have enough money left to at least pay your utility bills, after purchasing the tickets.\r\n\r\nHelp us improve the translation of this app in case of mistranslation send us an email support@roncosoft.com.br.",
  "summary": "Allow you to choose a large group of lottery numbers and play combinations.",
  "installs": "5,000+",
  "score": 4.1,
  "ratings": 30,
  "reviews": 21,
  "price": 0,
  "developer": "Ronco Software",
  "genre": "Entertainment",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Gambling",
  "released": "Sep 20, 2016",
  "updated": 1581356046000,
  "version": "1.5",
  "recentChanges": "Improvements for Android 9",
  "appId": "br.com.roncosoft.lotterywheeling",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery result sambad - Nagaland lottery results",
  "description": "Lottery sambad App\r\nLottery result apps - Nagaland lottery results.\r\nThis app is a result news of Lottery sambad. West bengal lottery sambad also Sikkim lottery sambad. This is a free android application of Nagaland lottery result, Sikkim lottery result app and West bengal lottery result. In this application we publish per day time to time Nagaland lottery sambad, west bengal lottery sambad and Sikkim lottery result app. We give live updates of lottery result daily. We are the fastest lottery result publisher. We deliver result before any other app publishes sikkim lottery result and sambad. You will find the result inside app.\r\n\r\n\r\nDisclaimer :\r\nThis Lottery sambad results app is an unofficial, it's not connected to any State Lottery sambad board. We just collect this results from open-source third party sites, we also suggest to you that please again check the result with official published results.\r\n\r\nDownload this application and enjoy it.",
  "summary": "Get Lottery Sambad Result App on your smartphone.",
  "installs": "1,000+",
  "score": 3.3333333,
  "ratings": 6,
  "reviews": 4,
  "price": 0,
  "developer": "Techno Bits",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Dec 14, 2019",
  "updated": 1582456418000,
  "version": "1.5",
  "recentChanges": "Major Bug Fix.<br>Logo Changed.<br>Add Lottery Sambad",
  "appId": "com.lotteryresults.sambad",
  "searchTerms": "lottery"
 },
 {
  "title": "UK Lottery Result",
  "description": "All UK Lottery Results In One App\r\n\r\n** Facilities **\r\n1 : you can add UK Lottery Results Website In This App\r\n2: you can make UK Lottery A-Z Sort\r\n3: You can Delete Any UK Lottery Results Site\r\n4: You Can Make Favorite List\r\n5 : You can make This App Open With Favorite List\r\n6: you can Reset And default This App\r\n7 : You Can Share UK Lottery Results Any Social Media \r\n8: You can Refresh News site\r\nand Any More facilities Available In this UK Lottery Results App",
  "summary": "All UK Lottery Results In One App",
  "installs": "500+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "Fab App Solutions",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Jun 19, 2019",
  "updated": 1585037573000,
  "version": "1.2.4.6.9.3",
  "recentChanges": "Fixed Bugs Add Powerful Browser To This App",
  "appId": "com.siwhele.uklottery.result",
  "searchTerms": "lottery"
 },
 {
  "title": "How To Play Lotto - Win The Lottery",
  "description": "Are you looking for lucky lotto numbers or method to play lotto.\r\nInside you will find the tips and tricks to win the lottery.\r\nYou will find lottery tips in video format.\r\n\r\nHow Can I Win The Lottery?\r\nSimple. Get this app and follow the process to increase your chances of winning the lottery.\r\nIf you are looking for some secret to win the lotto, then we have revealed that inside.\r\nYes, winning can bring you good amount of cash but you need to follow a process and this app will help you in following the process.\r\nSo, install this lottery tips app and make the best use of it.\r\n\r\nWe hope that you will like it.",
  "summary": "Great tips if winning the lottery is in your mind.",
  "installs": "1,000+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "Supercharge App",
  "genre": "Lifestyle",
  "contentRating": "PEGI 3",
  "released": "Feb 5, 2018",
  "updated": 1517837197000,
  "version": "1.0",
  "appId": "com.adminapps.android5a72a19119aab",
  "searchTerms": "lottery"
 },
 {
  "title": "LA Lottery Results",
  "description": "The best, fast, FREE Android app for Louisiana lottery results for the following draw games: \r\n\r\n * Powerball\r\n * Mega Millions\r\n * Lotto\r\n * Easy 5\r\n * Pick 4\r\n * Pick 3\r\n\r\nQuickly and easily scroll through all Louisiana lotto draw game results - no need to navigate through multiple menus to find game results.\r\n\r\nNumber history\r\nGenerate Quick Picks - Randomly generate picks for games\r\nPayouts for select games\r\nFrequency of drawn balls for select games\r\n\r\nAd supported",
  "summary": "LA Lottery draw game results in a single, easy-to-read list. Quick Accurate Free",
  "installs": "100+",
  "score": 4.714286,
  "ratings": 7,
  "reviews": 2,
  "price": 0,
  "developer": "Matthew Saavedra",
  "genre": "Entertainment",
  "contentRating": "PEGI 16",
  "contentRatingDescription": "Strong Language",
  "released": "Apr 7, 2019",
  "updated": 1583433050000,
  "version": "1.0.3",
  "recentChanges": "More connectivity bug fixes",
  "appId": "com.saavro.lalotto",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Scratch Off EVO",
  "description": "Lottery Scratch Off EVO is the best scratchers games.\r\n\r\nThere are several popular casino style lottery tickets like Poker, Slots, Blackjack, Roulette, 777…and more.\r\n\r\nLots of scratch-offs you can scratching for free.\r\n\r\nHit the JACKPOT and become a Lottery Scratch-Off game WINNER!\r\n\r\nTry your luck today!!\r\n\r\nOnly for entertainment purpose and could not win real money from this game.\r\n\r\n- This game is intended for an adult audience for entertainment purposes only. Success at this game does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "summary": "No.1 lottery scratch off game!<br>Like playing real scratch offs!",
  "installs": "100,000+",
  "score": 4.52,
  "ratings": 4277,
  "reviews": 839,
  "price": 0,
  "developer": "YouSee Design",
  "genre": "Card",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Sexual Innuendo",
  "released": "Dec 5, 2014",
  "updated": 1580790136000,
  "version": "Varies with device",
  "recentChanges": "Enhance performance.",
  "appId": "com.yousee.scratchfun_xmas",
  "searchTerms": "lottery"
 },
 {
  "title": "ME Lottery Results",
  "description": "The best, fast, FREE Android app for Maine lottery results for the following draw games: \r\n\r\n * Powerball\r\n * Mega Millions\r\n * Gimme 5\r\n * Tri-State Megabucks Plus\r\n * Lotto America\r\n * Lucky for Life\r\n * Tri-State Pick 4\r\n * Tri-State Pick 3\r\n\r\nQuickly and easily scroll through all Maine lotto draw game results - no need to navigate through multiple menus to find game results.\r\n\r\nNumber history\r\nGenerate Quick Picks - Randomly generate picks for games\r\nPayouts for select games\r\nFrequency of drawn balls for select games\r\n\r\nAd supported",
  "summary": "ME Lottery draw game results in a single, easy-to-read list. Quick Accurate Free",
  "installs": "100+",
  "score": 5,
  "ratings": 8,
  "reviews": 1,
  "price": 0,
  "developer": "Matthew Saavedra",
  "genre": "Entertainment",
  "contentRating": "PEGI 16",
  "contentRatingDescription": "Strong Language",
  "released": "Apr 12, 2019",
  "updated": 1583433727000,
  "version": "1.0.3",
  "recentChanges": "More connectivity bug fixes",
  "appId": "com.saavro.melotto",
  "searchTerms": "lottery"
 },
 {
  "title": "Oregon Lottery Results",
  "description": "Get the latest Oregon lottery results within minutes of the draws taking place. This easy-to-use app includes the following lotteries:\r\n\r\nMegabucks\r\nPowerball\r\nMega Millions\r\nWin for Life\r\nPick 4\r\nLucky Lines\r\n\r\nMegabucks, Powerball and Mega Millions also include a full breakdown displaying the number of winners and amount paid out for each prize level.\r\n\r\n\r\nThe following features are also included:\r\n\r\n\r\nTicket Checker\r\n----------------------------\r\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\r\n\r\n\r\nCustomizable Notifications\r\n----------------------------\r\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\r\n\r\n\r\nRandom Number Generator\r\n-----------------------------\r\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on house numbers and anniversary dates!\r\n\r\n\r\nResults Archive\r\n----------------------------\r\nAccess to the full archive of results dating back to the first draw of each lottery.\r\n\r\n\r\nSettings\r\n----------------------------\r\nCustomise which lotteries display in the app and in which order.\r\n\r\n\r\nSupport\r\n----------------------------\r\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at contact@lottery.net.\r\n\r\n\r\n----------------------------\r\nPlayers must be 18 or over to download this app. App Terms and Conditions apply.\r\n\r\nGambling can be addictive. Play responsibly.",
  "summary": "Lottery results for Powerball, Mega Millions and Oregon lottery games",
  "installs": "100+",
  "score": 0,
  "ratings": 0,
  "reviews": 0,
  "price": 0,
  "developer": "The Lottery Company Limited",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Jan 31, 2020",
  "updated": 1580479413000,
  "version": "OR Lottery 1.0 (297)",
  "recentChanges": "First release of the app.",
  "appId": "net.lottery.oregon",
  "searchTerms": "lottery"
 },
 {
  "title": "LottoSmart lottery draws and statistics",
  "description": "ALL THE MOST POPULAR LOTTERIES IN ONE APP\r\n\r\nLottoSmart is an app that offers the convenience of having anywhere with you the latest draws, numbers and statistics of the most popular lotteries in the world. The list, constantly updated, currently includes:\r\n\r\n====Africa====\r\nSouth Africa National Lottery\r\nSouth Africa Powerball\r\nKenyan My Lotto\r\n\r\n====Asia====\r\nSingapore Toto Lottery\r\nLotto Hong Kong\r\nBrazil\r\nBrazilian Mega Sena Lottery\r\nBrazilian Quina Lottery\r\nCanada\r\nCanadian Lottery 649\r\n\r\n====Europe====\r\nSwiss Lotto\r\nGreek Lotto\r\nFrench \"Loto\"\r\nGerman Lottery 6Aus49\r\nEurojackpot\r\nRomanian Lottery\r\nAustrian Lotto 6 aus 45\r\nEuroMillions\r\nHungarian Hatoslottó\r\nHungarian Ötöslottó\r\nPoland Lottery\r\n \r\n\r\n===India===\r\nIndia Saturday Super Lotto\r\nIndia Thursday Super Lotto\r\nIndia Jaldi 5\r\nIndia Jaldi 5 Double\r\nIndia Thunderball\r\n\r\n\r\n====Ireland====\r\nNational Lottery \r\nNational Lottery Plus 1 \r\nNational Lottery Plus 2\r\n\r\n====Italy====\r\nLotto Italiano\r\nSuperEnalotto\r\nWinForLife\r\nSi Vince Tutto SuperEnalotto\r\n10 e Lotto Tradizionale\r\n10 e Lotto 5 minuti\r\nVinciCasa\r\nMillion Day\r\n\r\n====Oceania====\r\nAustralian TattsLotto \r\nAustralian OZ Lotto \r\nNew Zealand Powerball \r\n\r\n====Spain====\r\n BonoLoto\r\n El Gordo\r\n La Primitiva\r\n\r\n====UK====\r\nUK 49's\r\nLotto UK National\r\n\r\n====USA====\r\nPowerball\r\nNew York Lottery\r\nWisconsin's Megabucks\r\nFlorida Lottery\r\nLotto 47 Michigan\r\nHot Lotto\r\nCalifornia SuperLotto Plus\r\nOregon Megabucks\r\nLucky For Life\r\nCash4Life\r\nLotto Texas\r\nArizona Lottery The Pick\r\nPennsylvania Match 6\r\nOhio Lottery Classic Lotto\r\nIllinois Lotto\r\nNew Jersey Pick 6\r\nLotto Indiana Hoosier\r\n\r\n===Central America===\r\nCaribbean Super Lotto\r\nJamaica Lotto\r\nJamaica Lucky 5\r\n\r\n\r\nLottoSmart was born from over ten years of Lottodesk experience, the most comprehensive PC software of statistical and systems applied to numerical games.\r\n\r\nWe are working to extend the games can be managed by the application.\r\n\r\nHere below are some of the features that make LottoSmart unique:\r\n\r\nIntuitive graphical\r\nDraws, overdue numbers, lottery wheels, utility at a glance.\r\n\r\nUseful and exclusive features\r\n- Overdue numbers table\r\n- Overdue pairs table\r\n- Most overdue triplets, quadruplets, quintuplets, sextuplets to match 2 numbers.\r\n- Top historical overdues ever achieved of numbers, pairs, triplets, quadruplets, quintuplets to match one number.\r\n- Numbers Search to find overdues and latest draws specified by user.\r\n- Overdues board.\r\n- Lottery wheels development.\r\n- Save your tickets of each game and highlight them in draw tables\r\n- Random numbers (generated with Mersenne Twister algorithm) to try your luck!\r\n\r\nPush notifications\r\nYou can receive a real time notification when new draws are available.\r\n\r\nEasy to use\r\nsimple and quick menu to access all the available lotteries.\r\n\r\nHelp by LottoDesk\r\nHave you a problem? Helpful support exclusive for you.\r\n\r\nSafe and Secure\r\nIt does not need access to your address book or personal data.\r\n\r\nConnected with the World\r\nSeamlessly integrated with the web it needs very little resources.\r\n\r\nFor more ideas!\r\nThe app was recently born and it is constantly updated to improve the existing features and to insert new ones.\r\nGive us feedback and suggestions on what would you consider useful or contact us to describe any problems.",
  "summary": "Latest draws and statistics of the most popular lotteries in the World",
  "installs": "10,000+",
  "score": 4.0875,
  "ratings": 80,
  "reviews": 43,
  "price": 0,
  "developer": "LottoDesk",
  "genre": "Entertainment",
  "contentRating": "PEGI 3",
  "released": "Feb 23, 2017",
  "updated": 1563915750000,
  "version": "2.0.44",
  "recentChanges": "Minor fixes.",
  "appId": "com.iokx.lottosmart",
  "searchTerms": "lottery"
 },
 {
  "title": "Scratch Card Billionaire Lottery",
  "description": "Scratch Card Billionaire! is an awesome free scratch card game. Do you want to know how much lucky are you?\r\n\r\nYou can choose and play with scratch cards inspired by the most famous casino games as poker, slots or blackjack and many others.\r\n\r\nEach scratch card has its own price, lucky, rewards and rewards probability distribution: search the bests scratch cards to earn more virtual money!\r\nYou can spend your virtual money buying scratch cards, buying lucky boxes to increment your lucky, or buying bigger coins to scratch faster.\r\n\r\nNOTE: You cannot win real money in this game!",
  "summary": "Scratch Card Billionaire is a virtual version of the famous scratch card games",
  "installs": "1,000+",
  "score": 4.0588236,
  "ratings": 17,
  "reviews": 4,
  "price": 0,
  "IAPRange": "£2.49 - £10.99 per item",
  "developer": "Foes",
  "genre": "Casino",
  "contentRating": "PEGI 18",
  "contentRatingDescription": "Real Gambling/Paid Contests, Simulated Gambling",
  "released": "Jul 16, 2019",
  "updated": 1569569430000,
  "version": "1.0.1",
  "recentChanges": "Bug Fixed",
  "appId": "com.cuzw.foes.scratchcard.billionaire",
  "searchTerms": "lottery"
 },
 {
  "title": "Kerala Lottery Results",
  "description": "Kerala Lottery Results Live Daily At 3.07 PM and official Results Will be Live at 4.30 PM \r\n\r\nTypes Of Lottery Results We Publish :\r\nPournami \r\nWin Win \r\nSthree Sakthi \r\nAkshaya \r\nKarunya Plus \r\nNirmal \r\nKarunya \r\nNewyear bumper \r\nSummer bumper \r\nPooja bumper \r\nThiruvonam bumper \r\nChristmas bumper \r\nVishu bumper \r\n\r\nThis is not the Official Lottery Result App We Publish the Accurate results of kerala lottery results at 3.00 & 4.00 PM and You Can Refresh in the App To get The Results As Soon As Possible.",
  "summary": "Kerala Lottery Results (3.07 PM LIVE)",
  "installs": "1,000+",
  "score": 4.964286,
  "ratings": 28,
  "reviews": 22,
  "price": 0,
  "developer": "Trust Appz",
  "genre": "Finance",
  "contentRating": "PEGI 3",
  "released": "Jul 20, 2019",
  "updated": 1588753328000,
  "version": "1.0",
  "recentChanges": "*Search Feature Added for Lottery Prize Check<br>*Prediction Added<br>*Refresh Button Added<br>*kerala Lottery Results Live at 3.07 PM<br>*Improved User Experience",
  "appId": "com.kerala.lottery.resulttoday",
  "searchTerms": "lottery"
 },
 {
  "title": "Lotto Day®",
  "description": "The world's favourite free lottery, Lotto Day, gives you the chance to win huge jackpots every single day… simply fill in your lines with your favourite numbers!\r\n\r\nPlay up to 30 lines per draw! With three daily draws, you have up to 90 chances of winning $25K every day! Just select five numbers between 1 and 48, and 2 bonus balls, on each line.\r\n\r\nRushed for time and want to fill in your lines quickly, with no ads? Become a Lotto Day VIP! Subscribe to remove ads, save your lucky numbers to use as often as you like, and autofill 5 lines at a time!\r\n\r\nSo, why pay for a lottery ticket ever again? You can play Lotto Day for free, directly from your phone; it’s easy to play anytime, anywhere!\r\n\r\nTurn on push notifications to make sure you never miss results!\r\n\r\n\r\nFEATURES:\r\n- $25K up for grabs every day!\r\n- Three daily draws at 12pm, 4pm and 8pm (GMT).\r\n- Play up to 30 lines for each draw.\r\n- Multiple winning combinations - chances to win cash and tokens on every draw.\r\n- Use tokens to skip ads.\r\n- Become a VIP; remove ads, save your favourite numbers, and autofill five lines at a time.\r\n\r\nWhat are you waiting for? You have nothing to lose, and thousands to gain!\r\n\r\nCheck out our social pages for news, updates, and more competitions:\r\n\r\nFacebook: https://www.facebook.com/lottodayapp/\r\nInstagram: https://www.instagram.com/vikerdaygames/\r\n\r\nLEGAL\r\n\r\nGoogle is in no way involved with Lotto Day™; it does not sponsor or endorse this App or any prize redemptions.\r\n\r\nThe Lotto Day™ free lottery is funded by partnerships and advertising instead of ticket sales.\r\n\r\nLotto Day™ does not endorse or promote gambling. \r\n\r\nEntrants must be 18 or over.\r\n\r\nLotto Day™ is a free mobile app that allows users to win with no purchase necessary.\r\n\r\nLotto Day does not require any details from its players other than an email address to make payments to winners via PayPal.\r\n\r\nLotto Day™ is operated by Viker Limited, a company incorporated under English law (company number 06290437) and registered at: 200 Union St, London, SE1 0LX.\r\n\r\nFor full terms and conditions, visit: https://viker.co.uk/app-terms/",
  "summary": "Win Real Money",
  "installs": "10,000+",
  "score": 4.02,
  "ratings": 234,
  "reviews": 88,
  "price": 0,
  "IAPRange": "£4.99 per item",
  "developer": "Viker",
  "genre": "Casino",
  "contentRating": "PEGI 12",
  "contentRatingDescription": "Simulated Gambling",
  "released": "Mar 13, 2020",
  "updated": 1586444733000,
  "version": "Varies with device",
  "recentChanges": "A new update to Lotto Day with a brand new lotto draw to support our healthcare heroes! We have also made some improvements to optimise the Lotto Day experience!",
  "appId": "com.viker.lottoday2",
  "searchTerms": "lottery"
 },
 {
  "title": "CA Lottery Results",
  "description": "Quickly and easily scroll through all California lotto draw game results - no need to navigate through multiple menus to find game results.\r\n\r\n* PowerBall\r\n* MegaMillions\r\n* SuperLotto Plus\r\n* Fantasy 5\r\n* Daily 4\r\n* Daily 3 \r\n* Daily Derby  \r\n\r\nFeatures:\r\n\r\nHistory - Results of past drawings\r\nGenerate Quick Picks - Randomly generate picks for games\r\nPayouts - See the number of winning tickets sold and the associated prize amounts\r\nFrequency - See how many times a ball was drawn for 20, 50, or 100 draws\r\n\r\nAd supported",
  "summary": "CA Lottery draw game results in a single, easy-to-read list. Quick Accurate Free",
  "installs": "10,000+",
  "score": 4.41,
  "ratings": 954,
  "reviews": 270,
  "price": 0,
  "developer": "Matthew Saavedra",
  "genre": "Entertainment",
  "contentRating": "PEGI 16",
  "contentRatingDescription": "Strong Language",
  "released": "May 5, 2013",
  "updated": 1583623875000,
  "version": "4.0.6",
  "recentChanges": "Fix issue with results being unreadable when a large system font is used",
  "appId": "com.matcho0.calotto",
  "searchTerms": "lottery"
 },
 {
  "title": "Lotto Pick 3 Whiz",
  "description": "Feeling Lucky? Want a proven number generation system to compare your daily workout too or do you just need to get the fine edge on winning the Pick 3 in your state lotto, then this app is for you. It is a professional pick 3 number generation software that will help you gain the advantage.",
  "summary": "Proven Pick 3 system for ALL states to help you gain the edge on your game!",
  "installs": "100,000+",
  "score": 4.3,
  "ratings": 412,
  "reviews": 125,
  "price": 0,
  "developer": "242 Apps",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "May 22, 2014",
  "updated": 1400787688000,
  "version": "1.0",
  "appId": "myapp.mmm.lottoapp",
  "searchTerms": "lottery"
 },
 {
  "title": "World Lottery Results",
  "description": "Find out the lottery results worldwide with the World Lottery Results App. Inside we have a lotto number generator just in case your favorite picks aren't giving you luck. \r\n\r\nCopy and paste the lottery number generator in your phone with the notepad.\r\n\r\n\r\nThe list below of the biggest jackpots around \r\n\r\n> California Super Lotto\r\n> El Gordo\r\n> Eurojackpot\r\n> Euromillions\r\n> Euromillions UK\r\n> Florida Lottery\r\n> French Loto\r\n> German Lotto\r\n> Hoosier Lotto\r\n> Hot Lotto\r\n> Irish Lotto\r\n> La Primitiva\r\n> Lotto 6/49\r\n> Mega Millions\r\n> Mega Sena\r\n> New York Lottery\r\n> OZ Lotto\r\n> Powerball\r\n> Powerball Australia\r\n> Super Ena Lotto\r\n> UK National Lotto\r\n> UK Thunderball",
  "summary": "World Lottery Results",
  "installs": "10,000+",
  "score": 3.6956522,
  "ratings": 46,
  "reviews": 17,
  "price": 0,
  "developer": "Fun Games & Apps",
  "genre": "Card",
  "contentRating": "PEGI 3",
  "released": "Mar 25, 2013",
  "updated": 1541012741000,
  "version": "2.0",
  "recentChanges": "Bug fixes",
  "appId": "com.worldlottoresults",
  "searchTerms": "lottery"
 },
 {
  "title": "PowerBall and MegaMillions Statistics and Results",
  "description": "This application is very customizable.\r\nIt allows setting statistics options when you generate lucky numbers.\r\nYou can check the results in the app when you set the numbers you played.\r\nThe application uses a special algorithm using statistics of games, to generate special numbers for each draw.\r\nThis lottery application allows you to generate numbers for different lottery games around the world and you can save your own game if is not on the list.\r\nIt has popular games from Norway and the world,  with results updated after each game.\r\nIt has the feature to let you save your Favorite numbers and Excluded numbers.\r\nYou can Share your numbers with somebody else when you hit the button share.\r\nEvery time you generate numbers it will save the numbers in history and save the numbers with the date for future use.         \r\nYou can delete the draws from history that you don't want one by one or all.\r\nYou can add the Favorite numbers and Excluded numbers or delete all history.\r\nYou can save your games. When you use a game will become the first in the list.\r\nAdd the History option where you can see the previously generated numbers.\r\nYou can add games that you play and the app will let you know if you have matching numbers.",
  "summary": "Generate Lottery numbers for games with your phone from many statistics.",
  "installs": "100,000+",
  "score": 4.4220185,
  "ratings": 2200,
  "reviews": 972,
  "price": 0,
  "IAPRange": "£0.99 - £299.99 per item",
  "developer": "GEORGE",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Apr 13, 2016",
  "updated": 1582733033000,
  "version": "2.2.103d",
  "recentChanges": "Add translation. Fix bugs.",
  "appId": "com.logan19gp.dcloterry",
  "searchTerms": "lottery"
 },
 {
  "title": "Thai Lottery Lucky Numbers",
  "description": "This application is still under development. Features you see below may be unstable or unfinished (or not develop yet hahaha) but the development will be finished soon and this app will become the greatest thai lottery application ever:)\r\n\r\nFeatures<\\b>\r\n• Check lottery results back to 2 years and save the result to checking history\r\n• Verify lottery with QR code\r\n• Watch live while talking to each other\r\n• High accuracy lucky Numbers with giving history you can check\r\n• Talk, share your lottery results via lottery community\r\n• Save your lottery\r\n• Lottery statistics back to 25 years\r\n• Generate Lucky Numbers from your dream\r\n• Real time notification",
  "summary": "All in one Thai lottery application with high accuracy lucky Numbers",
  "installs": "50,000+",
  "score": 4.57,
  "ratings": 430,
  "reviews": 108,
  "price": 0,
  "developer": "chornerman",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Jan 15, 2016",
  "updated": 1537286576000,
  "version": "6.0.0 PREVIEW 3",
  "recentChanges": "UI improvements<br>Fix bugs",
  "appId": "com.chornerman.thailotteryluckynumbers",
  "searchTerms": "lottery"
 },
 {
  "title": "Pick 4 lottery",
  "description": "You just add one up to four last draws and let the device to do the job.\r\n- No Internet connection required.\r\n\r\n\"ATTENTION\"\r\nRun tests with old winning numbers from pick 4 before playing with real money, I don't guarantee that everyone will win. This app just helps to pick some numbers rather picking\r\nrandomly or can't decide which numbers to play by yourself.  \r\n\r\n*Rate this app wisely*\r\n\r\nIncludes four processing systems:\r\n\r\n- Generates a list of random draws with the sum from 1 to 35.\r\n- It calculates each new row in the list from the last draws.\r\n- It Calculates once to produce a list from the last draws.\r\n- Just generates a random list of numbers.\r\n\r\nYou can run a test from old picks to see which lottery system suits you,\r\nalso, the numbers may come in exact order or any order.\r\n\r\nAlso, you can make combinations, like inserting data every two or three draws.\r\n\r\n** New update **\r\n-New system added-\r\nCalculates the numbers each other and produce a list of 10 draws.",
  "summary": "Unique powerful lottery generator for pick 4 that depends on the last draws.",
  "installs": "10,000+",
  "score": 4,
  "ratings": 56,
  "reviews": 24,
  "price": 0,
  "developer": "Mertzsoft",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "May 24, 2017",
  "updated": 1558271431000,
  "version": "3.3",
  "recentChanges": "Minor Fix.",
  "appId": "com.mertzlos.pick4",
  "searchTerms": "lottery"
 },
 {
  "title": "Thai Lottery 123",
  "description": "Thai Lottery App Provide Free information regarding lottery in thai. There are many idea show how to take lottery information. Thai lottery app is best for lottery users.\r\n\r\nThere are many trick related with thai lottery which show as image.\r\n\r\n\r\nThai Lottery 123 tips  but not offering any Tips on winning the lottery. There are a lot of other websites and apps that offer Thailand Lottery Tips but always use it at your own risk. In Thailand it is very common to believe in Lottery Tips which are derived from different methods or analysis.\r\n\r\nHow to use.\r\nOpen app,\r\nclick on category,\r\nshow many image as you can win lottery\r\nyou can click on image and zoom it also.",
  "summary": "Thai lottery 123 app help to getting information regarding lottery and tricks",
  "installs": "10,000+",
  "score": 4.7261906,
  "ratings": 84,
  "reviews": 33,
  "price": 0,
  "developer": "infotechpro",
  "genre": "Books & Reference",
  "contentRating": "PEGI 3",
  "released": "Aug 31, 2018",
  "updated": 1573986870000,
  "version": "10.0",
  "appId": "com.thai.lottery123",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Free",
  "description": "Helps to find your lottery picks. It draws a set of random numbers out of a given range. Random picks usually lead to higher winnings than the usual birthdays and lucky numbers because fewer players sharing the same set.\r\n\r\nCan be customized for many different lotteries world wide. Draws a normal set and optionally an extra set of numbers. \r\n\r\nAd supported freeware",
  "summary": "Helps to find your lottery picks.",
  "installs": "50,000+",
  "score": 3.7014925,
  "ratings": 134,
  "reviews": 28,
  "price": 0,
  "developer": "SpeedyMarks",
  "genre": "Finance",
  "contentRating": "PEGI 3",
  "updated": 1535036721000,
  "version": "1.2.0",
  "recentChanges": "- loads faster<br>- works offline",
  "appId": "com.speedymarks.android.lottery.free",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Lucky Number",
  "description": "Lottery lucky number generate your lucky number for USA lottery and jackpot. \r\nLottery lucky number games includes \r\n❖2by2\r\n❖5 card cash\r\n❖All or Nothing\r\n❖Badger 5\r\n❖Bank a Million\r\n❖Big Sky Bonus\r\n❖Bonus Match 5\r\n❖Cash 25\r\n❖Cash 3\r\n❖Cash 4\r\n❖Cash 5\r\n❖Cash4Life\r\n❖Cashball\r\n❖Classic Lotto\r\n❖Cowboy Draw\r\n❖Daily 3\r\n❖Daily 4\r\n❖Dakota Cash\r\n❖Easy 5\r\n❖Fantasy 5\r\n❖Georgia FIVE\r\n❖Gimme 5\r\n❖Gopher 5\r\n❖Hit 5\r\n❖Hot Lotto\r\n❖Jumbo Bucks Lotto\r\n❖Loto Plus\r\n❖Lotto\r\n❖Lotto Texas\r\n❖Lucky Day Lotto\r\n❖Lucky For Life\r\n❖Lucky Lines\r\n❖Lucky Links\r\n❖Lucky Money\r\n❖Mass Cash\r\n❖Match 4\r\n❖Match 6\r\n❖Mega Millions\r\n❖Megabucks\r\n❖Midday 3\r\n❖Midday 4\r\n❖Montana Cash\r\n❖Multi Match\r\n❖MyDay\r\n❖Natural State Jackpot\r\n❖Northstar Cash\r\n❖Numbers\r\n❖Palmetto Cash 5\r\n❖Pick 2\r\n❖Pick 3\r\n❖Pick 4\r\n❖Pick 5\r\n❖Pick 6\r\n❖Pick 10\r\n❖Play 3\r\n❖Play 4\r\n❖Poker Lotto\r\n❖Poker Pick\r\n❖Powerball\r\n❖Quick Draw\r\n❖Quickster\r\n❖Revancha\r\n❖Road Runner Cash\r\n❖Rolling Cash 5\r\n❖Show Me Cash\r\n❖Super Cash\r\n❖Super Kansas Cash\r\n❖Super Lotto PLUS\r\n❖Take 5\r\n❖Tennessee Cash\r\n❖Texas Triple Chance\r\n❖Texas Two Step\r\n❖The Pick\r\n❖Treasure Hunt\r\n❖Very Own Megabucks\r\n❖Weekly Grand\r\n❖Wild Money\r\n❖Win 4\r\n❖Win For Life\r\n❖World Poker Tour.\r\n\r\nSelect your states to generate your lucky number.\r\n❖Arizona  (AZ)\r\n❖Arkansas  (AR)\r\n❖California  (CA)\r\n❖COLORADO  (CO) \r\n❖CONNECTICUT  (CT) \r\n❖DELAWARE (DE) \r\n❖DISTRICT OF COLUMBIA (DC)\r\n❖Florida (FL)\r\n❖Georgia (GA)\r\n❖IDAHO (ID)\r\n❖ILLINOIS (IL)\r\n❖INDIANA (IN)\r\n❖IOWA (IA)\r\n❖KANSAS (KS)\r\n❖KENTUCKY (KY)\r\n❖LOUISIANA (LA)\r\n❖MAINE (ME)\r\n❖MARYLAND (MD)\r\n❖MASSACHUSETTS (MA)\r\n❖MICHIGAN (MI)\r\n❖MINNESOTA (MN)\r\n❖MISSOURI (MO)\r\n❖MONTANA (MT)\r\n❖NEBRASKA (NE)\r\n❖NEW HAMPSHIRE (NH)\r\n❖NEW JERSEY (NJ)\r\n❖NEW MEXICO (NM)\r\n❖NEW YORK (NY)\r\n❖NORTH CAROLINA (NC)\r\n❖NORTH DAKOTA (ND)\r\n❖OHIO (OH)\r\n❖OKLAHOMA (OK)\r\n❖OREGON (OR)\r\n❖PENNSYLVANIA (PA)\r\n❖PUERTO RICO (PR)\r\n❖RHODE ISLAND (RI)\r\n❖SOUTH CAROLINA (SC)\r\n❖SOUTH DAKOTA (SD)\r\n❖TENNESSEE (TN)\r\n❖TEXAS (TX)\r\n❖VERMONT (VT)\r\n❖VIRGINIA (VA)\r\n❖WASHINGTON (WA) \r\n❖WEST VIRGINIA (WV)\r\n❖WISCONSIN (WI)\r\n❖WYOMING (WY)\r\n\r\nNote: The information contained on this app is for reference purposes only. We make no guarantee or representation as to the accuracy  and/or reliability. All brands and product names referenced herein are the trademarks or registered trademarks of their respective holders. This app is not affiliated to any of the organisations linked or described.",
  "summary": "Lottery lucky number generate your lucky number for USA lottery and jackpot.",
  "installs": "5,000+",
  "score": 4.268293,
  "ratings": 41,
  "reviews": 11,
  "price": 0,
  "developer": "Nature Droid",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Apr 14, 2017",
  "updated": 1514174604000,
  "version": "1.0.0",
  "recentChanges": "❖Updated Mega Millions to pick 5 numbers from 1 to 70 and one number from 1 to 25<br>❖Added KENO game",
  "appId": "com.naturedroid.usaluckynumber",
  "searchTerms": "lottery"
 },
 {
  "title": "Thailand Lottery Result",
  "description": "Thailand Lottery Result allows you to check the latest and also recent lottery results and see if you have strike your lucky star ! Thailand Lottery Result attempt to release the result as soon as they are being announced by Thailand Government Lottery Office. Not only you can check the result Thailand Lottery Result also broadcast the live drawing process so you can enjoy the excitement of the process.\r\n\r\nOur app only showcases Thailand Lottery results but not offering any Tips on winning the lottery. There are a lot of other websites and apps that offer Thailand Lottery Tips but always use it at your own risk. In Thailand it is very common to believe in Lottery Tips which are derived from different methods or analysis.\r\n\r\nAll the results in our app is based from Thailand Government Lottery Office and Thailand Lottery 3up is out of the scope of coverage. Thailand Lottery 3up is believed to be a way to predict upcoming lottery results based on past results plus formulas.\r\n\r\nInstall Thailand Lottery Result now so you can check the results from the convenience of your finger tips. If you like Thailand Lottery Result please rate and review our app so we know what to improve on in the next version.",
  "summary": "Check the latest result for Thailand Lottery with live drawing video",
  "installs": "10,000+",
  "score": 4.3333335,
  "ratings": 48,
  "reviews": 11,
  "price": 0,
  "developer": "300 Apps",
  "genre": "News & Magazines",
  "contentRating": "PEGI 3",
  "released": "Dec 11, 2017",
  "updated": 1520261565000,
  "version": "1.1",
  "recentChanges": "Migrate to new server to improve app stability",
  "appId": "com.kapps.thailand.lottery.result",
  "searchTerms": "lottery"
 },
 {
  "title": "TX Lottery Results",
  "description": "The best fast FREE Android app for Texas lottery results for the following draw games: \r\n\r\n* PowerBall\r\n* MegaMillions\r\n* Lotto Texas\r\n* Texas Two Step\r\n* All or Nothing\r\n* Pick 3\r\n* Daily 4\r\n* Cash 5  \r\n\r\nGet results fast! Quickly and easily scroll through all Texas lotto draw game results - no need to navigate through multiple menus to find game results.\r\n\r\nFeatures:\r\n\r\nHistory - Results of past drawings\r\nGenerate Quick Picks - Randomly generate picks for games\r\nPayouts - See the number of winning tickets sold and the associated prize amounts\r\nFrequency - See how many times a ball was drawn for 20, 50, or 100 draws\r\n\r\nAd supported",
  "summary": "TX Lottery draw game results in a single, easy-to-read list. Quick Accurate Free",
  "installs": "10,000+",
  "score": 4.44,
  "ratings": 375,
  "reviews": 108,
  "price": 0,
  "developer": "Matthew Saavedra",
  "genre": "Entertainment",
  "contentRating": "PEGI 16",
  "contentRatingDescription": "Strong Language",
  "released": "Jun 19, 2013",
  "updated": 1583622727000,
  "version": "4.0.1",
  "recentChanges": "Fix issue with results being unreadable when a large system font is used",
  "appId": "com.matcho0.txlotto",
  "searchTerms": "lottery"
 },
 {
  "title": "Lottery Win Numbers",
  "description": "Do you play the Lottery, Mega Millions or Powerball?\r\n\r\nHave you ever wanted to have a completely computer generated random set of numbers readily available to play the lottery?\r\n\r\nYou've come to the right place!\r\n\r\nThis application will generate two sets of 5 Lottery numbers and a Mega/Powerball for each set. Simply start the application and your new Lottery numbers are displayed.\r\n\r\nDon't like the initial Lottery numbers?\r\nPress the refresh numbers button to generate two new sets of Lottery numbers.\r\n\r\nDo you want more Lottery numbers?\r\nPress the refresh numbers button to generate additional Lottery numbers.\r\nRefresh numbers button can be pressed as many times as you need to generate all of the Lottery numbers you require.\r\n\r\nNew Edition of Lottery Win Numbers now includes a list of previously drawn numbers. A new button was added to allow the application to retrieve all of the past Lottery numbers drawn and the date of the draw. The list includes previous numbers for both Powerball and Mega Millions Lottery drawings. \r\n\r\nPress the Get Past Numbers button and the app will direct you to all of the Powerball and Mega Million lottery numbers drawn. Scroll the left list to see numbers and dates drawn for Powerball lottery. Scroll the list on the right to see numbers and dates for the Mega Millions lottery.\r\n\r\nCheck your ticket against these lists to see if you have won the Lottery, either Powerball Lottery or Mega Millions lottery.\r\n\r\nLottery Winning Numbers is not associated with Mega Millions lottery or Powerball lottery games. This application simply generates a set of random numbers. Lottery Winning \r\n\r\nNumbers is not liable for numbers that are not actual winning numbers for a lottery game.\r\n\r\nPlay at your own risk.\r\n\r\nFor gambling problems, please contact a gambling help center.",
  "summary": "Generate two sets of numbers to play Mega Millions or Powerball.",
  "installs": "1,000+",
  "score": 4.6,
  "ratings": 5,
  "reviews": 3,
  "price": 0,
  "developer": "Curious Custom Apps",
  "genre": "Tools",
  "contentRating": "PEGI 3",
  "released": "Oct 25, 2018",
  "updated": 1573853194000,
  "version": "1.2.1",
  "recentChanges": "Update Application: Added lists of previously drawn numbers for both MegaMillions and PowerBall. Enjoy!",
  "appId": "com.curiousca.lotterywin",
  "searchTerms": "lottery"
 }
]