[
 {
  "userName": "ikeyd2017",
  "version": "6.10.0",
  "score": 5,
  "title": "Sky bingo",
  "text": ". I've been playing on the sky bingo app and sky vegas app for about a year now. I haven't lost loads of money as I've won quite a few times either on the slots or playing bingo. I recommend new people wanting to play bingo or other games to down load the sky apps as they pay your winnings into your bank account within 2 working days and do not mess you about like other apps I've played. Would recommend sky to my friends and family as they've not let me down yet . !!!"
 },
 {
  "userName": "PrizeTurkeyDins",
  "version": "6.3",
  "score": 3,
  "title": "Bingo Fun",
  "text": "Sky bingo is one of my favourite sites to play the app has easy to use access rooms and a good selection of affordable games and some higher priced games with the option to play for some decent prize money. I only play what I can afford which is not a lot but affordable for my budget. Plus you can set limits to stay in control of your spending. Good Luck MPQMPQ\nThe app recently has been a bit temperamental and unreliable june/july 2017 many updates happening so hang in there I'm sure the guys at virturefusion are working on making the app the best it can be for sky as I still keep coming back!"
 },
 {
  "userName": "bsznnxn",
  "version": "6.13.0",
  "score": 5,
  "title": "My new favourite bingo",
  "text": "Iv played with many bingo halls an sites over the year i have found hands down sky is second to none i always get a win even if its little only thing i would ask for is a way to favourite bingo lobby's and other games so you will have a personal list of games u love only been with sky a week but I'm not going anywhere soon"
 },
 {
  "userName": "Kickers misses",
  "version": "6.13.0",
  "score": 5,
  "title": "Brilliant app and sites",
  "text": "Love how easy you can play and switch games and so many different kinds and the bonuses that you get every week it tops off to all the others around and day pick is fun too and it has the best deposit limits to help you stay in control"
 },
 {
  "userName": "Kerry;)",
  "version": "6.12.0",
  "score": 5,
  "title": "Sky Bingo",
  "text": "I would definitely recommend that if you enjoy playing Bingo and lots of other games then Sky Bingo is the One you should download with lots of bonuses and promotions and chat games to win\nI’ve won quite a number of times and really enjoy playing Sky Bingo 😊"
 },
 {
  "userName": "alfie3103",
  "version": "6.14.0",
  "score": 5,
  "title": "100%, top bingo app available",
  "text": "I’ve tried many bingo apps, some ok, some need their creators to put down their crayons and get back in the ball pit. \n\nI like everything about sky bingo. If I had to pick what I feel is the best part, it would be the chat rooms. Always a giggle win or lose."
 },
 {
  "userName": "tuwharetoa",
  "version": "6.11.0",
  "score": 5,
  "title": "Sky bingo",
  "text": "Love this site, been playing on it for a while now. Find it has lots of choice for the amount of money you wish to play, also good selection on slots also daily surprise were you could win different prizes"
 },
 {
  "userName": "Jjag58",
  "version": "6.8",
  "score": 5,
  "title": "5 STAR ENTERTAINMENT",
  "text": "I love to play on this site,when I became disabled,I stopped going to the bingo, so when sites like sky bingo became popular it was great for me,also I like the idea of them having different slots than their sister site sky Vegas,but you can use your balance at both."
 },
 {
  "userName": "Cech😎😎😎😎😶",
  "version": "6.12.0",
  "score": 5,
  "title": "Sky is the best bingo site",
  "text": "I love sky bingo I love the way we can chat with other players online and friendly chat hosts always ready to help when needed \nI’ve had a couple of big wins now and they have brilliant slots too"
 },
 {
  "userName": "Kiddie settlers",
  "version": "6.10.0",
  "score": 5,
  "title": "Big brand small prices",
  "text": "You can win some great prizes here. With games to suit all budgets. App is easy to use and easily connects to all your sky accounts. With new rewards added every month. I love it. The CH are always fun and helpful too. AuntyHays"
 },
 {
  "userName": "kingpinhardy",
  "version": "6.13.0",
  "score": 5,
  "title": "The fairest of them all",
  "text": "Sky is arguementally the most fairest of them all with the odds of winning are the most even they get , I wouldn’t use any other site plus they have all the best games and modes then anywhere else."
 },
 {
  "userName": "irishfairy82",
  "version": "6.13.0",
  "score": 5,
  "title": "Excellent",
  "text": "I can happily recommend sky bingo, casino,vegas as I’ve won quite a few times, good selection of games and always pay into your account within 3 days. Brilliant"
 },
 {
  "userName": "debbie438",
  "version": "6.14.0",
  "score": 5,
  "title": "I love it",
  "text": "I’ve used a few bingo sites and this has to b one of my favourites I love to variety and the fact u have the house prize but then u r able to win more on some games it’s great"
 },
 {
  "userName": "Shelbs1969",
  "version": "6.13.0",
  "score": 5,
  "title": "Sky bingo, fudgie65",
  "text": "This is the best bingo site for promotions, games, bingo, and the cms are fun friendly and help u in anyway they can and they are a scream, fudgie65, but I carnt seem to log in by the bingo app I have to log in through sky bet app."
 },
 {
  "userName": "Adie273",
  "version": "6.14.0",
  "score": 1,
  "title": "Total fix",
  "text": "I read the reviews that said it’s the same names winning all the time. I thought nothing of it. I gave it a shot, nearly 900 tickets later, not a single line won. And it was the exact same names winning the lines and full house. Seems a little suspect when the ‘odds’ are you don’t get a single line in almost 900 tickets, yet the same 3 people win consistently."
 },
 {
  "userName": "maggies abode",
  "version": "6.7",
  "score": 4,
  "title": "Magsabode",
  "text": "Can't log in it's so annoying spent £10 thought I would get bonus then another £10 no bonus don't think I will bother again that's why I've only given 1star"
 },
 {
  "userName": "A xxxx",
  "version": "6.14.0",
  "score": 5,
  "title": "Sky app",
  "text": "I’ve be using app on phone also use my laptop to ive never had any issues easyto use  jump   between games I like sky app"
 },
 {
  "userName": "ewela8818",
  "version": "6.3",
  "score": 4,
  "title": "Ewela888",
  "text": "I used to love sky bingo. Not always win but after spending about £1000 I expected to get anything back. I’ll wait a few weeks and we will see. Still one of best sites for me."
 },
 {
  "userName": "Stargirl2002",
  "version": "6.10.0",
  "score": 5,
  "title": "Sky bingo",
  "text": "Sky bingo is my favourite site the odds have been above average for me hopefully will keep up the good luck, has some very good games for everyone needs!"
 },
 {
  "userName": "Miss piggy2",
  "version": "6.12.0",
  "score": 5,
  "title": "One to download",
  "text": "One of the best bingo apps available and would recommend it to any new player wanting a game of bingo"
 },
 {
  "userName": "krystalham99",
  "version": "6.13.0",
  "score": 4,
  "title": "Sky bingo",
  "text": "I really enjoy sky Vegas and sky bingo don’t feel like I’ve lost loads of money. Every day you get awarded with a free chance to win some money don’t get any better really"
 },
 {
  "userName": "frankie0411",
  "version": "6.3",
  "score": 3,
  "title": "Big Top tombola",
  "text": "Have been playing this game for years and this last 2 weeks can get it on my phone at all and my kindle won’t let me see graphics what’s gone on."
 },
 {
  "userName": "WeeTootsie",
  "version": "6.14.0",
  "score": 5,
  "title": "Sky bingo",
  "text": "Love it would recommend it to everyone I think I’ve been with sky 5yrs the best online games ever thanks sky Sandra"
 },
 {
  "userName": "Handle1209",
  "version": "6.14.0",
  "score": 1,
  "title": "Great if you want to lose!",
  "text": "I’ve played rainbow riches bingo and slots same winners on bingo conveniently. On slots I’ve put in a lot of money and you don’t win anything only 50p here £2 there. The more you put in the less you win. Do yourself a favour don’t play it otherwise you’ll be down a lot of money!!!"
 },
 {
  "userName": "nannysonia7",
  "version": "6.14.0",
  "score": 5,
  "title": "I love playing",
  "text": "My experience with sky is wicked, had a few big wins but I enjoy the community spirit here."
 },
 {
  "userName": "Tricki tee",
  "version": "6.12.0",
  "score": 5,
  "title": "Love sky",
  "text": "I love sky I have won 3 jps and a £1000 hols voucher so I would love it but they always do amazing promos and bonus’s good site very friendly xx"
 },
 {
  "userName": "Moveitman",
  "version": "6.3",
  "score": 5,
  "title": "Top site.",
  "text": "All the sky sites are top class and easier to navigate ."
 },
 {
  "userName": "bigmase777",
  "version": "6.14.0",
  "score": 5,
  "title": "Great bingo",
  "text": "It’s a great app as you get a free game every day and they do games from 2p so what else can you ask for an amazing app"
 },
 {
  "userName": "luckybap",
  "version": "6.3",
  "score": 5,
  "title": "Sky bingo",
  "text": "Enjoy sky bingo and slots play often but know when to stop"
 },
 {
  "userName": "Stephaniemoore",
  "version": "6.3",
  "score": 5,
  "title": "Mrsm1709",
  "text": "Love sky bingo ,loads of games to play , tipping point is brilliant ... games to suit everyone's budget , highly recommended"
 },
 {
  "userName": "Leesmith123456789",
  "version": "6.14.0",
  "score": 5,
  "title": "Bingo",
  "text": "I love playing it when I can day or nights even play it at work 😄😄😄😄"
 },
 {
  "userName": "Charlenec37",
  "version": "6.8",
  "score": 5,
  "title": "Love it",
  "text": "Great app with loads of sot and bingo games and affordable I have win quite a few times too love this and sky vegas"
 },
 {
  "userName": "jellywollypoo",
  "version": "6.13.0",
  "score": 3,
  "title": "Bingo",
  "text": "I enjoy playing sky bingo but find a lot of the same people win all the time, it should be kept fair not one person winning twice in one game"
 },
 {
  "userName": "Carla-fitz",
  "version": "6.14.0",
  "score": 5,
  "title": "Excellent",
  "text": "Easy to set up and use, lots to chooses from quick payouts"
 },
 {
  "userName": "i-ree",
  "version": "6.14.0",
  "score": 5,
  "title": "Affordable and fun",
  "text": "Affordable and fun, something for everyone and ever budget.\nLove to play the scratch cards whilst waiting for bingo to start."
 },
 {
  "userName": "Felix1892",
  "version": "6.12.0",
  "score": 5,
  "title": "Fantastic",
  "text": "Love it can’t live with out it a must app to have I win all the time"
 },
 {
  "userName": "suehodges79",
  "version": "6.5",
  "score": 5,
  "title": "Review",
  "text": "Sky bingo is fun to play there's all sorts of rooms that u can play which makes more fun love the 1p games on here"
 },
 {
  "userName": "Bigbev05",
  "version": "6.4",
  "score": 1,
  "title": "Sky bingo app",
  "text": "I've just join this site hopefully to play bingo I've deposited my money and now when I sign in to play I just get a black screen I'm even unable to to get my money back wish I hadn't of signed up now didn't even get my new player bonus"
 },
 {
  "userName": "hcwmrl",
  "version": "6.12.0",
  "score": 5,
  "title": "Good fun",
  "text": "Addictive but when set to lucky mood even when losing great fun, specially the pennies games ;)"
 },
 {
  "userName": "X2801BECKSX",
  "version": "6.14.0",
  "score": 1,
  "title": "RUBBISH!!!",
  "text": "No matter what room your in it’s the same players winning over and over again! You mention it in chat and you get blocked😂 Never played on a worse bingo site. Quick enough taking money but never get anything back."
 },
 {
  "userName": "babfran",
  "version": "6.4",
  "score": 5,
  "title": "Favourite site to play bingo! Go Sky!",
  "text": "Favourite app to play bingo, would recommend."
 },
 {
  "userName": "Emma Taylor aka lilfoot83",
  "version": "6.3",
  "score": 5,
  "title": "Lilfoot1983",
  "text": "Brilliant bingo site my partner won an Apple iMac through this site"
 },
 {
  "userName": "Milliesnana",
  "version": "6.13.0",
  "score": 1,
  "title": "rubbish",
  "text": "Load of rubbish says if you deposit £10 on sign up you get £60 to play with once you’ve spent £10 I didn’t receive the bonus money once funds have gone account being deleted"
 },
 {
  "userName": "stebro23",
  "version": "6.14.0",
  "score": 5,
  "title": "Good",
  "text": "Have only won a very small amount but it’s good"
 },
 {
  "userName": "hope764",
  "version": "6.14.0",
  "score": 5,
  "title": "It’s a amazing site",
  "text": "I like sky Bingo it’s got all sorts on there. Bingo and slots and the free prize burst every day is really good to 🙂🙂"
 },
 {
  "userName": "Azza27",
  "version": "6.3",
  "score": 4,
  "title": "Sky bingo",
  "text": "Fun for all good prizes always feel like you could win at any moment"
 },
 {
  "userName": "Heazzzzz",
  "version": "6.14.0",
  "score": 1,
  "title": "Unavailable due to technical issues",
  "text": "Only had it a few days and get this more often than not. \nDisappointed in it."
 },
 {
  "userName": "BaldySteve30",
  "version": "6.3",
  "score": 5,
  "title": "Great App",
  "text": "Easy to use , very few bugs \n\nGreat application"
 },
 {
  "userName": "Fredpops",
  "version": "6.14.0",
  "score": 5,
  "title": "Sky bingo",
  "text": "Some great games with lots of variety and fun to play"
 },
 {
  "userName": "Woopiwon75",
  "version": "6.6",
  "score": 5,
  "title": "Awesome sky bingo",
  "text": "It's my second favourt bingo site big thumbs up"
 }
]