[
 {
  "userName": "Netmitch",
  "version": "4.0",
  "score": 5,
  "title": "Jeanette50",
  "text": "I play bingo only occasionally but play slots a scratch card a few times a week. The reason I don’t play bingo is like one off your other reviews I have read is that the same names keep coming up no matter what time of day or which bingo house you play. I have tried playing just 6 cards or as many as you could buy, still only the odd win, but never say 1 line then the next two lines or a line then the full house. However, at least a couple of names appeared as winners time and time again, this also used to happen when Gala Bingo was on the TV before the app to play on line. It even happens in the bingo halls the same people win time and time again, when you are waiting for one number it is so maddening when one of those said people call and win the game. In the halls you hear people around you tut tutting and whispering “them again” , I also know that some have stopped playing Bingo because  of this, as they are limited to only being able to afford the minimal number as they like to most days for the company and chats. Is that what you want New younger players?\nI will continue to play the slots etc until I think the Bingo will seem to being played fairer where by lots of different names appear as winners. Frustrated Jeanette50"
 },
 {
  "userName": "Lurtster",
  "version": "20.01.01",
  "score": 1,
  "title": "Awful",
  "text": "I registered for the £10 deposit get £50 free. Didn’t realise you can only play certain games but played something else and won £80. Decided to just take it and quit the app. What an absolute joke! So I deposited my £10 but wanted my withdrawal via bank transfer. It does let you do this on the app. Then you get an email that tells you, you can’t withdraw a different way to the way you deposited so the withdrawal has been cancelled. So then I tried to log back in to withdraw the same way I deposited. Somehow, and even after numerous conversations with gala, this account ended up being closed!!!!! I spoke with customer support via live chat which was painful only to eventually find out that account had been suspended, god only knows why!!!! Then gala gave me another user name which then ended up also being suspended!!! The whole thing was a shambles and I’m still trying to get my £89 back after sending my driving license twice as proof of ID and address. It will be an absolute miracle if I get this money. I would stay well clear of the app and Gala Bingo customer services!!!"
 },
 {
  "userName": "remembermeforcenturies",
  "version": "20.01.01",
  "score": 1,
  "title": "Appalling Customer Service!!!",
  "text": "Avoid this app, and this bingo site in general! I signed up and expected to receive a bonus, but was told I couldn’t have it because I used PayPal (this detail was never specified on any of their ads or their sign up pages). I tried to talk to their live chat team about this and was connected twice to a useless worker called Alison who refused to help me. She replied a couple times before abruptly ending the chat, and the second time around she didn’t even reply to my messages at all! \n\nThere’s no point playing Gala Bingo if they can’t be more specific with their sign up rules. Not once did it say I couldn’t receive a bonus if I used PayPal, and I don’t understand how that is even a rule to begin with! PayPal is used online to protect people’s data, if we can’t use it then what’s the point in giving us the option?! Why shouldn’t we get the same benefits as everybody else who signs up? In my eyes, I’m fully entitled to the £50 bonus but chances are I won’t see it because the customer service team are completely ignorant. Waste of bloody time!!!"
 },
 {
  "userName": "Saachi2014",
  "version": "4.1",
  "score": 1,
  "title": "Be very cautious with this site",
  "text": "I decided to join this gala bingo site  last night I put in all my details correctly checked them wrote down my user name and password they took my ten pound and hey presto after taken my ten pound out of my bank I had trouble logging in in fact after numerous attempts at trying to signing  in with all the correct details as I wrote it all down I couldn’t log in I sent emails to be told  I refund of money back as I had used the 10 pound  I had taken out of my bank what a load of rubbish I wish I could have logged in in the first place to have used it then in sending another email asking for my money back I was then sent another email saying that unfortunately because my now email doesn’t match  any details just have used they can’t refund me my money funny how they can send me emails thought dam right con artist if you ask me a rip off site and total thieves your full of total rubbish and I will be taking this to my local ombudsman for him to deal with !!! Be very cautious of this site and how they work !"
 },
 {
  "userName": "iloveian18",
  "version": "20.01.01",
  "score": 3,
  "title": "Your staff and to many issues on ur site since change over",
  "text": "I love my gala it’s got me though some tough times in my life and my bingo buddies are amazing on gala , but the staff of live help and over phone can be a pure nightmare , we as customers should not have to explain to them how and what the promotion and daily games are , they can have been very rude and way to often they give the wrong information which is just unacceptable sorry to say , every member of staff that works for gala here or aboard should know of all your going ons not us explaining to them just to be told they we’ll raise it , and please stop with the 24-72 hours time frame because you never ever abide by them times we always have to chase what gala owes us x"
 },
 {
  "userName": "keysysndb",
  "version": "3.52",
  "score": 5,
  "title": "Dreadful",
  "text": "Chose to join up to take advantage of the £30 bonus with the £10 deposit. \n\nRead the small print if you’re thinking of taking advantage of this offer as there are only certain games you can spend your money on in order to receive the bonus. So I’m a tenner down, got no bonus money and was almost impossible to access the 10 free spins. \n\nStick with tombola and virgin. At least you know where you stand with them and customer services are consistent, unlike the two attempts at live chat on gala"
 },
 {
  "userName": "Tiago Marques London",
  "version": "3.46",
  "score": 2,
  "title": "Shame app",
  "text": "I just download the app Gala bingo on Friday night to test my luck, in this occasion was my birthday 2 days after.\nI got 602£ on my luck and I thought to stop and do the withdrawal straight away and make some think special whit my wife on my date! Not! I could, the verification frozen my account and didn’t accept my documents to prove that was me! Really big deception. I tried many times have a a answer about Wats going, email and fone calls but not one could help me, theirs just sent me deposit of 50£ that I put to play. Never in my life I will play again on line.\nThat’s a shame for taking money away from people trust to playing online."
 },
 {
  "userName": "jaycloe",
  "version": "4.1",
  "score": 1,
  "title": "Hard to win",
  "text": "Been playing for a year now I only put in £10 in every so often and I have never won I think its one of them games you have to put in loads of money to increase your changes of winning I have noticed when someone has won a line and it flashes up on the screen to say who has won they have only 4 or 5 numbers left to wait for them to win the house but I have only got 1 or 2 numbers covered it happens all the time and it’s always the same names that seem to win. I no people that play it and have won but they put in a lot more money than I do so I defo think it’s a game where u have to put in a good bit of money before you have a chance to win."
 },
 {
  "userName": "Spamlaaa",
  "version": "3.48",
  "score": 2,
  "title": "Compatibility issues",
  "text": "I have the iPhone X and most of the games don’t work it requires you to swipe up to play which on this phone closes the app and to go back home you have to force close the app and restart it so it limits you to a few games which personally I don’t like to play but basically all games have issues such as I can’t see my balance unless it’s in landscape etc and games and the finger tracking seems off like if I’m tapping spin I will have to tap away from the button to spin just little things like that."
 },
 {
  "userName": "Londons Finest 87",
  "version": "4.1",
  "score": 1,
  "title": "Waste of money",
  "text": "Not a great site for the slots! Signed up, deposited £200 at the end of my patience and ended up with feeling disappointed and bored I must say. Didn’t keep me in the game at all during play just kept spinning with lousy pays from £1 spin. Regret signing up thought I would give it a go for the sake of gala being a known site but it’s not fun at all. If the games were to give something back for me to enjoy during play I wouldn’t feel as disappointed! Only good thing is the style and graphics are good. Not worth my time I’m afraid after that poor experience. Where’s the fair play?"
 },
 {
  "userName": "@missjadiem",
  "version": "3.46",
  "score": 3,
  "title": "Fun",
  "text": "Definitely fun and very addictive. Have won a few times but not a huge amount, mainly in the newbie bingo room. If only newbies could have longer access to those rooms rather than just 1 or 2 weeks max! 🙏🏼 I seemed to have the best luck in there, that’s probably why you only get a couple of weeks in there I guess :-P \n\nOverall though, the CH’s are really helpful and seem lovely. Just wish you could win a bit more, more often!"
 },
 {
  "userName": "Jordan wheway",
  "version": "4.1",
  "score": 1,
  "title": "Dont use !!!",
  "text": "I played the slingo games on the gala app and the game crashed without me playing it and still took my money this happened on a few different games resulting in me losing quite a bit of money. I went to customer support to which they said they would sort it, 2 weeks go by and i haven't heard anything so i try and contact them they say they are still looking into it , its been almost a year now and i have not heard anything back i will not be using them again and i advise you to stay away to,totally out of order!!"
 },
 {
  "userName": "Britina61",
  "version": "4.1",
  "score": 5,
  "title": "iPad problems",
  "text": "I’m having trouble with gala on my iPad. I can access every app but not this one. The page turns blue when I try to log on. I am able to log on to my phone but it hurts my eyes and can’t play for long. I have just registered with another Bingo site and it’s working well, Fingers crossec"
 },
 {
  "userName": "Bethy169",
  "version": "20.01.01",
  "score": 1,
  "title": "Do not download this",
  "text": "I’ve put a lot of money into this game ,you barely get anything back I recently got an offer that if I’d join and wager £10 slots on foxy bingo I’d get 200 spins 100 on foxy and 100 on gala on the 7th they never came on the 7th so I used the live chat the woman told me I was entitled to them and I just had to wait for them to be rewarded so it’s now the 8th and I still haven’t received my spins. Tried live chatting , got through to 2 staff members who both ignored me when I brought up the subject. Very annoyed."
 },
 {
  "userName": "Jordan188",
  "version": "3.48",
  "score": 5,
  "title": "Jordanbrandon",
  "text": "This app is amazing I thought I’d give it a go as I like the online slots and to my surprise I ended up winning so tried again on my next pay day and so again so easy to log in and I love the Touch ID feature, over the moon with this app"
 },
 {
  "userName": "racheljoshua438",
  "version": "3.46",
  "score": 5,
  "title": "Great",
  "text": "Downloaded the app last Friday evening to try my luck and won £50 within the first 10 mins. Would recommend to friends anytime as you can also set limits to stop you spending too much as well which is really good."
 },
 {
  "userName": "Busymum12",
  "version": "4.1",
  "score": 1,
  "title": "Gala slots",
  "text": "I play the slot games and to start off with they let you win to get you hooked, after that you end up wasting your money on them, I play the hot cross bunnies game and it will give you nudges to help you but say for instance you need 3 nudges to get a winning line then it’s fixed to just give you just 2 nudges, the game is just fixed to not win at all, going to stop playing it as I’m wasting my money that could be spent elsewhere, certainly would not recommend gala bingo app to anyone"
 },
 {
  "userName": "Rawmoonie",
  "version": "3.46",
  "score": 4,
  "title": "It’s Bingo and ....",
  "text": "Generally Ok. A little slow when your trying to the open the list of games available sometimes. Free Bingo for newbies in first week, but only a couple of times a day. 1 p and 2p games that are cheap enough. Too easy to get taken elsewhere on the site. Support seems a little poor (May be in India’s)"
 },
 {
  "userName": "ewela8818",
  "version": "3.46",
  "score": 5,
  "title": "Notluckyew8818",
  "text": "Very good site!!!! I sign up, very good newbie room and I was lucky to win some free money then played games and after some time I won jackpot of £500 !! I love you gala bingo!!  No problems, money in bank very quick. One happy customer, thank you gala!"
 },
 {
  "userName": "bbyonway2014",
  "version": "3.46",
  "score": 5,
  "title": "Not bad but I hardly win",
  "text": "Tonight tho I haven’t got on for hours seems to be getting some sort off work done to it never got my free bingo at all xxx this is 2nd night I can’t get on my app at all what’s going on gala Mynugget . Can u pleas fix this as I love to play gala x"
 },
 {
  "userName": "shaun xox",
  "version": "4.1",
  "score": 5,
  "title": "Love it!",
  "text": "Love the gala bingo app! Great for a cheeky wee game at night before bed, and won a good few times! Only down side is I have the iPhone XR and I find it difficult to come out of a game and press the back button due to the shape of the screen. But still love the app nonetheless 👌"
 },
 {
  "userName": "Loulou242",
  "version": "3.46",
  "score": 4,
  "title": "Better online!",
  "text": "Visited not long ago to local bingo hall and wasn’t impressed and won’t be rushing back however online is much better. Prizes are good online. Deposited £10 and got my free £30 after a week. Just wish I was lucky enough to win more!"
 },
 {
  "userName": "John123vhjkdd",
  "version": "20.01.01",
  "score": 1,
  "title": "Poor",
  "text": "Please anyone who is looking to download this and deposit money i strongly advise you not too, the games are really poor and 100% not realistic, same people win all the time and you never come with even a small chance of winning! After playing a lot of games on there i have never come close to winning anything, your never going to profit from playing your just throwing money to them. \nPlease i advise you not too"
 },
 {
  "userName": "yvonnem29",
  "version": "4.1",
  "score": 2,
  "title": "Yvonnem29",
  "text": "I used to use this site a lot but stopped due to it crashing so often by either app or online access. I’ve recently give it another try and it’s been down twice in 2 days. Not worth the hassle when you’ve got money in your account but can’t access it for hours. They also sent me a feedback form that won’t load!"
 },
 {
  "userName": "cathyh1964",
  "version": "4.0",
  "score": 5,
  "title": "My App not working",
  "text": "I have tried on many occasions to open my gala app but nothing happening, can you please explain why this has happened, all my other apps are working correctly"
 },
 {
  "userName": "Kats823",
  "version": "20.01.01",
  "score": 1,
  "title": "Latest Update Awful",
  "text": "Downloaded the latest update today and the app has been completely ruined to the point where it is unusable - deposit button didn’t work then did and took double out of my bank account then the app logged me out and won’t let me back in - just keeps looping on the Touch ID screen.  Well I suppose I will save lots of money but need to get my latest double deposit back somehow!"
 },
 {
  "userName": "Toggs66",
  "version": "4.1",
  "score": 1,
  "title": "Terrible app and service",
  "text": "This is possibly the worst application I have ever used, stay clear and use other providers. Having registered And spent money initially I’m unable to get back in without continually going down forgot password route.\n\nHaving tried to get web chat support from “Marvin” I got no where and he basically called me a liar. I only wanted to play to received promo in WGT Golf having but looks like, this was a scam.... terrible"
 },
 {
  "userName": "Lauz099",
  "version": "3.46",
  "score": 4,
  "title": "Need more bonus for old members",
  "text": "Could do with some more bonus etc for already members but I deposited£10 and won £307 on 3rd game on deal or no deal  1week before Christmas withdrew at 6am by dinner time next day money was in PayPal from there into bank good withdrawals processing if deposited via PayPal"
 },
 {
  "userName": "Tsmith80",
  "version": "20.01.01",
  "score": 1,
  "title": "Something not right",
  "text": "I downloaded the app and registered my details when I came to deposit some funds it failed (with no reason given and the funds were available at my end). Didn’t see right so I have deleted the app as I didn’t feel it was safe to use.\n\nHowever I have noticed that there is a pending transaction from my paypal so it looks like I’ll have lost the deposit money too.. great."
 },
 {
  "userName": "23angela",
  "version": "3.46",
  "score": 5,
  "title": "23angela",
  "text": "I opened the account two weeks ago and find it very easy to use and it is great entertainment it lets you set your own limits so you know how much you are spending"
 },
 {
  "userName": "SHANTASTIC9127!!@",
  "version": "3.46",
  "score": 5,
  "title": "Gala",
  "text": "It is extremely fun and very addictive would 100% recommend gala bingo app to anyone who has a passion for bingo,slots,casino etc your passion will become an addictive fashion! Download now to avoid disappointment!!"
 },
 {
  "userName": "Laurenbingo91",
  "version": "3.46",
  "score": 5,
  "title": "Gala la la",
  "text": "I've signed up to a few bingo apps now but Gala is one of the best, tickets from 1p, there's something for everyone. Had a few small wins and loved the first week of free bingo 👍🏻 think this will be my go to bingo app now"
 },
 {
  "userName": "chloequaintance.",
  "version": "3.46",
  "score": 5,
  "title": "Loveeeeee",
  "text": "Love gala bingo, so fun to play since having a little one I can’t go out and play anymore. So each week it’s a little treat. Won a few small prizes guess I’m not lucky enough. But still love it!!"
 },
 {
  "userName": "Ma windy",
  "version": "3.46",
  "score": 4,
  "title": "Returning player",
  "text": "I played this site on line a few years ago and have returned , happy days had a win with my freebie start , will come back again soon and try again"
 },
 {
  "userName": "S A Pinder",
  "version": "3.46",
  "score": 5,
  "title": "Great App",
  "text": "I love the new layout of the books, they are much easier to see, well done Gala.\n\nI love this app, it is so easy to use, lots of great bingo, slots and games. The bonus scheme is really great too. That ally recommend Gala Bingo."
 },
 {
  "userName": "Mumtoaprincess",
  "version": "20.01.01",
  "score": 2,
  "title": "Lost all faith",
  "text": "Have played on the site for a few years and used to like it but have to say I have now lost all faith in the site and don’t enjoy it anymore as it always seems the same names that win and you have to spend loads to get a win never won much as it is on here since I joined lost all faith now"
 },
 {
  "userName": "heartbroken-in-essex",
  "version": "4.1",
  "score": 1,
  "title": "Big fat con",
  "text": "I join and was also promised the promo that was on the site. When I didn’t receive all of it I spoke to someone on the live chat and was told at first it’s no longer running then when I said it’s still on the site so it should be honoured I was told I wasn’t eligible for it. Will definitely NOT be going back in this site and I warn anyone thinking of going to be very cautious"
 },
 {
  "userName": "Lisagjkgg",
  "version": "3.46",
  "score": 4,
  "title": "Simple and easy to use.",
  "text": "Really pleased with this app- there’s some things that still need to be updated as it’s a little tiresome going back and forth... by generally I would recommend this app."
 },
 {
  "userName": "Jodcai",
  "version": "3.46",
  "score": 5,
  "title": "Jodcai",
  "text": "enjoying playing at the minute, so so far it’s a 5/5 from me, however we will see how we get on further down the line..."
 },
 {
  "userName": "Makkajojochar123",
  "version": "3.46",
  "score": 5,
  "title": "Gala la la bingo !!!!!",
  "text": "Absolutely love playing on gala bingo app although when it states you will get 14 days in newbie room it should stick to it rather than not let u in after a week otherwise fab fab fab !!!!!"
 },
 {
  "userName": "xiyarain1",
  "version": "4.1",
  "score": 5,
  "title": "Good site",
  "text": "I have played all the major bingo sites and won the most on gala. A few weeks before I was due to go to Vegas I won £750 which came in handy!"
 },
 {
  "userName": "riameads",
  "version": "3.46",
  "score": 5,
  "title": "Fabulous App!",
  "text": "Absolutely love this app! Very user friendly. Easy to play slots aswell as bingo at the same time. And always nice to have a win now and then too! Very impressed :)"
 },
 {
  "userName": "tlf01723",
  "version": "3.46",
  "score": 5,
  "title": "App is easy to use. I like it",
  "text": "This app is easy to use and much better than another gaming app I used. The games are fun. I would recommend"
 },
 {
  "userName": "HannahRose123",
  "version": "4.1",
  "score": 1,
  "title": "Rude customer service",
  "text": "Too not use this Virgin is so much better. I had an issue with the spend £10 get £30 free. I emailed them and got a very rude message back claiming I spent all the money on slots and not bingo when I didn’t even play slots. I heard so any good things about this company and thought I’d give it a go and honestly wish I didn’t ended up wasting £10."
 },
 {
  "userName": "Dave.williams",
  "version": "3.51",
  "score": 1,
  "title": "What a joke",
  "text": "Before depositing I advise you read the small print. It says deposit £10 play with £30 what it doesn’t tell you is you have to lose £10 on bingo only before you recieve this bonus. When speaking to customer service there reply was. That’s why we are here to educate on our promos and offers. Not very helpful at all."
 },
 {
  "userName": "jojorip",
  "version": "20.01.01",
  "score": 4,
  "title": "Slot machines",
  "text": "Just slightly concerned about how features which or not coming up as often normal and The win is not as big is this you have to have a Big steak"
 },
 {
  "userName": "Ndhinvdhhbvsgb",
  "version": "3.46",
  "score": 3,
  "title": "Ok",
  "text": "Good games but I've never won a penny back and sometimes when I try and play it says 'timed out'. I also never got my £30 welcoming that it states when you join up. I personally would not recommend wasting your money."
 },
 {
  "userName": "burnzy18",
  "version": "3.46",
  "score": 5,
  "title": "Recommend",
  "text": "Total quality"
 },
 {
  "userName": "natzmayasmummy",
  "version": "3.46",
  "score": 3,
  "title": "Not bad bingo",
  "text": "I think that gala bingo could be a bit better, it's not bad for bingo online. Only down side I have with the site is it's always the same winners in most of the rooms. Although I think apart from the newbies room they should do more free games."
 },
 {
  "userName": "Arrrgh Zombies",
  "version": "3.46",
  "score": 5,
  "title": "It’s a gambling app.",
  "text": "Decent app. Quick load times. Haven’t won a bean yet though but that’s because I’m basically a jonas. \n\nLike I say, decent app to gamble a few quid."
 }
]