[
 {
  "userName": "1236796",
  "version": "1.8.2",
  "score": 3,
  "title": "Ha",
  "text": "This ap is rubbish pay very low 🖕stay a way from this ap unfair when u won money after u wan to keep play every spin dad spin with 2 pound 30 p won or most spin dead won 100 lost 1000 pound I was talkin to  one costum got  name Daren was sayin all the rubbish no wonder how many people not happy coz evetyones here tell true this app and ladboreks William hill robbery app they have all block me coz  I was complete about the fairness shame on this 3 app 👏👏👏👏"
 },
 {
  "userName": "Jenny5789755",
  "version": "1.6.2",
  "score": 1,
  "title": "Do not use this site",
  "text": "I tried to set up an account, after the initial set up you have to upload 2 personal documents of both photo ID and proof of address. I did this reluctantly. It was rejected due to no reason it had to be checked by a person rather than the electronic machine which normally check them. I was then approved I was on hold for over 10 minutes trying to resolve this and I’m the end gave up and asked them to delete my account."
 },
 {
  "userName": "casiono man",
  "version": "1.6.2",
  "score": 5,
  "title": "Really good - one of the best out there",
  "text": "Games are smooth, fast and have a preview before loading. Had to call c/s and they were really helpful. They could do with more games but don’t let that out you off. Better than 32 red, Ojo and Virgin."
 },
 {
  "userName": "Twcjkfdfsdhjiopknvcxcnhfd",
  "version": "1.8.2",
  "score": 1,
  "title": "Rip off merchants!",
  "text": "Over £300 in deposits over the last 5 weeks and not a single decent win. Every single week im hoping it will pay out and it just takes my money every time... i have a £25 deposit limit a day on and because of that it wont pay out. Every time i have put a deposit limit on a gaming app it has took me for a ride never paying out because it knows i wont put it straight back in ! Scum of the earth !"
 },
 {
  "userName": "Twinkster1971",
  "version": "1.6.2",
  "score": 5,
  "title": "Super 5 stars",
  "text": "Fantastic quality of games and easy directions to menu and banking !\nHavnt won anything as of yet but 9 is my lucky number so let's see where my lucky number takes me hahahahahahahahaha"
 },
 {
  "userName": "Mtn202",
  "version": "1.8.0",
  "score": 1,
  "title": "Con",
  "text": "The usual site where you win with you’re first deposit and never again. You hardly ever get the feature on the slot games and when you do the pay outs are low. They will say they have a 95 percent win rate but that will include wins that aren’t even half you’re stake. You should only play with you’re 1st deposit and withdraw the winnings and don’t play it again because they will get their money back."
 },
 {
  "userName": "jtmather",
  "version": "1.6.2",
  "score": 5,
  "title": "Bet 365",
  "text": "Brilliant app download people loads of games to choose from and hours of entertainment just waiting for a big win haha"
 },
 {
  "userName": "Kingdazza77",
  "version": "1.8.2",
  "score": 1,
  "title": "Money takers",
  "text": "I would advise anyone who wishes to download this not to do it all they do is reel you in make you think your winning big when in fact your not if I was you I would keep your money in your bank or pocket if I could swear I would be saying a hell off a lot more about these but **** them!!!!!!! Money takers!!!!!!!"
 },
 {
  "userName": "raymondo75",
  "version": "1.6.2",
  "score": 5,
  "title": "Beginner",
  "text": "Finding it excellent the games are very sharp no loss of signal and a very good verity.\nEven if I didn’t get my beginners bonus no worries tho .\nBut very good so far"
 },
 {
  "userName": "rob 👌",
  "version": "1.8.2",
  "score": 1,
  "title": "Centurion",
  "text": "I cannot believe every time I go on these games I put in one or two hundred pounds and don’t even get a look in at bonuses, when it gives you one nothing comes in you don’t even get a win ???? Very disappointing, I am cancelling my app and trying another. 😡"
 },
 {
  "userName": "mugfool",
  "version": "1.8.0",
  "score": 5,
  "title": "Ripped off",
  "text": "I love losing 80% of the time fair play you do give some back 👍 my fault not yours"
 },
 {
  "userName": "mr nudge",
  "version": "1.8.2",
  "score": 5,
  "title": "Carl dean",
  "text": "Not very good at paying out was looking forward to playing few ppl told me it was good"
 },
 {
  "userName": "stephllfixit",
  "version": "1.8.2",
  "score": 1,
  "title": "Bad",
  "text": "To be honest really bad. You rarely, if ever, win with the slots and you never win with the arcade. Also bets are automatically set at £2 and with a lot of the layout you may sometimes accidentally press to spin instead of changing the bet. Avoid."
 },
 {
  "userName": "Dazhappygilmore",
  "version": "1.8.1",
  "score": 2,
  "title": "The worst",
  "text": "I play a lot of different sites. Bet 365 games is probably the worst. Clean looking app but the returns are awful. Not even a glimmer of a decent win in multiple sessions. They must have there return rates set lower than most."
 },
 {
  "userName": "klaudio13",
  "version": "1.8.2",
  "score": 1,
  "title": "The worst app",
  "text": "Its the worst application it will only steal your money I played 1200 and it gave me 37 pound I recommended like i did to all my friends and nobody is playing anymore to not play here it will only steal your money and it wont give you nothing.."
 },
 {
  "userName": "jamesalvahaye",
  "version": "1.4.0",
  "score": 5,
  "title": "Deal or no deal is a great game and lots of fun",
  "text": "10 our of 10"
 },
 {
  "userName": "Susansavage",
  "version": "1.4.1",
  "score": 5,
  "title": "Suzywongs",
  "text": "Love this ap no worries with withdrawing ur winnings lots of games to choose from"
 },
 {
  "userName": "Mynamenoyours",
  "version": "1.8.2",
  "score": 5,
  "title": "Great app",
  "text": "Best betting app by far, highly recommend!"
 },
 {
  "userName": "Marky.V",
  "version": "1.5.0",
  "score": 1,
  "title": "Don’t bother",
  "text": "Getting a feature on this site is extremely rare. Put a fair bit through it with no joy on several occasions."
 },
 {
  "userName": "sootysooty1801",
  "version": "1.6.2",
  "score": 1,
  "title": "Freezes constantly",
  "text": "Good game but freezes when have a win bet 365 not interested in trying to sort"
 },
 {
  "userName": "Zigholic",
  "version": "1.8.0",
  "score": 5,
  "title": "Very good",
  "text": "Brilliant app, lots of games to play"
 },
 {
  "userName": "sammysammy5",
  "version": "1.8.2",
  "score": 5,
  "title": "Win win win",
  "text": "Great game won 500 pound 😁"
 },
 {
  "userName": "Dan2013007",
  "version": "1.6.2",
  "score": 1,
  "title": "Don’t fall for it",
  "text": "Don’t waste your money the jackpots get won on a daily basis when have you ever heard anyone win bit on bet 365 slots it’s a scam !!"
 },
 {
  "userName": "skamarate",
  "version": "1.8.2",
  "score": 1,
  "title": "Me",
  "text": "I play on this casino from 2 years and I lost all money in this time no win no bonuses nothing ."
 },
 {
  "userName": "GavlarrrrrrrrrrrrrrH",
  "version": "1.8.2",
  "score": 1,
  "title": "Shocking",
  "text": "Deposited £500 and played eye of Horus. It took £70 to get any kind of win £4. Then after £240 the bonus came. £12. Stay clear!!!"
 },
 {
  "userName": "SithLord1975",
  "version": "1.8.0",
  "score": 1,
  "title": "Lowest returns ever",
  "text": "You will literally burn through your cash in minutes. Much better payouts on other sites. What a con!"
 },
 {
  "userName": "StumpyMc",
  "version": "1.8.0",
  "score": 3,
  "title": "Payouts",
  "text": "Payouts are awful... you win little bits then... gone...."
 },
 {
  "userName": "RacheyRoo1",
  "version": "1.6.2",
  "score": 1,
  "title": "Keeps crashing",
  "text": "Games keep freezing."
 },
 {
  "userName": "Jonoxwolves",
  "version": "1.8.2",
  "score": 1,
  "title": "Awful games",
  "text": "Awful games keeps freezing and quitting the app. Shocking"
 },
 {
  "userName": "avalilly08",
  "version": "1.8.2",
  "score": 1,
  "title": "Slots",
  "text": "Percentage back from the slots is nonexistent really really poor"
 },
 {
  "userName": "Vodkaslush",
  "version": "1.8.3",
  "score": 1,
  "title": "Games",
  "text": "Haven’t won a penny on bet 365 didn’t even have a welcome bonus 🤷‍♀️"
 },
 {
  "userName": "Atanass777",
  "version": "1.8.0",
  "score": 1,
  "title": "my game hit when I hit a bonus",
  "text": "my game hit when I hit a bonus \nwhat ???"
 },
 {
  "userName": "Gareth_16",
  "version": "1.6.2",
  "score": 1,
  "title": "Game keeps timing out",
  "text": "The game keeps timing out and you lose all of you free spins and tumbles"
 },
 {
  "userName": "hillshills asda",
  "version": "1.5.0",
  "score": 5,
  "title": "Great game",
  "text": "Great to play"
 },
 {
  "userName": "spawnytoad",
  "version": "1.8.1",
  "score": 5,
  "title": "Wild antics",
  "text": "Fantastic game"
 },
 {
  "userName": "bet 365 mug",
  "version": "1.8.1",
  "score": 1,
  "title": "Worst ever",
  "text": "Stay away"
 },
 {
  "userName": "boolou5",
  "version": "1.4.1",
  "score": 1,
  "title": "Bad game robbed",
  "text": "£29 not one feature."
 },
 {
  "userName": "stat1768",
  "version": "1.8.1",
  "score": 5,
  "title": "Mr",
  "text": "Very god app :))))"
 },
 {
  "userName": "MikeyMorrison",
  "version": "1.6.2",
  "score": 5,
  "title": "Golden Egypt",
  "text": "A+"
 },
 {
  "userName": "Jimmymc1704",
  "version": "1.0.2",
  "score": 4,
  "title": "Not the worst but not the best",
  "text": "Wide selection of games and some good bonuses but some games you have to spend a fortune to get on feature and sometimes it's not even worth it! One feature didn't pay out a penny but that's gambling I suppose! Very easy to use and deposit and withdrawals are easy to make"
 },
 {
  "userName": "visage_2007",
  "version": "1.0.2",
  "score": 4,
  "title": "Does what it says on the description",
  "text": "Allows access to games through bet365, slightly quicker than going through the webpage. Large selection of games"
 },
 {
  "userName": "Boygypotramp",
  "version": "1.0.2",
  "score": 5,
  "title": "Good app",
  "text": "I've used this app a few times no big wins as yet but really easy to use and a wide variety of games"
 },
 {
  "userName": "Mak20132013",
  "version": "1.0.2",
  "score": 5,
  "title": "Amazing app try it out",
  "text": "Very easy to understand and play recommend"
 },
 {
  "userName": "thefatmourinho",
  "version": "1.0.2",
  "score": 3,
  "title": "Pity about the crashes",
  "text": "Would have been 5 stars but the regular crashes and reinstalling is a pain."
 },
 {
  "userName": "Diddledo 12345",
  "version": "1.0.2",
  "score": 5,
  "title": "Cool app",
  "text": "This app is quick and easy to access"
 },
 {
  "userName": "Cooperctr",
  "version": "1.0.2",
  "score": 5,
  "title": "Only good when your winning",
  "text": "A*"
 },
 {
  "userName": "nickieb2592",
  "version": "1.0.2",
  "score": 4,
  "title": "Cool",
  "text": "Good app could do with a few more games on there, but other than that it's a good one"
 },
 {
  "userName": "Sy_82",
  "version": "1.0.2",
  "score": 5,
  "title": "Spot on",
  "text": "Is what it is, no issues"
 },
 {
  "userName": "Avenue array",
  "version": "1.0.2",
  "score": 4,
  "title": "Games App",
  "text": "This is a decent site that has quite a good variety of games with varying stake amounts."
 },
 {
  "userName": "Flick4173",
  "version": "1.0.2",
  "score": 3,
  "title": "Games",
  "text": "Quick withdrawals and all the latest games"
 }
]