[
 {
  "userName": "Areyouthefarmer?",
  "version": "5.0.2",
  "score": 1,
  "title": "Terrible app",
  "text": "Avoid using this app! Screen froze on cash out page when I tried to scroll up and down, when the app ‘caught up’ by bet had cashed out on Jordan Spieth winning The Open for £46. I called PP and they said they couldn’t reverse the cash out because bet is ‘in play’....(?) I was told I could put the £46 on the player to win (Odds had by then reduced from 18/1 to 9/2) I imagine if Spieth was tied 20th instead of tied 2nd at the time they would reversed the cash out. I stand to lose £140. I’m not a major gambler, I often have a bet on televised sport just for fun and cheering on the player or players I’ve bet on. So with this happening it has ruined my enjoyment of the event. If this app is not fit for purpose PP should at least accept responsibility and rectify any genuine errors made by punters. Once my bets have been settled I shall close my account, I’ll never use PP again, there is after all loads of bookmakers to choose from. Punters pal! Yeah right"
 },
 {
  "userName": "scammy paddy",
  "version": "5.0.5",
  "score": 1,
  "title": "dan",
  "text": "Worst app ever used. They allow you to put cash in but then when account name spelt incorrectly and your bets done and won bye they say more I’d needed. Despite telling them I spelt surname wrong due to predictable txt via phone while on set up they want you send I’d to correspond to what’s on the account or your account will stay suspended. So here’s the deal paddy pathetic keep the winnings you con artists and keep getting your staff to give fake reviews to make your app look more appealing. Yes I found out that you give staff bonuses for good reviews linked to the  customer service team which let’s be frank, haven’t got two brain cells to rub together. Just avoid people there loop while system will rob you all. From freezing accounts to the independent panel with the not up to football scores for cash outs. Apparently coral much better I’ll try them"
 },
 {
  "userName": "LIAMFOREVER",
  "version": "5.0.5",
  "score": 5,
  "title": "This ain’t it chief...",
  "text": "I made myself an account and was forced to verify my account by sending the correct documentation over to them. I did this and my account was verified finally after two days of waiting.  After a couple of days my account was suspended and then shut down due to concerns of my age although I sent through images of my passport.\n\n  I was forced to open another account with a new email but it wouldn’t allow it because they knew by my name and address that I have had a pass account (which they shut down).  It has all been a massive inconvenience that no one should have to go through. \n\nI spoke to customer support and it was like talking to a brick wall. It took 5 minutes for a single reply so I must have been in a chat for an hour to finally come to the conclusion that he couldn’t do anything about it.  \n\nThis would be a great betting app like many others out there but if you’re forced to verify the account then good luck."
 },
 {
  "userName": "Grumpykev81",
  "version": "5.0.5",
  "score": 1,
  "title": "Avoid the slots",
  "text": "The actual betting app is pretty good, odds on the horses are lower than most other sites though. I play slots a lot and I know you play them at very high risk but the slots on PP are by far the worst on any site I’ve been on, tonight’s example is I played £150 and won £4. I’m not writing this because I’ve lost and I’m having a tantrum, as I say I spend a small fortune on slots every week and I accept you will lose more than you win, I’m writing this so those of you that enjoy slots don’t waste a penny, the average win over the last 3 months is about £1 for every £70 spent. I know PP will say they are monitored by the gambling commission but what they won’t tell you is they set the wins per spin at the bare minimum. If you don’t play slots then the betting app is worth a go. If you do play the slots go somewhere else."
 },
 {
  "userName": "Adds&jai",
  "version": "3.24.1",
  "score": 3,
  "title": "Poo",
  "text": "I had £136 then won 38 then hit 0 and the screen froze and blacked out and then after 5 mins put me back on the main paddy power screen and then it showed £81 I turned the app off then on again saw the money didn't go back up and I called paddy power for help. I have been using paddy power for a long time and I feel so let down that's so wrong I didn't bet my screen was frozen then blacked out and I didn't bet please re add my money your app Glitched out and i shouldn't have to lose out because of it. This happened at 7:13 today please help me\n\nThey didn't they just took my money \nIt didn't allow me to play that's what's so disheartening I've been playing and using paddy power for ages and this is the first time that has happened thats why I called straight away and explained what happen if I had used and lost the money I wouldn't contact you look at my account I've lost lots and won lots and not once have I contacted you however this wasn't me that why I'm so mad 😡\n\nThey know their app is faulty it shouldn't be allowed"
 },
 {
  "userName": "dav6679",
  "version": "5.0.3",
  "score": 1,
  "title": "Absolute con",
  "text": "If you receive a special offer from a betting company, BEWARE because their is always a catch, they never give you anything for nothing, if PADDY POWER offer you anything for free avoid like the plague, not only is their the usual catches but in my experience when I tried to use my free bet it took the amount off my cash balance which meant I lost my free bet, I also encountered an issue logging in as the app kept on freezing and as my free bet was for a specific race again I lost my free bet. When I rang Paddy Power the jumped up woman had the customer service skills of a 3 year old, refused to accept any responsibility so I told her to close my account, she didn’t even try and put things right, she closed my account and as a result I lost all the other free bets on my account. Dirty thieves"
 },
 {
  "userName": "viktor kopylov",
  "version": "5.0.4",
  "score": 1,
  "title": "Terrible to their Loyal Customers",
  "text": "So it’s Kosovo vs Azerbaijan (football). On the app it’s saying 0-0. With a draw at ridiculous odds, something like 225-1. You never know Azerbaijan might be parking the bus with 2 reds. And bare in mind it’s like stoppage time at this point (or so the app says). I put a bet on a draw. Then check the score else where. It’s 4-0 Kosovo. Tell the customer service team, and they advise me that they have a 3rd party doing the scoring on the website. I feel like the least thing they could do is just refund me the bet. They didn’t and I won’t be using them again. They also cashed me out on a few bets pretty small but totally dismissed my complaint again. There are company’s Which treat they’re customer a lot better."
 },
 {
  "userName": "trevhad",
  "version": "3.24.1",
  "score": 4,
  "title": "All round good bet app",
  "text": "Have read all the below negative comments and reviews and honestly I don't work for PP or quite frankly Care but my PP app has always been reliable and I have had no problems at all!i find that most people select an option then if it doesn't work they end up pressing buttons everywhere then making the site freeze or crash but as I am an adult I have the patience wherein I can select an option then wait until it loads up!i feel this is a vgood app and does exactly what it says on the tin"
 },
 {
  "userName": "Magicmuff1975",
  "version": "5.1.2",
  "score": 4,
  "title": "iPad version a bit buggy tbh",
  "text": "Been using PP on Galaxy S8 with absolutely no problems whatsoever. Installed and used it on iPad Air 2 (recently updated to software version 13.1.3) but not quite as good as the Andriod version. Laggy and buggy - one example: when you click on ‘open bets’ it fails to show them. They do eventually show but only with repeated attempts. Will probably stick to the Galaxy S8. So much better and reliable. The 4 stars are still deserved due to the fact that PP has been absolutely perfect for me so far in all other areas."
 },
 {
  "userName": "berto1943",
  "version": "5.0.0",
  "score": 5,
  "title": "Re.    Getting.     Bet.    On.",
  "text": "I.   Wonder.      When.      I.     Go.     To.     Put.        A.     Bet.       On.       Say.     Say.       Twenty.    Pounds.     On.      At.      9/2.   Then.    I’m.      Told.     The.     Maximum.      Bet.    Is.    Something.      Like.      £18-30.    At.    Those.     Odds.    Surely.       A.     Firm.      Of.      Paddy.     Powers.      Standing.      Does.     Not.     Need.     To.    Go.    To.    Such.      Lengths.       On.     Such.      Small.      Stake.    And.    Deprive.    A.     Pensioner.     Of.      His.     Only.     Enjoyment.         Please.     Reply.    And.    Give.     Reason.       Regards.     G Sinclair"
 },
 {
  "userName": "dinglydangly",
  "version": "5.1.2",
  "score": 5,
  "title": "Dangerous",
  "text": "The gaming (online slots) side to this app is absolutely toxic! Typical gaming style, you’ll get a few big(?) wins to start, then it claws it back, and not in a subtle way either, more like a sledgehammer to the knees! \nWas playing Diamond Mines Megaways, had a few small wins that lured me in, then before I knew it over 800 spins had gone by without even a hope at the Win Multiplier (which is the aim of this game) not even a furtive glance. Contacted paddy as I did feel a little vulnerable, but no response. \nVery sad 😞"
 },
 {
  "userName": "wadia860",
  "version": "5.0.3",
  "score": 3,
  "title": "Good App",
  "text": "This is a really great App. Paddy Power seem to give the very best offers over all of the other bookies. I wanted to give them 4.5 stars but can only do full stars. The reason it would be 4.5 stars is because there's no option to do the Irish Lottery on this app. I'd love an option for this to be on there. \n\nThe navigating around the app could be a little better (I bet on English football). It’s quite difficult to find particular bets (over/under 1.5 goals for example). Overall,  great work Paddy Power...just get the Irish Lotto on there please and make it easier to navigate."
 },
 {
  "userName": "kzm193",
  "version": "5.0.0",
  "score": 1,
  "title": "A once great app now rife with instability, bugs, and disfunction.",
  "text": "I used this app quite a bit last year.\nIt had no problems, and was generally a pleasant experience.\nNow, if you're lucky to get past the initial loading screen (something you'll find yourself constantly restarting the app for), you'll be greeted with a myriad of non-functionality.\n\nBugs include:\n- UI bugs, for example, not being able to scroll down the right-handed sidebar, for my betslip.\nAnother example would be the menu presented when one presses their balance amount, often completely does not work.\n- Paypal payment, once you press the pay button to send a deposit, you'll be stuck with a loading spinner, with no way to get out. You will have to close the app.\n- General slowness, unresponsiveness, and abject lack of reliability.\n- App startup failure as mentioned above.\n\nThis app needs fixing.\nWhen it is fixed, I'm sure it'll be a great app, especially if apple pay could be implemented?\nFor now, however, I will avoid this app. I suggest others do the same."
 },
 {
  "userName": "Chukyarla",
  "version": "4.1.0",
  "score": 5,
  "title": "Paddy power",
  "text": "About this free £10 bet after you place 5 £10 bets. Not happy with this , I can bet up to and beyond £50 a week in smaller bets . Because I cannot afford to bet £10 a time I get penalised in this offer.\nExample bloke or female comes on every week spends minimum required (5x£10 ) bets and goes on other sites , he gets a free bet. Where as I come on bet up to beyond £50 in smaller bets I get nothing . \nNot fair not good for people like me . Not happy . Please reply . Thanks"
 },
 {
  "userName": "yacht larinka",
  "version": "5.0.3",
  "score": 3,
  "title": "Clarity",
  "text": "The promotions are not clear .  For example\n\n1. Money back if certain horse wins.    If the horse is backed each way then only the win element of the bet is refunded.   This is NOT made clear at the outset and therefore misleading\n\n2.  Advertise payment on 4 places in 14 runner race. Therefore odd should be quarter for place BUT only pays a FIFTH of the odds . This is devious and punter should be offered option as extra to take fourth place and then obtain quarter of odds but to pay out a fifth without communication then again this is devious and if Gaming commission knew then possibility of being fined"
 },
 {
  "userName": "jamesingham",
  "version": "4.0.3",
  "score": 1,
  "title": "Account got hacked",
  "text": "My account got hacked despite only ever logging in on one device with a relatively strong password. They spent all my money on random bets on South American football games. I complained and paddypower said that my account was compromised but that there was no evidence (which makes no sense IMO), and so no refund was due. They then told me to go to my local police (again, makes no sense as there is no \"evidence\"). I replied to the support email as I had originally contacted and now my emails are being blocked/returned as spam. Shame on you paddy power.\n\nI no longer recommend them as I believe there are some serious security concerns with their systems."
 },
 {
  "userName": "Shiboinkers69",
  "version": "6.1.1",
  "score": 5,
  "title": "Love It!!!",
  "text": "I love this app. Can gamble anytime anywhere. I love gambling, even though my wife doesn’t like it I don’t care. I don’t care that she took the kids and is staying at her sisters. Now I’ve got peace and quiet got the house to myself. Don’t have to hear my wife singing or children’s laughter. Just silence and with this app I can have a bet whenever I want and don’t even need to leave the house or see or speak to anyone. Love it."
 },
 {
  "userName": "Fcjhsd",
  "version": "6.0.0",
  "score": 5,
  "title": "Frankie Dettori Sporting Legends",
  "text": "I used to regularly play Roulette until one day deciding to have a spin on the slots. Knowing the reputation of slot games I was hesitant until winning £600 in the space of 20 minutes on my first time using the game. Since then only winning between £50-£100 here and there, but as a game the Frankie Slot is satisfying to play with regular scatter games and bonus games and certainly pays out enough in my experience."
 },
 {
  "userName": "TomH50",
  "version": "4.0.1",
  "score": 5,
  "title": "Worse betting app I’ve ever used !",
  "text": "I have to re boot my iPhone 7 about 10 times a day due to this app freezing ! It’s almost as if the company don’t want you to be able to bet ! It’s that bad. \nOnly reason I still use it is down to the cash plus card that gives you immediate access to your winnings ( when you can manage to actually place a bet that is )"
 },
 {
  "userName": "hzoehvforjjqydur",
  "version": "5.0.1",
  "score": 5,
  "title": "Con artists",
  "text": "Watch out for the “free bets”. They wouldn’t let me put mine on online, told me to phone dial a bet. The Irish girl at dial a bet lied to me that my bet was on and deleted my free bet from my account. Today when I checked my account my bet placed yesterday does not exist. When I contacted paddy power today they say I did not place a bet yesterday.\n\nThey are now looking into it????\n\nNot a trustworthy company"
 },
 {
  "userName": "Stany28",
  "version": "3.24.1",
  "score": 1,
  "title": "For football accumulators, don't bother",
  "text": "I've used the app for probably a year now. Whilst the odds are competitive and the choice and range of betting (all around) is good, the cash out is poor. It's slow and I wonder if Paddy Power have made it this way on purpose. You try to cash out, it then takes ages. When it finally responds you get worse odds than before. I could accept that if the game changed but then you try to accept the odds it provided and they reduce again. I think it's 'theft' from Paddy Power. This has happened a few times.\nI won't be using the app any more!"
 },
 {
  "userName": "CraftyClive",
  "version": "5.1.0",
  "score": 5,
  "title": "CraftyClive",
  "text": "At first I couldn't understand how this worked but PP give me some worthwhile advice and directed me how to bet , sounds to simple for many punters but PP made it simple for me. Thanks for your help Paddy Power...to add , They play fair as far as the punter’s concerned at least you know where your at,  by the end of the day keep up the good work PP ..plus your only a phone call away. 👍👍👍"
 },
 {
  "userName": "PapatoneM",
  "version": "5.0.2",
  "score": 3,
  "title": "Layout of system",
  "text": "Most impressed with clear and concise layout of system.i particularly enjoy building “cross sports “ accumulators, I get some good returns @ low stakes. Other well known sites seem to make it difficult to place bets of this nature. Amassed a nice (£9,300)“kitty “ only to lose most playing roulette late Friday. Gaming online is a Mugs pastime, fingers burnt ( metaphorically) . It’s no consolation to think it wasn’t mine to start with,but a VALUABLE lesson learned. If France win the World Cup in 90 mins I’ll feel a lot better. PapatoneM"
 },
 {
  "userName": "Ash B Scotland",
  "version": "4.1.0",
  "score": 5,
  "title": "Ash",
  "text": "The new app is very poor and more often than not will not load - when it does the site freezes - come on Paddy Power you can do much better than this / get your tech team to resolve the problem or you will loose custom to rival bookmakers\n\nFeb 2018 / site now upgraded and now best on the market : forget the rest Paddy Power is Best!"
 },
 {
  "userName": "Neileng",
  "version": "3.24.1",
  "score": 1,
  "title": "Errors in app..you will pay",
  "text": "WARNING- if their app has errors on it they will not void the bets.\n\nBet on a footy team on the 'in play' feature. Unknowingly bet on a team that was displayed as winning 2-1 but in reality they were actually losing 2-3 but the odds were as if they were winning, my bet then played as I lost, I was shocked as it displayed the final result as if I won. PP did not void the bet and do not take responsibility for ANY errors on THEIR app. Makes the app pointless. \n\nIf the roles are reversed, i.e. You see an error and take advantage of the errors and odds, they will then of course void the bet."
 },
 {
  "userName": "Reso Nix",
  "version": "5.0.5",
  "score": 5,
  "title": "Easy Straight Forward",
  "text": "Easy to use especially through PayPal brilliant odds and some funny selections too.\nBut be careful when betting in the last minutes of play especially football they change the odds every few minutes so it’s harder for you to bet on the correct results!"
 },
 {
  "userName": "Barneydog2013",
  "version": "5.0.0",
  "score": 5,
  "title": "Wish Paddy were more consistent with live betting,",
  "text": "I like the live betting aspect of Paddy Power, but can’t understand why sometimes it is offered and sometimes not, there is no obvious reason why, I have looked at all scenarios. But Paddy Powers new site is faster than before which makes a huge difference to the experience, Tony"
 },
 {
  "userName": "Zigholic",
  "version": "6.1.1",
  "score": 3,
  "title": "No cashout option on app but is on desktop",
  "text": "Theres no cashout option on the ios app (ipad), but the exact same bet is available to cashout on the desktop website? There must be some sort of problem? Surely if you can cashout on desktop website then the exact same bet should be able to cashout on app too? Please sort this out.......... also Please add tote placepot betting on horse racing, all other bookmakers have placepot betting but not paddy power!"
 },
 {
  "userName": "brownhill3",
  "version": "5.0.1",
  "score": 5,
  "title": "Cash back",
  "text": "Even when you get a bet wrong and want to over turn it they will give it you back say you bet a £5 and realise you’ve already had it and want to cash out other bookmarkers will give you like £4.90 back but not pp they give you the lot back very good very easy very satisfied."
 },
 {
  "userName": "ReggieWook",
  "version": "6.0.0",
  "score": 5,
  "title": "Paddy Power App",
  "text": "I always find the Paddy Power App easy to use and it has enough offers to constantly keep you interested. I have never experienced any technical issues and as online bookies go this is quite rightly a market leader. If you are thinking about giving it a go - do."
 },
 {
  "userName": "Eoin.g",
  "version": "5.1.1",
  "score": 5,
  "title": "Good company app not so good",
  "text": "Paddy power are a good company and good to regular clients but the app isn’t so good. Freezes a lot and going from one bet to another is a nightmare especially if plays games. But disappointing for such a big company. Mailed them and the said delete and reinstall!! Bit insulted by that. Enjoy paddy power just be warned app not the best."
 },
 {
  "userName": "Pabjab",
  "version": "4.0.4",
  "score": 1,
  "title": "Misleading",
  "text": "Please watch this site as bonus do not get added when you join and company states if you were directed from a different link then those bonus do not get added even though you join on their own page !  Be careful quite misleading and customer service appalling\nThis above has happened be aware I should have read this ! I have learnt a lesson and be warned the customer care is disgusting basically saying tough sh#t to its customers .\nThis site will be deleted immediately from my devices"
 },
 {
  "userName": "Antonio GLSi",
  "version": "5.0.5",
  "score": 2,
  "title": "One huge error",
  "text": "Its ok apart from one MAJOR mistake that none of the other bookmakers have made. When on your open bets you cannot see what the score is of the teams you have in play, in fact you have to one by one look for the scores, what a massive mess up, makes me want to use another bookmaker just for that alone, sort that out and PP will be up there with the other apps, until then it is just a below average booky app which is fiddly and awkward to use"
 },
 {
  "userName": "DM81A",
  "version": "5.0.3",
  "score": 1,
  "title": "Slow",
  "text": "The App is very slow compared to other well known betting sites, the most annoying thing about this site is, when scrolling down (for example) today’s games, and you happen to see the markets of a particular match, when you click the arrow to go back, you don’t return to exactly where you were, but actually you go out of the list completely! Then you need to click on the list you want and scroll all the way down to where you were!"
 },
 {
  "userName": "dmtrangers",
  "version": "5.0.0",
  "score": 4,
  "title": "New Paddy Power app",
  "text": "Hello, I find new app ok for placing bets but if you have ante post bet on fitba you now can’t see your cash out before new app set up in January which find pathetic!!! Also you can’t now see date your bet was placed like before which also find pathetic!!! If you could see date before how can’t you see it now in new and approved app!!! Cheers DMT."
 },
 {
  "userName": "Mickygas",
  "version": "5.0.3",
  "score": 1,
  "title": "Low payouts and irregular 😔😔",
  "text": "After hearing great reviews from friends on this app I was very keen to download it but after many months and a couple of grand less I find I've had maybe two or three wins on slots worth talking about. \nRecently spent around £300 on slots and biggest win I've had is £20............ I'm very very dissatisfied paddy power. 😡😡😡Your payout ratio doesn't add up and I've deleted this app for now.\n\nI hope you'll take my opinion on board cos you could lose a decent, loyal customer????\nI'll await your response....."
 },
 {
  "userName": "FrankellsPhilly",
  "version": "4.1.0",
  "score": 1,
  "title": "Padddypowerless!",
  "text": "Absolutely terrible since been updated. Can't use PayPal to deposit, neither can you return to the 'home' from the 'deposit' page to use funds already in the betting account. Coming out of the app doesn't resolve this issue either, click back on it and it opens at the 'deposit' page. So much for sensible gambling? This app just wants the money from the users bank account! Will be deleting it once I've had the chance to use the £2.31 in my paddypower account!"
 },
 {
  "userName": "Adamu419",
  "version": "4.0.2",
  "score": 2,
  "title": "No cash out feature",
  "text": "All betting companies are having cash out feature but your app doesn’t have, and even if you bet on teams and when the match commences, it doesn’t notify you or even when there’s a penalty or goal scored, your app is not even closer to William Hill and Betfair because those two companies notifies you when the match starts or even when there’s a card shown or penalty given. Fix your app."
 },
 {
  "userName": "mike wenn",
  "version": "5.0.0",
  "score": 5,
  "title": "Super Fast Super Intuitive",
  "text": "Never gambled or betted in shops before it never made much sense to me but the app make light work of options to bet the odds the return in successful and so theres no need to be a genius!\nThe games are fun too played Roulette and won which was again super easy to learn and use."
 },
 {
  "userName": "viveirland",
  "version": "5.1.2",
  "score": 5,
  "title": "Bonus",
  "text": "Could really do with more bonuses especially on games and casino, as a vip member , I only get bonus from my key account manager and sometimes it’s just nice to see bonuses pop up without having to ask.\n\nApart from that, all good 👍"
 },
 {
  "userName": "mr roles 999",
  "version": "5.1.0",
  "score": 2,
  "title": "Few things need to improve",
  "text": "I’ve had problems where Iam winning on the fruit slots and it freezes and I lose my money it happened twice the other night I called and the staff where terrible,I’ve never had a problem with them I’ve told friends and family who have joined this because of me and I think there’s a few things not up to scratch st the minute I was thinking king of leaving"
 },
 {
  "userName": "nochouce",
  "version": "5.1.1",
  "score": 4,
  "title": "Keep coming back to it",
  "text": "Not perfect but a decent app.  whilst I do use others find myself coming back to PP. Offers ‘ In Running’ betting which most don’t but route into it can be bit fractious at times. Specials are handy. One thing don’t like is way you can find yourself in the ‘Casino’ section by default."
 },
 {
  "userName": "The 3 terriers",
  "version": "6.1.1",
  "score": 5,
  "title": "Time to bet",
  "text": "Great app easy to use I like the fact you can preset a limit to how much you can bet.\nI know you can change it but by the time you gone into that part of the app you have time to consider what your doing"
 },
 {
  "userName": "Unhappy234",
  "version": "6.1.1",
  "score": 1,
  "title": "Avoid, poor customer care",
  "text": "Experience used to be quite positive but a bet recently ‘disappeared’ from my account.... a bet I am very confident would have come through! They initially accused me of never having made the bet.... then said I claimed it early.... but it isn’t anywhere on my account. No help, just false accusation. Was told my query would be passed to management and I would receive more info, never heard back. Amount I had bet was v low but it‘s the principal. Have lost all trust."
 },
 {
  "userName": "Briggsaroony",
  "version": "4.0.5",
  "score": 5,
  "title": "Never had an issue",
  "text": "Have been using pp for a good 5 years now and never had any issues. I have tried most betting apps but pp is my go to. I find it easy to use for horse racing and can't see where all the negativity is coming from."
 },
 {
  "userName": "Jbrack86",
  "version": "6.1.0",
  "score": 1,
  "title": "Scam",
  "text": "Deposited £20 put it on Roulette landed on black 10 then glitched and was all of a sudden in red then got a message across the screen saying there was an error with the game. Went on chat got through after 20 minutes and was told it would be escalated. Asked for my winnings or at least my money back but no joy. I feel completey scammed. I play to have fun winning is just a bonus for me. Doubt I will get a response or any money back so I suggest to anyone thinking of downloading this app DO NOT DOWNLOAD."
 },
 {
  "userName": "Halps1471",
  "version": "5.1.1",
  "score": 1,
  "title": "Mr Halpin",
  "text": "I have spoken to the paddy power team about this but I don’t seem to get anywhere. The total goals and corners market has been my bet for years, suddenly a few days ago it disappeared. They say it’s down to the traders but I just don’t get it. It’s been on every major game for the past 10 years so why would you suddenly stop putting it up. I’ve been having that bet every day for the past ten years. The paddy power answer just doesn’t make any sense."
 },
 {
  "userName": "Lumleton",
  "version": "6.1.0",
  "score": 2,
  "title": "Crashing",
  "text": "For some time this app has had little glitches, like you select a goal scorer to bet on and it actually slects the next goal scorer down. Annoying but you can work around that.  Today the app is just crashing constantly. Closing and restarting doesn’t help just blank screen when I try to place a bet. Had enough, just want my money and I’ll use something else."
 },
 {
  "userName": "T P Jenkins",
  "version": "4.0.4",
  "score": 3,
  "title": "Confusing layouts and availability of bets",
  "text": "Have used this app for football bets for about six months. Often obvious bets are unavailable; for example wanted to bet on who would win FA Cup and this not available, however obscure foreign matches in abundance. Presume for addicts only - kind of a fixed odds betting terminal in your pocket. If you want to bet continually on unknown matches great but for the casual punter I’d try elsewhere."
 },
 {
  "userName": "Bi11yBu11dog",
  "version": "6.1.1",
  "score": 5,
  "title": "MP",
  "text": "Great App. Not a big gambler, a few horses, the odd footy match or try scorer in a rugby match. App is easy to use, a bit of fun and never had any issues in the last couple of years. I should add, they do through the odd free bet my way every so often, hint, hint 😁"
 }
]