[
 {
  "userName": "Eamonntr",
  "version": "3.6.8",
  "score": 4,
  "title": "Not a big gambler",
  "text": "I'm not a big gambler and would only have an occasional punt on the Premiership. Usually gamble on this as plenty of markets and odds seem good compared to some. Wouldn't mind a football only app as loads on it but I only use football. That said it's easy to find Premiership games and they've added a Bet Builder function so you can add loads of goalscorers, bookings etc etc. in same game."
 },
 {
  "userName": "seankeenan1986",
  "version": "3.6.9",
  "score": 5,
  "title": "Boylesports App",
  "text": "This app is excellent. Very easy to navigate through each sports individual to place a bet. Depositing and withdrawing money is very straight forward. With the new cash out offer available during pending accumulators, this has brought the app ahead of its competitors and ahead of the game. #TimeToPlay"
 },
 {
  "userName": "gabewalton",
  "version": "3.6.1",
  "score": 5,
  "title": "Good So Far",
  "text": "Despite a lot of complaints this app is running fine so far. Won £15 quid tonight and have withdrew the money. If the money enters my bank account i will be more than happy to deposit again. App runs smoothly and is up to date. So far so good!"
 },
 {
  "userName": "wosik98",
  "version": "3.6.11",
  "score": 1,
  "title": "Read before you bet",
  "text": "All teams winning by 1/2 goals, from the beginning of the bet starting cash out was suspended, every single game from kick off says suspended all the way through until the games finishing. Ended up losing to a 90+ min goal but checked cash out at 60 mins. Awful betting site. Check your bet as soon as it kicks off they say “market suspended for this match” but click on the match and it’s open for betting. Absolute scam!"
 },
 {
  "userName": "bluemonkey29",
  "version": "3.6.9",
  "score": 5,
  "title": "Such an improvement",
  "text": "BoyleSports must have really listened to customer feedback. This version of the app is so easy to use and love the new bet builder and combined odds features. I can even check my loyalty points from my shop bets."
 },
 {
  "userName": "Barrybruce",
  "version": "3.6.6",
  "score": 1,
  "title": "Restricted Account and terrible App",
  "text": "The app itself has always been terrible but they did tend to offer some decent promotions so stuck with them and was a whopping £30 in credit over a 3 month period which was enough for them to restrict my account and ban me from promotions. Customer service is appalling and cannot tell you why but can tell you the decision will not be reversed. No great loss (which is exactly why my accounts been restricted)..."
 },
 {
  "userName": "Engelsman1975",
  "version": "3.6.4",
  "score": 5,
  "title": "Like it. A lot!",
  "text": "I really like the new App Boylesports. A big move forward on the old one and certainly much easier to use. The navigation around the sports is much better! Big step forward. Best of luck."
 },
 {
  "userName": "Sondorpalko",
  "version": "3.6.9",
  "score": 5,
  "title": "Fast and reliable",
  "text": "The app is superfast and very reliable when it comes to placing on bets. I enjoyed the layout of it as well and how straight forward it is to be used. In the top range from all sportsbook apps out there."
 },
 {
  "userName": "Greysi Grishelyov",
  "version": "3.6.11",
  "score": 5,
  "title": "App is fast",
  "text": "I have used BoyleSports for many years and they are without doubt the best bookies I have ever used. They provide very competitive odds, great promotions and any time I’ve needed to use their customer service it’s been excellent."
 },
 {
  "userName": "Cyprus2020",
  "version": "3.6.11",
  "score": 5,
  "title": "Good betting site",
  "text": "Been using the site on and off for a number of years. Definitely one of the best for giving out the best odds for various sporting events. Will continue using in the future"
 },
 {
  "userName": "rab2606",
  "version": "3.6.11",
  "score": 5,
  "title": "Fab",
  "text": "Just joined up as my local shop changed from William Hill to Boyle and I can happily say the app and betting experience have been first class so far, and I would highly recommend"
 },
 {
  "userName": "Luke_12jones",
  "version": "3.6.11",
  "score": 1,
  "title": "Disgraceful",
  "text": "This evening I placed 2 bets on Liverpool to win the odds were 18/1 and then 20/1 5 minutes later I placed a £1 and a £2 and should have received £60+ back after Liverpool won but because they didn’t win in 90 which it didn’t say they had to I didn’t get my money. I then complained to the chat support and their response was “Read the Rules then” this is a disgrace and not worth the money, thieving scum this site"
 },
 {
  "userName": "Quilty78",
  "version": "3.6.5",
  "score": 5,
  "title": "Top marks",
  "text": "Fantastic app! Fast, great navigate and just all round easy to use. Great layout and some great offers which is a real bonus! Would highly recommend to anyone."
 },
 {
  "userName": "Jezlin Fluin",
  "version": "3.6.11",
  "score": 5,
  "title": "Doubled my winnings a few times",
  "text": "Great to be able to watch the racing live through the app, especially with At The Races losing Irish racing, happy out"
 },
 {
  "userName": "Dujuana Thorley",
  "version": "3.6.11",
  "score": 5,
  "title": "paid out quick",
  "text": "Boylesports betting app is a very good, it has many different features and is very easy to navigate 5 star rating from me ? ? ?"
 },
 {
  "userName": "Brenlyn Margett",
  "version": "3.6.11",
  "score": 5,
  "title": "Excellent for horse racing",
  "text": "By some way my favourite bookie. Regular good offers and any issues dealt with promptly and proffesionaly. Highly recommended unlike many other online outfits!"
 },
 {
  "userName": "Keashawn Hanmer",
  "version": "3.6.11",
  "score": 5,
  "title": "Never any issues",
  "text": "First opinion of the app is very good, very user friendly. Bets and promotions have all been settled promptly, can't really ask for much more!"
 },
 {
  "userName": "Rickyticktick",
  "version": "3.6.11",
  "score": 5,
  "title": "Very good",
  "text": "Works well and easy to use, just doesn't win on every bet I place, could you improve on this please lol"
 },
 {
  "userName": "Damo5979",
  "version": "3.6.11",
  "score": 3,
  "title": "Poor App in comparison to others",
  "text": "Went on the site and was looking at greyhound racing. All of the next off races were already off and you couldn’t have a bet on them. What’s the point?"
 },
 {
  "userName": "KenKenzoBanks",
  "version": "3.6.11",
  "score": 5,
  "title": "Easy",
  "text": "Easy to use, just wish it was as easy to pick winners! Highly recommended."
 },
 {
  "userName": "Jaslynn Buxam",
  "version": "3.6.11",
  "score": 5,
  "title": "Quick response if I have any issues",
  "text": "I bet everyweekend with this app & never have any issues A+"
 },
 {
  "userName": "Scott Edgett",
  "version": "3.6.11",
  "score": 5,
  "title": "Good specials",
  "text": "Quick response and friendly service"
 },
 {
  "userName": "cathryn123",
  "version": "3.6.11",
  "score": 4,
  "title": "Weekend betster with the hubby",
  "text": "I enjoy a weekend bet with the hubby so love this easy to use app. \n\nIt breaks down horse racing and football for even a starter like me to enjoy and be confident using. \n\nSecure and help is always at hand"
 },
 {
  "userName": "Lucymae Currin",
  "version": "3.6.8",
  "score": 4,
  "title": "Surprisingly good",
  "text": "I'll be honest I was only vaguely aware of boylesports but downaloaded app to get opening offer. Surprised at how easy it is to use and can't complain on prices. Have recommended."
 },
 {
  "userName": "Andy morrison",
  "version": "3.6.11",
  "score": 5,
  "title": "Boylesports Review",
  "text": "Morrison67 I found this app very appealing as it’s very easy to navigate around and find what you want immediately"
 },
 {
  "userName": "Dionysios Buckler",
  "version": "3.6.11",
  "score": 5,
  "title": "Better than SkyBet",
  "text": "I love games and casino. Excellent selection of games, easy deposit and withdrawals methods. Friendly staff in store"
 },
 {
  "userName": "Kaylina Tefft",
  "version": "3.6.11",
  "score": 5,
  "title": "Easy to use",
  "text": "Simple straightforward quick and accommodating,Curtious if problem"
 },
 {
  "userName": "Iluvcats769",
  "version": "3.6.11",
  "score": 5,
  "title": "Brilliant app",
  "text": "Best odds, best customer service, best selection of streaming quality. Only thing it is missing is a built in JustEat button"
 },
 {
  "userName": "CD1977!!!!!!!!",
  "version": "3.6.8",
  "score": 5,
  "title": "Solid",
  "text": "A reliable App. Service never goes down (unlike Apps of certain competitors)....."
 },
 {
  "userName": "Malak Jablonski",
  "version": "3.6.11",
  "score": 5,
  "title": "Quick response if I have any issues",
  "text": "Very efficient"
 },
 {
  "userName": "Barrymcb",
  "version": "3.6.8",
  "score": 5,
  "title": "Very easy to use",
  "text": "Really good app, a lot easier than a lot of other online bookies."
 },
 {
  "userName": "Shug23",
  "version": "3.6.3",
  "score": 1,
  "title": "Slow",
  "text": "The App is painfully slow. No chance of placing an in play bet as there is every chance a further 3 goals will have gone in by the time the bet is placed. Really poor ! Send through promotions that don’t work and ask you to send screenshots to prove you won. Terrible service."
 },
 {
  "userName": "Shyvonne Burn",
  "version": "3.6.11",
  "score": 5,
  "title": "Good app",
  "text": "i am playing the last ten years and this is one of the best betting websites & apps i found thank you 😃"
 },
 {
  "userName": "Brydox",
  "version": "3.6.11",
  "score": 2,
  "title": "Poor",
  "text": "This app is pretty poor in my opinion the UI is horrible it lags is more annoying than it needs to be they also except phone bill payment this method is horrible and gets people into debt stay well clear imo"
 },
 {
  "userName": "Amsbu85",
  "version": "3.6.3",
  "score": 1,
  "title": "Poor loyalty",
  "text": "One of the worst sites ive used.\nIve used a lot of betting sites but this has to be the worst for customer loyalty bonus is extremely rare points are almost non existent and when you contact the care team they couldn’t care less!\nFind another site don’t waste your money!!"
 },
 {
  "userName": "Holmer Dornin",
  "version": "3.6.11",
  "score": 5,
  "title": "My lucky bookie",
  "text": "The sign up bonus isn't great but the offers for existing customers are awesome !"
 },
 {
  "userName": "Brashaun Thirlwall",
  "version": "3.6.11",
  "score": 5,
  "title": "Use it every weekend",
  "text": "Excellent customer service & very easy to deal with"
 },
 {
  "userName": "Avynn Vedntyev",
  "version": "3.6.11",
  "score": 5,
  "title": "Fast wihdrawals",
  "text": "Very good promotions. ..pay out fast ... easy to use app ... I would recommend boyles to my friends .."
 },
 {
  "userName": "Haelie Ruddle",
  "version": "3.6.8",
  "score": 5,
  "title": "Impressed",
  "text": "I was impressed by the app, I really can’t fault it, it has everything I want in a betting app"
 },
 {
  "userName": "Adamc1213",
  "version": "3.6.11",
  "score": 5,
  "title": "The app",
  "text": "The app is great simple to use easy to navigate makes betting easy to do and enjoy"
 },
 {
  "userName": "Suzett Thackray",
  "version": "3.6.11",
  "score": 5,
  "title": "CS is amazing",
  "text": "Much Better Offers than the Paddy Power Website - Easy to use & Lots of Free Bets. Unlike Paddy Power Offers"
 },
 {
  "userName": "conkster",
  "version": "3.6.11",
  "score": 1,
  "title": "Withdrawal problems",
  "text": "When I withdrew money from my account I got an email saying it can not go through and they can not send money to my account? Can’t say I’ve ever heard of any betting site who can’t put money on to a card. They’ve got no problems taking it from one though"
 },
 {
  "userName": "Raionna Chicchelli",
  "version": "3.6.11",
  "score": 5,
  "title": "easy to bet",
  "text": "Bets always settled very quickly. A few more free bets wouldn't go amiss though ?"
 },
 {
  "userName": "Giveit a name",
  "version": "3.6.4",
  "score": 2,
  "title": "I have to continually log in",
  "text": "Even just looking at another site for 2 seconds means that you have to log in, go back to the homepage and navigate from there. Was easier before the upgrade."
 },
 {
  "userName": "Saphronia Drane",
  "version": "3.6.11",
  "score": 5,
  "title": "10 out of 10",
  "text": "Double winnings on football is good"
 },
 {
  "userName": "Irie Tilbrook",
  "version": "3.6.11",
  "score": 5,
  "title": "fast",
  "text": "Football bet offers are good"
 },
 {
  "userName": "Kunta Leamy",
  "version": "3.6.11",
  "score": 5,
  "title": "I use it for darts",
  "text": "Easy to use and amazing customer service."
 },
 {
  "userName": "Oss2121",
  "version": "3.6.9",
  "score": 5,
  "title": "Fast and easy to use!",
  "text": "A brilliant and user-friendly app."
 },
 {
  "userName": "Keira Dumbarton",
  "version": "3.6.11",
  "score": 5,
  "title": "Great service",
  "text": "I've been betting with Boyles for year now - It’s a solid business"
 },
 {
  "userName": "Eleonor Copcote",
  "version": "3.6.11",
  "score": 5,
  "title": "No complaints",
  "text": "My current favourite bookie. Some good prices and offers. Support very good too"
 }
]