[
 {
  "userName": "JemmBear",
  "version": "2.22.0",
  "score": 5,
  "title": "Review of Casumo",
  "text": "I can’t really remember where I first saw or heard of Casumo but like most gambling game sites I was a little hesitant. However Casumo has to be my all time favourite app to play on. The games are so fun to play, deposits & withdraws are so easy to make and the team are so fun and so easy to talk to. I 1000% trust Casumo for a fun time and 1000% trust them with my money.  I love the app so much! I also love how they let you know how long you have been on for and how much you might have won or lost so you get a reality check so you don’t go crazy or do something that you might regret! Casumo is awesome!"
 },
 {
  "userName": "brensutton95",
  "version": "2.37.1",
  "score": 1,
  "title": "ONE OF THE WORST",
  "text": "CASUMO has got to be one for the worst casinos to come across never won anything more than what has been deposited. Weeks and weeks by and lost over £200 without one withdrawal I know they abide by regulations but ever where else I have played on the exact same games seem to pay out more and run extremely smoother. If I could give 0 stars I would i know it’s about luck but even read trustpilot reviews the app is a complete scam and traps you in alway under your deposit I have two accounts with Casumo and never seen a profit, will never be using again hope everyone sees this as I’m not really ever see and reading any good winners on this app."
 },
 {
  "userName": "Panos Germanakos",
  "version": "2.28.0",
  "score": 1,
  "title": "DONT WASTE YOUR MONEY HERE",
  "text": "Many times when I was playing online there were interruptions with their systems and my bets were not accepted things like that..one week ago while I was playing blackjack I couldn’t select hit, stand, double, split nothing..my connection were perfect and as they told me in the live chat they saw that there was interruption with THEIR system. I would have won the hand I had a 10 dealer had 2 and the next card was 10 but I couldn’t hit...to make the long story short I contacted them many times and it’s like talking to the wall they didn’t refund me. So I told them to close my account."
 },
 {
  "userName": "Spawnkl",
  "version": "2.40.2",
  "score": 5,
  "title": "Bonus",
  "text": "Sean, who support me, he is give all answers, and more important, that he understand customers, he is amazing person, I think more helpful person in the world, understanding situation, I not just trying help, he find right solution, I hope and wish that all people who working in customer service will be like Sean, Thank you very much for you help, \nKind Regards \nAlex"
 },
 {
  "userName": "Exinosvio",
  "version": "2.29.0",
  "score": 5,
  "title": "Its good!",
  "text": "Been playing here (but not often) for quite a while . Its the best imo! The problem i have now is that i want to play for example 7 sins on my iphone 6 and at the start it shows to drag upwards so you can start. It does nothing when i do that , so i cannot play. Deva any idea? Tried all kinds of swipes , nothing works..."
 },
 {
  "userName": "Griffiths 26",
  "version": "2.40.2",
  "score": 1,
  "title": "Absolutely terrible.",
  "text": "Started playing with Casumo about 6 months ago and all it does it take take take. You NEVER win. You have to at least put £100 in to win a bonus and even then every bonus I played was giving me back no more than 50 quid in winnings. Horrible experience for a customer who’s spent thousands and get nothing back. Never experienced anything like it before as a gambler. Please please use other online casinos because Casumo is definitely the worst I’ve played on. I wouldn’t even give a star if I could help it."
 },
 {
  "userName": "AdamB96",
  "version": "2.27.0",
  "score": 4,
  "title": "Great casino deserves better app!",
  "text": "Fantastic casino with great offers and a huge selection of games. \n\nThe app on the other hand is slow and doesn’t load some games.\n\nupdate 2.27.0 seems to have made things run a bit quicker but i’m still having to use safari on ios to play."
 },
 {
  "userName": "Badeng9",
  "version": "2.38.1",
  "score": 2,
  "title": "Good casino, terrible app",
  "text": "Have used Casumo on PC for a while with no issues. Decided to try the mobile app today and it is terrible. I could get only one spin out of any slot I tried, then it would just constantly reload the game over and over to no end. Requiring the app to be force closed to get back to the main menu. Tried multiple times with multiple games but faced the same issue every time."
 },
 {
  "userName": "Chicken dipppppper",
  "version": "2.40.2",
  "score": 1,
  "title": "Go to someone trustworthy",
  "text": "Extremely quick to take your money and extremely slow to give you it back when you win!\n\nI have been using Casumo for over a year and the first time I’m up they require more information that takes 24 hours for someone to review to be them told that isn’t not good enough. I have been with Skybet for years and never been asked for any of this. Definitely be deleting the app and my account after/If I get my money 😡"
 },
 {
  "userName": "Fbxgcbcgjdk",
  "version": "2.34.0",
  "score": 3,
  "title": "Like most sites",
  "text": "Deposit and withdrawal no problems, like most sites, once you have had a big win and withdrawn you find that features never happen as often or if ever as they did initially, or is it just me ? Just an initial bonus and nothing after that \nBut all in all an ok site"
 },
 {
  "userName": "Twcjkfdfsdhjiopknvcxcnhfd",
  "version": "2.37.1",
  "score": 1,
  "title": "Broken!",
  "text": "Game constantly crashes. Ill be half way through placing a bet on live roullette and it will crash and by the time i load it back up bets are closed and iv got not even half the numbers covered that i planned to. Get free spins and it will crash and they dissapear wasted so much money and the only reason i keep playing is because you can lock withdrawals! Fix your app! I tried deleting and re-installing the lot!"
 },
 {
  "userName": "heyejehens",
  "version": "2.34.0",
  "score": 5,
  "title": "Casumo",
  "text": "I have dabbled with many gambling sites but I must say Casumo is the best site by far. With a large variety of games and bonuses available for large cash outs, would highly recommend."
 },
 {
  "userName": "trigull",
  "version": "2.33.0",
  "score": 1,
  "title": "Worst of all",
  "text": "Terrible site very low payouts on games that’s if you can get them working as seem to constantly crash and freeze on winning rounds customer service terrible rubbish bonuses long wait time for money to be returned have to jump through hoops to get what’s rightfully yours would rate zero stay away from this one ...and no this isn’t a case of bad loser before any trolls jump on it !"
 },
 {
  "userName": "ManLikeSmithy",
  "version": "2.36.0",
  "score": 1,
  "title": "Used to be great",
  "text": "I used to love Casumo , now with the latest update its constantly crashing and taking me back to the main screen . Every 20/30 seconds, sometimes it works for a few mins but it will always crash . \n\nTotally ruined experience when it crashed on a big stake feature . Please please fix this , I can’t be the only one with issues !!!"
 },
 {
  "userName": "dogg755",
  "version": "2.30.0",
  "score": 1,
  "title": "Too many fails",
  "text": "I gamble every month with casumo, and have recently moved to the app.\nUnfortunately at the moment the app is broken in several ways.\n\nA couple of games I have tried completely fail to load, kicking you back to the game choice screen. \nOne game I would really like to play, a megawatt buffalo one, loads then gives an internal server error message. It did this a few days ago, then worked for a couple of days, now fails again.\nI’m currently checking through what games I have access to one by one. NOT something I consider fun. \nSo yeah, get your act together casumo, you take more than enough money from us..."
 },
 {
  "userName": "Greenoooo",
  "version": "2.30.0",
  "score": 5,
  "title": "The best",
  "text": "I would defo say this is the best site for slots , no hassle when cashing out and only takes one to two working days . If u want a good slot site this is it 👍"
 },
 {
  "userName": "Craig989",
  "version": "2.20.0",
  "score": 5,
  "title": "Great app",
  "text": "Won £400 last night pending on that but great app I use website but it’s the same but great website and app 100% enjoyed being with Casumo"
 },
 {
  "userName": "jamesellis85",
  "version": "2.6.1",
  "score": 5,
  "title": "Get wonky on mobile",
  "text": "Great app use it daily after work. Only thing is you need to get more of the pc games on mobile eg wonky wabbits and secret of the stones"
 },
 {
  "userName": "Brdhnnnn hug",
  "version": "2.40.2",
  "score": 1,
  "title": "Don’t play this game",
  "text": "I won some money but the game keeps crashing I tried to go back onto the game and it keeps booting me off. I’ve tried it on my laptop, I phone and iPad. My connection is fine. Definitely something wrong with this app. I cannot even get onto live chat to speak to someone about this I have now wasted money on this"
 },
 {
  "userName": "luke048",
  "version": "2.40.2",
  "score": 1,
  "title": "Worst gambling app out there",
  "text": "I have played on various apps and I’ve got to say casumo is the most unfair out of all the apps I have previously played on, I have now lost around £500 pound and not once I’ve had a decent win to withdraw, on other apps i seem to win atleast something worth withdrawing. \nOn other apps I actually have net profit \nOn casumo it’s all loss"
 },
 {
  "userName": "Laujk",
  "version": "2.18.0",
  "score": 5,
  "title": "Jackpots",
  "text": "Love this app and casumo but would like to know which games have jackpots so maybe a jackpot section would be good"
 },
 {
  "userName": "Hajinku",
  "version": "2.17.1",
  "score": 1,
  "title": "Don’t say I you didn’t get warned! Do not trust these guys",
  "text": "Do not trust this app. I. The first day of signing up, i won £1000 and they decided to put bans on my account! They would not give any reason as to why? If they can offer an explanation them clearly something dodgy is going on. I highly suspect they are rigging something. DO NOT TRUST"
 },
 {
  "userName": "Connor009",
  "version": "2.40.2",
  "score": 1,
  "title": "I’d",
  "text": "Need to take picture of Id like passport/driving license to sign up I currently don’t have none all so need  take a picture of letter like bill or any thing with address on seems bit daft to have to sign up like this and bit dodgy think I will give it a miss there lose as I gamble big"
 },
 {
  "userName": "ALW67whu",
  "version": "2.17.1",
  "score": 1,
  "title": "Another casino site",
  "text": "Can we please have a self-excluding app for all casinos and betting sites which will bar anyone from opening new accounts-it’s not always easy to control your gaming when you can just sign up to a new site when you are feeling down or weak"
 },
 {
  "userName": "unlucky Genie",
  "version": "2.40.2",
  "score": 1,
  "title": "Difficult in closing games",
  "text": "What a nightmare. Loaded  a game played for awhile then attempted to leave the game but there was not a home button in sight nor any other button that would allow me to exit the game .Spend a long time trying to exit a game with no luck on my iPhone X"
 },
 {
  "userName": "lucypollard1",
  "version": "2.21.0",
  "score": 3,
  "title": "Connectivity issues",
  "text": "Good app when it works but quite often it freezes"
 },
 {
  "userName": "RichieRich2015",
  "version": "2.5.1",
  "score": 3,
  "title": "No function with Apple pencil",
  "text": "Doesn't seem to work with Apple pencil. It will show it pressing buttons but doesn't actually press them. Any ideas?"
 },
 {
  "userName": "nice fruitcider",
  "version": "2.22.0",
  "score": 1,
  "title": "Shame",
  "text": "Real shame , but this app keeps crashing!! I enjoyed for a while but it crashes and then you loose the enjoyment. I actually went on the desk top site to express my disappointment and while I was chatting on the online chat they logged me out! And said my session had expired! RUDE"
 },
 {
  "userName": "GJREEM",
  "version": "2.33.0",
  "score": 4,
  "title": "Love slots",
  "text": "Love this app and Casumo is good. Not just good but fantastic. It has my fav black magic fruits and you get your winnings back within two days. Love u casumo you are wicked 👍👍👍😁😁😁"
 },
 {
  "userName": "acey80",
  "version": "2.25.0",
  "score": 1,
  "title": "Review",
  "text": "Absolutely shocking site you spin and it takes credit off you then when you have still credit left it says no fund left absolute joke definitely wouldn’t recommend this site at all"
 },
 {
  "userName": "Mr Limpo",
  "version": "2.33.0",
  "score": 1,
  "title": "Money in.",
  "text": "This is the worst gambling site I ever been, one week I tried playing, it will never give u your money back, when it comes to free spin, free spins will only pay you coins.\n\nI hope they will not delete this comment, last one got deleted,\n\nGood luck pigeons"
 },
 {
  "userName": "Gazza Lichfield",
  "version": "2.8.0",
  "score": 1,
  "title": "Poor payouts",
  "text": "App is a little buggy and poor on Apple devices. Payouts are also poor so if your a high roller then this site is a no go. Returns are very poor so dont expect to win and cashout regularly. The tilt is high also. There are better slots/casino sites that have better returns"
 },
 {
  "userName": "Ly5bk1",
  "version": "2.38.1",
  "score": 1,
  "title": "Really bad experience",
  "text": "When you won the money and try to withdrawal, they will asking you many proof documents, although you did sent proof documents but they still can not verify and can’t withdrawal. Be careful your money"
 },
 {
  "userName": "chrisk3pt",
  "version": "2.20.0",
  "score": 1,
  "title": "Same old rubbish AVOID LIKE AIDS!",
  "text": "Hooks you in by a little win (Standard) then hammers you till you have no money left 😂 wouldn’t recommend stick to the big boys like sky Vegas etc “very ropey gameplay with no regular bonuses”\n\nI await the bot reply from site saying we are regulated by trading standards etc 😂😂😂😂"
 },
 {
  "userName": "Nj5353",
  "version": "2.40.2",
  "score": 1,
  "title": "No freebies or bonuses",
  "text": "Spent £240 in 6 hours, couple of bonus triggers that paid nothing.. No bonuses or freebies.. \nSo many better paying sites out there for that sort of deposit..\nDisappointing tho as this is actually not a bad app.."
 },
 {
  "userName": "Evertondavid",
  "version": "2.30.0",
  "score": 1,
  "title": "Rip off",
  "text": "Avoid!\n\nI have played on a few different sites and don’t gamble a lot (£20 max) a day here and there. This site is the worst for % payout. The site crashes all the time and is so fixed it’s untrue. \n\nMake your own minds up about the site but honestly it needs investigating. Absolute rip off! \n\nAs for the trophies and level ups, these are pointless and don’t do anything! Little bit odd and very childish considering its meant to be an adult site."
 },
 {
  "userName": "jl123;",
  "version": "2.28.0",
  "score": 1,
  "title": "Where to start",
  "text": "Blackjack table is blurry so you can’t really see the cards. The app doesn’t stay open when playing. Can’t login without it self refreshing."
 },
 {
  "userName": "Dogwalker63",
  "version": "2.40.2",
  "score": 1,
  "title": "Getting back in!",
  "text": "I’ve been a member but not used the site for a while, now when I tried to log back in I have to send a Live Photo my driving license and proof of address a bit OTT"
 },
 {
  "userName": "gahsjidhd",
  "version": "2.20.0",
  "score": 1,
  "title": "Disappointing casino site",
  "text": "This site is crap and you can’t withdraw your own deposit if you want! Would not suggest this site to anyone! Disappointing!"
 },
 {
  "userName": "wills282080",
  "version": "2.39.1",
  "score": 1,
  "title": "Absolute robbery",
  "text": "Sighned up today spent £30 pound won nothing good range of games but might aswell thrown down drain in with a lot of slot company’s this is by far the worst one I’ve ever come across DO NOT WASTE YOUR MONEY"
 },
 {
  "userName": "Lucianwd63db",
  "version": "2.37.0",
  "score": 5,
  "title": "Feedback",
  "text": "I like so much to gamble."
 },
 {
  "userName": "lovelyrobot14",
  "version": "2.34.0",
  "score": 1,
  "title": "Not happy",
  "text": "Deposited close to £6K since I started playing with them.\n\nStopped when I deposited £100 and didn’t get ONE single winning spin on £1 bet.\n\nThat’s 100 spins and no winning spin."
 },
 {
  "userName": "mollywm5100",
  "version": "2.21.0",
  "score": 1,
  "title": "Don’t like one bit",
  "text": "Don’t like this app I put money on lucky lady biggest win was 10 what a joke I’ll stick to grosvenors casino won £1500 off there app😡😡"
 },
 {
  "userName": "Darrenmo",
  "version": "2.8.0",
  "score": 1,
  "title": "Don’t waste your money",
  "text": "This is bad bad bad eats your money bonuses are non existent and when you do get one if your lucky ha ! You will win pennies so don’t even bother with it 😔"
 },
 {
  "userName": "nonickname6347",
  "version": "2.22.0",
  "score": 1,
  "title": "Pretty rubbish",
  "text": "I’ve only played it three times but every time I start an ok run, it just switches off, really annoying, it’s as bad as a bookies app."
 },
 {
  "userName": "Tw185",
  "version": "2.22.0",
  "score": 5,
  "title": "⭐️JACKPOT⭐️",
  "text": "Great app great casino a few large wins here and there appreciate it 👍🏻👍🏻"
 },
 {
  "userName": "whabjsjdbdbdj",
  "version": "2.40.2",
  "score": 1,
  "title": "Shocking",
  "text": "Constantly crashing and re-loading games. Deleted App after 1 day."
 },
 {
  "userName": "Shaba 737574929472233",
  "version": "2.38.1",
  "score": 1,
  "title": "Terrible casino",
  "text": "Terrible casino. £30 in and not a single bonus on dead or alive with 45p spins sky Vegas would get me 4 bonuses with that much"
 },
 {
  "userName": "mel1111111111-",
  "version": "2.40.2",
  "score": 1,
  "title": "Crashes",
  "text": "App keep crashing games won’t load"
 },
 {
  "userName": "Trace3005",
  "version": "2.25.0",
  "score": 1,
  "title": "Wild gold",
  "text": "My opinion of this game it just takes your money, tonight I saw it slip on a spin stopping me winning, I’ve decided I won’t be returning to Casumo"
 }
]