[
 {
  "userName": "L1ll1pop",
  "version": "4.0.0",
  "score": 5,
  "title": "Excellent platform which will continue to grow",
  "text": "The concept is fantastic and is so much safer than standard betting. The different ways you can generate income is brilliant and bets last three years before having to worry about cashing in. \nThe new update of the IOS app is nice, but there are still some differences between the website and app. The ability to ‘star’ players you are interested in but haven’t bought yet hasn’t come across from the website to the app, whilst you also cannot sort based on % gain or dividends return which would be useful. \nI would also like it to be possible to search via a players club to make it easier to search for players. \nThe ability to spin the app when turning the phone screen could allow for more visibility when looking at your portfolio too. \nOverall a super product and very glad to have found it, just wish I had done so six months earlier!"
 },
 {
  "userName": "coldore",
  "version": "4.0.0",
  "score": 4,
  "title": "Football Player Trading",
  "text": "A unique innovative platform where you can buy, hold & sell players. Traders can make money from a variety of ways - price rise, performance dividends, media dividends & inplay dividends (goals & assists). \nUnlike a normal bet you won’t lose all your money & the player could rise again into profit.\nFootball Index listen to their customers & are constantly looking at ways to expand & improve the product.\nThe platform has a few bugs & does need improving. I believe the trend list should be money increase, not percentage. This is because lower priced players get on the trend list easier. Also it would be very handy to know your profit/loss from selling & how that would affect your balance before you did so.\nI really enjoy the product & I will not be placing a normal bet again."
 },
 {
  "userName": "GreyHair",
  "version": "3.9.3",
  "score": 4,
  "title": "Great product",
  "text": "This is the perfect product for me. I love football and I love investing. There are of course risks so you should read all the rules, which are clearly laid out. There are also plenty of tutorial videos out there to assist, and a great twitter community. The product itself is innovative, you buy and sell players and you get dividends if they appear in the media and if they perform well (insert caveat here). The only reason it isn’t 5 stars is because it’s still early days and they need more player analysis, the app still has an annoying bug when you top up on existing players it first looks like you’re buying more at the same price and takes too long to update to show you the current price you are buying at, which can be misleading so they need to tighten up on performance."
 },
 {
  "userName": "dan spreads",
  "version": "3.8.3",
  "score": 5,
  "title": "Make money having fun on a simple, effective platform.",
  "text": "If you are thinking of joining, don't hesitate join this unique platform. On a personal note I have been trading on the index for around a year and my portfolio has doubled since my original investment. For me football index is the final string to the bow in the world of sports betting. Buying futures in football players something we sometimes love and sometimes hate, makes an incredibly moving market. In which you can make some serious money. I am constantly having a joke and a laugh with my friends about the app, who in turn are on the verge of joining. My advice to anybody starting up is to put your knowledge in making decisions, when it comes to a football player everybody has an opinion!"
 },
 {
  "userName": "Princeof Persia",
  "version": "4.7.0",
  "score": 5,
  "title": "Finally making money from my football knowledge",
  "text": "After dumping thousands of pounds over the years with traditional bookmakers, I have finally discovered a platform that allows me to make money from my knowledge by allowing me to trade shares in footballers who can earn me dividends over time. Instead of spewing money every weekend on a coupons I now deposit a little each week into my football index account and buy underpriced players and watch them grow each week. It gives me the buzz feeling of a sports bet without it burning a hole in my wallet. Best part is FootballIndex allow you to trade risk free for the first 7 days (up to £500). I 10/10 recommend this platform to anybody who thinks they know their football."
 },
 {
  "userName": "FI Trader 🚀🚀🚀",
  "version": "4.9.1",
  "score": 5,
  "title": "The Game. Changed 🚀",
  "text": "This platform, only being 4 year olds, is still in its early stages but has seen a huge increase in the market by both the numbers of traders and the size of individual investments. This shows the increasing confidence in the platform and I feel that ‘huge’ will be nothing compared to what will be seen over the next few years. I consider this to be a small drop in the ocean.\n\nFI is very different to usual sports betting as you don’t lose everything after one losing decision. You may lose a certain amount, but it’s up to you as to how much risk you take and when you choose to buy/sell a player. Hence, The Game. Changed 🚀\n\nI’ll admit there have been system issues over the years, but the FI team have continued to grow in the way they resolve the issues and also how to prevent them. Any issues can be frustrating, but the positive growth in the product massively outweighs them.\n\nI highly recommend this platform to anyone looking to use their football knowledge to make some money, but have a bit of thrill and excitement at the same time."
 },
 {
  "userName": "Rhys Mayhew",
  "version": "4.9.1",
  "score": 5,
  "title": "Best app I ever downloaded",
  "text": "I personally can’t believe this app has so many one stars reviews, all the 1 star reviews I’ve just seen are people that haven’t spent time researching the app and are mad they lost money. The app itself runs perfectly and is easy to use. The reason you have to withdraw to the same card is so someone can’t log on and take all your money out to their card, nothing wrong with that. \nI have been on football index for 2 months now and in the last month I’m made 10% on my investment! More than I’d earn on my savings account in 5 years, get on this app ASAP, so much fun researching players and getting paid when they smash it on the pitch, love it!"
 },
 {
  "userName": "rickspur",
  "version": "3.8.7",
  "score": 1,
  "title": "Football index missing funds",
  "text": "I have been using football index for over a week, 6 days ago some of my funds went missing from my account. I contacted Football Index the only way possible, which is by email. I received an automated reply and nothing more.\n\nApproximately £200 of my money disappeared from my account, following numerous emails without a response I finally received £100 back into my account together with an email explaining that they have had problem with their system (what they called “An Outage” ) and apologising.\n\nHowever £100 still remains outstanding from my account and I have since written to them every day, once again without a response.\n\nI feel that this problem could easily be fixed if they had a contact number to call or if they actually read the emails sent to customer support and call me to discuss the issue.\n\nI feel like they have stolen £100 of my money. The nature of football index means that you are required to deposit considerable funds into their hands. I have now lost all trust that they are responsible enough to be able to look after my funds. Terrible experience, which is a shame because it is fun to use.\n\nHopefully somebody at football index will read this review and look into my account and generally improving the customer services procedure."
 },
 {
  "userName": "Lonewolf7975",
  "version": "3.9.4",
  "score": 5,
  "title": "Great innovative platform",
  "text": "Having been on the index a couple of years I can only say good things about it. It combines fantasy football with gambling in a way never seen before. Wanting to invest some money into stocks and share but not knowing where to start this platform has seen me return 100% on my investment so far and has been easier, more profitable  and more fun than conventional stocks and shares. Also gotta love getting paid daily dividends which I reinvest for comping interest. Tip for new users- start small and learn the platform before investing big. Also try to think long term, any dips in the market won’t last long and are the best time to invest!"
 },
 {
  "userName": "AndyMax10",
  "version": "3.8.5",
  "score": 5,
  "title": "Andy H",
  "text": "If you’re a football fan that’s into sports betting or always wanted to trade on a stock market, but never properly understood it, like myself. Then Football Index is for you. It’s an exciting way to make money whilst watching football and expanding your knowledge of European footballers. I’ve been trading since December 2015, and the platform is still relatively new and unheard of. There is so much expansion for the platform still to make as it’s recently branched out to other countries and continues to grow it’s advertising. Jump on board, have fun making money, picking up dividends daily, and see your portfolio grow as Football Index itself grows."
 },
 {
  "userName": "GibboFI",
  "version": "3.9.5",
  "score": 5,
  "title": "Changing gambling forever",
  "text": "I used to bet regularly £10 here, £20 there - and ended up constantly down. Then I stumbled across FI the beauty of the product is you can chase those short term high risk wins (all be it you’ll never lose your stake instantly like a traditional bookmaker) or you can trade as you would shares on the stock or currency markets, but rather than in a product you know nothing about in a market you know nothing about it’s in the thing you love, football. I’ve made significant profit playing FI, but above that I’ve engaged with a great online community and had a lot of fun too."
 },
 {
  "userName": "CaileanDMaciver33",
  "version": "4.2.0",
  "score": 1,
  "title": "A scam",
  "text": "I tried withdrawing money after a few days of using the app and it wouldn’t let me, said I needed to verify my age which I tried to do. Only way you can verify age is by having a passport/ driving license (no problem) AND a proof of address that is less than 3 months old, your proof of address can’t be a mobile bank statement it can only be a tax bill or a copy of a bank statement which in today’s world isn’t so easy to get with everything being paperless. Don’t fall for the scam.\n\nUpdated: trying to log back on again despite the fact I can’t withdraw my money I thought I would just have fun with the money on their and see what happened. My account has been “suspended” for no reason. An absolute scam, brilliant idea that seems interesting but the people behind this app are out to exploit"
 },
 {
  "userName": "I Dani do anything by Alves",
  "version": "3.8.3",
  "score": 5,
  "title": "Make money buying footballers!",
  "text": "It’s a good app that combines the fun of fantasy football with the thrill of trading in a commodity all football fans will understand: footballers. \n\nI would like to see some additional features like being able to search your portfolio by value risen or fallen in the previous 24 hours. It would also be useful to have upcoming fixtures included in a player’s bio.\n\nOverall, The Football Index is a fantastic concept and I would highly recommend to those that know their football. Much better than losing money on unlikely accumulators!"
 },
 {
  "userName": "footie i man",
  "version": "3.9.9",
  "score": 5,
  "title": "Does exactly what it says on the tin",
  "text": "I have been on for 1 year and seen healthy profit on my investments. Recent dips in the market of course scare new users but the product is definitely still growing and although you might not see such massive growths as with a year or two ago, a steady increase will happen with the right players.\n\nMoreover, many ways to make profit. Not just from increased share price but( to name only two) in play dividends( payout if you player scores or assists) and media dividends( your player features in the daily news)"
 },
 {
  "userName": "Gilchrist1983",
  "version": "4.9.1",
  "score": 3,
  "title": "Great profits, dull product",
  "text": "I’ve made a shedload of money on Football Index but now feel very disenfranchised with it. The product has very little fun or excitement to it. If you want something purely to make money then it’s for you, especially if you like football. \nIf you want something more fun based with some profit available on the side then I’d highly recommend Footstock - daily fantasy football combined with trading that actually gets the pulse racing.\nOther current new option is sportstack, more for the pure gamblers.\nLong live Football Index, my stolid Football-ISA that finds my more exciting start-up adventures!"
 },
 {
  "userName": "Andy1738590",
  "version": "4.0.0",
  "score": 5,
  "title": "Great fun and great rewards",
  "text": "Really professional set-up, easy to use, and very lucrative. I enjoy football index as it gives me a great platform to invest, and I find football far more interesting than the stock market. Fantastic dividend structure, and the thrill of seeing the capital of players in your portfolio grow makes it a fun and enjoyable platform to put a bit of money each month. App runs really smoothly for cash deposits, withdrawals and trades - I’ve never had a single issue with it"
 },
 {
  "userName": "PJ YNWA",
  "version": "4.0.0",
  "score": 5,
  "title": "Life Changing!",
  "text": "Never has an app or concept had such a life changing effect then this one for me. From an avid gambler who was constantly looking for that big win, I now hardly place a bet and focus fully on this app!\nWhilst this is still a gambling website, it bridges the gap between betting, fantasy football and stocks & shares. Suitable for all price brackets from the casual gambler to the serious investor this is the app / platform for you.... If you do nothing else this year try this out!"
 },
 {
  "userName": "Coleyscrooge",
  "version": "4.0.0",
  "score": 5,
  "title": "So much better than gambling on the football!",
  "text": "This is a brilliant concept... it’s got me more interested in football than I’ve ever been, and making money while I’m at it! It’s a slower burn than gambling, you need patience, but that works for me. You’re also very unlikely to make big losses in a short period of time like you would on any of the gambling sites. Definitely worth trying out - my tip is to start with a small amount and get the hang of how it works."
 },
 {
  "userName": "Top dog johnny",
  "version": "3.9.5",
  "score": 5,
  "title": "Traditional bookies RIP",
  "text": "Brilliant way of using your football knowledge to see returns on your investments unlike traditional bookmakers. Many ways to earn dividends without losing your initial investment. Do your research, plenty of helpful videos and chat rooms to use. Can’t recommend this enough if you enjoy football, fantasy football and betting. Been going for 3 years and showing incredible growth in the platform. Won’t use a traditional bookies for football bets again."
 },
 {
  "userName": "big mac again",
  "version": "4.7.0",
  "score": 5,
  "title": "Make money whilst having fun",
  "text": "I’ve been on the index for just over 2 years I have a return of 215% on my investment and enjoy watching football even more than I use to when your able to watch a player in your portfolio. You don’t need loads of money to make a profit just patience and a bit of research. I’ll never waste a tenner on a Acca on a Saturday that’s lost by half time where with the index that tenner bet lasts upto 3 years unless I cash out early"
 },
 {
  "userName": "ManLikeOtto",
  "version": "3.9.5",
  "score": 5,
  "title": "Everyone Needs This!",
  "text": "If you like football get this app! It’s actually mad how easy it is and if you know anything about football you can make money. Even just buying youth players cheap and holding onto them until they break into the first team can be a lucrative investment. Honestly having a blast using this app and am making money pretty fast. Start small, learn the ropes. When you’re consistently making money, scale up. Simple."
 },
 {
  "userName": "The Kingsmead Knight",
  "version": "3.9.5",
  "score": 5,
  "title": "Life changing!",
  "text": "If you’ve spent far too much time on the likes of Football Manager or Fantasy Premier League then Football Index is for you. Put your European football knowledge to the test and profit from it financially. I no longer throw my money away on traditional sports betting. Football Index is the future and the platform still has so much room for growth. Get on early and grow that portfolio before the platform reaches its peak, which in my opinion is still years away."
 },
 {
  "userName": "Conkersoniii",
  "version": "4.0.0",
  "score": 4,
  "title": "It’s a decent app. Room for improvement",
  "text": "I use the app more than I do the site, mainly for the convenience. There are some features, such as watchlist, which don’t appear within the app but are on the site. So if you tag someone to keep an eye on, you are not then in a position to act upon this, if using the app. Asides from this, it’s pretty good. Allows you to do most of what you would want with ease. Sometimes it could be better updating your balance once you withdraw. All in all, worth using."
 },
 {
  "userName": "Jay Frazz",
  "version": "4.9.1",
  "score": 5,
  "title": "A new way to experience football!",
  "text": "What can I say - 2 years on The Football Index and I have never enjoyed football more than I do now! Using my football knowledge I can whizz through the list of players and pick out those little gems that will make me money! The ever evolving app is outstanding, and enables me to keep up to date with the going’s on of FI, and trade on the move! \nA great app for a great platform! Excellent work Football Index team!!"
 },
 {
  "userName": "Jwelshey",
  "version": "3.9.8",
  "score": 5,
  "title": "Finally a stock market that adds fun",
  "text": "This is a great app. I've invested previously in things like Etoro and stuff but this is far safer for your money. \nYou can have fun penny trading or by having a planned portfolio. The dividends are cool as you get money for media bonus' and match day performance. \nMost importantly it's a growing app/business that will Get more and more popular as stock markets are getting risky and this is a great alternative as it objects fun into it all. I'm pleased."
 },
 {
  "userName": "Tomo4587",
  "version": "3.8.6",
  "score": 3,
  "title": "It’s adequate",
  "text": "As the title suggests, it’s ok. It works and sometimes it doesn’t. The news has yet to work altogether for me. You click on an article and it doesn’t load. The dividends pay out and the news buzz is in favour of the big players. I’ve seen all sorts of reports from the same sources and they don’t appear for that player. I’m still miffed as to how the work it out. \nIt needs clarity and improvement with bug fixes etc. The game is interesting in layout and concept. It does work but there is some confusion from me and my friends who use it."
 },
 {
  "userName": "Churchills dog",
  "version": "3.9.5",
  "score": 5,
  "title": "The future!",
  "text": "A great mix of football, gambling and investment! Can't believe it has taken so long for a product like this to arrive. Use your football knowledge to predict the next Ronaldo and player performances, get it right and your player will increase in value. Advice to new users, learn the rules, start small and get involved in the great Football Index social media community for help and advice. This really is the future of football betting!"
 },
 {
  "userName": "LPBKML",
  "version": "3.8.7",
  "score": 5,
  "title": "Great app",
  "text": "Great app and firstly would recommend doing your research. I saw advert after advert on twitter, never signed up for ages just scanned the ‘football stock market’ as a gambler I put a id say ‘little’ amount into the Index to play around with get to grips make the rookie mistakes and learn from them made mistakes got a bit of luck aswell on the way, continued to add more in and use the app daily now!, but the whole concept and execution of the app on a whole is amazing"
 },
 {
  "userName": "kaka-8",
  "version": "3.9.9",
  "score": 5,
  "title": "Genius idea",
  "text": "This app has the potential to take over gambling as we know it. \nFor all the millions who love Football Manager and Fifa but feel they no longer have the time unless of course there is money to be made.  This is a stock market were horrible traders businessman and bankers don’t have inside knowledge to manipulate the little people.  It’s a level playing field for once. How much is your football knowledge worth?"
 },
 {
  "userName": "Scott Danby",
  "version": "3.8.2",
  "score": 5,
  "title": "Brilliant innovative product",
  "text": "I would advise spending time getting to know the product before investing heavily, there is a lot to learn. But it adds an extra dimension to watching football and makes you root for things you didn't think you would. It's a growing platform which means there are always opportunities to profit, it has come so far in the last 6 months excited to see what 2018 brings!"
 },
 {
  "userName": "Mjihgybtf",
  "version": "3.9.5",
  "score": 5,
  "title": "Saves me thousands I would usually lose gambling",
  "text": "Great product, stops me from betting hundreds per week on one off matches. Using it as an investment before I buy a house in 6-9 months. Can still gamble on a player if I want and if it doesn’t pan out I may lose 5-10% of my stake at most. Having said that most players have increased massively since I joined 3 months ago. Very difficult to lose money."
 },
 {
  "userName": "WARMBREEZEDIE",
  "version": "3.8.2",
  "score": 1,
  "title": "USE THE WEBSITE - App pushes you out and denies access",
  "text": "After using this in Italy (so outside the U.K.) for months one day the app decided I couldn't access anymore - all without notifiying me or making me sign a different T&C agreement. Guys keep yourself from using this and only use the site - this prevents you from BS like the above. The website is also much better designed and with additional features, so I don't get why using this piece of junk rather than the website. Just shoot up Chrome and enjoy your profits. Stu away from this crap of an app and most importantly don't rely on this if you don't want to be prevented access to your funds and assets."
 },
 {
  "userName": "ari arian",
  "version": "4.10.0",
  "score": 5,
  "title": "The new era of sports betting",
  "text": "What a truly genius idea football index is. Wish I had done my homework on this platform years ago! Since joining football index my coupon betting has significantly dropped as this is way more fun being able to make money on football players ability/potential instead of having to predict the outcome of a match, \nFootball Index gets a 10/10 from me."
 },
 {
  "userName": "Giggs_1990",
  "version": "3.9.6",
  "score": 1,
  "title": "Age verification",
  "text": "So was asked to verify my age a few days ago after I have put money in to the account. Why does my age not get verified before I put my hard earned money in? When trying to verify my account all I get is a automated email which gives a query number and states that they will aim to get back to you within 72 hours. It’s gone past 72 hours and nothing so send a email to see if I can get an update, what do I get? A new query number! Why is there not a number to contact so customers can get an answer rather then just automated email service which is not helpful at all.\n\nSill waiting 90hours and waiting..."
 },
 {
  "userName": "Singh29",
  "version": "3.9.5",
  "score": 5,
  "title": "Can’t setup the password",
  "text": "I am having trouble with log in setup, cant setup the password as its keep saying it has to be combination of at least 8 characters. Lower & upper case, numbers & special characters. I tried everything, cant seem to be working.\n\nSolution: I have worked it out, go on your computer first, make an account on their website & then log in the app."
 },
 {
  "userName": "rickettssj",
  "version": "3.9.5",
  "score": 1,
  "title": "Really frustrating",
  "text": "Same as most people, saw the ads and wanted to see how it works, seemed like a cool idea.\n\nI didn’t get anywhere near the actual app because the sign up process is SO frustrating.\n\nIt’s asks you a wealth of information, some of which I get as it’s a betting platform but most which seems so unnecessary. The straw that broke the camel’s back was the password selection, which has ridiculous criteria (at least 8 letters, lower and upper case, numbers and special characters?!). I tried various passwords that fit that criteria, which were for some reason refused. After that I lost interest and deleted the app."
 },
 {
  "userName": "Index Review",
  "version": "4.9.1",
  "score": 5,
  "title": "Life Changing",
  "text": "Its almost shameful its took me this long to leave a review for this platform , but joining Football Index will easily be the best decision you will make financially in your life. \n\nJoined in May 17 with £500 and as of today currently at over £60k profit from a further £15k investment. \n\nThis next year is going to best the biggest yet. It’s not too late to join , in fact it’s only just getting started."
 },
 {
  "userName": "@JoeyHolding",
  "version": "3.9.9",
  "score": 5,
  "title": "The Best",
  "text": "Brought a whole new aspect to the way I watch and follow football, I now find myself tuning into la liga, Ligue 1, bundesliga like never before. If you know a thing or two about football, get on this app. Knowledge is power, knowledge is profit. And an even bigger bonus, it's stopped my interested in normal betting such as accumulators and request a bet which has saved me sooo much in the long run"
 },
 {
  "userName": "Clubdukes",
  "version": "3.9.8",
  "score": 5,
  "title": "Improve Analytics",
  "text": "Great job Football Index. Being in FinTech and trading technology myself, there are a few improvements I can suggest, particularly with the analytics. For example, I should be able to see if I am holding a player and quantity, when I look through Top 200 and squad list. As it is v difficult to remember.  Feel free to contact me for further recommendations. Many Thanks \nAmar"
 },
 {
  "userName": "dhxhcjclrwjdhchcy",
  "version": "4.0.0",
  "score": 5,
  "title": "Revolutionary platform",
  "text": "As a trader on FI for over a year, I’ve been really good impressed with the development of the platform. The potential for growth is huge. The app itself could be improved upon in a number of areas, hopefully the work with NASDAQ will improve the data / stats available from within the platform and in the app. Good times ahead!"
 },
 {
  "userName": "Woy wobinson",
  "version": "3.9.5",
  "score": 5,
  "title": "Revolutionalised betting",
  "text": "Signed up about 6 months ago as I was tired of continually losing money on normal betting sites - best decision I’ve ever made!! Started by investing a small amount of money until I got confident with the site, now invested a lot more and have more profit than I’d ever have dreamt of!! Completely changed betting and can only see this site rising more and more, get on it early"
 },
 {
  "userName": "Clayyyst 98",
  "version": "3.9.2",
  "score": 5,
  "title": "Make money with your football knowledge",
  "text": "Great app, lacks one or two of the features of using the website but for checking your portfolio or quickly getting on or off someone it works great. Takes a while to fully understand what drives the market but money to be made for sure regardless of starting amount."
 },
 {
  "userName": "DP101 Franks",
  "version": "3.9.4",
  "score": 5,
  "title": "FI is a game changer",
  "text": "Been on the platform for 18 months and it’s honestly a game changer.\n\nAmazing introduction to a trading platform with the comfort of knowing your football stuff. \n\nIt can take a while to understand the rules fully however it’s defiantly worth spending this time to monitor the market and ask questions across the forum. \n\nProduct still in its infancy so it’s a great time to come and board, spread your risk across a number of players. Every day there are dividends on offer for media ratings and/ or performance ratings (provided by opta) so every day gives you an interest and reason to trade/ reinvest/ sit back and watch your holds capital growth. \n\nBeware of addiction 😏 and enjoy!"
 },
 {
  "userName": "Hoody85",
  "version": "3.9.6",
  "score": 5,
  "title": "Fun and profitable",
  "text": "I’m 10 months in and won £900 in dividends and my portfolio value is £2100. I’m no expert so anyone can do it. It’s jut announced its going worldwide so expect huge growth soon so great time to get into it. My one tip - follow some football index ‘experts’ on Twitter. Lots of my most profitable purchases have been tips (free) from these guys. On many of these occasions I’ve never heard of the player!"
 },
 {
  "userName": "jonathan 212",
  "version": "3.9.5",
  "score": 2,
  "title": "Good idea still needs work",
  "text": "The app is a great idea and adds excitement to games. The app itself isn’t easy to use. If I here some new signing rumours or an injury and I want to buy that player quick I find myself spending 10-20 mins trying to find that one player, having to spell there name exactly right, googling there official names. It would make it a lot easier if you could search by team, league, nationally all in one search bar. Great concept I just find it very temperamental using it."
 },
 {
  "userName": "Michael Nicholas",
  "version": "3.8.5",
  "score": 5,
  "title": "Amazing Returns",
  "text": "Signed up to football index over 2 years ago and the returns have been quite exceptional. I confess I don’t know a lot about football so I bought the top 100 tracker and it has made steady returns over this period plus dividends. Someone with better football knowledge than myself the possibilities to make money must be endless."
 },
 {
  "userName": "J1mmy 66",
  "version": "3.9.5",
  "score": 5,
  "title": "Amazing alternative to footy Betting",
  "text": "I’ve been on the app for 3 years+ now and roughly make about 7%+ returns a month with very little checking and over 550% returns so far :D\n If you’re tired of stressful football betting, try football index, it’s more of a long term approach so be patient, but well worth it compared to traditional betting and even savings accounts!"
 },
 {
  "userName": "Gareth Bateman",
  "version": "3.9.9",
  "score": 5,
  "title": "Genius idea - Great app",
  "text": "FI is a brilliant idea for football fans that like to think they know a lot about football. It’s great speculating which players will perform and which players other fans love. The dividends payouts keeps your portfolio interesting and targets the star players for your portfolio.\n\nThe app is quick, smart and very user friendly. Very simplistic for an index."
 },
 {
  "userName": "Schmoobiewooooooobie#6",
  "version": "3.9.2",
  "score": 5,
  "title": "Amazing idea",
  "text": "Really good stocks/shares version with football. \nAlthough would like more performance related data & price rises as it tends to be only popular players from popular teams who consistently reap rewards. (Whether playing well or not. I.e. pogba) \nWhereas a high performing player from a lesser known team will often go unnoticed even if playing well."
 },
 {
  "userName": "danjackknife",
  "version": "3.8.3",
  "score": 4,
  "title": "Almost Perfect - Buzz news links issues",
  "text": "As stated on the title, the only underlying issue I have is the Buzz news section. It’s great to see the list sources but opening them is the problem. On opening, the link is loaded but the spinning wheel blocks us from scrolling. \n\nApart from that, I think if this app has filters: Biggest Increase and Biggest Decrease, on the portfolio, it would be the ultimate app!"
 }
]