[
 {
  "userName": "HarrisJames16",
  "version": "6.8.6",
  "score": 5,
  "title": "Great App, Hoping for Big things",
  "text": "Love the app. Would be great to start making this a bit more modern though in terms of design. For example, dark modes and reducing white space from the open bet screen. Like do I need to see the “Notifications” selector on all 20 games in my accumulator. I’d much rather have a single line of data showing the bet type and current score, rather than splitting this over three lines, would be able to see much more on the screen. Would be really great to be able to have an option to hide open bets. For me, I want to place certain bets for events happening next year or for season long accumulators, but I don’t want to see them every time I go to Open Bets. Just whenever I want to see how they’re getting on. So having a settings option against each open bet to hide would be brilliant and I’ll get placing the long terms ones."
 },
 {
  "userName": "PlazaPlayer",
  "version": "6.8.4",
  "score": 5,
  "title": "Great App, but shameful max payout.",
  "text": "Just like it says really. It’s one of the best out there if not the best. Everything is smooth with no glitches and it’s a credit to Sky.\nBut Sky Bet let it down with the just £250,000 max winnings. Yes I know a lot will read this and think you’re never going to win that much anyway, but when you see both William Hill and Bet 365 both offering 8 times more at £2million it kind of looks scared to lose. I do a lot of Anti Post betting throughout the year in football and I’d like to think IF I did actually win that my winnings were not capped at just £250k. I do a 6 match correct score Accumulator just for £1 but I can’t place it on sky because of there very small cap.\nBut that’s my only gripe. It’s also not stopping me from giving the App 5 stars and it’s justified to. Just double that Max payout and you’d have plenty of my money for sure."
 },
 {
  "userName": "Jeffajfjf",
  "version": "6.8.6",
  "score": 4,
  "title": "Great app- one small change",
  "text": "I have used around 8 of the biggest names for betting apps and sky bet is definitely in the top 2. Clean and friendly user face, fast updates and shows details like goalscorer ect. \n\nI would rate this app 5* if they changed their group bet function. I feel it would be great to have an option where every member puts their money into a group pot that is then placed on the acca once everyone has picked their selections. If say 4 people put in £5 and the bet wins £100, each player has their winnings (£25 in this example) credited next to their name which they can keep in the group to carry on using or withdraw to their main account. I feel like this would help complete the feel of the group bet idea instead of everyone picking a selection and then betting individually if they wanted to."
 },
 {
  "userName": "Y2020yj",
  "version": "8.3.0",
  "score": 2,
  "title": "Empty slots",
  "text": "Betting with sky bet is fine I enjoy the lay out and the app tends to work good, however they often email me with offers to deposit and play slots for free spins or just promote the slots via email. When I deposited money a few weeks ago to play fishin frenzy and also another time to play book of kings, I never received a single free spin. This has happened numerous times with either them not giving the free spins or the slots rinse the money in seconds with no wins and the funs over. Today they emailed me regarding the new slots game ‘lucky emeralds’ this time not even offering free spins but I thought I’d go ahead and deposit £10 to try it out seems as they never pretended they’d give any free spins this time. For the first 8 £1 spins I won £0, finally winning a measley £1.50 once and then lose the last £2.50 across 3 spins. In my experience the slots are NEVER worth it it doesn’t matter how much money you put in you’ll always walk away a loser."
 },
 {
  "userName": "Davesixsix",
  "version": "6.4",
  "score": 5,
  "title": "Newbee",
  "text": "I'm a novice at betting and have pretty much worked my way through all the first time offers from all bookies. Downloaded for Cheltenham due to free bet offers and enhanced places. Out of all the bookies apps and sites I have been impressed with sky's so far. Not won yet so can't comment on cashing in yet but love the detail in form on racing that some sites don't give. Found it easy to use and even though I had issues using free bets after contacting customer services and they explained just to tick the free bet and leave stake box empty everything went well. Customer service was reasonably quick in responding and helpful. Like I said still new to app and sky but up to  now 5star."
 },
 {
  "userName": "Lukee1200",
  "version": "6.8.6",
  "score": 5,
  "title": "Good app, shame about the deposit limit",
  "text": "This app works very well, quick and user-friendly and easy to find a range of accumulators for football bets. Only minor criticism is that I have daily deposit limits and have to wait exactly 24 hours from the time I make each deposit. This means if I have a bet in mind the next morning but had a bet the previous night my deposit limit won’t reset until that next night. A minor inconvenience maybe, but I know most companies seem to reset deposit limits at midnight which would make much more sense, rather than constantly having to refer back to check time of last deposit"
 },
 {
  "userName": ".o0O",
  "version": "6.8.6",
  "score": 5,
  "title": "Skybet & optistats robbed so many people on the first day of this new season",
  "text": "Liverpool vs Norwich, a bet placed for 2 players to have 2 shots, both had 2, then sky decide a player was offside for the first shot even the the referee didn’t give the offside, so they didn’t pay out, so many people complaining on Twitter & fb and I wouldn’t expect anyone to bother with skybet or trust optistats anymore, I quite liked the site up until this but there’s no point in it at all if you won’t be paid on the rare occasion you do win, they’ve lost the trust unless the do the right thing and settle the bet and pay people what they should of rightly won ."
 },
 {
  "userName": "ptheskil",
  "version": "6.8.6",
  "score": 5,
  "title": "The best app for betting footie and horse racing",
  "text": "Having tried a few betting companies, Ladbrokes, bet365 I find this one tops all of them for a number of reasons including the special bets on offer during the footie and horse racing, one addition which would take you to another level(bet365 already have) is the ***betting during the horse race *** as on occasions I might just miss the start or want to see how the first few furlongs go before deciding whereas bet 365 you can bet right upto the finish of the race, the information the layout of the cards are better and less confusing on skybet hence it’s my default betting site."
 },
 {
  "userName": "DannyMards",
  "version": "6.5.1",
  "score": 5,
  "title": "Amazing customer service",
  "text": "Best customer service in the business. Probably have jot got as much variety as Bet365, but the customer service and caring for their customers is what made me stay with SkyBet.\nOther day I placed a bet on some Enhanced Odds that were ridiculously high. I won the bet and I got an email from them saying that in normal circumstances they would settle the bet according to the right odds despite the system error, but it was settled as the odds I had placed my bet on. Pretty sure Bet365 would not care as they once got my money away after I cashed out on a goal that was not given after VAR check!"
 },
 {
  "userName": "Moonfyahh",
  "version": "6.8.6",
  "score": 5,
  "title": "Excellent App",
  "text": "Used to use William Hill until they banned my account (with money in) for being too young. I am 28. Tried verifying age with passport even went into their branch, no luck. Ever since I have used sky bet and never had a single issue. quick deposits and withdraws through paypal (basically instant). My only suggestion for improvement is I would like to see my yearly profit and loss, rather than having to add each month up separately. I would also like to see more non spirt bets added, for example brexit, weather conditions, etc.\nOtherwise faultless. Highly recommend."
 },
 {
  "userName": "HNVH6M",
  "version": "6.8.6",
  "score": 5,
  "title": "Still market leader for casual gamblers... just",
  "text": "Does everything it needs to do, just a couple of issues.\n\nGoal notifications on football is still eons slower than bet365, but that’s not a game breaker, especially if you use another app for goal notifications as most people do.\n\nSecondly and more irritatingly is the persistent presence of the return to home screen issue. I’m constantly switching apps when placing bets, checking form and previous match stats and whatnot, and every time it jumps back to the home screen. I’m assuming it’s a ram/recent memory issue with iOS but it’s the only thing that stands between me recommending this as the best app over 365.\n\nOther than that can’t complain - apart from the form graph that mocks me with my terrible losing streaks!\n\nLove the skybet club and the new group betting. Wish there was a way for everyone to put money on together on the bet, but the logistics of that are understandably far too complex, so that will remain a pipe dream for now!"
 },
 {
  "userName": "Yassicat",
  "version": "6.5.1",
  "score": 5,
  "title": "Happy Customer",
  "text": "I like the SkyBet app and website. It is reliable and they offer a good range of bets on different sporting events. They also provide plenty of offers in addition to the normal bets. There is also a loyalty club available if you stake a certain amount each week. However, this is not a high amount and Sky do not force you to join if you do not wish to. Good service and I enjoy the variety of bets available. Also, I’ve not had any problems with the customer service. Only used it twice and a both occasions a prompt resolution was supplied."
 },
 {
  "userName": "yhpaige",
  "version": "6.8.6",
  "score": 5,
  "title": "Amazing app but please improve creating request a bet markets",
  "text": "I’ve been using this app for a while and I love it, it’s so easy to use and very quick with withdrawing your winnings. Unlike the one star reviews I’ve seen on here skybet are one of the most fairest bookies out there and they don’t take too long to pay out. \n\nOne thing to improve when creating a request a bet it would be nice to receive an in app notification of what odds my bet is priced as or if my bet has been priced so i can find it and just making more options on there like 2-6 bets."
 },
 {
  "userName": "Bebopster",
  "version": "8.0.1",
  "score": 3,
  "title": "Latest App Update",
  "text": "Hi. I could not see how to provide feedback about this app other than to write a review. I am a frequent user and usually fairly happy with it. However I am not that keen on the new design as I keep having to press an “x” to cancel certain pages while I am building accumulators and find the new screens and layouts generally a bit “clunky”. \nHowever my biggest negative is that I can no longer see the odds at the top of the screen when building an accumulator.... Please, please, please can you bring this feature back? As now I have to keep checking my bet slip every time I add a selection to an accumulator to see what the odds are? \nMany thanks"
 },
 {
  "userName": "Lewwat",
  "version": "8.0.1",
  "score": 3,
  "title": "It’s not bad but confusing",
  "text": "This app is confusing when it comes to certain stats.\nWhen you compare stats within the app to stats of 3 other reliable sources the 3 other sources have the same stats however they’re different to the stats which are stated in the app. \nTherefore it calls into question how reliable stat collection of the app is. \nIt also makes the stat collection appear to be wrong because if 3 sources have the same and 1 differs it’s usually the 3 that are the same that are right. \nThis ultimately could be the difference between winning and losing, and could mislead people unless they just check the app directly"
 },
 {
  "userName": "K1ngKaz",
  "version": "6.8.4",
  "score": 5,
  "title": "Best Betting App by far!",
  "text": "Have used many but SkyBet is by far the easiest to use, the smoothest, has the best in-play functionality, fairly responsive and free bets you can bet and if you win can withdraw without having to rollover like Bet365 & many competitors.\n\nBe part of the bet club as well, bet £25 a week and get a free £5 bet! Price boosts, request a bet, Saturday soccer accas.\n\nEasily the best betting app by a long way! Very innovative and leading the way with new features the users want! Profit & Loss is the latest! Awesome touch, well done SkyBet 👌🏼"
 },
 {
  "userName": "Delta Australia",
  "version": "6.5.5",
  "score": 5,
  "title": "Excellent, if persistent, App",
  "text": "Sky Bet is an easy to navigate, easy to use app with a great user experience. You can search for your bet and place it in no time at all. My only criticism is the million push notifications you get every hour. If betting is your life I could see this being handy but casual gamblers will feel pestered after a while. Simply switch these off if you need to and will continue to be an epic piece of app design. Now hand me back my metaphorical betting slip and tiny plastic pen..."
 },
 {
  "userName": "Will1987::::",
  "version": "6.8.2",
  "score": 5,
  "title": "Happy so far",
  "text": "I’ve had many problems with Ladbroke’s, William Hill and so on regarding in-play and many delays on their sites which has prevented cash-out opportunities on many occasions but have found Sky Bet to be very quick and up to date efficiency excellent. Been a customer of Sky Bet for some years but only just started using it weekly and I’m very impressed, much more consistent than ladbrokes and other betting apps I’ve used. Big thumbs up for Sky once again. 👍🏻"
 },
 {
  "userName": "Alibrighton",
  "version": "6.5.1",
  "score": 5,
  "title": "Mr Ali S",
  "text": "Nice casino. Many games and many game providers. I remember them when they had old design which was much better in my opinion. But most likely its about preferences, not about casino itself.\nThe casino is trying to adhere to modern trends and all is good but I believe they should review their withdrawals times. Normally, it takes no longer than 24-36 hours which used to be good in the past but nowadays their competitors offer much better withdrawal conditions."
 },
 {
  "userName": "Degman85",
  "version": "6.4.1",
  "score": 5,
  "title": "As per Sky",
  "text": "As usual anything associated with Sky works well. They must have cornered the tech guys because their apps do not fail, not like others who employ the fat boys who live in a cellar and do nothing except mess up apps. Sky products are the benchmark against others need to be measured. Total 5 stars without question, what else could you give. Sky Bet should nip over to Trip Advisor and Ebay and advise them how to configure updates that work and not mess up a product. 😄"
 },
 {
  "userName": "MisteeSav",
  "version": "6.7.1",
  "score": 4,
  "title": "Annoying update - they’ve fixed it!",
  "text": "If you come out of this app for a split second, it takes you back to the home page when you go back in, each time. Never used to do this, and it’s irritating. Change it back so that if you look at a text message or email, when you click back to this app, you don’t lose where you were and have to start again.\nThanks for fixing the bug. Still good to see you listen to your customers."
 },
 {
  "userName": "No Good Nicknames Left !!",
  "version": "6.7",
  "score": 4,
  "title": "SKYBet - Decent App",
  "text": "This would have been 5 stars but for one major flaw . . . . when you pop out of the app to look at another app then go back in it resets back to the homepage which is a major pain if you are building an accumulator and are looking at the form guide I have recently tended to use the mobile page as it does not do this.\n\nThat aside easy to use with specials and easy on the eye they can at times take longer to payout as opposed to announcing a looser but would hope that’s not app related."
 },
 {
  "userName": "Danalls",
  "version": "6.5.5",
  "score": 5,
  "title": "Sky bet is the best",
  "text": "Sky bet is the best betting app I have used. I used to use others but this past 12 months I have found no need. It’s so easy to use. Depositing and withdrawing is simple. Where sky bet really comes out on top is the promotions. I was getting so annoyed with all these book makers advertising new customers deals. Sky bet gives me a chance to win something for nothing twice a day everyday for nothing"
 },
 {
  "userName": "Caddy001",
  "version": "6.4",
  "score": 5,
  "title": "Best so far",
  "text": "I've used a few betting apps and found this one is by far the best one. I had a bet recently that won and after 10/15 mins the powers that be decided to disqualify the horse and place it 2nd, Sky Bet still honoured the bet and paid it out as a winner as well as the new winner, now l did check another app or two and they didn't. These guys don't mess about, prompt payments, good offers! No complaints whatsoever! Keep up the good work.👍🏼"
 },
 {
  "userName": "J Nuttall",
  "version": "6.5.1",
  "score": 5,
  "title": "Can’t fault!",
  "text": "Member of off online better apps.. sky Bet it’s the easiest to locate certain bets and app in generate is simple and easy to use! Gave me a my money back the other day when Bony came off in 2 mins of playing due to injury.. was a nice gesture from Sky thank you... and have great offers and Promotions.. will be sticking with them for a long time!! Can’t say much more than never had a problem in nearly 5 years"
 },
 {
  "userName": "conga3",
  "version": "6.8.2",
  "score": 5,
  "title": "Great, could be easier to navigate, too much clutter in it.",
  "text": "The title says it all.\nYou asked me for an update, I have one which will save a lot of navigating clutter. Have a little search box like they have on the apple  Betway app, as now it can be time consuming search for for example to find a worldwide soccer club. And the site is a bit bloated beyond having a bet. A search box would solve everything."
 },
 {
  "userName": "tom0__",
  "version": "6.8.6",
  "score": 5,
  "title": "Best app for betting",
  "text": "I love the horses so I have accounts with all the big bookies - Ladbrokes, Coral, Paddypower etc. SkyBet easily offer the best service out of all of them - their app is much easier to navigate than the rest, their offers are better (SkyBet club is a great offer), the customer service is fantastic (they reply to my queries within 10 minutes usually), they offer best odds guaranteed etc. 100% would recommend."
 },
 {
  "userName": "Demos83",
  "version": "6.8.6",
  "score": 5,
  "title": "Too Good",
  "text": "This is by far the best betting app, knocking the socks off the bookmakers competitors. It’s sublimely easy to use and the speed at which I can lose vast amounts of money is very impressive. The fact that I haven’t eaten for 6 days and have no electricity or running water after being disconnected due to unpaid bills can be forgiven, as I can place a weeks wage on a weak Beginners Chase in a matter of milliseconds without getting out of bed."
 },
 {
  "userName": "telf75",
  "version": "6.5.1",
  "score": 4,
  "title": "Great app, good prices",
  "text": "Really enjoy using Sky bet. Very simple to use and a good selection of bets on all the major sports and more. Request a bet is great and the cash out works really well. Would have bee 5 star if they had a football coupon that went by start time like some others do. Would mean be a bit less scrolling when your looking for games that are soon to kick off. Other than that, it’s brilliant and the betting app I use most."
 },
 {
  "userName": "Dunci",
  "version": "6.5",
  "score": 4,
  "title": "Great App but...",
  "text": "App is great to use, very user friendly but I’ve recently got an iPhone X and every time I click a bet, for example on the Inplay market screen when I want to click multiple bets to add to an Acca it pops up with the iPhone keyboard after each click, I then need to click done on the keyboard then click on my next price, then same happens again after every bet I click... it did not do this with my iPhone 7... Any ideas?"
 },
 {
  "userName": "Rudeboi123",
  "version": "6.7",
  "score": 4,
  "title": "Great but room for improvement",
  "text": "Great app, couldn’t fault it although I have improvements I could easily think of, changing the odds format easier as at the moment you have to go through several stages before being able to change them. Another is making the layout more friendly, as it’s sometimes hard to find a certain league, it should be cut up into Continents then countries to find it."
 },
 {
  "userName": "Richa284",
  "version": "6.5.5",
  "score": 4,
  "title": "One of the top 2 betting apps",
  "text": "A good app which has a wide range of betting options across all sports. I use Sky Bet mainly for football accumulators on a weekend and it’s normally very reliable.\nThere are odd occasions when it can be frustrating for cash out options when the bets stay suspended for longer than usual during peak points of a Saturday afternoon but having tried other apps I still consider it to be one of the best. I’m basing this on being a customer for over 10 years with Sky Bet and have used the app for betting for the majority of the past 5 years or so.\n\nLimits on deposits can and in my opinion should be set, this works really well.\n\nApp can have Touch ID with is very reliable.\n\nCredits from wins and withdrawals are completed very quickly via the app."
 },
 {
  "userName": "maximoparked",
  "version": "6.4.1",
  "score": 4,
  "title": "Very good with one suggested improvement",
  "text": "As a gambler I have sampled most major bookmakers apps, skybet is one of the most intuitive and user friendly. The only real complaint I have is that when you view your open bets you can’t click on the bet to take to back to the market you placed the bet (to see it odds have drifted for example). All in all a good app but it’s a shame sky bets prices are often not that competitive"
 },
 {
  "userName": "JoJake84",
  "version": "6.5.2",
  "score": 5,
  "title": "Great platform for betting",
  "text": "So easy to use & clear what your looking at, sounds daft but other betting sites can be very fiddly finding things. The boosts are great too and the cash outs have improved this year. Before it would go grey for ages when wanting to cash out but couldnt. But now i get generous offers and up to the end of games too. I use sky bet all the time now as well as vegas!"
 },
 {
  "userName": "Dan K L",
  "version": "6.5.1",
  "score": 5,
  "title": "Best betting app available",
  "text": "Easy to use and navigate, offers and promotions very transparent compared to other bookmakers (not loads of pages of small print to read through). Rewards your loyalty each week with a £5 free bet. Next days horse racing markets priced up quickly so you can get on early if you want to. Best odds guaranteed on all UK & Ireland horse racing.\nTop app, would highly recommend."
 },
 {
  "userName": "notabhappyguy",
  "version": "8.3.0",
  "score": 1,
  "title": "Gone bad",
  "text": "Let’s start with horse racing. If you try tapping on horse that’s favorite it sometimes don’t highlight it or select it. \nThen after you’ve done a bet and want re-elect the same horses they are no longer highlighted and you got unselect them and select again to be selected again. \nAnd the same things applies to football. So it takes longer to do any bets. So annoying. And sometimes It make mistakes in my bets because it’s not highlighted. Then there is while trying to pick 7 horses or teams it tells me I’ve got x2 bets so I can only do acc’’s when I really want to do a super Heinz. Sorted it out."
 },
 {
  "userName": "Cazacarlos",
  "version": "6.4",
  "score": 5,
  "title": "Mr",
  "text": "Sky bet is the best app ever, I've had them all, I've swapped and changed constantly, I've been with sky bet now for almost twelve months, no way am I changing again to another betting app, the other day I placed a £5 stake on tiger woods to win the masters, 100/1 anti post, he had withdrawn, sky bet refunded my £5 stake back into my account, can't imagine any other app bookie doing this, thanks skybet. BRILLIANT..."
 },
 {
  "userName": "Waag1",
  "version": "6.8.2",
  "score": 4,
  "title": "It could be 5 stars but it lacks options in terms",
  "text": "This app would have 5 stars if it offered more corners markets for the majority of footballs matches that occur in a day, as the ones they already offers are quite limited... if Bet365 does that option why wouldn’t Skybet do the same? I believe Skybet should look into this matter, at least have all European games to have corners markets and it would be 5star"
 },
 {
  "userName": "J0d1n82",
  "version": "8.1.0",
  "score": 1,
  "title": "Not obvious how to withdraw your cash",
  "text": "This app is really crafty, in a time when betting and what betting companies are doing to protect from addiction to gambling  is under incredible scrutiny. I know it is purposefully made difficult to withdraw your money so that in the end you will get fed up and just bet again until it’s all gone, but this isn’t responsible is it?!  I had absolutely no intention of betting again but it still had me pulling my hair out as to how I actually get my money out!  It’s not obvious, and even the help skirts around the topic. Very, very, deceiving. Shame on you Sky Bet."
 },
 {
  "userName": "Mercury73",
  "version": "6.8.6",
  "score": 4,
  "title": "Love this app BUT....",
  "text": "The app does everything you want it to and is easy to use but something has changed in a recent update (only noticed as the season started) - whenever I try to add a group bet to the betslip, I’m taken out of the app and asked to log into sky bet from the browser - it doesn’t do this when adding any other bet. Please can you sort it out :-)"
 },
 {
  "userName": "Lukeb00tz",
  "version": "6.8.6",
  "score": 5,
  "title": "All round excellent app",
  "text": "I recently had a query regarding an acca I couldn’t cash out but wanted to change selections, the man was very quick and helpful with something probably quite awkward from the support point of view, The odds on football a great, sometimes the horse markets have best prices in there, free bet offers in big races are very good, brilliant app!"
 },
 {
  "userName": "Daft kev",
  "version": "6.8.6",
  "score": 5,
  "title": "Like the app",
  "text": "Just a quick review everything is easy to find on the sky bet app i like it and use it a lot the only things that bug me are i keep on having to reselect the Touch ID several times a week and changing a card expiry didn’t prove easy the other week other than that 👍🏻"
 },
 {
  "userName": "s!lvef0x",
  "version": "6.8.2",
  "score": 4,
  "title": "Good app, good options",
  "text": "Good app, easy to use, lots of options for football....the boost and super boosts are great but could possibly do more to keep up with competitors deals and promotions. \nThe in-play options are also really good and offer a lot of choice.\nOnly negative is that the odds with Sky are usually quite low especially compared with some of the other big players (Bet 365 for example)"
 },
 {
  "userName": "Scott Atk",
  "version": "6.8.2",
  "score": 4,
  "title": "By far the best betting app for functionality",
  "text": "Easy to use with everything laid out in an easy to find format. Use it predominantly for football betting and when I’ve tried other apps they are clunky and the layouts are needlessly complicated or don’t link together as well as skybet. Would of given it 5 stars but I keep losing so until I drop a £500 acca I’m keeping a star."
 },
 {
  "userName": "keyhole2019",
  "version": "6.8.6",
  "score": 4,
  "title": "Great prices & variety of offers but...",
  "text": "Only reason Iv not given 5* is because a few times the app has frozen on me when Iv either tried to place a bet or cash out, I understand this does happen & it has happened to me with 365 but its frustrating when the bet I couldnt place ends up winning or the bet I couldn’t cash out on ends up losing"
 },
 {
  "userName": "Cheggerz365725378623",
  "version": "6.8.6",
  "score": 5,
  "title": "Best of the best",
  "text": "Of all the betting apps out there this is a million miles ahead of anything I’ve used. Even when it’s stability has faltered sky resolve this quickly and now with the introduction of near instant withdrawals they’ve just gone a step further. Only betting app I’ve consistently used week in week out"
 },
 {
  "userName": "kishenvadher",
  "version": "6.7",
  "score": 5,
  "title": "App",
  "text": "Amazing app but since the last update, everytime you come out of the app and open it after 5-10 seconds it refreshes the page you were on and goes to the main menu, this never used to happen before, please see this on the next update. Thank you."
 },
 {
  "userName": "djfozzy1",
  "version": "6.5.4",
  "score": 5,
  "title": "Great app",
  "text": "Great app to use..... the only thing I find wrong with the site at times is when the cash out is suspended for a long period of time & makes it difficult to cash out !!! Other than that, their variety of bets & extra places in the bigger races etc make it great value to bet with them 👍"
 },
 {
  "userName": "Finlay1986",
  "version": "6.8.6",
  "score": 1,
  "title": "Worst company ever",
  "text": "Don’t use this company. Happy taking your money but if you win don’t expect them to pay out. Won a significant amount and when I went to withdraw it they suspended my account. Nearly a week later and I’m still waiting. Customer service is a disgrace. Can’t contact them by email but you can sit and wait for half hour at a time on the chat. But don’t take too long to type a message otherwise they time you out and you start the whole process again. If I could if given 0 stars I would of"
 },
 {
  "userName": "Hotpins",
  "version": "8.3.0",
  "score": 2,
  "title": "Please don’t waste your money.",
  "text": "Please, please, PLEASE don’t spend your money with Sky Poker. How this app is ‘regulated’ is beyond me. If you want to sit at tables with players which are scattered with bots / fake users with the sole aim of draining your deposit account, then this is the app for you. But if you’d rather have a chance of actually winning some money and putting your poker skills into practice - go to a casino or get your friends together play with real humans (when lockdown is over....obviously!).\nAvoid. Avoid. Avoid."
 }
]