[
 {
  "userName": "c brents",
  "version": "2.1.1",
  "score": 1,
  "title": "Stay away..I’ve never written a review but...",
  "text": "This is the worst casino app I have ever played. I feel completely ripped off. Cannot breath without it cutting me off, must have signed back in 50 times in half hour, funnily enough when I may have actually won something. \nPlay £2 a spin and the most you get is 20p win if your lucky. How’s that even close to being fair? £38 played for a terrible experience. What’s more I tried to withdraw my £10 I originally paid but it just kept saying the money in the account was bonus and couldn’t withdraw. So even if I got up to £100 I wouldnt be able to withdraw anyway. (I tried when I won some small amounts and when I was low on funds it made no difference) my point is I feel I have been ripped off I will tell anyone and everyone to stay clear. I think this needs to be reported as the app is fraudulent and taking money off people. I understand gambling rules, you win some and you loose. I know I’m wasting my breath as I will not get my money back but PLEASE DO NOT DOWNLOAD! Save yourself from wasting your time and money. Disgusting 🤬🤬🤬🤬I just wish I would have read the reviews first. How do they get away with this?"
 },
 {
  "userName": "Dhaodhrn",
  "version": "2.1.1",
  "score": 5,
  "title": "Don’t download!!",
  "text": "Had to sign in every time I opened and closed the app. Their machines paid out £600 out to me off their free £10 bet when I tried to withdraw n they seen that they took £500 off me and left me with £100 saying the maximum you can win off the £10 free bet they need to be more specific when signing up and even at that couldn’t withdraw the £100. Played with it and the machines took everything and left me with nothing. Win some loose some but this was just scandless, paid out well until I tried to withdraw and they took it back. Felt completely robbed."
 },
 {
  "userName": "Ollie199028",
  "version": "2.1.1",
  "score": 1,
  "title": "Utter garbage",
  "text": "32 red should be investigated as it is so bad, the app and website continuously loses connection to survey and kicks you out of the game. At first I thought it maybe the app that was faulty but after trying online and it doing exactly the same thing realised that it is to much of a coincidence for this to be happening to both. Once it kicks you out you then have to go back into the game and start from scratch! \n\nGambling sites bang on so much about money laundering and treat customers fairly but this company is so clearly a con company and lives up to it’s awful reviews. Listen to the reviews and steer well clear from this company!!"
 },
 {
  "userName": "benrutter22",
  "version": "2.1.1",
  "score": 1,
  "title": "DISGUSTING DO NOT DOWNLOAD!!!",
  "text": "Me and my partner had a £10 homies for jointing no deposit ‘ wicked .  I lose mrs wins £460 then tells her she has to wager £500 through the account and then what ever we won off off that we could keep so we was told by a call operator at 32 red . We then won £1200 and we were over the moon it transfered to cash and we was exited ‘ we then get told we are only getting £100 and the rest was going back to the casino after we have a recorded phone call of them telling us the opposite!! SEE YOU IN COURT!!!!"
 },
 {
  "userName": "madmax6169",
  "version": "2.1.0",
  "score": 1,
  "title": "Rubbish peace of crap",
  "text": "My partner downloaded this and got her £10 bonus and won about 300 in cash and £10 in bonus cash and she went on to withdraw £240 in cash and was robbed by them as they only paid out £100 cash and took the rest and said £100 pound was all she was allowed even though she won £300 so you don’t get all of what you win and they clear your account with them off all the remaining money totally disgusting I would advise everyone never get this app it’s totally crap"
 },
 {
  "userName": "Theresa9903",
  "version": "2.1.1",
  "score": 1,
  "title": "Disgusted",
  "text": "I signed up for this Friday and followed all the rules. I had the £10 bonus and also deposited money too. I won almost £400 and went to withdraw it. Today I receive an email saying I'm not getting anything at all as they've confiscated my winnings. I've spoken to them numerous times today and their representatives were rude, didn't care at all. They didn't give any reason why I couldn't have my winnings just that they weren't going to give it to me"
 },
 {
  "userName": "forum 64",
  "version": "2.1.1",
  "score": 1,
  "title": "Greedy clawback of winnings",
  "text": "I have played the downloaded version on desk top but in view of its greedy , immediate and blatantly obvious clawing back of any winnings, I would not advise risking this badly designed site. Extremely difficult to navigate, rare wins and generally substandard quality of whole thing.\n I take part in a large private online gambling forum and this site is by far and away the one that receives the worst reviews and the most criticism. My advice would be to avoid!"
 },
 {
  "userName": "fabaroooooz",
  "version": "2.1.1",
  "score": 1,
  "title": "Waste Of Time!!",
  "text": "Do not bother with the £10 bonus as you get NONE of it in your winnings if you win big, I won £500 in who wants to be a millionare and it all went into my bonus!!! You cannot get any real money from the £10 bonus UNLESS you put your OWN money in, and even then, the site takes 75% from your bonus and 25% from your own cash, meaning you BARELY get anything for your own cash! Absolute waste of time!!!!!!"
 },
 {
  "userName": "AzNoProblem",
  "version": "2.1.1",
  "score": 1,
  "title": "DONT EVEN BOTHER DOWNLOADING",
  "text": "32 Red is quite possibly the worst betting app I have ever used, It's a disgrace! It kept crashing and kicking me out of the numerous times and when I spoke to them in the chat a girl named Cheyenne was rude and careless towards me. Cheyenne was so rude that because I wasn't happy she wanted to deactivate my account. Please give bad reviews people to stop this idiotic site wheeling people in. I didn't even want to love a star but it's the only choice I could give for a bad review."
 },
 {
  "userName": "Xwarli",
  "version": "2.1.0",
  "score": 1,
  "title": "Shameful Tacky Waste of Time",
  "text": "Clunky unresponsive app with a maze of menus that don’t provide any feedback when clicking and leave you waiting and wondering. Plenty of bugs, buttons don’t work, can’t claim £10 free bonus, dodgy Terms. For an app and company that deals with money it just feels like the whole app has been done on a shoestring budget which doesn’t reflect well. Would I trust them with my money? Absolutely not."
 },
 {
  "userName": "luckymummyxx",
  "version": "2.1.1",
  "score": 5,
  "title": "Love it",
  "text": "Deposited £10 and won straight away £50 and was able to withdraw easily. Only down side was the time it takes to process a withdrawal other than that I love 32 red:)"
 },
 {
  "userName": "Lost the lot",
  "version": "2.1.1",
  "score": 1,
  "title": "Very bad games none I’ve even seen before.",
  "text": "Limited games hardly anything you see in ALL the other casinos. And wins are so small it’s unreal you can’t even win a £10 on a bonus on 60p a spin stay away if your playing to try win money don’t wastes your chances here. I have not seen such small wins as they give here anywhere eles. I’ve won £700 plus on other casinos on that stake very bad casino."
 },
 {
  "userName": "Jer23Amber",
  "version": "2.1.1",
  "score": 1,
  "title": "Seriously listen",
  "text": "This is the worst site for casino. They will not let you take your winnings even after playing through the bonus wagging requirements. If your like me and have most of the other sites then stick to them. No help from anyone either! Stick to either virgin casino or Leo casino they are decent! Trust me on this DO NOT open an account they are the worst"
 },
 {
  "userName": "Boo975",
  "version": "2.1.1",
  "score": 1,
  "title": "Avoid the scam",
  "text": "I put 10£ and got another 10£ bonus, i have gone up to 400£ but i found out 100£ was cash 300£ bonus, how they calculated that i am not sure, i decided to withdraw 100£ through paypal, 300£ bonus disappeared, 100£ never came to my paypal, after a few days it was back into casino accounts, never let me withdraw it. Don’t waste your money on this app."
 },
 {
  "userName": "Jwinnter12",
  "version": "2.1.1",
  "score": 1,
  "title": "DO NOT USE!",
  "text": "I have had non stop issues from taking £100 of my own winnings off me to saying my details are invalid and i need a new payment method or to send my documents across. Ive done this so many times and to have £100 stolen of me is mental! Phone numbers wont ring, Customer service is shocking. 100% need reporting no one use this app please! I actually beg its so bad and i feel so stupid!!!!"
 },
 {
  "userName": "ievakv123",
  "version": "2.1.1",
  "score": 5,
  "title": "Good place where to play",
  "text": "I have won some money  I have lost some money , but in general I won more than I lost . And in general good online casino."
 },
 {
  "userName": "AmySquiz26",
  "version": "2.1.1",
  "score": 1,
  "title": "Awful",
  "text": "Don’t even bother with this site. The customer service is shocking. They offer you bonuses, let you claim them, then you are told you aren’t eligible and this is by customer service after you’ve waited to try and get in touch. The player payback is absolutely shocking. Out of all my experiences this is the absolute worst of all the gambling sites."
 },
 {
  "userName": "Deak1980",
  "version": "2.1.1",
  "score": 1,
  "title": "Worst app ever",
  "text": "I try to log in and it tells me my id is wrong despite the fact when you use the web it is perfectly fine. Games crash partway through and then you are unable to reload them unless you close the app attempt to log back in and try again. But no promises I’m afraid. All in all a pointless app. Try on pc if you can."
 },
 {
  "userName": "Czerrina",
  "version": "2.1.0",
  "score": 1,
  "title": "I haven't won, 70 pounds gone",
  "text": "The app itself is nice and easy. Since the start, the money I've won have not exceeded 10 pounds. I have been playing dream catcher, blackjacks and roulettes, they are easy to play but never let you win much money. If you want to try the app, I guess you can. But one advice, if you lose that starting money - do not ever deposit, ever again!"
 },
 {
  "userName": "Robothreesixfive",
  "version": "2.1.1",
  "score": 1,
  "title": "Rubbish app",
  "text": "Haven’t even had the app an hour and it has lost server connection 3 times and now won’t let me log in with my password. If you use password recovery and leave the app to read the email they send you it exits the screen you are on and leaves you in a loop! I hope the desktop version is actually fit for purpose."
 },
 {
  "userName": "pecs275",
  "version": "2.1.1",
  "score": 1,
  "title": "Massive scam!",
  "text": "I downloaded the 32Red app and deposited £20 to get a bonus (£32 for each £10 deposited). I then opened the slots and after about 5 rolls it would crash saying “Unable to connect to servers”, I lost several small wins and opened the bonus round and again lost connection... quite simply a huge scam rip off! DO NOT waste your time or money on the 2nd grade scam..."
 },
 {
  "userName": "M Winfield",
  "version": "2.1.0",
  "score": 1,
  "title": "Worst gabling site ever",
  "text": "I am a gambler, I have done it for many years. Of course you are playing against a machine and the odds are against you. But I played this after work one day. I ended up putting £700 in and not a single chance of winning only at first with their bonuses. It’s on the web as the best site to gamble!! DONT GET THIS APP! I have years of experience absolute rip off."
 },
 {
  "userName": "bego212",
  "version": "2.1.1",
  "score": 1,
  "title": "Worst casino ever",
  "text": "Keeps crashing constantly specially when getting the features bonus i wonder why??? They are thieves called customers services, they blamed my internet connection lol maybe me\nAnd other people that have left a review about the same thing we sharing the same\nInternet connection(interesting).AVOID PLEASE MANY OTHER ONLINE CASINOS ARE WAY BETTER THAN THIS ONE"
 },
 {
  "userName": "selot11",
  "version": "2.1.1",
  "score": 1,
  "title": "Do not waste your money!!",
  "text": "It’s a scam and please please read all the reviews that been wrote by the other people. They don’t let you win money the internet connection drops for some reason and if you win accidentally then they don’t let you withdraw your money!!! Then u contact with the customer service and they ban your account lol"
 },
 {
  "userName": "Frustrated gamer 4",
  "version": "2.1.0",
  "score": 1,
  "title": "Crashes when you win. Poorly made app.",
  "text": "How convenient that it crashes every time you win big in slots and yet takes your money but doesn’t give you your win. Also the app is poorly made with different games all over the place you don’t know what is what.  Deleted app and account. Bye bye."
 },
 {
  "userName": "lokka42",
  "version": "2.1.1",
  "score": 1,
  "title": "Scam - avoid !!",
  "text": "Do not use this site. They will take your deposit and then hold it until you send every detail about your private banking and accounts, line by line.  They took a deposit from me and now won’t pay out my winnings, nor return my deposit hiding behind their ‘verification rules’"
 },
 {
  "userName": "Crazygal73",
  "version": "2.1.1",
  "score": 1,
  "title": "Horrendous",
  "text": "Would give 0 stars if possible. DO NOT download unless you’ve got plenty money to play with as it’s a pretty much zero return. App should be removed from App Store. It constantly crashes saying it’s unable to connect to server no matter what kind of internet connection you use. The worst app I’ve ever used"
 },
 {
  "userName": "Kanedrewoates",
  "version": "2.1.1",
  "score": 5,
  "title": "Too casino",
  "text": "Plenty of games to play some retro but new games like blueprint are needed always good promos can not complain."
 },
 {
  "userName": "foxyste86",
  "version": "2.1.1",
  "score": 1,
  "title": "DO NOT USE",
  "text": "Absolutely terrible online casino. They do not reward you in the slightest for playing (a prize wheel that gives one free spin every now and again is not a reward!) and are intent on taking your money as quickly as they can! Do not bet with them as you WILL lose!"
 },
 {
  "userName": "Colopus",
  "version": "2.1.1",
  "score": 1,
  "title": "Constantly loses connections",
  "text": "I read the previous reviews, but thought their issues were down to their internet. But I was wrong... running on 75mb fiber somehow the app is constantly losing connection to the server.\n\nTerrible, terrible app. Cashed out within 15 minutes as it was unbearable."
 },
 {
  "userName": "MaggieMay29",
  "version": "2.1.1",
  "score": 1,
  "title": "The worst app ever!",
  "text": "I haven’t seen such a terrible app before. Games keep freezing funnily enough especially when the slot spins for bonuses. I had to keep login in over and over again. All you do is taking peoples money. Absolutely disgusting. Will not play agin... Shame there is no possibility to give 0 stars..."
 },
 {
  "userName": "_Westy_",
  "version": "2.1.1",
  "score": 1,
  "title": "Bloody Awful!",
  "text": "Software is slow and as per other reviews kicks you out and makes you sign back in. £70 wagered at £1 per spin, kept winning 12p and the occasional 24p! Lasted less than 10 minutes.\nRubbish experience on possibly the worst casino site I have been on!"
 },
 {
  "userName": "ZombieCrusher1234",
  "version": "2.1.1",
  "score": 1,
  "title": "Honestly",
  "text": "Seriously, unbelievable, I went with the flow, 10 pound deposit, bonuses, realized how you made your money, earned an enough to get the 10 I put in, withdraw, and I have a look in my bank account, and instead of -10 then +10, it’s -22. Absolute disgrace, seriously. Duck you"
 },
 {
  "userName": "charmainedemarigny",
  "version": "2.1.1",
  "score": 1,
  "title": "No Money paid out",
  "text": "I won 247 and I’m still waiting for them to deposit my payout... it has been a week now. \nI keep sending emails after me sending all the proof of bank details and what not.... still nothing, not even a response on email."
 },
 {
  "userName": "raprap213",
  "version": "2.1.1",
  "score": 1,
  "title": "Do not play on this scam website",
  "text": "Just dont i should have listen from other peoples comments but i didnt i wont alot of money from bonus bet and realise you have to bet it for 50X before you get your money not recommend this betting site"
 },
 {
  "userName": "Vikki12344",
  "version": "2.1.1",
  "score": 1,
  "title": "Fraudulent app",
  "text": "They take money off you. Then won’t let you log back in. You try and speak to people on live chat and they repeat themselves all the time. Nothing they suggest works. Then they freeze you from talking to them. Absolutely disgusting!! STAY CLEAR AWAY FROM THIS APP"
 },
 {
  "userName": "-flyer-",
  "version": "2.1.1",
  "score": 1,
  "title": "Sh#t",
  "text": "So I seen the advert for this game on tv so thought hey why not give it a go well what a load of sh it it won’t even go past the registration get to the last bit ant it’s just loading I mean I actually waited over ten minutes and nothing. \nDo not download this it’s a waste of time!!!"
 },
 {
  "userName": "scotty1800",
  "version": "2.1.0",
  "score": 1,
  "title": "Crap wins",
  "text": "Played on demo mode on most of the games before parting with my money,glad I did as all you win is not even a quarter of your steak,no decent wins,boring games as all your doing is pressing the spin button and getting nothing back on over 100 spins,crap app!!"
 },
 {
  "userName": "calkings1467",
  "version": "2.1.1",
  "score": 1,
  "title": "Worst online betting site AVOID!!!",
  "text": "They give you a win on casino to start with and as soon you start to put money on here you win absolutely nothing. SCAM. The app itself is awful glitches all the time half the games won’t load."
 },
 {
  "userName": "stop its not worth it",
  "version": "2.1.1",
  "score": 1,
  "title": "Don’t waste your money and time",
  "text": "I have won some money. I tried to withdraw it and didn’t work. \nIt’s is easy for them to take money of your bank but it doesn’t work other way.\nPlease don’t use this app and save your own money."
 },
 {
  "userName": "mrs weirmee",
  "version": "2.1.1",
  "score": 1,
  "title": "Awful!",
  "text": "Every 1 minuets cut off and saying cannot connect to the server! Must had been signed in about 100 times in half an hours!!!! Please short it out. Good with the no deposit required and give you £10 bonus for play...."
 },
 {
  "userName": "Designrascal",
  "version": "2.1.1",
  "score": 1,
  "title": "Worst Gambling App Ever",
  "text": "Hands down the worse gambling app ever. Let me explain Red 32 you have to sometimes let a little bit of a win happen! Just so we can keep playing for longer. Stay away from this like a person with Corona!!"
 },
 {
  "userName": "Galaboy79",
  "version": "2.1.1",
  "score": 5,
  "title": "Scary Terry",
  "text": "Excellent games and won £1500 on my 1st visit I’ll definitely be back here with a bigger swag bag next time 👍"
 },
 {
  "userName": "Pstoddy",
  "version": "2.1.1",
  "score": 1,
  "title": "Don’t bother it’s fixed!",
  "text": "They don’t even try to disguise the fixed pattern of payouts! I did manage to ‘win’ £50 and withdraw it but then I couldn’t win anything after!!! \nTo make it worse the server connection keeps dropping out mid game! 🤬"
 },
 {
  "userName": "Alfiecavapoo",
  "version": "2.1.1",
  "score": 4,
  "title": "Good",
  "text": "App version of the website. No issues so far."
 },
 {
  "userName": "Cool kids tv",
  "version": "2.1.1",
  "score": 4,
  "title": "Broweyes72",
  "text": "Love it but needs work on connection issues"
 },
 {
  "userName": "confusedx1990",
  "version": "2.1.1",
  "score": 1,
  "title": "Honestly read the reviews it’s a scam!!!",
  "text": "The games all glitch, the websites logs you out constantly. You never win... trust me I’ve played over £140 and never even had so much as a feature on a game. Seriously stay away!"
 },
 {
  "userName": "annie4gerry",
  "version": "2.1.0",
  "score": 5,
  "title": "Good games",
  "text": "Excellent site for quality"
 },
 {
  "userName": "Matlock1979manchester",
  "version": "2.1.0",
  "score": 1,
  "title": "Waste",
  "text": "Don’t waste your time or money on this app, very slow, it freezes every time you close a game down and try to go back to home screen, win to lose ratio favours lose 70% of the time,"
 },
 {
  "userName": "John24912491",
  "version": "2.1.1",
  "score": 5,
  "title": "Dangerous",
  "text": "Highly recommend to anyone willing to risk it for a biscuit"
 }
]