[
 {
  "userName": "Quaedam",
  "version": "11.6.1",
  "score": 1,
  "title": "POOR IS TOO GOOD A DESCRIPTION!",
  "text": "This morning I have played several games on this site.  From 8.30 it slowed down...and slowed down....and slowed down more.  Playing Persian Fortunes was more like playing Russian Tortures.  10 seconds to show the cascade (not to mention the MISerable payouts).  Then I play another game.  And I notice that there are issues with the balance reducing more than the gameplay...( I think).  I didn't think much of  his as it was prhaps only £1or so....but then, on the same game, I won around £1.60 which didn't seem to transfer to my balance.  Then I noticed that again, for definite.  I go to try to live chat to ask someone to check for me...and the live chat box...won't open the keyboard on my device so I can't communicate with them. Now, I'm not techstupid! so I reopenth app, refresh, empty cache, uninstall and go in via the website (because trying the website route defaults to opning the app anyway).  Same thing on website, I can enter my details but can't chat back to the waiting agent.  I am now posting this as the only means of getting through and in the hope that JPJ will get their acts together."
 },
 {
  "userName": "Floyd462663626275",
  "version": "11.2.0",
  "score": 1,
  "title": "no, No, NO!!!",
  "text": "Remember the song by Grandmaster flash White Lines with the lyrics “Don’t do it”. That’s this site.   I wish I had read the reviews first but I joined and added £20. Got free spins which added up to about 23p. Tried several different games which I had trouble accessing all(phone kept telling me to swipe up). The games are lacking everything,  quality, enthusiasm, graphics and value for money.  I then tried the free bingo after losing my money in under 10 minutes (I am not a newbie to gambling and I know the odds are against you but this site does seem rigged,  I play on Bet365 and no problems there)   I then tried to have a go at the free bingo but kept looping back to the homepage.  It was then I decided to delete my account.  The customer service was the best part of the app but I didn’t download the app to have a good customer service.  Feel like I would have had more excitement being mugged for my £20. But no way to get my money back."
 },
 {
  "userName": "JustHHHHH",
  "version": "8.0.5",
  "score": 1,
  "title": "Mmm not convinced",
  "text": "So it’s a gambling site so obviously there is a high risk to loosing money. I added £10 and received the free spins and free bingo tickets which I won back my £10 and withdrew.. phew. I then proceeded to win £1.16 lol so played it all, I’m a maverick like that! The problem I have with this site is that like many others it says it’s into responsible gambling .. so why is the MINIMUM weekly deposit £100, it should be £10. They also have promotions which encourage you to spend more, at the moment one only lets you get the promotion if you spend £5 a day for 3 consecutive days .. that’s is a BIG no I’m my book! We are all free to choose what we do with our money but when games are overly complicated to purchase tickets many being a min 25p bet with no clear guidance on how to change your stake,  it causes massive alarm bells for me. So I’ll give this one a miss."
 },
 {
  "userName": "Sun209blue",
  "version": "9.6.0",
  "score": 5,
  "title": "New update lay out!",
  "text": "Please please jackpot joy can you put a list of ALL games back on the home page! Since the last update I cannot find the games I want to play!! Bingo has disappeared (unless you type bingo in the search bar - the games come up but not the info I need - how much, whether it’s a link game, how many players, how much is the pot!! - this is SUCH important info!!!) I also like to see all of the slot games on offer! I now have to try to remember the name of the game I want to play and type it into the search bar!! Ridiculous! Hugely unsatisfactory!! From a loyal member of 6 years"
 },
 {
  "userName": "123pak",
  "version": "9.6.0",
  "score": 4,
  "title": "Not so much joy but constant frustration with THE GODFATHER!",
  "text": "I’m so fed up of having to constantly login again and again when it looks as though I might win a huge amount of money on this game. But instead, the game locks me out and shows me a blank white screen every time I bet big, even in demo mode the same thing happens every time! I use the iPad app and I even go to the trouble of clearing the history before I begin!  It it makes no difference to the way the game plays out of control when it looks as though I might actually win something back???"
 },
 {
  "userName": "598BB",
  "version": "11.2.0",
  "score": 1,
  "title": "The updated App is dreadful",
  "text": "I used to love this App. If was by far the easiest to use of any of the sites I’ve tried. The claim to have made it better! No they’ve killed it... I have to login twice unless I want to use the few games presented to me at first login. First time I can use my fingerprint the second time I have to type my full password (what was the point of using the IOS fingerprint option). I could save my password in browser but this is something I hate doing. Then just about every slot you have to drag your screen up to fit, however this does not work and you get stuck in a loop of dragging then it asks again😡 \n\nSo well done on destroying the App and I’ll look for one that actually works well..."
 },
 {
  "userName": "neededthat",
  "version": "7.0.0",
  "score": 5,
  "title": "App Store review",
  "text": "It's rubbish can't get frees ?whats happened to you jackpotjoy ? Everything is a mess . You totally are getting everything wrong . My large family who have been with you for years have all quit and gone to another site it's just me who's left . The play off palace has affected them when you failed to get the last game sorted out they were not impressed and have now found s much better site ... I'm just giving you the benefit of the doubt . Where your loyalty ???"
 },
 {
  "userName": "Caaaannon",
  "version": "9.6.0",
  "score": 1,
  "title": "You put more money in then what you win!",
  "text": "When you look back at how much money you actually spend on here to how much you end up winning you will be disappointed and shocked. Regulars should get more benefits. I feel like I have put so much money into this site yet get 10p wins everytime no matter how high I put my bets at. No fun anymore. The only time I’ve ever won big was when they gave me free spins when I first joined and that was probably to reel me in, very sad I fell for it. It would be more fun if you didn’t even win big but at least won some of your money back. My advice- join up and play with the bonus’ they give you and your first deposit then LEAVE AND DELETE"
 },
 {
  "userName": "Tjm732015",
  "version": "11.12.0",
  "score": 3,
  "title": "Something odd is going on",
  "text": "I dont know whats going on, but for some reason in the app and on the mobile website, trying to lower your coin size is a nightmare!   As you lower it keeps swiping the screen to a swipe up option and sometimes completley out of the game so it reloads... this is not on.  I thought it was just a glitch at first but this is truley a big annoyance.  I have tried it on my ipad too and it still does it. Please fix, oh and whats with changing mega moolah?!!!  Totally different now."
 },
 {
  "userName": "Allyv9",
  "version": "11.2.0",
  "score": 1,
  "title": "Jackpotjoy",
  "text": "shocked at how bad this site is , used to be good site, the  past few days playing lack of payouts beyond belief that so many games can be so bad , deposits don’t last compared to my other site , 1 deposit here generally last 2-3 minutes compared to my other site one deposit usually last 2-3 hours , never see wins in chat which I find very strange as every other site I play are full of people putting wins in chat , mostly full of complaints , host just talking to each other ,  give you a strange feeling ,  1 star so far for you jackpotjoy , Alaskacat"
 },
 {
  "userName": "Shazzie23",
  "version": "10.1.0",
  "score": 2,
  "title": "Not the same",
  "text": "Site keeps crashing, Been member for years now, It was great back then. I have been lucky had a few big wins, doesnt seem to be the same anymore, I feel as if they just want to look after the newbies and push us oldies to one side.  Not many bonus games anymore and if there is you have to wager higher stakes than before. VIP has really gone down hill. Same winners winning nearly 2-4 games one after the other, iam lucky if I get a win theses days.I try not to go on much now"
 },
 {
  "userName": "princessmadcow",
  "version": "11.13.0",
  "score": 3,
  "title": "Princessmadcow",
  "text": "It keeps booting me out and won’t let me buy tickets saying please login? I am logged in and no I have not got any cache or cookies to clear my lap top is up to date also. I would appreciate a win please also randy  and hosts to change the same winners picked on sessions it’s getting as same people win or get picked it’s very noticeable other than that the hosts are doing a great job in this difficult covid19 time thank you xx"
 },
 {
  "userName": "Exsterminhater",
  "version": "11.12.0",
  "score": 1,
  "title": "Car crash.",
  "text": "Thanks Jackpot Joy, you saved me twenty quid and possibly a lot more. I downloaded your app and deposited £20 then went on Millionaire Megaways, £20 lasted about half an hour. Pretty standard I thought. I then deposited another £20 and tried at least 10 different games. Each time the game wouldn’t load and I was thrown out of the app and then had to log in again. Good practice for remembering my log in details! Anyway, I’ve withdrawn my £20 and deleted the app, lesson learnt! Obviously you get to keep the original £20, go and have a drink on me. Ta da!"
 },
 {
  "userName": "Success40",
  "version": "7.0.0",
  "score": 5,
  "title": "Jackpotjoy- great fun and real wins!!",
  "text": "Friend has recommended that website to me, and I am pleased with that. It is a great fun, sometimes winning, sometimes loosing ( like it is in life 😉), however very helpful hosts, secure payment and withdrawn proceed quickly. \nI have so far recommended to 3 of my other friends and all of them have enjoyed winnings !!!"
 },
 {
  "userName": "Syrupsponge",
  "version": "11.7.0",
  "score": 2,
  "title": "Games are good but too many repeat winners",
  "text": "Don’t spend a tenth of what I used to in the old days. Too many maxers targeting the guaranteed game jackpots, making it virtually impossible for the hobby player to win and seeing the same names winning every day. \n\nOther sites offer run on houses, 1tg/2tg bonuses and shares jackpots in multiple games, so even if you don’t win the house you don’t feel it’s all give and nothing back.\n\nSite’s got greedy, players got greedy."
 },
 {
  "userName": "Craig989",
  "version": "7.3.0",
  "score": 5,
  "title": "Fun👍👍",
  "text": "Jackpotjoy is the most best slots out there reliable and the staff are really friendly even the people who play bingo are friendly it really is the number 1 slots I've ever played thanks jackpotjoy for helping me in the past I Rate 5 stars because there really nice people and friendly"
 },
 {
  "userName": "ChelleDinos",
  "version": "8.0.5",
  "score": 2,
  "title": "Response of app to slow",
  "text": "Have to say I prefer the web version. The app is slow and when rotating device to play games the game zooms so you have to reset the app. Also some of the games don’t have to home button so you can’t return to home page so again you have to reset the app. Even using the web version on my phone gives better game play! Will not be using app until the bugs are fixed"
 },
 {
  "userName": "kezzab1989",
  "version": "9.5.0",
  "score": 3,
  "title": "What’s happened",
  "text": "This was always a great app but the last two updates have been terrible. The one a few months back messed up the bingo by making the screen large when selecting tickets on bulk buy etc forcing me to have to close the app and re open. Have updated again today and app keeps freezing!!"
 },
 {
  "userName": "bigloz81",
  "version": "11.13.0",
  "score": 1,
  "title": "Worse site ever for loyalty to there players",
  "text": "Once was a good site ,the way you earn loyalty point now is terrible the old way you got more for your money now you are lucky to get any as you get them if u win over 20 on the slots and looking back on my history I’ve spent a lot off money and had no big wins in a long time , as they say join the promotions and you do but never win so don’t even know if they are real,wouldn’t recommend to anyone now a days"
 },
 {
  "userName": "alekdaone",
  "version": "11.9.0",
  "score": 1,
  "title": "Total rubbish",
  "text": "Played every day for a few weeks, spent more then 200£ and always give way less then you deposit, you deposit 50£ will win 20£ and if you continue to play lose those 20 as well, just will burn your money, never got a decent win. If you want to try the best casino just play SkyVegas. For less then month won over 2k with everyday playing sometimes you lose, but overall the best out there, only SkyVegas is the real casino."
 },
 {
  "userName": "Rosiejulia",
  "version": "11.7.0",
  "score": 5,
  "title": "Great fun and excitement that doesn’t stop!",
  "text": "Jackpotjoy is a great site that always brings you new promotions and games on a daily basis. Great prizes to win and a very good site for wins on games. The customer service is always on hand and great to deal with. I highly recommend this site."
 },
 {
  "userName": "KLHD",
  "version": "11.13.0",
  "score": 1,
  "title": "Couldn’t actually use the app!!",
  "text": "No point downloading the app because I couldn’t access any of the games!! Had to load it on safari as it wouldn’t load at all!! And Supposedly I was to receive £50 once I spent my first £10 deposit!! Not that they made it very clear but I was then given “free tickets” I used 50 of them on a 5p a ticket game only to then realise that was my free “£50 bonus” the games were jumpy and slow even on safari!!\nI don’t rate it at all!!"
 },
 {
  "userName": "Bluebird26",
  "version": "8.0.3",
  "score": 3,
  "title": "Needs Updating",
  "text": "Overall it isn’t a bad app, but I think it’s built from the website so certain things are buggy, like the app zooms in for no reason and then you have to close the app and start again as you can’t zoom back out also it needs updating for the bigger iPhone X screen size"
 },
 {
  "userName": "trippyteg",
  "version": "11.7.0",
  "score": 5,
  "title": "Love this site",
  "text": "Think this sites great although the catch of the month is a let down lately liked it better how it used to be other than that great site great service"
 },
 {
  "userName": "Welsh886",
  "version": "9.6.0",
  "score": 1,
  "title": "Don’t waste your money",
  "text": "I played on here a few months back and was winning decent ( at least my money back anyways) started back thinking it was one of my faves but guess what no payout I have spent 100 of my own money in less than a week and not one withdrawal! £10 lasts me about half hour on other sites it can last hours and have a payout at the end beware virgin, heart and jackpot joy are all the same!! You’ve been warned"
 },
 {
  "userName": "tracey051",
  "version": "8.0.3",
  "score": 5,
  "title": "Jackpot winner",
  "text": "I have found that I win on this site more than any other I’ve been on, won£78 thousand and win quite often saying that put a lot on too but I do see some decent wins so I’m sticking to this site"
 },
 {
  "userName": "kazziewins",
  "version": "11.7.0",
  "score": 5,
  "title": "Prompt payment of winnings and fun site",
  "text": "So very impressed with the time it takes for winnings to be transferred.  Most of the time it is the next day.  Enjoy all the games and great customer service."
 },
 {
  "userName": "Stephy147",
  "version": "7.0.0",
  "score": 5,
  "title": "Best site around",
  "text": "Best site for software the only down fall can be the chat there some folk that think they have shares in this site and in turn think they are in with the paint just ignore that and have fun"
 },
 {
  "userName": "Reedy2928",
  "version": "11.13.0",
  "score": 1,
  "title": "Disgraceful",
  "text": "The big night in is today, I put £20 on in total it took them literally 10 minutes to take in on spins. Hardly any payout at all. I stopped using this site because of the low chances anyways. Complete scam. Takes and takes constantly, always a catch with any reward. Most I’ve ever won in there in the past was about ten pounds. Not worth the time at all. William hill Vegas is so much better."
 },
 {
  "userName": "ARCHIEBARCHIE09",
  "version": "7.0.0",
  "score": 5,
  "title": "Jbop",
  "text": "Excellent I hope the wager acquirements don't let me down as I won two hundred pound make sure you spend every penny out of your bonus otherwise the Force you spend your winnings 👍"
 },
 {
  "userName": "speecho85",
  "version": "8.0.0",
  "score": 5,
  "title": "My review",
  "text": "Joined jackpot joy 3 weeks ago and it's quickly become my favourite site. Having the app just makes it so much easier now I can play anywhere"
 },
 {
  "userName": "eddylaaaa",
  "version": "8.0.5",
  "score": 5,
  "title": "Deposited",
  "text": "I sent invite 2 my friend to join so he did deposit £10 got 2 120 played more so I should of got £20 like it says but still yet not received it not happy"
 },
 {
  "userName": "elfthirteen",
  "version": "8.0.0",
  "score": 5,
  "title": "Simply the best sight",
  "text": "Great friendly sight with helpful people who not only chat while you play but also phone to check all is well"
 },
 {
  "userName": "jinty1231",
  "version": "7.0.0",
  "score": 5,
  "title": "Enjoy jackpotjoy",
  "text": "I have tried other sites but none match up to jackpotjoy games bonuses prizes all very superior to all others"
 },
 {
  "userName": "Magic witch",
  "version": "7.0.0",
  "score": 5,
  "title": "Love Sapphire Bingo and Jungle Jump.",
  "text": "I have a few medical issues that prevent me going out sometimes so it's wonderful that I can still get to play Bingo and other games."
 },
 {
  "userName": "chloemoo1",
  "version": "8.0.3",
  "score": 5,
  "title": "Good app!!",
  "text": "Only ever deposited 20 pound since I downloaded this app and yet I have won And withdrawn about 160 in two days! Such a good app and not a rip off like other sites are!!"
 },
 {
  "userName": "chickybin1564",
  "version": "11.13.0",
  "score": 5,
  "title": "Excellent",
  "text": "I would recommend all games sites they are the best referral dazmethemoney if you wish to join great promos chat rooms and great selection of games"
 },
 {
  "userName": "Helenfinn",
  "version": "11.2.0",
  "score": 1,
  "title": "Don’t do it!!!",
  "text": "Don’t be a fool like me and believe you can win, there’s only one winner and that’s jpj the app is terrible and freezes all the time. As for the games, over a 100 spins and not a single bonus round. Used to be a good site but it’s gone down hill. Don’t waste your money. If I could I’d give it 0 stars but I cannot because it wouldn’t post so 1 it is."
 },
 {
  "userName": "winmesom",
  "version": "8.0.3",
  "score": 5,
  "title": "Jpj",
  "text": "Love jpj been here since almost opened host are friendly plenty of games but I think they should do a 75 room also"
 },
 {
  "userName": "samwilkes86",
  "version": "7.9.0",
  "score": 5,
  "title": "Review",
  "text": "Brilliant site .. never had a single problem.. great choice of games .. and really fast payout .. they get a 10 star rating from me !"
 },
 {
  "userName": "Dragpittx",
  "version": "11.2.0",
  "score": 3,
  "title": "After of the promos & games are missing",
  "text": "About a week ago the app stop load after the games / promotion. I now can only get 6 slots games to play, also I can’t find the bingo games and the free slots games."
 },
 {
  "userName": "turkey2000",
  "version": "8.0.3",
  "score": 3,
  "title": "Be aware",
  "text": "Great when your winning like any other site BUT while you waiting for win to be withdrawn, Don’t play as you will lose the lot. It seems that they know your waiting for your cash."
 },
 {
  "userName": "Cerystia10",
  "version": "11.2.0",
  "score": 3,
  "title": "Updated app",
  "text": "The updated app is totally useless. Navigation has lots more steps than previously. Opening s fans is now frustrating. Don’t think I’ll. W using be using this sit again."
 },
 {
  "userName": "halipaly",
  "version": "11.13.0",
  "score": 4,
  "title": "Love jpj but ......",
  "text": "Been a member for 14 years and things are not the same anymore.\nAlso lots of technical hitches but still the only bingo site I would ever play on."
 },
 {
  "userName": "Mrs_Devvo",
  "version": "11.2.0",
  "score": 1,
  "title": "Jackpotjoy(less)",
  "text": "App is absolutely shocking now, I only ever really played on Rainbow Riches & a few bingo games.\nThey have all now gone from the app, & don’t even get me started on Catch of the month.\nBefore the app removed most games, I did wager quite a bit of money each month & I was lucky to win two spins (if that)"
 },
 {
  "userName": "Mr pingit",
  "version": "11.11.0",
  "score": 5,
  "title": "Win or lose",
  "text": "I love playing jack pot joy because it is fun to play whether you win or lose \nDiesel."
 },
 {
  "userName": "fee128",
  "version": "8.0.0",
  "score": 5,
  "title": "Best about!",
  "text": "Have won a good amount and choice of games would recommend 100%"
 },
 {
  "userName": "halps3101",
  "version": "11.2.0",
  "score": 5,
  "title": "halps3101",
  "text": "I put £10 in and won £160 with drew the £100 and a few days later won another £100 and withdrew it"
 },
 {
  "userName": "wasted90",
  "version": "8.0.3",
  "score": 1,
  "title": "Holiding my winnings hostage!",
  "text": "Deposited many times no problem the minute I tried to withdraw I wasn’t allowed have to prove who I am were I live none of the links work to do. In the live chat room I can’t type anything in Iv sent emails and only thing said back so far is my account will b shutdown in 72 hours!!!!"
 },
 {
  "userName": "Maggirl69",
  "version": "7.0.0",
  "score": 5,
  "title": "jPJ",
  "text": "Love the new layout, more and more things available on the mobile app, so it's all brilliant!! Thank you"
 }
]