[
 {
  "userName": "daniel tocker",
  "version": "3.2.0",
  "score": 1,
  "title": "Useless betting app",
  "text": "Withdraw £500 only to get £110 put into my bank.\n they told me they would send other £390 and it should be in you bank within the next 5 working days,\nIt’s now been 10 days and the funds are still not in my bank? Last few Days I have tried getting into my account because I still have bets on and it says access denied.  I have Sent emails and still no reply from the bet10 team this is the worst betting app ever, would never ever recommend them and a hope people think twice about downloading this app please look at the reviews.\n\nI have sent an email like you said and there has still not got back to me it’s been 7 days?"
 },
 {
  "userName": "L33ro7",
  "version": "3.2.0",
  "score": 3,
  "title": "App on IPad needs massive improvement",
  "text": "Enjoy the app on my phone but often when it needs charging I resort to the IPad. This is terrible and that's being kind, takes an age to load and sometimes doesn't at all. Would recommend a fix for this ASAP as most other sites have done there work to improve their app and 10Bet don't want to be left behind."
 },
 {
  "userName": "Verno - Giggidy Giggidy",
  "version": "3.2.0",
  "score": 1,
  "title": "Useless Betting Company",
  "text": "Revamp the app and I can no longer access my account. Contacted customer support who are useless and couldn’t give me any decent answers for the cause of the problem. They just kept telling me to try the same thing over and over again which didn’t work over and over again so sacked it off. There’s hundreds of better betting companies and apps out there. Don’t waste your time with these idiots."
 },
 {
  "userName": "Musclebuilderpro",
  "version": "3.1.1",
  "score": 1,
  "title": "Worst betting site ever",
  "text": "I joined 10 bet deposited £50 and won £200 I then see the next day the money has gone from my account. When i contacted the customer service they said it was a problem on their end and that it would be resolved and back in my account within a week. 4 weeks passed as i battled back and forth but they never gave me a penny back. And i never received the money i deposited. Avoid this site please !!!!!!"
 },
 {
  "userName": "Vgvygvygvygvguyugug",
  "version": "3.1.1",
  "score": 1,
  "title": "Worst betting app I’ve used",
  "text": "This is my first ever review; the quality of this app has compelled me to. The app initially takes a very long time to load, and then takes just as long to navigate once you’re in. It often signs you out not long after logging you in, and is just generally terrible. \n\nThey offer a lot more markets than most, but the quality of the app forces you to not take advantage of them. Do not recommend."
 },
 {
  "userName": "FatSamsGrandSlam",
  "version": "3.2.0",
  "score": 5,
  "title": "Best looking sports book around!",
  "text": "The old UI wasn’t great. But the new look absolutely is! Check it out and you’ll see what I mean. Clean, elegant, intuitive and much faster than it was before. I really like it."
 },
 {
  "userName": "Jeff0i",
  "version": "3.2.0",
  "score": 1,
  "title": "Terrible app and procedures",
  "text": "Really slow vs other sites. Matches are slow to be uploaded and updated as an inplay option.\n\nPlus good luck attempting to get any winnings back. They are happy to take money from your bank with zero proof of ID but withdrawing it back to your card requires uploading of multiple documents. Just keep coming back via email saying incorrect docs. Jokers. I’d go elsewhere folks."
 },
 {
  "userName": "pluton247",
  "version": "3.2.0",
  "score": 5,
  "title": "Excellent",
  "text": "One of the best apps out there plus you receive your winnings especially if you deposit with PayPal within 20 minutes."
 },
 {
  "userName": "S0nNy21",
  "version": "3.2.0",
  "score": 5,
  "title": "Stepped up!",
  "text": "I started betting there ages ago and took a break from them. They have come a long way and this app looks and feels amazing. Face ID log in, PayPal support, very responsive site and app!"
 },
 {
  "userName": "Mr Grapes",
  "version": "3.1.1",
  "score": 5,
  "title": "Great app for sports betting",
  "text": "Very impressed with the app, easy to use, lots of promotions and free bets appear in your account quickly. Not a casino player but won off free spins which topped up my sports balance"
 },
 {
  "userName": "Whippet Wheats",
  "version": "3.2.0",
  "score": 4,
  "title": "Works well",
  "text": "App works well for me and had no issues with withdrawals.\nWithdrew money and was in account the following day.\nApp may need an update as some promotions have expired beyond the valid dates"
 },
 {
  "userName": "Cmo101",
  "version": "3.1.1",
  "score": 1,
  "title": "Awful app!!",
  "text": "Terrible app!  Takes forever to load & just as long when navigating & making your selections.  It's always logging you out, I've just had to log in 5 times in a row!!! Forever getting messages saying access denied.  It's really just a total pain to use!  Definately not user friendly in the slightest!!"
 },
 {
  "userName": "Reubenation",
  "version": "3.1.1",
  "score": 2,
  "title": "Not the best",
  "text": "App is fairly slow compared to other apps and the ‘keep me logged in’ feature does not work, reported the problem and was told it was to do with the reality check which makes no difference."
 },
 {
  "userName": "jdtrfhu",
  "version": "3.1.1",
  "score": 1,
  "title": "Worst betting app ever!",
  "text": "I think this is officially the worst betting app I have tried, it’s so slow and laggy and it takes about a minute to load something, update your servers 10Bet and give your customers notifications. If you want to know what a good betting app is then go download skybet or bet355"
 },
 {
  "userName": "jon ka",
  "version": "3.1.1",
  "score": 5,
  "title": ":)",
  "text": "Helps in my betting, saving time and at the same time winning! Try it!"
 },
 {
  "userName": "BjornBjornsen",
  "version": "3.1.1",
  "score": 1,
  "title": "Good markets and options let down by slow/laggy interface",
  "text": "As the title says.\n\nHas a decent amount of games and markets however its severely let down by a slow, laggy, choppy interface. \n\nNeeds cleaning up and the random pop ups are annoying. If you are going to offer punters in-play betting then the interface needs to be able to accommodate fast bets, clicks, scrolling.\n\nUnfortunately I won’t be re-depositing till this is fixed."
 },
 {
  "userName": "BEDDY83",
  "version": "3.1.1",
  "score": 1,
  "title": "Do not use",
  "text": "I have never wrote a review on here before, however this deserves it. \nThe app doesn’t work properly, the layout is dreadful and it didn’t put my bet on even though it said “completed”\nYou have been warned!!"
 },
 {
  "userName": "Muppets453",
  "version": "3.1.0",
  "score": 2,
  "title": "Flakey as hell on iPhone 10",
  "text": "Fails to load properly half the time. Close, restart / same again. Just keep trying !!  It’ll load eventually."
 },
 {
  "userName": "Rimsy1",
  "version": "3.1.1",
  "score": 2,
  "title": "It’s a start",
  "text": "Needs to be speedy up somehow as it lags quite a bit, also notifications of goals. Will have to compete with the likes of Sky Bet & Bet 365 to prove themselves"
 },
 {
  "userName": "GpL66",
  "version": "3.2.0",
  "score": 1,
  "title": "Shocking and Frustrating",
  "text": "So frustrating to use, I use English fraction odds but when I change in the settings it constantly back to American odds. Slow and glitchy application too"
 },
 {
  "userName": "Gorse2018",
  "version": "3.1.1",
  "score": 1,
  "title": "Slow slow slow",
  "text": "Nice range of in play bets but the lag delays are so long even on WiFi. The brand has a lot going for it but they really need to fix the speed issues."
 },
 {
  "userName": "YRADCC",
  "version": "3.1.1",
  "score": 1,
  "title": "Worst betting app ever",
  "text": "Poor odds compared to other sites\nNeed to change settings every time\nPoor management of the bonus for instance £50 bonus needs £800 worth of pre event bets at over 1.6 to keep any monies made in profit"
 },
 {
  "userName": "Connor.m7",
  "version": "3.2.0",
  "score": 1,
  "title": "Avoid this app",
  "text": "Worst betting app I’ve ever experienced it allowed me to sign up make my deposit and place two bets as soon as the first one won it signed me out of my account and denied me access"
 },
 {
  "userName": "red moomin",
  "version": "3.2.0",
  "score": 2,
  "title": "Slow",
  "text": "The app would be good, except it’s very slow and doesn’t save my settings."
 },
 {
  "userName": "fuad51",
  "version": "3.1.1",
  "score": 5,
  "title": "Like it",
  "text": "Easy to use"
 },
 {
  "userName": "Annie 2019",
  "version": "3.2.0",
  "score": 2,
  "title": "Could you please fix it",
  "text": "Keeks me out every 3 second. Don’t have Enora time even to check settings😔"
 },
 {
  "userName": "Lee1haz",
  "version": "3.1.1",
  "score": 2,
  "title": "Speed",
  "text": "Wasn’t bad at first but this is becoming unbelievably slow it’s 2018 guys get with it or loose your customers"
 },
 {
  "userName": "timo_53",
  "version": "3.1.1",
  "score": 5,
  "title": "Great",
  "text": "Really good app and costumes service help great"
 },
 {
  "userName": "astu1983",
  "version": "3.2.0",
  "score": 1,
  "title": "Update rubbish",
  "text": "Update needs changing back to previous version"
 },
 {
  "userName": "JackMassie1998",
  "version": "3.2.0",
  "score": 1,
  "title": "AVOID AVOID AVOID",
  "text": "The worst betting company I have ever played with. That 2.6 rating should be much lower. I recommend all to avoid at all costs."
 },
 {
  "userName": "32redrubbish",
  "version": "3.2.0",
  "score": 1,
  "title": "Mr black jack",
  "text": "This betting site is a joke, don’t play on them\nCasino\nNever ever, dealer always getiing black jack 21 20\nOr 19 and almost never busting, worse expiration ever."
 },
 {
  "userName": "rahaf rose",
  "version": "3.1.1",
  "score": 5,
  "title": "The best",
  "text": "The best app ever!! \nVery fast"
 },
 {
  "userName": "REZA malekmohamadi",
  "version": "3.2.0",
  "score": 1,
  "title": "Bonus",
  "text": "Absolutely useless app"
 },
 {
  "userName": "sobo82",
  "version": "3.1.1",
  "score": 1,
  "title": "Horrible",
  "text": "Worst ever app slow"
 },
 {
  "userName": "Wren2013",
  "version": "2.1.1",
  "score": 1,
  "title": "Money went missing from account",
  "text": "Worst betting app I've used apart from worst set up  I've seen of putting bets on and the lag on it is very bad and then to find out I was winning and all of a sudden money went missing out of my sports account while playing on casino part and I enquired about this and there was no help from customer service made a lot of gibberish and lots of lies from them about things supposed to be like this and just nonsense wish I could show u the customer service response perhaps I will put that on twitter to put people off from signing up but if I was u stay away from this site and don't get me started on the bonuses!!!!!!!!"
 },
 {
  "userName": "Ocddj",
  "version": "1.4.4",
  "score": 1,
  "title": "Needs major work",
  "text": "Signed up for this for the bonus, which if you think about it is pretty ridiculous that you have to turn over so much to get it. If you do manage to win some it would take forever to turn over that much to actually see your bonus! Wrong in my opinion.\n\nNow on to the app, very slick looking, but that's were it ends! Navigation is poor, no easy way to find games/matches for that day, weird logging in and out sometimes it logs you back in sometimes you go back after 2 mins and you have to log back in again. Can be slow at times and error messages constantly. Also a better my bets page is needed. And faster settling of bets. Needs more markets for sports as well such as lower league clubs and darts games.\n\nHas potential to be amazing but needs a lot of work!\n\n1 star at the moment for me."
 },
 {
  "userName": "33France",
  "version": "3.0.0",
  "score": 1,
  "title": "Very bad and very slow",
  "text": "2017- Bad navigation + very slow, crashes or server errors. Anyone saying this is a good app isn't being honest. Wait 60 secs to bet on the same choice again, this means if you have a multiple and just want to change it even slightly for a new bet you have to wait 60 seconds. 2018 - Tried again a year later and even worse, agree with everyone who says it’s difficult to withdraw money. Can only recommend you avoid it, so many apps doing the same thing far better."
 },
 {
  "userName": "Jonesy1602",
  "version": "1.3.1",
  "score": 1,
  "title": "Never receive deposit bonus",
  "text": "You will never receive your deposit bonus unless you send them a copy of your driving license, you holding your driving licence, your passport, you holding your passport, a utility bill, you holding your utility bill, you standing in front of your house, you doing a handstand in front of your house, you doing a handstand in front of your house holding all of the above documents.... In your toes.... With one hand in your pocket!"
 },
 {
  "userName": "Joseker",
  "version": "1.5.2",
  "score": 5,
  "title": "Great for a flutter",
  "text": "Really easy to use and offers all the games you'd want to bet on...keeps things interesting when watching two lower league teams battle it out."
 },
 {
  "userName": "Adamu419",
  "version": "3.0.3",
  "score": 1,
  "title": "App crashes a lot",
  "text": "App keeps crashing on iPhone X! Which has led to me deleting the app numerous of times and re-downloading several times when it keeps crashing. Odds too when I change it to decimal it doesn’t permanently save rather keeps going back to fraction after I go back to my phone’s menu, and I tries opening the app again then everything goes back to fraction not decimal"
 },
 {
  "userName": "Caffedelskiy",
  "version": "1.5.2",
  "score": 4,
  "title": "Easy to use",
  "text": "Very easy to use and makes betting very easy. Just need improvement with cash out as you can't take any money out sometime like 20 min till end of game. Casino is crap, games as well. Can loose a lot of money."
 },
 {
  "userName": "Diwana.2",
  "version": "1.2.3",
  "score": 5,
  "title": "Quality App for Betting",
  "text": "The best betting app on the market by a long shot for football predictions, I urge anyone to buy this app, I have won my money back that I paid for it and a lot more."
 },
 {
  "userName": "David J. Barnes",
  "version": "1.2.2",
  "score": 5,
  "title": "Great App!!",
  "text": "Only gripes are it shows black screen if Allow Notifications are disabled; it fails to remember time zone and betting format eg when you want decimal.  But 10bet are a great bookie and I like this app a lot."
 },
 {
  "userName": "Chris number 18",
  "version": "1.4.4",
  "score": 5,
  "title": "Great app, easy to use",
  "text": "The fairest casino by a long way! The casino manager always available to help if you have and questions."
 },
 {
  "userName": "DJMinorflat3000",
  "version": "1.2.3",
  "score": 5,
  "title": "Does what it says",
  "text": "And does it perfectly, I definitely recommend this app if you are looking for something similar. Kudos to developer. Perfect app for betting."
 },
 {
  "userName": "Markyd113",
  "version": "1.4.4",
  "score": 5,
  "title": "Top site",
  "text": "10Bet is a great betting experience, web site is easy to navigate on all devices and they have some great offers"
 },
 {
  "userName": "Christhepower22",
  "version": "1.3.1",
  "score": 1,
  "title": "Withold winnings",
  "text": "Dont join, takes deposit off your card and when you go to withdraw it says waiting to verify bank card for days and even after that pends the withdrawel!! Not fair whats the point in depositing and playing and not being able to withdraw for over a week when you win🤔"
 },
 {
  "userName": "$$MANI$$",
  "version": "1.2.3",
  "score": 5,
  "title": "No more shops for me",
  "text": "Now i can bet while on move.. I don't need to go to shop anymore.. easy to use app. Liked it.."
 },
 {
  "userName": "Kroyales",
  "version": "1.4",
  "score": 5,
  "title": "Great sports betting",
  "text": "10Bet has some great bonuses, with good sports betting odds. Really impressed with the customer service, fast and really helpful. Definitely one one the best joining bonuses."
 },
 {
  "userName": "Lee ake",
  "version": "1.1",
  "score": 1,
  "title": "Don't download",
  "text": "This company are rip of merchants, I deposited 20 pounds only for it not to arrive in my 10 bet account customer service was poor and still don't have my money back, no option to withdraw! Don't open an account and be robbed  this app should be shut down ! Also I have opened legal action with them"
 }
]