[
 {
  "appId": "co.uk.camelot",
  "title": "The National Lottery: Official",
  "description": "The Official National Lottery app is where you can play: \n\nLotto\nThe one. The only. The original National Lottery game.\nIt’s the nation’s game, with thousands winning prizes in every draw.\nLotto tickets cost £2 per play, with draws every Wednesday and Saturday.\n\nEuroMillions\nThere’s big and then there’s EuroMillions big!\nThis is the game with out of this world jackpots, creating new millionaires every week.\nEuroMillions tickets cost £2.50 per play, with draws every Tuesday and Friday.\n\nSet For Life\nDig out your bucket list! You could win £10,000 every month for 30 years* with Set For Life.\nPay just £1.50 per line and play up to 4 weeks in advance.\nDraw days every Monday and Thursday.\n\nThunderball \n£1 might make your night. Win £500,000* for just £1!\nDraws every Tuesday, Wednesday, Friday and Saturday.\n\nOr play an Instant Win Game\nIn just a few taps, you could win anything from a few pounds to a life-changing million.\nWith prizes that never run out, there’s an Instant Win Game for everyone!\nGames cost from £1 to £5 to play.\n\nLotto HotPicks & EuroMillions HotPicks\nBigger prizes for fewer numbers\nPick and match winning balls from the main draws or choose a Lucky Dip® for randomly selected numbers. \n\nAnd don't forget, every time you play a National Lottery game you help support good causes all over the UK. In fact, £30M is raised on average each week**.\n\nBesides playing, managing how you do so has never been easier:\n\nEnable Touch ID and Face Recognition and sign-in to your account instantly.\nSave your lucky numbers and enter draws at the tap of a button.\nIn a rush? Scan your paper tickets in seconds to see if you’re a winner.\nLink your bank account details to add and withdraw funds at any time.\nSet limits to manage fund levels and how many games you can play per day.\n\nDownload now and play The National Lottery from the palm of your hand.\n\nTo improve the app experience, we collect anonymous information about browsing behaviour. More information is available in our Privacy Policy at https://www.national-lottery.co.uk/privacy-policy\n \nIf you have a suggestion, a bug to report or a new feature for us to consider, we want to know! Email app@camelotgroup.co.uk.\n \nPlease note whilst available for download for tablet, the app is best used on mobile devices.\n \nPlayers must be 18 or over to download this app. App Ts&Cs apply.\n \n*Prizes are fixed, subject to capping.\n**Around £30 million raised weekly is an average based on April 2018 - October 2019.\n \n \nIf you're worried about yourself, or someone you know, speak in confidence to the people at GamCare on 0808 8020 133 or visit www.gamcare.org.uk. You can find out more about our approach to responsible play on the Responsible Play page, found in the app menu.",
  "genres": [
   "Lifestyle",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2010-12-13T08:00:00Z",
  "updated": "2020-04-23T06:41:04Z",
  "releaseNotes": "- Play the games you love with The National Lottery app! \n- To improve your National Lottery experience, we’ve given our Transaction History in My Account a refresh\n- There are now exclusive games that are only available on our app. Come and give them a try!\n- We have integrated with GAMSTOP. If you've registered for the national gambling self-exclusion scheme, you will no longer be able to play Instant Win Games on the app",
  "version": "7.3.0",
  "price": 0,
  "developer": "Camelot UK Lotteries Limited",
  "score": 4.7584,
  "reviews": 210242,
  "currentVersionScore": 4.7584,
  "currentVersionReviews": 210242,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.ntlworld.dswift.uklottery",
  "title": "National Lottery Results",
  "description": "Get the latest UK Lottery results within seconds of the draws taking place. This easy-to-use app shows the National Lottery numbers, prize breakdown information and jackpots for the following lotteries:\n\nLotto\nEuroMillions (including UK and European Millionaire Maker)\nThunderball\nSet For Life\nLotto HotPicks\nEuroMillions HotPicks\n\n\nThe following features are also included:\n\n\nQR Ticket Scanner\n--------------------------------------\nFor lottery tickets purchased in shops, simply scan the QR code printed on your ticket using your phone’s camera to see if you have won a prize.\n\n\nTicket Checker\n--------------------------------------\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\n\n\nCustomisable Notifications\n--------------------------------------\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\n\n\nRandom Number Generator\n--------------------------------------\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on Lucky Dip numbers!\n\n\nResults Archive\n--------------------------------------\nAccess to the full archive of results dating back to the first draw of each lottery.\n\n\nSettings\n--------------------------------------\nCustomise which lotteries display in the app and in which order.\n\n\nSupport\n--------------------------------------\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at support@lottery.co.uk.",
  "genres": [
   "Entertainment",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2009-05-26T03:48:47Z",
  "updated": "2020-01-16T10:15:43Z",
  "releaseNotes": "This version includes bug fixes and performance improvements.",
  "version": "4.1.1",
  "price": 0,
  "developer": "The Lottery Company",
  "score": 4.67152,
  "reviews": 7078,
  "currentVersionScore": 4.67152,
  "currentVersionReviews": 7078,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.yaohua.vegasnights",
  "title": "Vegas Nights Slots",
  "description": "Real slots at Vegas Nights - The Best Free online social Casino Slots Game ! \nPLAY NOW to receive a FREE Welcome Bonus Package!\n\nWorld class gambling game design brings real slot games from the casinos to mobile App! New Features and Surprising Bonuses on All New Slots!\n\nVegas Nights Slots is the best slots game there is, offers the most stunning graphics and a realistic casino experience. Enjoy every benefit you can possibly have on a real slot machine! Progressive Jackpot, Stacked Symbols and Locked WILDs! PLAY NOW and get the best slot experience today!\n\nWhat is special at Vegas Nights Slots?\n• Tournament Day, Quest Day, and Challenge Day bring you Extra bonus every day of the week!\n• All levels All slots 100% FREE to play! New Updates online every week!\n• Multiply your winnings to maximize the benefits with Double Ups and Bonus Games!\n• 2,000,000 FREE Coins for starter bonus, plus Hourly bonus, Daily Bonus, Store Bonus, Holiday Bonus, Friends Bonus, Fan Page Bonus and many more FREE coins available everyday!\n• A variety of WILD, Free Spins, Bonus Games, Jackpots and more interesting ways to play!\nPlay Vegas Nights Slots, the BEST Online SLOTS Game ever!\n\nPlay free slots, slot machine games & online casino. Make a fortune with huge jackpots, free daily games on Vegas Night Slots! Ding Ding Ding! Jackpots!\n\nVegas Nights Slots is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling. Use of this application is governed by Mobee's Terms of Service.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-06-03T10:52:15Z",
  "updated": "2020-01-10T03:28:44Z",
  "releaseNotes": "Real Slots at Vegas Nights!\n\n-Fixed Bugs.\n-Overall upgraded.\n-Improved stability and compatibility.\n\nPLAY NOW!\nGold luck & Happy spinning!\n\nFollow us on Facebook at: \nhttps://www.facebook.com/vegasnights.slots\nIf you run into a bug or have a question, you can contact us at support@mobeegaming.com",
  "version": "2.0.8",
  "price": 0,
  "developer": "Mobee Co., Ltd.",
  "score": 4.88889,
  "reviews": 873,
  "currentVersionScore": 4.88889,
  "currentVersionReviews": 873,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.thehealthlottery.HealthLottery",
  "title": "The Health Lottery",
  "description": "Download the official Health Lottery Mobile app to play a variety of Health Lottery games on the go – AND support vital health-related charities across Great Britain!\n\n· £100,000 FREE prize draw every Wednesday & Saturday.\n· £77,777 to be won instantly on scratch cards. · £25,000 jackpot draws every 3 minutes. · \n - Over £150 Million won in prizes so far.\n · 20% of every play goes to health-related causes.\n · Over £112M given to charity, changing over 500,000 lives.\n · Register in seconds.\n · Play scratch cards from as little as 5p\n\nOur new app remembers your details, so you only need to log-in once and your wins will be automatically shown. You can also check the winning numbers in all of our five weekly charity lottery jackpot draws for tickets bought in retail.\n\nEasily set up a subscription to play lottery by Direct Debit so you never miss a draw and take advantage of all our latest promotions – whether that be free tickets, raffles, or cashback bonuses.\n\nTickets for our draws cost only £1 and our draws take place every Tuesday, Wednesday, Thursday, Friday and Saturday). Each ticket you buy for any Wednesday or Saturday draw gives players an automatic entry into a free prize draw for £100,000. \n\nSince we launched in 2011, we’ve given away over £150 million in prizes to our players.\n\nQuickWin\nOur revolutionary QuickWin game runs a lottery draw every 3 minutes! You’re playing for a £25,000 jackpot in each draw.\n\nScratch Cards\nWe run a wondrous array of online Scratch Cards, each with their own odds and INSTANT jackpots up to £77,777! You can play for as little as 5p.\n\nThe Health Lottery is not a national lottery. We operate on behalf of 12 Community Interest Companies (CICs), managing 12 society lotteries in rotation. Each is licensed by the Gambling Commission and represents multiple local authority areas across Great Britain – raising money for health-related good causes within their respective areas. Each month a different regional society takes a turn at participating in the draws so that every area in England, Scotland and Wales gets an appropriate share of the monies raised. Since inception in 2011, over £113 million has been raised for good causes through The Health Lottery – which has supported over 3,000 projects.\n\nFor details of when each society lottery is running, see the location of each society, or to find out more about The Health Lottery, please click on the link below. https://www.healthlottery.co.uk/about-us/\n\nTo improve the App, we collect anonymous information about browsing behaviour. For more information on our Privacy Policy, please visit our website at https://www.healthlottery.co.uk/privacy-policy/\n\nGames Rules and Procedures apply. Players must be 16 or over and be physically located within Great Britain (England, Scotland, and Wales).\n\nWhat’s new in Version 1.6.5\n- General performance improvements and bug fixes\n - Payment gateway enhancements \n\nYou can follow us on:\nFacebook - https://www.facebook.com/healthlottery\nYouTube - https://www.youtube.com/user/HealthLottery\nTwitter - https://twitter.com/HealthLottery\nInstagram - https://www.instagram/healthlottery",
  "genres": [
   "Entertainment",
   "Games"
  ],
  "contentRating": "17+",
  "released": "2013-08-19T18:43:16Z",
  "updated": "2020-04-09T16:16:05Z",
  "releaseNotes": "- General performance improvements and bug fixes\n- Payment gateway enhancements",
  "version": "1.6.5",
  "price": 0,
  "developer": "The Health Lottery",
  "score": 2.97358,
  "reviews": 265,
  "currentVersionScore": 2.97358,
  "currentVersionReviews": 265,
  "searchTerms": "lottery"
 },
 {
  "appId": "uk.co.eulotto.Eulotto",
  "title": "Lottoland UK: Lottery Betting",
  "description": "Bet and win real money with Lottoland, the lotto betting app featuring top lotteries such as PowerBall, MegaMillions and the Irish Lotto! Bet on the outcome of these draws, get the latest results and, if yours are winning bets, win real money with the chance of becoming a jackpot millionaire.\n\nLottoland – Top 3 Reasons to Download\n1. Win big jackpots every day: Become an instant millionaire with top bets on the outcome of lotto draws!\n2. Bet on international lotteries and the world’s biggest jackpots: Keno 24/7, Irish Lotto, US PowerBall, US MegaMillions and many more.\n3. Betting made easy: Simply choose the draw, select your numbers and place your bet.\n\nDownload the Lottoland UK lotto app today – you could win big and become a millionaire anytime, anywhere!\n\n\nPromo Terms and Conditions:\n\n1. The Player’s use of the Website and your participation in any gaming or wagering (including any promotions) is governed by these terms and conditions. Players should ensure that they have read and understood these Promotional Offers Terms before taking part in any promotion.\n2. Player’s must register at Lottoland.co.uk, confirming that they are 18+, prior to placing any bets or playing any games.\n3. This promotion is available to all registered players using the Lottoland App for the first time. This promotion is redeemable once per user and can only be attained via the Lottoland App.\n4. For free bets or free game plays, no deposit is required to redeem the free bet or free game play.\n5. For discount promotions, the player must place at least one bet or one play on the specified products.\n6. Bonus amount cannot be withdrawn prior to any specified wagering requirement being met.\n7. Bonuses only applies to the first bet or first game play.\n8. Bonuses will be automatically applied in the checkout section and it is the player's responsibility to check their cart before confirming the transaction.\n9. Any person found to be operating multiple accounts in promotions will be in breach of these Promotional Offers Terms. Lottoland will determine at its sole discretion by whatever means it deems necessary to establish if different entries or accounts are connected to the same person.\n10. Participants, whether individually or acting in a group, will be found to be in breach of these Promotional Offers Terms if Lottoland, in its sole discretion, has reason to believe that a promotion has been abused, manipulated, or that irregular, fraudulent, collusive or illegal activity has occurred.\n11. The decision of Lottoland in all promotional matters is final and no correspondence will be entered into. Lottoland reserves the right to withhold promotional benefits until resolution of any dispute.\n12. The decision of Lottoland in respect of any matter concerning or related to competitions and promotions is final.\n13. A breach by a participant of these Promotional Offer Terms and/or Lottoland Limited’s General Terms or where there is evidence of a series of bets placed by a participant, whether individually or acting as a group, which due to promotional offers result in guaranteed customer profits irrespective of the outcome, may result in Lottoland withdrawing the availability of any promotion or all promotions to that participant or group of participants and/or voiding any wager funded by the promotion and remove any winnings from such wager.\n14. Lottoland reserves the right to amend or withdraw any promotion at any point at its sole discretion.\n15. Promoter: Lottoland Limited, Suite A, Ocean Village Promenade, Ocean Village, Gibraltar, GX11 1AA (“Lottoland”).",
  "genres": [
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-03-14T10:11:37Z",
  "updated": "2020-04-20T08:02:30Z",
  "releaseNotes": "We regularly update our app to give you the best Lottoland experience possible. If you have any comments about our latest update or ideas about what you’d like to see next, please get in touch via email at support@lottoland.co.uk.",
  "version": "1.7.3 UK",
  "price": 0,
  "developer": "EU Lotto Limited",
  "score": 4.58815,
  "reviews": 4912,
  "currentVersionScore": 4.58815,
  "currentVersionReviews": 4912,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.FortyOneGames.Scratchers",
  "title": "Lucky Lottery Scratchers",
  "description": "Lucky Lottery Scratchers is the most realistic and authentic scratch-off lottery ticket game in the App Store!\n\nIf you like scratch-off tickets, you will love Lucky Lottery Scratchers!\n\n* Many types of scratch-off games and scratcher cards: Double Dollar, Fortune Galore, Money Rain, Big Time Bucks, Lucky 777, Gold Strike, Diamond Millions, and more!\n* Match numbers\n* Reveal Multipliers\n* Play Bingo\n* Bonus Games\n* Instant Win\n* Massive Top Prizes\n* VIP program rewards the best players\n* Play offline - no Internet connection required\n* FREE daily and hourly bonus credits that reward frequent play\n* Hundreds of game levels to play\n* Designed to work with iPhones and iPads\n\n\nDownload Lucky Lottery Scratchers today and let us know what you think by leaving a review in the App Store!\n\n\nPlease Note:\nLucky Lottery Scratchers is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes.  Practice or success at social casino gaming does not imply future success at real money gambling.  Lucky Lottery Scratchers is for entertainment purposes only and offers only a simulated gambling experience.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-09-04T07:00:00Z",
  "updated": "2020-01-06T20:30:14Z",
  "releaseNotes": "Improved odds of winning on new scratcher cards!",
  "version": "1.0.3",
  "price": 0,
  "developer": "41 Games",
  "score": 4.60344,
  "reviews": 174,
  "currentVersionScore": 4.60344,
  "currentVersionReviews": 174,
  "searchTerms": "lottery"
 },
 {
  "appId": "uk.co.lottery.euromillions",
  "title": "Euro-Millions",
  "description": "Get the latest EuroMillions results within seconds of the draw taking place.  This easy to use app displays the EuroMillions numbers including Millionaire Raffle and full prize breakdowns including number of winners and prizes paid.\n\nThe EuroMillions application gives you access to all past results so that you can check the numbers for any draw since the game began in February 2004. \n\nYou can also automatically check your own EuroMillions selections against the results of all draws that have taken place in the last 180 days using a built-in Ticket Checker tool. \n\nThe Random Ticket Generator gives you a fantastic alternative to the EuroMillions Lucky Dip feature, and will provide you with as many randomly-generated entries as you could ever need. \n\nThis free EuroMillions app gives you: \n\n- The latest EuroMillions results and prize values \n- Access to a complete EuroMillions results database \n- A built-in EuroMillions Ticket Checker tool \n- Random EuroMillions entries with a Random Ticket Generator",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2011-02-10T02:49:38Z",
  "updated": "2017-05-19T14:52:12Z",
  "releaseNotes": "Minor bug fixes and improvements to performance.",
  "version": "1.4.1",
  "price": 0,
  "developer": "The Lottery Company",
  "score": 3.71429,
  "reviews": 7,
  "currentVersionScore": 3.71429,
  "currentVersionReviews": 7,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.apphappygames.lotteryscratchers",
  "title": "Lottery Scratchers",
  "description": "Do you ever wish you could win the lottery? Well today could be your lucky day! With the new game Lottery Scratchers, you get to experience the same fun and excitement as playing real scratchers, without actually having to lose money. Test your luck by playing 26 different scratch off tickets ranging from Bingo to Red Hot 7’s… and if luck is on your side, you may win BIG!!\n\nFeatures:\n\n• 26 Different Lottery Scratcher Tickets\n• Real feel scratching effect\n• Huge Payouts\n• Win multiple times per ticket\n• Win up to 20x the prize.\n\nReady to test your luck and win big?\n \nDisclaimer: This game is intended for an adult audience and does Not offer real money gambling or an opportunity to win real money or prizes.  Our game is meant for amusement and entertainment purpose only.  Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-05-27T08:18:04Z",
  "updated": "2020-03-16T22:32:37Z",
  "releaseNotes": "New Pot O' Gold Scratcher",
  "version": "1.97",
  "price": 0,
  "developer": "App Happy Games LLC",
  "score": 4.30356,
  "reviews": 616,
  "currentVersionScore": 4.30356,
  "currentVersionReviews": 616,
  "searchTerms": "lottery"
 },
 {
  "appId": "uk.co.lottery.irishlottery",
  "title": "Irish Lotto",
  "description": "Get the latest Irish Lotto results within seconds of the draw taking place. This easy to use app shows the National Lottery numbers and full prize breakdowns including number of winners and prizes paid for the following lotteries:\n\n- Lotto\n- Lotto Plus 1\n- Lotto Plus 2\n- Lotto Plus Raffle\n- EuroMillions (including Irish Raffle and EuroMillionaires Raffle)\n- EuroMillions Plus\n- Daily Million\n- Daily Million Plus\n- Telly Bingo\n- Lotto 5-4-3-2-1\n- Lotto 5-4-3-2-1 Plus 1\n- Lotto 5-4-3-2-1 Plus 2\n\n\nThe following features are also included:\n\n\nTicket Checker\n--------------------------------------\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\n\n\nCustomisable Notifications\n--------------------------------------\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\n\n\nRandom Number Generator\n--------------------------------------\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on Quick Pick numbers!\n\n\nResults Archive\n--------------------------------------\nAccess to the full archive of results dating back to the first draw of each lottery.\n\n\nSettings\n--------------------------------------\nCustomise which lotteries display in the app and in which order.\n\n\nSupport\n--------------------------------------\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at support@lottery.co.uk.",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2011-02-24T23:53:57Z",
  "updated": "2020-04-02T07:18:27Z",
  "releaseNotes": "The app has been completely rewritten from the ground up, making it much quicker than the previous version, accompanied with a fresh redesign to make the app easier to use.\n\nWhat's new:\n\n- Updated to include all of the Irish lotteries.\n\n- The latest results now appear almost instantly after a draw, with historical results available at the tap of a button.\n\n- The bottom tab bar has been replaced with a menu, freeing up space on the screen and providing quick access to all areas of the app.\n\n- The app no longer restarts every time it is reopened, making it quicker to pick up where you left off.\n\n- Statistics for each lottery and information on how to claim prizes can also be found from the menu.",
  "version": "2.0",
  "price": 0,
  "developer": "The Lottery Company",
  "score": 4.72283,
  "reviews": 451,
  "currentVersionScore": 4.72283,
  "currentVersionReviews": 451,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.red.lottery",
  "title": "Lottery Results - Ticket alert",
  "description": "NOW INCLUDING MEGAMILLIONS & POWERBALL DRAWS!\n \nOver 1 million downloads - get it now and check your lottery results on the move!\n\nThe Lottery Results app provides the quickest and most convenient way to check the latest UK Lottery results on your mobile device.\n \nHighlights:\n \n- Updated Lottery Results available right after the draw\n- Prize Breakdown for every draw!\n- Record your numbers\n- Automatically check if your numbers win\n- Lucky Dip? Use Number generator to create your very own lucky dip\n \nCheck the latest UK Lottery Results with UK's no 1 Lottery Results app - available on both iPhone and iPad.\n \nIn addition to providing fast and accurate lottery results, the app also offers other unique and handy features:\n \nMy Numbers\n \nA convenient way to record the numbers you have played and the app will automatically check if you win.\n \nFeeling Lucky?\n \nCan't decide what numbers to play? Let  the app pick the numbers for you using Number Generator and save them directly to \"My Numbers\" \n \nLottery Stats \n \nFind out which numbers are most likely to win with our unique Lottery Number Frequency. \n \nNew Features are coming soon! \n \n**  The Lottery Results app requires a Wi-Fi or Data network for some of its content. Please ensure you have an Internet connection before launching this application**\n \nWe want to make Lottery Results app better for our users so please feel free to send us your comments and suggestions using the Feedback form within the app or our support forum.\n \nVisit Red Knight Apps website or follow us on Twitter @RedKnightApps or Facebook (www.facebook.com/redknightapps )\n \nDisclaimer:-\n- Always check your tickets with the official lottery service provider to confirm any possible winnings.\n \n- All descriptions, names, characters, locations, imagery and videos in this application are copyright of their respective owners.\n\nBy downloading the Lottery Results App you are indicating acceptance of Red Knight Interactive’s Terms and Conditions and Privacy Policy www.redknightapps.com/privacy.php. If you would like Red Knight Interactive to remove any data we have relating to you and your use of the Lottery Results App service, please email support@redknightapps.com",
  "genres": [
   "Reference",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2011-12-21T17:59:00Z",
  "updated": "2019-01-14T15:16:21Z",
  "releaseNotes": "Small UI updates",
  "version": "2.1",
  "price": 0,
  "developer": "Red Knight Interactive",
  "score": 4.42122,
  "reviews": 641,
  "currentVersionScore": 4.42122,
  "currentVersionReviews": 641,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.betfred.lotto",
  "title": "Betfred – Bet on Lotto",
  "description": "**New Customer Offer: Stake £5 & Get £10 in FREE BETS + 5 Free Scratchcards!**\n\nEnjoy Lotto betting on our state of the art Betslip, with historical draw results across a wide range of draws anytime, anywhere, in an instant, win with the Betfred Lotto App. With Betfred Lotto, you can bet your numbers up to 4 weeks in advance of the draw! We have also added some instant win games and scratchcards for your enjoyment!\n\nWHY BETFRED LOTTO?\nOur app is free to download and allows you to bet on a wide range of popular Lotto draws; including your favourites such as Irish Lotto, 49’s, Irish Daily Million and many more!\n\nMARKET LEADING ODDS\nMarket leading odds of 700/1 for 3 numbers on the Irish Lotto and pay-outs of up to £150,000 for 5 correct numbers on the 49’s draw. You’ll never be short of markets to choose from with betting available 24/7 and numerous draws taking place every day!\n\nBRAND NEW FEATURES\nOnce you have chosen the numbers you want to bet on, there are some fantastic new features to make your experience better. Here you can copy or add a line of numbers to your favourites section and even include or remove the bonus ball from your line!\n\nSAVE YOUR FAVOURITE NUMBERS\nOnce you’ve placed a bet on a particular Lotto draw, you can save that line of numbers in our favourites section. Your numbers can then be used again on future Lotto draws!\n\nINSTANT HISTORICAL RESULTS\nOur app boasts a comprehensive results section which includes results of all the latest draws and a catalogue of results dating back over 12 months!\n\nDownload and enjoy Betfred Lotto now!\n\nLotto Stake £5 Get £10 in Free Bets + 5 Free Scratchcards\n\nNew Customers Only. Deposit and stake £5 on Lotto within 14 days of registration. First bet must be placed on Lotto. Free Bets and Free Scratchcards credited within 24 hours. Free Bets not included in any returns and expire after 7 days. Free Scratchcards can only be used on Ted and expires 7 days after crediting. Payment restrictions apply. SMS validation may be required. Full T&Cs apply.",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2013-09-11T05:42:26Z",
  "updated": "2019-11-04T11:14:17Z",
  "releaseNotes": "Download today and take advantage of our new customer offer - Get £10 in FREE BETS + 5 Free Scratchcards to play with when you stake £5. \n\nThis update contains some technical tweaks, to give you a faster and more enjoyable Betfred Lotto experience!",
  "version": "2.2",
  "price": 0,
  "developer": "Betfred",
  "score": 4.6112,
  "reviews": 1304,
  "currentVersionScore": 4.6112,
  "currentVersionReviews": 1304,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.annexio.wlcapp",
  "title": "LottoGo.com: Bet & Win",
  "description": "Place your bets on the biggest lotteries from around the globe with LottoGo.com.\n\nOur lotto betting app puts the best jackpots – including the mighty Powerball and Mega Millions - at your fingertips. So, whether you’re at home or on the move, we give you the chance to pick your numbers and win in an instant!\n\nIn addition to lottery betting, there’s a range of fun Scratchcards and Instant Win games to choose from.\n\nAs a member of LottoGo.com, you’ll have access to a variety of great discounts and exclusive deals – all sent direct to your inbox!\n\nLottoGo.com is a brand of Annexio Limited, a leading provider of secondary lottery and lottery betting services. \nWe’re proud to be licensed and regulated by multiple jurisdictions worldwide, including the UK Gambling Commission, the Isle of Man Gambling Supervision Commission, and the Irish National Excise Licence. As such, a commitment to providing our players with an enjoyable and secure gaming experience is at the heart of everything we do.\n\nAvailable only to players 18 years and over. LottoGo.com believes in responsible gambling. For more information visit www.gamcare.org.uk, or by reading our Responsible Gambling Policy here: https://www.lottogo.com/en/responsible-gambling-policy",
  "genres": [
   "Lifestyle",
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-06-20T02:06:52Z",
  "updated": "2020-04-01T20:35:42Z",
  "releaseNotes": "Changes to Apple Pay feature to fit in with new regulations regarding credit card use.\nFix of errors when user navigates to various screens.",
  "version": "1.26.3",
  "price": 0,
  "developer": "Annexio Limited",
  "score": 3.75135,
  "reviews": 929,
  "currentVersionScore": 3.75135,
  "currentVersionReviews": 929,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.seanstewart.lottery",
  "title": "Lottery Number Generator",
  "description": "Lottery Number Generator generates random lottery numbers.",
  "genres": [
   "Utilities",
   "Entertainment"
  ],
  "contentRating": "4+",
  "released": "2010-08-19T00:48:51Z",
  "updated": "2017-12-08T04:59:19Z",
  "releaseNotes": "Layout changes",
  "version": "2.0.4",
  "price": 0,
  "developer": "Sean Stewart",
  "score": 2.75,
  "reviews": 4,
  "currentVersionScore": 2.75,
  "currentVersionReviews": 4,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.gamesys.heartbingo",
  "title": "Heart Bingo: Real Money Games",
  "description": "Join the fun at the award-winning Heart Bingo and play Bingo, Slots and Casino games. We even have Box Bonanza prizes and a Daily Free Game for all our players, you just need to deposit £10. \n\nWith Bingo and Slot game jackpots worth thousands to be won, you can play from as little as 10p. As well as super promotions to play onsite and in our welcoming Chat rooms, Heart Bingo has got everything you need!\n\nSo join Heart Bingo today, the 2018 WhichBingo winners of ‘Best Mobile Bingo Experience’, ‘Best Online Bingo Chat Team’ and for the second year in a row, ‘Best Online Bingo Site’. \n\nDownload the App today!\n\nDaily Free Game\nTry Daily Paper, the Daily Free Game where you could win Cash or Free Spins on the hugely popular Paper Wins Slot game. With a £750 top prize available, what are you waiting for? \nYou just need your first deposit to be £10 or more.\n\nBingo\nLove Bingo? There are cash prizes up for grabs 24 hours a day, 7 days a week with sensational jackpots and Full House prizes up to £500. Take a peek in our Candy Club room and enjoy exciting Bingo offers, like 10p games, BOGOF Bingo, Evens Stevens and Free Bingo!\n\nEach game of 90-ball Bingo features a Progressive Jackpot which can be won by completing a Full House in 40 calls or less. There’s also a Community Super Jackpot to be won when calling ‘house’ on selected games within 38 calls. Each Super Jackpot offers a cash prize ranging between £5,000 and £25,000!\n\nSlots\nIf Slot games are more your thing, then Heart Bingo’s got you covered with stunning titles such as Paper Wins Jackpot, Secrets of the Phoenix and Double Bubble and more.\n\nCasino\nOr if you fancy seeing the bright lights of Vegas, take your seat at the Casino table and enjoy Roulette like never before. \n\nBest Chat and more\nYou’ll get a warm welcome from our friendly Hosts in Chat, who will entertain you with fun quizzes, games and extra prizes. Plus take part in exciting promotions to win cash and prizes.\n\n\nPlease play responsibly. BeGambleAware.org. 18+\n\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.",
  "genres": [
   "Games",
   "Simulation",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-07-21T14:29:44Z",
  "updated": "2020-03-11T11:40:56Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.59929,
  "reviews": 4769,
  "currentVersionScore": 4.59929,
  "currentVersionReviews": 4769,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.bridgetech.lottery.balls",
  "title": "Lottery Balls -  Lotto Results",
  "description": "Increase your chances of winning the lottery with Lottery Balls. \n\nEver noticed how there's rollover after rollover without a winner and then multiple people hit the jackpot at the same time. There's a reason for that; people are all picking their numbers the same way. \n\nYou can beat this trend. Lottery Balls uses highly advanced randomising algorithms to find the numbers that other people aren't choosing. \n\nAs well as helping you win the top prize and not having to share it, Lottery Balls increases your chances of winning the smaller prizes. When using other random number generators, including the \"lucky dip\" available at retailers, each row of numbers will be produced in isolation. Using their method, if you're buying more than one ticket, you'll find you're repeating the same number on several lines. That's fine if all you're interested in is the jackpot, but for smaller prizes, you've got a better chance of winning if you cover a wider range of numbers. That's why Lottery Balls generates multiple lines holistically, without repeating any numbers across the different tickets. \n\nEver forgotten to buy your ticket? Lottery Balls can remind you on the day of the draw to go out and get it before it's too late. \n\nCheck results in the app and receive a notification to let you know when the draw has happened. Look up the results from previous draws. \n\nLike playing the same numbers every week? Lottery Balls can save your favorite numbers for quick and easy access every time. \n\nLottery Balls works with any lottery. We've even added built-in generation rules for many popular worldwide lotteries. \n\nThese include:\nEurope\nEuromillions\n\nAustralia\nPowerball\nMonday & Wednesday Lotto\nOz Lotto\nSet for Life\nTattsLotto (Saturday Lotto)\n\nCanada\nDaily Grand\nDaily Keno\nLottario\nLotto 649\nLotto Max\nPick-2\nPick-3\nPick-4\n\nChina\n七乐彩 (Lucky 7)\n七星彩 (Lucky 7)\n六合彩 (Mark Six Lottery)\n双色球 (Double Colour Ball)\n排列三 (Order of 3)\n排列五 (Order of 5)\n福彩3 D (3D Lottery)\n超级大乐透 (Super Lotto)\n\nSpain\nBonoloto\nEl Gordo\nLa Primitiva\n\nUnited Kingdom\nHealth Lottery\nLotto\nSet For Life\nThunderball\n\nIreland\nDaily Million\nLotto\n\nItaly\nSuperEnalotto\n\nJapan\nナンバーズ3 (Numbers3)\nナンバーズ4 (Numbers4)\nハロウィンジャンボ宝くじ (Jumbo Lottery)\nミニロト (Mini Loto)\nロト6 (Loto 6)\nロト7 (Loto 7)\n\nMexico\nChispazo\nMelate\nMelate Retro\n\nPhilippines\nGrand Lotto 6/55\nLotto 6/42\nMega Lotto 6/45\nSuper Lotto 6/49\nUltra Lotto 6/58\n\nSingapore\nTOTO\n\nTurkey\nSayisal Loto\nSüper Loto\n\nUSA\n2by2\nAll or Nothing\nCash 5\nCash4Life\nDaily Derby\nFantasy 5\nFlorida Lotto\nGimme 5\nJackpot Triple Play\nJersey Cash 5\nLotto America\nLucky Day Lotto\nLucky For Life\nMass Cash\nMega Millions\nMegabucks\nPick 2\nPick 3\nPick 4\nPick 5\nPowerball\nSuperLotto Plus\nTexas Two Step\n\nSouth Africa\nDAILY LOTTO\nLOTTO\nPowerBall\nUK 49\n\nWe’re adding more and more of these all the time and we’d love to hear your suggestions for what you’d like included. There’s a form here if you’d like to suggest one. http://bit.ly/324vSYW\n\nIf you win using this app then please take the time to rate it 5 stars.\n\nFollow me on Twitter for the latest promotions, news and updates. @MarkBridgesApps",
  "genres": [
   "Entertainment",
   "Games",
   "Casual",
   "Casino"
  ],
  "contentRating": "4+",
  "released": "2012-02-25T04:01:22Z",
  "updated": "2020-01-20T18:40:38Z",
  "releaseNotes": "Minor bug fixes and improvements",
  "version": "2.29",
  "price": 0,
  "developer": "BRIDGETECH SOLUTIONS LIMITED",
  "score": 4.60562,
  "reviews": 71,
  "currentVersionScore": 4.60562,
  "currentVersionReviews": 71,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.bigfishgames.jackpotcityslotsf2pios",
  "title": "Jackpot Magic Slots™ & Casino",
  "description": "You must be 18+ to access this game.  This game does not offer gambling or an opportunity to win real money or prizes.  Practice or success at social gaming does not imply future success at gambling. \n\n--------------------- \n\nLooking for Vegas-style excitement?  Download Jackpot Magic Slots™ for free and spin up huge winnings, starting with a $1,000,000 free coin Welcome Bonus.  Enjoy AMAZING scatter slots games, Crazy Money® Deluxe™, community jackpots & more!  Play live with your friends or join a club and compete in online social tournaments.   So sit down, relax, have a martini and some coins – on us. We've got tons of slot games and friendly people to play with for free!\n\nFun & Exciting Vegas-Style Slots\n• Exciting slot machines with free spins \n• Exclusive bonus games\n• Play LIVE with your friends! \n\nClimb the ranks with CLUBS:\n• Join other players with our latest feature — Clubs. \n• Team up to win BIG PRIZES while playing your favorite slots games!\n• Create your own club or join an existing one\n• New ways to earn free coins\n\nPlay the best free slots: \n• Daily bonuses just for logging in! \n• Customize and strut your stuff with pets and gifts! \n• Compete for coin prizes in tournament\n\nWin big with 4 levels of jackpots! Awesome! Hit Flaming 7's for multiple jackpot levels in Jackpot City. Spin the Lightning Wheel for big prizes. Follow the yellow brick road for an adventure in Road to Oz. Click your heels together 3 times and you’re in the magic world of Jackpot Magic Slots™!\nGet in the zone with Jackpot Magic Slots™!\n\nQuestions? Suggestions? Contact us at http://www.bigfishgames.com/help/jackpotmagicslots\n--------------------- \nThis game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-07-15T20:31:20Z",
  "updated": "2020-04-27T16:14:18Z",
  "releaseNotes": "• Introducing a new event type, Golden Egg Magic!\n• Play our newest slot machines: Aloha Fortunes, Big Fortune Double Up\n• Minor bug fixes",
  "version": "12.3.4",
  "price": 0,
  "developer": "Big Fish Games, Inc",
  "score": 4.59011,
  "reviews": 9366,
  "currentVersionScore": 4.59011,
  "currentVersionReviews": 9366,
  "searchTerms": "lottery"
 },
 {
  "appId": "net.wingchan.iuklotto",
  "title": "UK Lotto Kiosk",
  "description": "UK LOTTO Kiosk - a complete lottery app:\n\nFeatures include:\n- Latest UK Lotto draw detail with prize breakdown\n- Instant alert on draw\n- Last 80 draws history\n- Charts and statistics on frequency and overdue numbers\n- Random numbers generator",
  "genres": [
   "Entertainment"
  ],
  "contentRating": "4+",
  "released": "2019-08-09T07:00:00Z",
  "updated": "2019-09-10T09:26:19Z",
  "releaseNotes": "- Supports Chinese language\n- Resizable charts\n- Minor bugs fixed",
  "version": "1.0.2",
  "price": 0,
  "developer": "wingchan.net",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.aspireltd.s2c",
  "title": "Scratch2Cash - Scratch Cards",
  "description": "Play our exciting range of instant games including VIP Black, Bejeweled, The 7th Heaven, Lucky Charms, Bingo Bonanza, Horoscope and much more!  \n\nPlay the best scratch cards available online and win real money from your mobile phone or tablet, over 3G or Wi-Fi. \n\nEnjoy exclusive special offers and promotions at Scratch2Cash and boost your winnings to the max! \n\nTOP FEATURES INCLUDE: \n• The top online scratch cards and jackpot slots from industry leading providers Netent, NeoGames, Microgaming and Play’nGo, all optimised for mobile and tablet play. \n• Quick to load and easy to register, deposit and find your favourite casino slots and scratchcard games. \n• Dedicated support team ready to assist you with any issue – 7 days a week! \n• Play for real money, or get some practice in with the no pressure demo feature. \n• Fast, secure cash-outs and a wide selection of payment options. \n•Great winning chances – 1 in every 3 scratch cards is a winner* - now that’s what you call a lottery with exciting odds! \n\nSince 2005 Scratch2Cash has proven to be the number one choice for scratch card players on the web. Our years of experience combined with our passion to bring you the fairest, secure and most entertaining tombola style instant games make Scratch2Cash the ideal place to play. \nAt Scratch2Cash you’re sure to find hours of pure fun with the highest level of entertaining games on the web in a safe and secure environment.\n\n*On average\n  \n\nCONNECT WITH US:\nWebsite: https://www.scratch2cash.com/\n\nGeneral T&Cs apply:  \nhttps://www.scratch2cash.com/bonus-policy/\n\nNote that:\nBets on different games contribute differently to the wagering requirements and that other terms apply: \nNot sure what link to put here\n\nT&Cs Welcome bonus:\nhttps://www.scratch2cash.com/promotions/welcome-package/",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-05-31T16:47:40Z",
  "updated": "2020-04-14T13:46:52Z",
  "releaseNotes": "We have done major updates to our app including: \nUp to 2M Jackpot .\nBest Casino tournaments . \nVariety of scratch games !",
  "version": "1.33",
  "price": 0,
  "developer": "ASPIRE GLOBAL LIMITED",
  "score": 4.45859,
  "reviews": 157,
  "currentVersionScore": 4.45859,
  "currentVersionReviews": 157,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.sharkparty.monopolybingo",
  "title": "MONOPOLY Bingo!",
  "description": "Play MONOPOLY Bingo games FREE with the award-winning mobile bingo app! Combine classic MONOPOLY rules with bingo boards and VOILA! You get MONOPOLY Bingo! In our free online bingo game, you can play with MULTIPLE bingo cards – more than any other bingo game out there!\n \n***With over 5 million installs, we bet you’ll LOVE MONOPOLY Bingo too!***\n \nEnter live bingo halls as you advance through the MONOPOLY game board. Land on your favourite classic MONOPOLY properties, wait for the bingo balls with your numbers and BINGO! You win! Soon your MONOPOLY money will grow and you can start building houses and hotels – just like the classic MONOPOLY game you know and love!\n \n***Multiple Bingo Cards at a time***\nPlay MONOPOLY Bingo with more bingo cards than any other bingo game! Try your luck by playing with up to 8 bingo cards simultaneously, using smooth controls to easily switch between them. Unlock more bingo cards by completing MONOPOLY game-themed collections!\n \n***Bingo Tournaments & Weekly Puzzle Events***\nCompete against friends in our free MONOPOLY Bingo game’s tournaments! Play free games and see which of your friends can complete the most Bingo cards! With our multi-level boosts, you can see future bingo numbers, get free daubs, and bonus spaces on your bingo cards to help you win. If you ever run out, you can always use the MONOPOLY money you collected to buy more.\n \n***Features***\n· Collect Community Chests to gain coins, extra boosts, bingo tickets and more as you move along the MONOPOLY board.\n· Build houses and hotels by gaining experience in different rooms.\n· Travel across classic MONOPOLY properties to reach places around the world.\n· Increase your MONOPOLY fortune!\n \nMONOPOLY Bingo is such a fun game to play! Classic MONOPOLY pieces combined with bingo cards makes for an irresistible, fun time! Play live bingo with other players from around the world. With more bingo cards than any other game, you’ve got AMAZING chances to win! So what are you waiting for?! Get out your bingo daubers and starting calling out “BINGO!”\n\nPlease note: MONOPOLY Bingo is an online only game. Your device must have an active internet connection to play.\n\nPlease note that MONOPOLY Bingo is free to play, but you can purchase in-app items with real money. To delete this feature, on your device go to Settings Menu -> General -> Restrictions option. You can then simply turn off In-App Purchases under \"Allowed Content\". In addition, MONOPOLY Bingo may link to social media services, such as Facebook, and Storm8 Studios will have access to your information through such services. \n\nThe game is intended for an adult audience. The game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"\n\nThe MONOPOLY name and logo, the distinctive design of the gameboard, the four corner squares, the MR. MONOPOLY name and character, as well as each of the distinctive elements of the board and playing pieces are trademarks of Hasbro for its property trading game and game equipment. © 1935, 2014 Hasbro. All Rights Reserved.\n\nFollow Storm8\nwww.storm8-studios.com\nfacebook.com/storm8\ntwitter.com/storm8",
  "genres": [
   "Games",
   "Casino",
   "Board",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-12-11T00:23:23Z",
  "updated": "2020-01-07T21:42:34Z",
  "releaseNotes": "- Opportunities to earn new types of rewards through watching video ads in different parts of the game!\n- Updated Achievement rewards to more clearly communicate the type of reward.\n- Various bug fixes.",
  "version": "3.3.3",
  "price": 0,
  "developer": "Storm8 Studios",
  "score": 4.46544,
  "reviews": 767,
  "currentVersionScore": 4.46544,
  "currentVersionReviews": 767,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.prismstudios.megamillionsquickpicker",
  "title": "Lottery.com",
  "description": "Lottery.com is the first-ever, safe and secure, mobile lottery platform that lets you play official U.S. lottery games right from your phone. You can also keep track of your physical tickets with our ticket scanner and check jackpot results for every U.S. lottery game. It’s FREE to download and provides a slew of other great features.\n\n*Play Powerball and Mega Millions in select states.\n*Scan and track physical tickets and to be notified when you win.\n*Cash-out right from the phone and always collect 100% of your winnings!\n\nSAFE TO USE\nLottery.com ensures safety by utilizing industry-leading technology that verifies your identity, location, and age to provide the best and most secure mobile lottery experience.\n\nGET STARTED FAST\nPlaying the lottery on your phone is easy! Simply create an account, verify you’re old enough to play, add your payment method, and get started! When you win, you can cash out immediately and you get 100 percent of your winnings!\n\nTHE COOL STUFF YOU DON’T WANT TO MISS\nAutoLotto Alerts - Don’t miss a big jackpot! Our AutoLotto alerts automatically alert you when the jackpot is high so you’ll never forget to play again.\n\nTicket Tracking - Have paper tickets you’d like us to track for you? No problem! Snap a picture of your full ticket in the app and we’ll track your numbers for you and let you know when you’ve won. No need to search for results again!\n\nInstant Cashout - Get all your winnings delivered right to your bank account, safely and securely, when you win! You keep 100 percent of your winnings!\n\nWE’RE IN THE “MAKING PEOPLE HAPPY” BUSINESS\nIt’s so much fun to dream of what you’d do if you won the lottery, and we want to make the experience of playing just as fun. We’ve got a lot of happiness in store for you, but if you need help, have a question, or want to suggest a feature, please contact us! Our Customer Happiness team is here to help.\n\nBy downloading and using the Lottery.com app, you are indicating that you have read the Privacy Policy and agree to the Terms of Service posted at https://lottery.com/privacy and https://lottery.com/terms respectively.",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2014-03-21T15:44:47Z",
  "updated": "2020-03-03T17:54:44Z",
  "releaseNotes": "Performance Improvements and Bug Fixes",
  "version": "2.1.16",
  "price": 0,
  "developer": "AutoLotto, Inc",
  "score": 4.47825,
  "reviews": 46,
  "currentVersionScore": 4.47825,
  "currentVersionReviews": 46,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.theotino.bingo.luckybingowonderland",
  "title": "Bingo！",
  "description": "◆2020 BEST FREE ONLINE BINGO◆\nNever miss this exciting real-time Bingo game! Hourly FREE chips, huge JACKPOTS, multiple bingo winnings, Rich Assets cards, delicate puzzle collections, holiday themes...It’s time to hit the blitz winning and get into the LUCKY bingo heaven!\n\nBINGO EXCLUSIVE FEATURES\n- Stay at home and enjoy hourly FREE power-ups & chips just like a bingo party!\n- Bash in the real-time multiplayer tournament with global players in every bingo room\n- Up to 4 winning bingos on ONE card! You’ll feel like in bingo heaven!\n- Collect puzzle cards for Rich Assets, create unique treasures and make worldwide cuisines, then start your own bingo story!\n- Customize your bingo caller and call out your lucky numbers\n- Earn puzzles pieces in every game and compose vivid collections!\n- FREE hint and auto-daub help you blitz the competition more easily\n- Play up to 8 cards with 9 crazy power-ups, dive yourself into an incredible party!\n- Win FREE chips in daily spins and try your luck every day\n- Join in Bingo Elite and claim daily rewards in a row\n- Exciting in-game events keep your fun going, blitz to collect surprising prizes!\n- Holiday themes update regularly with special gameplays!\n- Send & receive gifts with friends when staying at home, connect your family & friends through gaming!\n\nReady to begin a lucky bingo journey? Download and play for FREE now!\n\nBingo Elite subscription\n\n-You can subscribe for new monthly or seasonally updates (every month or every season.)\n-Subscriptions are from $6.99 USD, $12.99 USD monthly and $38.99 USD seasonally, and the first season will only cost $19.99\n\n-All prices are subject to change without notification. We occasionally run promotion prices as incentives or limited time opportunities for qualifying purchases made during the promotional time period. Due to the time sensitive and promotional nature of these events, we are unable to offer price protection or retroactive discounts or refunds for previous purchases in the event of a price reduction or promotional offering.\n-Payment will be charged to iTunes Account at confirmation of purchase\n-Subscription automatically renews for the same price and duration period as the original “one month\"/\"one season\" package unless auto-renew is turned off at least 24-hours before the end of the current period\n-Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package (monthly or seasonal package)\n-Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase\n-No cancellation of the current subscription is allowed during active subscription period\n-You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the the subscription period to avoid being charged. Please visit http://support.apple.com/kb/ht4098 for more information. You may turn off the auto-renewal of your subscription via your iTunes Account Settings.\n-Any unused portion of a free-trial period, will be forfeited when the user purchases a Bingo Elite subscription\n\n* Links to our Terms of Service and Privacy Policy can be found below\nPrivacy Policy: http://www.luckybingo.xyz/privacy.html\nTerms of Use: http://www.luckybingo.xyz/termsofuse.html\n\n* Prices are equal to the value that \"Apple's App Store Pricing Matrix\" determines as the equivalent of the subscription price in $ USD.\nCannot stop loving? Contact us via Email: bingoservicesvc@gmail.com\n\nLike us on Facebook for daily gifts! @BingoLuckybingowonderland\nhttps://www.facebook.com/BingoLuckybingowonderland/\n\nDisclaimer:\n\n- The games are intended for adults and do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n- Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "genres": [
   "Games",
   "Board",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-05-15T11:08:35Z",
  "updated": "2020-04-23T04:39:19Z",
  "releaseNotes": "1. Bingo at home but eager to go outside? Seaside retreat Bingo is ready! Sunshine and sumless bingos are waiting for you!\n2. Chat room added in every scene! Greet with bingo friends and speak freely!\n3. New! Surprising winning effects in Multi Bingo, Infinity Bingo and Seaside Retreat scenes!\n4. Surprise! Our second-anniversary party is coming in early May! Join to celebrate our birthday together!",
  "version": "1.5.4",
  "price": 0,
  "developer": "Theotino",
  "score": 4.64213,
  "reviews": 1277,
  "currentVersionScore": 4.64213,
  "currentVersionReviews": 1277,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.bunny-scratch.mahjong",
  "title": "Lottery Scratch Card Mahjong",
  "description": "Lottery Scratch Card - Mahjong is a free scratch card game. \nTest your luck by playing 40 scratch tickets without having to lose real money.\n\nFeatures:\n• 40 scratch tickets\n• Real scratching effect\n• You will never lose pocket money by playing these free scratch tickets \n• Play fun clicker game, defeat Nian beasts and become super clickers\n• Best time passer & pressure reducer\n\nList of scratch off tickets:\n• Big Winner\n• Phoenix Rooster\n• 2019 Zodiac Fortune\n• Super Mahjong\n• Roll the Dice\n• Lucky Wheel\n• Lunar New Year\n• Dragon & Lion\n• Red Envelope\n• Sky Lantern Festival\n...and more.\n\n\n• The game does not offer real money gambling or an opportunity to win real money or real prizes.\n• This product is intended for amusement purposes only.\n• Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Lifestyle",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-01-20T08:52:15Z",
  "updated": "2019-01-17T00:55:41Z",
  "releaseNotes": "Enhance performance.",
  "version": "25.0",
  "price": 0,
  "developer": "Happy Entertainment LLC.",
  "score": 4.88235,
  "reviews": 34,
  "currentVersionScore": 4.88235,
  "currentVersionReviews": 34,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.tqg.lts.mobile.ios.scl",
  "title": "Scottish Children’s Lottery",
  "description": "With the Scottish Children’s Lottery, you can play for great cash prizes from our weekly jackpots, drawn every Monday and Thursday, through to a range of fun Instant Win Lotteries, you can now win on the move with our new app.\n\nIt couldn’t be easier to get started, and with up to £25,000 up for grabs every week, why wait?\n\nSimply select five lucky numbers from 1 to 49, or tap 'Fast Play' and we’ll do the rest. You can choose to take part whenever you fancy, on a draw-by-draw basis, or up to eight weeks in advance. You can even make things super easy by opting to play by Direct Debit, which means we’ll enter you into every draw for as long as you’d like. There’s no need to worry about missing a draw again!\n\nWhat’s more, if you’d rather not wait until draw night, our easy-to-play Instant Win Lotteries give you the chance to scoop fantastic on-the-spot cash prizes from your mobile. You could win big - wherever you are!\n\nOffers shown in app previews may be outdated and are subject to change, please visit scottishchildrenslottery.com/en/stv/promotions/promotions.html to find more information on our current promotions.",
  "genres": [
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2017-02-17T17:46:15Z",
  "updated": "2019-09-03T17:47:50Z",
  "releaseNotes": "Update/fixes to links. Bug fixes.",
  "version": "1.0.3",
  "price": 0,
  "developer": "STV ELM LIMITED",
  "score": 3.16667,
  "reviews": 6,
  "currentVersionScore": 3.16667,
  "currentVersionReviews": 6,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.arvystate.net.app.MyLottery",
  "title": "MyLottery",
  "description": "Start using the **NUMBER ONE** lottery number generator available on market!\n\n**NEVER AGAIN** try to remember Lottery numbers and combinations by hand! Use this innovative, easy to use application to remember numbers and generate new combinations. Just **SHAKE** your device for a new one.\n\n**NOW ASK SIRI** to generate a number combination for you, based any of your desired profiles. A new number will be ready in less than a second!\n\nWe use random generation methods utilizing device sensor data with real-time entropy data collected from environment, so the numbers are closer to true randomness. Your **LUCK** is finally in **YOUR OWN** hands, not calculated by your phone!\n\nTrack and read **SPECIAL** reports about your lottery combinations and see if your luck changes and follow your numbers!\n\nChoose your own personal **PROFILE** and tell the app how many combinations and numbers to generate!\n\nSUBSCRIPTION, PRICING, & TERMS\nMyLottery starts with a 7-day free trial. You receive full access to our random number generation service, combination tracking, analysis reports and profile selection to fully test out the app without any restrictions. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period. The amount charged depends on the active subscription price, $6.99 for monthly and $19.99 for yearly subscription. Payment will be charged to iTunes Account at confirmation of purchase. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase. Any unused portion of a free trial period, will be forfeited when the user purchases a subscription to that publication.\n\nFull Terms & Conditions and Privacy Policy are available on the link below:\nhttps://unifiedsense.com/assets/terms.html",
  "genres": [
   "Utilities",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2013-04-10T16:52:22Z",
  "updated": "2020-04-05T22:53:45Z",
  "releaseNotes": "Fixed some bugs and improved the app's performance.\n\nThank you for using MyLottery!",
  "version": "3.1.0",
  "price": 0,
  "developer": "Dal Rupnik",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "lottery"
 },
 {
  "appId": "uk.co.lottery.thunderball",
  "title": "Thunderball",
  "description": "Get the latest Thunderball results within seconds of the draw taking place. This easy to use app also includes full prize breakdowns and number of winners.\n\nBut that’s not all that this useful app has to offer you! You can check results right back to the first ever draw on 12th June 1999 and you are also able to check your own Thunderball numbers for all the draws where a claim is still valid using the built in Thunderball Checker Tool.\n\nGot fed up of trying to choose random numbers for the Thunderball Lottery? Why not use the Random Ticket Generator to pick your numbers!\n\nThe free Thunderball app provides:\n\n- The latest draw results for Thunderball with prizes and number of winners\n- Access to a complete Thunderball results archive\n- Use of the Thunderball Ticket Checker tool\n- Thunderball numbers via the Random Ticket Generator",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2011-02-10T23:47:09Z",
  "updated": "2019-11-13T16:12:32Z",
  "releaseNotes": "Updated to support iOS13",
  "version": "1.5.3",
  "price": 0,
  "developer": "The Lottery Company",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.johnmackay.LottoLens2",
  "title": "Lotto Lens",
  "description": "Start scanning your National Lottery tickets as soon as you buy them and we'll notify you after the draw if you win. We’ll show you how many numbers you matched and how much money you’ve won. Never worry about forgetting to check your ticket again! We even check those pesky raffles.\n\nLotto Lens includes iCloud sync so that you can scan your ticket with your iPhone as soon as you buy it, and you'll receive an alert on your iPad straight after the draw if you've won.\n\nManage a syndicate? Not only is Lotto Lens the fastest and most reliable method of checking your tickets, it will also help you keep track of who's paid and how much each member has won.\n\nHere are some of the highlights:\n\n• Scan Lotto, EuroMillions, Thunderball, Set For Life and HotPicks tickets\n• See how many numbers you matched and how much you've won\n• Receive push notifications if you've won, and optionally of the latest results\n• Smart purchase reminders for the games you play most often\n• Syndicate management to keep track of who's paid\n• A Widget showing the latest results at a glance\n• Privacy with Touch ID / Face ID\n\nLotto Lens is fast, fun and incredibly useful. Join my hundreds of thousands of users and start scanning your tickets today!\n\n\n-- Scan All Your Tickets with a Subscription --\n\nYou can scan 3 tickets for free to experience the benefits of Lotto Lens and you will then be prompted to purchase a subscription. A subscription allows you to:\n\n• Scan an unlimited number of tickets, showing how many numbers and raffles you matched and your prize money\n• Enable iCloud Sync to keep your tickets in sync across all of your devices. Scan your ticket with your iPhone as soon as you buy them, and receive winning alerts on your iPad.\n• Enable prompt automatic ticket checking with Winning Ticket Alerts\n• Enable notifications of the latest results\n• Access to the last 180 days worth of results and prizes\n• Enable smart ticket reminders for the games you play most often\n• Manage your syndicate and keep track of who's paid and how much each member has won\n\nOur Scan All Tickets subscription offers the flexibility of 3 renewal periods to choose from:\n\n• Monthly\n• Bi Annual\n• Annual\n\nAll 3 plans offer the same great features as described above, but the longer the renewal period the greater the saving.\n\nPayment will be charged to your iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Your account will be charged for renewal within 24-hours prior to the end of the current period, at the cost of your selected plan. Subscriptions may be managed, and auto-renewal may be turned off, by going to iTunes & App Store Settings after purchase. \n\nFor more information on how we handle your information, please review our Terms of Service and Privacy Policy.\n\nTerms of Service: https://www.johnmackay.co.uk/terms/\nPrivacy Policy: https://www.johnmackay.co.uk/privacy/\n\n\n-- Support --\n\nIf you have any difficulties using Lotto Lens and would like support, please use the Request Support feature within the app.\n\n\n-- Disclaimer --\n\nLotto Lens is not associated with The National Lottery or Camelot UK Lotteries Limited. You should claim any prizes from your National Lottery retailer as normal (so keep your tickets in a safe place after scanning them because you still need them to claim!). It is your responsibility to check your tickets before discarding them.",
  "genres": [
   "Lifestyle",
   "Utilities"
  ],
  "contentRating": "17+",
  "released": "2016-09-08T10:48:59Z",
  "updated": "2019-10-12T17:36:42Z",
  "releaseNotes": "We've updated the Results Widget - it's now a little easier on the eyes, especially for those of you who have added it to your home screen on iPadOS.",
  "version": "7.2",
  "price": 0,
  "developer": "John Mackay",
  "score": 4.6002,
  "reviews": 6911,
  "currentVersionScore": 4.6002,
  "currentVersionReviews": 6911,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.viker.lottoday",
  "title": "Lotto Day",
  "description": "The UK's favourite free lottery, Lotto Day, gives you the chance to win huge jackpots every single day… simply fill in your lines with your favourite numbers!\n\nPlay up to 30 lines per draw! With three daily draws, you have up to 90 chances of winning £25K every day! Just select five numbers between 1 and 48, and 2 bonus balls, on each line.\n\nRushed for time and want to fill in your lines quickly, with no ads? Become a Lotto Day VIP! Subscribe to remove ads, save your lucky numbers to use as often as you like, and autofill 5 lines at a time!\n\nSo, why pay for a lottery ticket ever again? You can play Lotto Day for free, directly from your phone; it’s easy to play anytime, anywhere!\n\nTurn on push notifications to make sure you never miss results!\n\n\nFEATURES:\n- £25K up for grabs every day!\n- Three daily draws at 12pm, 4pm and 8pm (GMT).\n- Play up to 30 lines for each draw.\n- Multiple winning combinations - chances to win cash and tokens on every draw.\n- Use tokens to skip ads.\n- Become a VIP; remove ads, save your favourite numbers, and autofill five lines at a time.\n\nWhat are you waiting for? You have nothing to lose, and thousands to gain!\n\nCheck out our social pages for news, updates, and more competitions:\nFacebook: https://www.facebook.com/lottodayapp/\nInstagram: https://www.instagram.com/vikerdaygames/\n\nLEGAL\n\nApple is in no way involved with Lotto Day™; it does not sponsor or endorse this App or any prize redemptions.\n\nThe Lotto Day™ free lottery is funded by partnerships and advertising instead of ticket sales.\n\nLotto Day™ does not endorse or promote gambling. \n\nEntrants must be 18 or over.\n\nLotto Day™ is a free mobile app that allows users to win with no purchase necessary.\n\nLotto Day does not require any details from its players other than an email address to make payments to winners via PayPal.\n\nLotto Day™ is operated by Viker Limited, a company incorporated under English law (company number 06290437) and registered at: 200 Union St, London, SE1 0LX.\n\nFor full terms and conditions, visit: https://viker.co.uk/app-terms/",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-10-08T07:00:00Z",
  "updated": "2020-04-09T19:33:57Z",
  "releaseNotes": "Your favourite daily lottery… with THREE draws and bigger than ever jackpots! This version has a few minor bug fixes and improvements for the best Lotto Day experience!",
  "version": "2.33",
  "price": 0,
  "developer": "Viker",
  "score": 4.21729,
  "reviews": 428,
  "currentVersionScore": 4.21729,
  "currentVersionReviews": 428,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.williamsinteractive.jackpotparty",
  "title": "Jackpot Party - Casino Games",
  "description": "There ain't no party like a Jackpot Party! You and your favorite Vegas slot machine games are invited to join the party. Spin slots by top casino game brands to win BIG!\n \nWhat happens at the Vegas slots party, stays at the Vegas slots party! Enjoy an authentic, fun, and thrilling fruit machine experience that embraces all the hot Vegas slots! Visit the world’s biggest casinos and spin the best slots from your home. Find everything you LOVE about the neon capital of the world right here and spin the best fruit machines for iPhone and iPad devices. Celebrate life in the biggest, boldest way possible with every slot machine you love! \n \nYou’re on the guest list, and so are the casino slots from the heart of Vegas or even the local pub fruit machine! Have a blast spinning famous fruit machine games like Planet Moolah, Ruby Link, Kronos Unleashed, Dragon Spin, fruit slots, Raging Rhino, Great Eagle, Zeus slots, Buffalo Slots, and many other casino slot games we all adore. With over 200 free slots games for iPad, plus many fun new slots that are added all the time, this is the best party bash in town!\n \nFun casino slots game features are waiting for you at the lucky slots party! Enjoy special progressive casino slot machines, spin free slot machines that offer HUGE bonuses, collect daily bonus rewards, play new slots and challenges, and a whole lot more! This free pokies party never ends, with every feature available for you around the clock and from anywhere in the world. \n \nParty time is bingo time! The Jackpot Party casino slots app also includes awesome free online bingo games that allow you to collect bingo balls, join leagues and live bingo tournaments, and win massive prizes and gifts playing free slot machine games. Don’t forget to throw the confetti in the air as you yell out “BINGO!”. \n \nTurn on the magic party lights and join the Jackpot Party casino Lightning Leagues! Take your favorite slot machines for a spin, advance in the slots game, spin the wheel, and earn league coins. Spin free casino slot games and compete in challenges to win HUGE slots prizes and bonuses every day! Reach the top pokie games league by spinning hot slots, and discover mega party prizes!   \n \nThis party is for winners only! Spin our festive fruit machines bonus wheel and play Jackpot Party casino games to win big prizes every hour. You can win mini, minor, and MAJOR online pokies rewards, and even double them to win coins, bonus slots and Jackpot slots! The biggest prize of all is the thrill of this party, but the prizes and gifts sure add slots of fun!\n \nDid we mention that entrance to the casino slot party is FREE?!? It’s a slots mania!!! You’ll find all the free slots for iPad on this app. No cash is needed to start playing free slots casino games and spinning your favorite free slots. Just hit download and you’ll immediately find yourself at the hottest party EVER, with free casino slot machines as far as the eye can see. Play slots machines free of charge and join the pokie winner's circle of this slots casino: free slots game!\n \nPokies fans, what are you waiting for? Download the best pokies app now, play pokies and put the Vegas jackpot in your pocket. Play this fruit machine game at home with all your favorite pokies games. It’s a house party full of free fruit machines! Become the life of the party NOW and download the app to start celebrating the madness of winning slots! Join the Vegas casino slots frenzy and play casino slots FREE to become the master of the game! \n \nNote: Guest account does NOT merge with Facebook account.\nThe games are intended for an adult audience. (i.e.,intended for use by those 21 or older).\nThe games do not offer real money gambling games or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Social Networking"
  ],
  "contentRating": "17+",
  "released": "2012-12-12T23:33:11Z",
  "updated": "2020-04-29T18:45:26Z",
  "releaseNotes": "Hey, Jackpot Partiers!\n\nIn our latest release, we’ve introduced some new and exciting updates to Tournaments!\n\nPlus, we’ve added several new slots for you to enjoy, including:\n\n-  Undying Beauty\n\n- Zen Chan\n\nMake sure to check them out!\n\nAlso including bug fixes and game improvements!\n\nDon’t miss out on BONUS COINS, contests, and tons of FUN! Join the JPSC Community today:\n\nhttps://www.facebook.com/JackpotPartyCasinoCommunity\n\nhttps://www.instagram.com/jackpotparty",
  "version": "5014.01",
  "price": 0,
  "developer": "Phantom EFX, Inc.",
  "score": 4.58423,
  "reviews": 1205,
  "currentVersionScore": 4.58423,
  "currentVersionReviews": 1205,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.NJD.Random-Number-Generator",
  "title": "The Random Number Generator",
  "description": "Make sure you have The Random Number Generator for those inevitable times when you urgently need a random number!\n\nFeatures:\n\n- Utilises superior algorithms for a unique sequence of random numbers every time.\n\n- A customisable appearance.\n\n- Speech Synthesis to read out your number.\n\n- Options to choose both a minimum and maximum number to limit the result to the random number you really need.\n\n- An option to show a history of generated numbers.\n\n- The ability to only generate unique numbers.\n\n- A clean, minimalistic layout with no clutter.\n\n- Support for second screens using AirPlay or wired connections.\n\n- Ideal for a lottery.\n\n- Designed to fully support all iPhone and iPad screen sizes.\n\n- Works with iPad multi app modes. (Split-View and Slide-Over.)\n\nThis app will constantly be updated and improved. If you have any feedback or suggestions on what you would like to see, please contact us at: NicholasDeanApps@gmail.com",
  "genres": [
   "Utilities",
   "Productivity"
  ],
  "contentRating": "4+",
  "released": "2013-03-12T05:12:01Z",
  "updated": "2020-05-10T21:38:24Z",
  "releaseNotes": "- Speech no longer gets muted by the silent switch.\n\n- Now available on MacOS!\n\n- Updated firebase accounts.",
  "version": "5.5",
  "price": 0,
  "developer": "Nicholas Dean",
  "score": 4.73684,
  "reviews": 19,
  "currentVersionScore": 4.73684,
  "currentVersionReviews": 19,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.offroadn.LotteryNumber",
  "title": "Lottery $$$",
  "description": "This app is different than other regular lottery apps. It currently calculates the numbers that have been displayed the most since the inception of its lottery. It crunches the numbers pertaining to its type of drawing. Currently it does this for VA, NC and multi-state lotteries. It also shows the history of the last 10 drawings for each game. By clicking on any of the balls for a lottery, it sorts by descending order of how many times a number has been drawn.  Frequently, more lotteries, states and enhancements will be added.\n\nNC - Pick 3, Pick 4, Cash 5\nVA - Pick 3, Pick 4, Cash 5, Cash 4 Life\nMULTI STATE - Lucky For Life, Mega Millions, Powerball\n\nThis app is to be used as entertainment. It has no guarantee that the numbers will win. The displayed numbers are the most returned numbers based off the history of the winning numbers.",
  "genres": [
   "Entertainment",
   "Games",
   "Casino"
  ],
  "contentRating": "4+",
  "released": "2017-10-24T22:29:33Z",
  "updated": "2018-05-11T22:46:35Z",
  "releaseNotes": "SURPRISE!!! no more ads!",
  "version": "13.0",
  "price": 0,
  "developer": "Keith Phillips",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.unibet.lottery",
  "title": "Unibet Lottery Betting",
  "description": "Bet on the world’s biggest lotteries with Unibet’s new lottery betting app. \nLottery betting involves making a bet on the outcome of an official lottery draw. You pick which lottery draw to bet on and which lottery numbers you think will be drawn - if you guess correctly you win cash. The size of your winnings will depend on the number of balls you correctly guess for your chosen draw.\n\nFeatured lotteries include:\n\n• EuroMillions: Europe’s biggest and most popular lottery draw, with a colossal jackpot of up to £160 million. \n• EuroJackpot: Europe’s second most popular lottery draw, with a huge jackpot of up to €90 million.\n• MegaMillions: America's super lottery! This incredible draw has created some of the biggest wins of all time.\n• Powerball: America’s Powerball created the biggest lottery jackpot ever; a mind-blowing $1.6 billion in 2016. \n• El Gordo Christmas Lottery: The biggest draw in the world, with over £2 billion worth of cash prizes to be won.\n• Cash4Life: Get a shot at winning the incredible prize of £1000 a day for life.\n \nUpdated lottery results and prize breakdowns are available after every draw.\n \nUse your existing Unibet account to log in, or simply create an account through the app. \n\nYou must be 18 years or older and have a valid Unibet account to be able to place a bet with this service.\n\nUnibet International Ltd is licensed by the UK Gambling Commission (UKGC). Full details can be found at http://www.kindredgroup.com\n\nUnibet. \nBy Players, For Players.",
  "genres": [
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2017-09-01T08:27:58Z",
  "updated": "2018-02-15T08:36:47Z",
  "releaseNotes": "Thanks for using our app. Enable auto-updates to ensure you don’t miss the latest app enhancements.",
  "version": "1.1",
  "price": 0,
  "developer": "Unibet",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.ntlworld.dswift.eurolottery",
  "title": "EuroMillions",
  "description": "Get the latest EuroMillions results within seconds of the draw taking place. This easy to use app shows the EuroMillions numbers (including associated draws like the Millionaire Maker, Irish Raffle and EuroMillions Plus) and full prize breakdowns including number of winners and prizes paid. \n\n\nThe following features are also included:\n\n\nQR Ticket Scanner (UK only)\n--------------------------------------\nFor lottery tickets purchased in UK shops, simply scan the QR code printed on your ticket using your phone’s camera to see if you have won a prize.\n\n\nTicket Checker\n--------------------------------------\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket. Only play EuroMillions on certain days every Friday or Tuesday? Not a problem, you can exclude your checked tickets from draws you do not play.\n\n\nCustomisable Notifications\n--------------------------------------\nGet notified instantly when the latest EuroMillions results and prize breakdowns become available. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\n\n\nRandom Number Generator\n--------------------------------------\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on Lucky Dip numbers!\n\n\nEuroMillions Results Archive\n--------------------------------------\nAccess to the full archive of results dating back to the first draw which took place in 2004. \n\n\nMultilingual Support\n--------------------------------------\nThis app is available in the following languages: English, French, Portuguese, Spanish, Dutch, Chinese, German, Italian, Polish, Swedish and Russian.\n\n\nSupport\n--------------------------------------\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at support@euro-millions.com.",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2009-06-08T01:52:37Z",
  "updated": "2020-01-17T19:01:44Z",
  "releaseNotes": "The EuroMillions app has been completely rewritten from the ground up, making it much quicker than the previous version, accompanied with a fresh redesign to make the app easier to use.\n\nWhat’s new:\n\n- The latest results now appear almost instantly after a draw, with historical results available at the tap of a button.\n\n- A ticket scanner has been added, making it incredibly quick and easy to see if you have won a prize. Scan your tickets as soon as the numbers have been drawn, so you can see if you've matched a prize before the winning amounts have been confirmed.\n\n- The bottom tab bar has been replaced with a menu, freeing up space on the screen and providing quick access to all areas of the app.\n\n- The app no longer restarts every time it is reopened, making it quicker to pick up where you left off.\n\n- Statistics for EuroMillions and information on how to claim prizes can also be found from the menu.",
  "version": "4.0",
  "price": 0,
  "developer": "The Lottery Company",
  "score": 4.54125,
  "reviews": 1188,
  "currentVersionScore": 4.54125,
  "currentVersionReviews": 1188,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.multiLotto.lottery",
  "title": "Multilotto - Lotto & Casino",
  "description": "Multilotto – Bet on Lottery online and check latest lottery results anytime, anywhere\nAt Multilotto you can bet on the results of a wide range of international lotteries for a chance to win the same prizes, including the jackpots. Just choose your favorite lottery, pick your lucky numbers and wait for the draw – it’s that easy.\nSome biggest lotteries available on the Multilotto App are:\n ● US Powerball\n ● US Mega Millions\n ● EuroJackpot\n ● Irish Lotto\nMain features:\n- Bet on lotteries online – you can bet on the world’s biggest lotteries such Powerball, MegaMillions, Eurojackpot, Bitcoin Lotto, Irish Lotto, New York Lottery, Lotto 6/49, El Gordo, SuperEnaLotto, La Primitiva\n- Drawing results - Check up to date and historical lottery results\n- Statistics – you can find the most common winning numbers\n- Casino games – you can play hundreds of exciting online casino games, including slots, roulette, blackjack, table games, poker, classic card.\nDownload the Multilotto App now and get closer to the world’s biggest jackpots.\nQualifications:\nMultilotto is one of the world’s leading online lottery betting companies and is licensed by Curacao eGaming/Malta Gambling Authority/UK Gambling Commission/Irh National Excise License Office.\nYou have a guarantee of payouts if you win.\nThis is a real money gambling app. Gamble responsibly. www.gambleaware.co.uk, www.gamcare.org.uk.\n\nNotes\nPlease note that:\n- Players must be aged 18 years or over to play.\n- For any questions, you can either visit: www.multilotto.com or contact us support@multilotto.com",
  "genres": [
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-02-08T10:21:40Z",
  "updated": "2019-11-26T07:40:20Z",
  "releaseNotes": "Merry Christmas！\nWe've implemented some regulatory updates.",
  "version": "V3.0.1",
  "price": 0,
  "developer": "MultiWarehouse",
  "score": 4.71569,
  "reviews": 204,
  "currentVersionScore": 4.71569,
  "currentVersionReviews": 204,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.national-lottery.casino",
  "title": "National-Lottery.com Casino",
  "description": "Free Play and Real Money casino games are now available from the National-Lottery.com Casino.\n\nPlay the UK’s most popular Slot, Jackpot and Table Games from your iPhone or iPad now!\n\nSPECIAL OFFER – Welcome Bonus (of up to £200) is available for all new players!\n\nSo what are you waiting for? There’s a whole host of games for you to enjoy on the National-Lottery.com mobile casino ranging from the classic casino games of Roulette and Blackjack to a wide range of exciting slots games. With new games being added all the time we are confident that you will find plenty to entertain you, no matter what kind of casino player you are.\n\nThe National-Lottery.com casino app is available on iPhone, iPad and iPod Touch.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-07-10T20:02:38Z",
  "updated": "2015-10-02T17:25:16Z",
  "releaseNotes": "Updated to support iOS9 and the new Apple San Francisco font.",
  "version": "2.3",
  "price": 0,
  "developer": "The Lottery Company Ltd.",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.bingo.tour.party.crazy.free.ios.avidly",
  "title": "Bingo Party - Bingo Games",
  "description": "Bingo Party is the Classic & Special Bingo Game with 8 CARD VERSION!  Wanna get more bingos? Wanna be more fun? Just play Bingo Party!\n\nGame Features:\n# Realtime multiplayer! Play with more than 10,000 players at a time!\n# Join elite to play up to 8 cards!\n# Over 30 bingo rooms! We will be rolling out more rooms!\n# 500 Tickets & 30 powerups to start off. Each day you have another 150+ tickets to continue the bingo trip. Don't miss it!\n# Your daily bonus will increase by your level up!\n# Complete kinds of puzzles to get BIG BONUS!\n# 7 types of power-ups - Help you get more bingos!\n# Daily Tournament - Complete other players to win big!\n# Achievement - Over 200 achievements to challenge. Complete to win!\nIf you love bingo and want to try a new one, Bingo Party is a good choice. Just have a rest out from other bingo games, we will not let you down!\nIf you love bingo and want to try a new one, Bingo Party is the good choice. Come experience the fantastic NEW BINGO game, we will not let you down!\nDon't Wait and download now, a new Bingo Party is waiting for you!\n\nPractice or success at social casino gaming does not imply future success at real money gambling. \n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n•The games are intended for an adult audience.\n***********************************************************************\n\nHave questions or suggestions about Bingo Party - Bingo Casino & Slots Games?\nEmail your questions to bingo@avid.ly.\n\nThank you for playing and have a wonderful bingo trip!",
  "genres": [
   "Games",
   "Board",
   "Casino"
  ],
  "contentRating": "12+",
  "released": "2017-08-10T01:53:14Z",
  "updated": "2020-04-30T16:03:50Z",
  "releaseNotes": "1. Bug fixed and game optimized.\n2. Newly added Advancement Pack for new players.",
  "version": "2.5.0",
  "price": 0,
  "developer": "Avid.ly",
  "score": 4.65123,
  "reviews": 10305,
  "currentVersionScore": 4.65123,
  "currentVersionReviews": 10305,
  "searchTerms": "lottery"
 },
 {
  "appId": "co.designstack.Lottery-Number-Picker",
  "title": "Lottery Number Picker",
  "description": "UK Lottery Number Picker.\n\nAn Uber Bling Themed Random Number Picker for UK Lotteries and Euromillions.\n\nPick your numbers in Style! Bling Style! \n\nGet random numbers for:\n- Lotto\n- Euromillions\n- ThunderBall\n- Health Lottery\n\nThis App Rains traditional lucky charms like Gold Coins, Lucky Horseshoes, Clovers, Diamonds and Money. If only that happened in real life!\n\nRandom Numbers will appear with a Golden Comet reveal.\n\nThis app is styled in Ultra Luxury, a hint of what's to come if you do win the lottery.",
  "genres": [
   "Entertainment"
  ],
  "contentRating": "4+",
  "released": "2013-05-03T22:19:23Z",
  "updated": "2020-04-29T14:45:36Z",
  "releaseNotes": "Bug fixes and performance improvements",
  "version": "2.6",
  "price": 0,
  "developer": "N Thorn",
  "score": 1,
  "reviews": 2,
  "currentVersionScore": 1,
  "currentVersionReviews": 2,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.vics.thelottery",
  "title": "The Lottery - Lucky Numbers Generator and Simulator",
  "description": "Your luck is closer than ever with this new lottery simulator.\n\nThis app helps you generate and keep track of your lottery tickets. It also generates lucky numbers for future drawings.\n\nNumbers can be generated by:\n- manual selection\n- physics simulation\n- random\n- magic (based on name, birthday, lucky numbers, destiny number and other personal factors).\n\nOther facilities:\n- database for saved tickets\n- statistics\n- beautiful graphics and animations\n \n\n* the number 12+1 was not used in the making of this app",
  "genres": [
   "Utilities",
   "Finance"
  ],
  "contentRating": "4+",
  "released": "2013-12-17T00:15:05Z",
  "updated": "2013-12-21T05:11:14Z",
  "releaseNotes": "- fixed a small bug",
  "version": "1.0.2",
  "price": 0,
  "developer": "Victor Campeanu",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.yahenskyi.random",
  "title": "Random: All Things Generator",
  "description": "Need a random number? Or can’t you decide what to do? Random is a powerful app that will solve all such problems.\n\nFeatures:\n• Number generator (from a range 0 - 999999999)\n• Letter generator\n• Dice roller (roll up to 4 regular dices in one go)\n• A custom item from a list generator\n• Yes or No \n• Coin flipper\n• Card generator\n• Rock-Paper-Scissors\n• Map Point\n\nGenerate a new random number simply by tapping a ​randomize button or by touching the Apple Watch screen. For those who want a bit of additional exercise, shaking your iOS device will also result in a new random response.\n\nUse Force Touch for setting the minimum or maximum values in your Apple Watch app. Same for the number of dices​, cards, and selection of lists.\n\nRandom PRO subscription benefits:\n• Sync: Get access to your data from all your devices.\n• Themes: Customize the app with various themes and background images.\n• No advertising.\n\nIf you decide to get Random PRO subscription, your purchase will be charged to your iTunes account. 1 month costs $2.99 and 1 year costs $11.99. Active subscriptions will be auto-renewed 24 hours before the expiry date. You can manage subscriptions from Account in iTunes after subscribing, you’ll also be able to cancel the auto-renewing subscription from there at any time. Any unused portion of the free trial period will be forfeited if you purchase a subscription to Random PRO before your trial expires.\n\nTerms & Conditions: https://yahenskyi.dev/terms-conditions/\nPrivacy Policy: https://yahenskyi.dev/privacy-policy/",
  "genres": [
   "Lifestyle",
   "Family",
   "Games",
   "Board"
  ],
  "contentRating": "4+",
  "released": "2016-07-05T22:00:04Z",
  "updated": "2020-05-04T15:21:32Z",
  "releaseNotes": "• New random category: Map Point\n\nThanks for using the Random app!\nThis release also contains bug fixes and performance improvements.",
  "version": "2.2.0",
  "price": 0,
  "developer": "Volodymyr Yahenskyi",
  "score": 4.50427,
  "reviews": 117,
  "currentVersionScore": 4.50427,
  "currentVersionReviews": 117,
  "searchTerms": "lottery"
 },
 {
  "appId": "uk.co.totalwebsystems.lotteryguy",
  "title": "Lottery Guy",
  "description": "\"Revealing The True Lottery Secrets... Busting The Myths... And Pulling Back The Curtains Of The Fake Lottery Systems... The Lottery Guy's Tips Give It To You Straight!\"\n\nI need to warn you up front – sadly, nearly every system out there is total junk. Seriously. So be prepared for some honest lottery system reviews… a lot of people aren’t going to like this…\n\nEnough already! The internet is full of junk lottery systems, and downright lies about everything from picking lottery numbers to wheeling systems.\n\nIt's time to see the myths and secrets to winning the lottery exposed. I'll be clearing out the lottery closet and revealing the fake science behind many so-called 'lottery systems'.\n\nI'll also show you step-by-step exactly what you really can do to get the best chances of winning the lottery, and how to maximise your winnings.\n\nIt's truly amazing just how much money you can pay for a 'system' that gives you no better chance of winning the lottery than picking numbers at random. Are the sellers merely misguided, and don't really understand what they are selling - or something far worse altogether..?\n\nYou will be securely armed with the knowledge to see through the junk and false claims. You will be one of an exclusive, select group of people who actually play the lottery wisely (not many people do).\n\nYou can leap on the fast track to becoming lottery wise right here with my Free Lottery Tips course. And don't worry, I'm not going to confuse you with complex maths, just give you simple steps you can take to increase your chances of winning starting today.\n\n• About The Author\n• Syndicates Work: FACT!\n• My Lottery Blog\n• Favorite Articles\n• FREE Lottery Tips\n• Lottery System Reviews\n• Lottery Questions\n• General Stuff\n• Lottery Secrets\n• Lottery Compare Tool\n• Share The Love\n• Contact Me\n• Biography\n\nMaster the secrets of the lottery syndicate now, and you can be a wiser player, and winner, for many years to come.\n\nBe Lucky!\n• Lottery Guy\n\nWe give High Star Ratings to only the Very Trusted and Best Value systems. The opinions expressed within are the authors alone, as are the Comments and Reviews provided by our users; and do not necessarily reflect the opinions of those companies whose products we review. Independence of information is therefore guaranteed.\n\nAn internet connection via mobile data or WiFi is required to use some features of this application.",
  "genres": [
   "Reference",
   "Books"
  ],
  "contentRating": "17+",
  "released": "2016-01-20T18:05:51Z",
  "updated": "2018-01-29T17:38:54Z",
  "releaseNotes": "• iOS10+ Improved Compatibility \n• Minor bug and crash issues fixed",
  "version": "0.7.6",
  "price": 0,
  "developer": "Total Web Systems Limited",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "lottery"
 },
 {
  "appId": "biz.saemi.SetForLifeResults",
  "title": "Set for Life Results",
  "description": "Set For Life Results : Probably, the most comprehensive, yet simplest way to check The Lott's Set For Life results.\n\nFEATURES\n\nCheck latest Set For Life results\n- Check the latest and past Set For Life results by swiping left or right on your iOS device.\n- Navigate to any Set For Life Lotto results quickly.\n\nView all Set For Life results\n- View all Set For Life results since August 2015.\n\nView next Set For Life draw details\n- Includes next jackpot amount.\n\nSubscribe latest Set For Life results push notifications\n- Receive push notification when the latest Set For Life results is out.\n- Receive push notification when the latest Set For Life results jackpots is out.\n- Receive push notification when the next Set For Life draw details is out.\n\nShare Set For Life results with your friends\n- Send Set For Life results to your friends using iOS built-in sharing.\n\nPersonal Set For Life Number Storage\n- Keep a list of your Set For Life numbers that you bought or thinking of buying.\n\nSet For Life Results Number Checker\n- Check your Set For Life numbers against any Set For Life results.\n- View Set For Life results with your favorite Set For Life numbers highlighted.\n- View the prize group that you have won highlighted.\n\nSet For Life Number Generator\n- Generate random winning Set For Life numbers by shaking your iOS device.\n\nUniversal\n- One app for your iPhone, iPod touch and iPad.\n\nSet For Life Results works for The Lott in Australia only.\n\nSUPPORT\nIf you have any feedback or questions, drop us an email at support@saemi.biz.\n\nCheck out Set For Life Results on Facebook, http://www.facebook.com/SetForLifeResultsApp.\nFollow Set For Life Results on Twitter, @SetForLifeRslts.\n\nSET FOR LIFE RESULTS IS AN ORIGINAL IDEA BY SAEMI.",
  "genres": [
   "News",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2016-02-29T23:26:39Z",
  "updated": "2017-10-15T19:10:49Z",
  "releaseNotes": "We update our app regularly to give you a better experience. Thank you for using our app.\n\nIf you have any feedback or questions, drop us an email at support@saemi.biz.",
  "version": "2.7.2",
  "price": 0,
  "developer": "Sam Tang",
  "score": 4,
  "reviews": 3,
  "currentVersionScore": 4,
  "currentVersionReviews": 3,
  "searchTerms": "lottery"
 },
 {
  "appId": "uk.co.lottery.healthlottery",
  "title": "Health Lottery App",
  "description": "Health Lottery results delivered to your device within seconds of the draw taking place.\n\nThis easy-to-use application gives you the very latest Health Lottery results within minutes of the draw taking place.\n\nArchived Health Lottery results date all the way back to the first draw in 2011.\n\nThe Health Lottery Ticket Checker allows you enter your chosen numbers to see how many balls you have matched.\n\nAnd if you are short of inspiration for choosing your lottery numbers, you can make use of the Random Ticket Generator, rather than having to rely on Quick Pick numbers.",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2012-01-24T19:32:55Z",
  "updated": "2019-11-13T18:37:41Z",
  "releaseNotes": "Updated to support iOS13",
  "version": "1.5.1",
  "price": 0,
  "developer": "The Lottery Company",
  "score": 3,
  "reviews": 5,
  "currentVersionScore": 3,
  "currentVersionReviews": 5,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.bigfishgames.bfcasinouniversalfreemium",
  "title": "Big Fish Casino: Slots & Games",
  "description": "You must be 18+ to access this game.  This game does not offer gambling or an opportunity to win real money or prizes.  Practice or success at social gaming does not imply future success at gambling.\n\n------------------\n\nDownload now! New players get 100,000 FREE BONUS CHIPS in the #1 FREE to play Casino app in the world! Over 65,000 5-star reviews!\n\nBig Fish Casino gives you the chance to WIN BIG in Slots, Blackjack, Texas Hold'em Poker, Roulette, and more! Play live with your friends, with all the thrill of Las Vegas! Sit down, relax, have a drink & some chips – on us. We've got gorgeous games and millions of friendly people to play with for FREE!\n\nMake a fortune with HUGE Jackpots, Free Daily Games, Slots Bonus Games, and more! Will you play it safe and hold your cards, or double down and get a lucky ace? Over 16 BILLION chips in Jackpots given out each day!\n\nHave an adventure like no other in our original Slot Machines! Hit Flaming 7's for multiple jackpot levels in Jackpot City! Hunt for clues to uncover a huge win in Sherlock Mysteries! Fortune awaits those brave enough to enter the Enchanted Cavern…\n\nTOP FEATURES: \n• Exciting slot machines with FREE SPINS and Bonus Games you won't find anywhere else!\n• Everybody wins together in our unique Social Scatter™ Slots Games!\n• Win up to 1 MILLION chips in our Reward Center games!\n• Daily FREE game and bonuses could win you up to 65k FREE Chips just for logging in!\n• Play LIVE with your friends! Beat the house in Blackjack or test your skills in Poker! \n• Customize and strut your stuff with free pets, gifts, and power ups! \n\n--------------------- \n\nQuestions? Suggestions? Contact us at www.bigfishcasinosupport.com!",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-12-17T20:03:18Z",
  "updated": "2020-03-23T17:03:04Z",
  "releaseNotes": "•Minor bug fixes. \n•Don’t miss out on the upcoming Easter Treasure Rush!",
  "version": "12.2.8",
  "price": 0,
  "developer": "Big Fish Games, Inc",
  "score": 4.573,
  "reviews": 8972,
  "currentVersionScore": 4.573,
  "currentVersionReviews": 8972,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.hans.lotto.uk.nloot",
  "title": "UK Lotto Thunderball 49 EuroMillions Health",
  "description": "UK Lottery  results checker  support Lottery in UK \n\n1. UK Lotto   ( Millionaire Raffle 1 2 )\n2. EuroMillions  ( Millionaire Maker ) \n3. Health Lottery\n4. HotPicks\n5. ThunderBall\n6. UK 49's\n\nand Functions \n\n1. The latest lottery results\n2. Results History\n3. Check number\n4. Statistics\n5. Numbers Management \n\nThis is the best APP for the lottery fans to get the lottery information. It let you quickly and easily check the latest lottery results of UK Lotto, EuroMillions, Health Lottery, Hot Picks, ThunderBall and UK 49's. It's also provided with purchase management function and numbers select function. \n\nSo you must have this APP if you play lottery in UK !\n\n\n[Function List Descriptions]\n\n· The latest lottery automatic notification\n\nYou can set personal needs to accept the lottery automatic notification.\n\"Do you worry to forget the important date for check the winning numbers? If you subscribe the notice, after the lottery updates, notification will be sent to your cell phone, lest you forget the lottery.\"\n\n\n· The latest lottery results\n\nProvide the latest winning numbers and detailed information of UK Lotto, EuroMillions, Health Lottery, Hot Picks, ThunderBall and UK 49's. \nYou can check the latest winning numbers.\nThe APP information synchronously updates almost at the same time with the lottery terminals .\n\n\n· Results History \n\nIncluding the latest one, you can see the last 50 draw lottery winning numbers. \n( It's the best way to checking the correct numbers. )\n\n\n· Check number\n\n You can key-in the lottery numbers, the system can help you check the winning numbers information (in the last 50 draw). \n It quickly check your input numbers if they won the prize of which period.\n\n\n· Statistics\n\nTo view the common digital ranking from the past winning numbers. It contain:\n* Top number  - the most frequently occurring digital \n* Top Pairs  - the most frequently occurring pairs\n* Top Triplets - the most frequently occurring triplets \nTry to forecast the winning numbers in the future by this data. \nThis feature is only for UK Lotto, EuroMillions, Hot Picks and ThunderBall.\n\n\n· Numbers Management \n\nit can help you to see how many balls you have matched in the latest draw. You can effectively manage your lottery tickets.\nThis feature is only for UK Lotto, EuroMillions, Health Lottery, Hot Picks and ThunderBall.\n\n\n. Corresponding lottery list\n UK Lotto, EuroMillions, Health Lottery, Hot Picks, ThunderBall, UK 49's\n\nWelcome to use this APP as a lottery management tool.\n\n( Notice : APP data is for reference only.  In the event of any dispute, the official websites shall prevail. )",
  "genres": [
   "Reference",
   "News"
  ],
  "contentRating": "17+",
  "released": "2016-09-22T18:24:21Z",
  "updated": "2016-11-03T23:33:43Z",
  "releaseNotes": "update sdk\nupdate push notify",
  "version": "1.1.0",
  "price": 0,
  "developer": "HSIN HAN WU",
  "score": 3.4,
  "reviews": 5,
  "currentVersionScore": 3.4,
  "currentVersionReviews": 5,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.irishlottery.lotto",
  "title": "Irish Lottery",
  "description": "Get the latest Irish Lotto results within seconds of the draw taking place. This easy to use app shows the National Lottery numbers and full prize breakdowns including number of winners and prizes paid for the following lotteries:\n\n- Lotto\n- Lotto Plus 1\n- Lotto Plus 2\n- Lotto Plus Raffle\n- EuroMillions (including Irish Raffle and EuroMillionaires Raffle)\n- EuroMillions Plus\n- Daily Million\n- Daily Million Plus\n- Telly Bingo\n- Lotto 5-4-3-2-1\n- Lotto 5-4-3-2-1 Plus 1\n- Lotto 5-4-3-2-1 Plus 2\n\n\nThe following features are also included:\n\n\nTicket Checker\n--------------------------------------\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\n\n\nCustomisable Notifications\n--------------------------------------\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\n\n\nRandom Number Generator\n--------------------------------------\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on Quick Pick numbers!\n\n\nResults Archive\n--------------------------------------\nAccess to the full archive of results dating back to the first draw of each lottery.\n\n\nSettings\n--------------------------------------\nCustomise which lotteries display in the app and in which order.\n\n\nSupport\n--------------------------------------\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at support@irishlottery.com.",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2011-02-25T02:38:17Z",
  "updated": "2020-04-02T07:18:53Z",
  "releaseNotes": "The app has been completely rewritten from the ground up, making it much quicker than the previous version, accompanied with a fresh redesign to make the app easier to use.\n\nWhat's new:\n\n- Added Telly Bingo and Lotto 5-4-3-2-1 (including Plus 1 and Plus 2) lotteries.\n\n- The latest results now appear almost instantly after a draw, with historical results available at the tap of a button.\n\n- The bottom tab bar has been replaced with a menu, freeing up space on the screen and providing quick access to all areas of the app.\n\n- The app no longer restarts every time it is reopened, making it quicker to pick up where you left off.\n\n- Statistics for each lottery and information on how to claim prizes can also be found from the menu.",
  "version": "5.0",
  "price": 0,
  "developer": "The Lottery Company",
  "score": 4.73508,
  "reviews": 721,
  "currentVersionScore": 4.73508,
  "currentVersionReviews": 721,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.tinyMobile.scratchers",
  "title": "American Scratchers Lottery",
  "description": "American Scratchers Lottery recreates every aspect of the \"scratch off experience\" and brings it home to you in this new and exciting game. If you've ever played scratch off lottery tickets before, you already know exactly how to play! Enjoy 34 different scratcher tickets and 5 different game types (match 3 style, lucky number style, blackjack, coin adding, Poker, horse racing, slots, RPG style and our latest \"auction style\"!!!). \n\nLevel up by buying tickets and winning to get additional bonus amounts every time you win! Collect all the achievements and best your friends on the Game Center leaderboards for maximum enjoyment! Bottom line, if you like scratcher lottery tickets, you are going to love American Scratchers Lottery.\n\nGet the same rush of excitement when you win and enjoy the savings versus traditional lottery games and scratch off tickets.\n\nSpecial thanks to Kevin Suffecool for his poker hand evaluation code!\n\n*** Information about Player’s Club VIP Card:\n• Subscription service billed monthly. Included features:\n  *20% extra currency on TinyBuck purchases\n  *VIP daily chest (opt-in required)\n  *0.50 TinyBuck per minute in-app reward\n  *Ads removed \n\n• Payment will be charged to iTunes Account at confirmation of purchase\n• Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period\n• Account will be charged for renewal within 24-hours prior to the end of the current period, at a cost listed in the app (currently $2.99 /mo. USD or equivalent in other locales)\n• Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase\n• Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable\n\nFor more information, visit the following link below to read our privacy policy and terms of service http://tinymobile.com/privacy-policy-terms-of-service/  You can also tap the privacy policy link our app’s App Store listing.\n\n\nThis app is intended for entertainment purposes only, no real money is rewarded.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2011-11-05T02:24:30Z",
  "updated": "2019-09-30T14:50:07Z",
  "releaseNotes": "• Metadata update only. Non-critical update for users.",
  "version": "3.8.2",
  "price": 0,
  "developer": "Tiny Mobile Inc.",
  "score": 4.26984,
  "reviews": 63,
  "currentVersionScore": 4.26984,
  "currentVersionReviews": 63,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.leisureapps.lotterynews.ga",
  "title": "Lottery Results for Georgia",
  "description": "Lottery results for Georgia's Lottery (GA Lotto). Every game is available and results are updated every 10 minutes. Always accurate and fast.\n\nTons of features:\n- Search past lottery results and specific dates\n- Lottery game statistics, including hot and cold numbers and frequency of numbers.\n- Lottery news and updates\n- Alerts for your favorite lotto games\n\nCurrent games listed:\n\nMega Millions\nPowerball\nAll or Nothing Morning/Midday/Evening/Night\nJumbo Bucks Lotto\nFantasy 5\nGeorgia Five\nCash 4 Midday\nCash 4 Evening\nCash 3 Midday\nCash 3 Evening",
  "genres": [
   "News",
   "Entertainment"
  ],
  "contentRating": "4+",
  "released": "2016-11-04T08:32:33Z",
  "updated": "2016-11-04T08:32:33Z",
  "version": "1.0",
  "price": 0,
  "developer": "Leisure Apps",
  "score": 4,
  "reviews": 1,
  "currentVersionScore": 4,
  "currentVersionReviews": 1,
  "searchTerms": "lottery"
 },
 {
  "appId": "biz.saemi.EuroMillionsResults",
  "title": "EuroMillions Results",
  "description": "EuroMillions Results : Probably, the most comprehensive, yet simplest way to check EuroMillions’ results.\n\nFEATURES\n\nCheck latest EuroMillions results\n- Check the latest and past EuroMillions results by swiping left or right on your iOS device.\n- Navigate to any past EuroMillions results quickly.\n\nView all EuroMillions results\n- View all EuroMillions results since February 2004.\n\nView next EuroMillions draw details\n- Includes next jackpot amount.\n\nSubscribe latest EuroMillions results push notifications\n- Receive push notification when the latest EuroMillions results is out.\n- Receive push notification when the latest EuroMillions results jackpots is out.\n- Receive push notification when the next EuroMillions draw details is out.\n\nShare EuroMillions results with your friends\n- Send EuroMillions results to your friends using iOS built-in sharing.\n\nPersonal EuroMillions Number Storage\n- Keep a list of your EuroMillions numbers that you bought or thinking of buying.\n\nEuroMillions Results Number Checker\n- Check your EuroMillions numbers against any EuroMillions results.\n- View EuroMillions results with your favorite EuroMillions numbers highlighted.\n- View the prize group that you have won highlighted.\n\nEuroMillions Number Generator\n- Generate random winning EuroMillions numbers by shaking your iOS device.\n\nUniversal\n- One app for your iPhone, iPod touch and iPad.\n\nEuroMillions Results works for EuroMillions in United Kingdom only.\n\nSUPPORT\nIf you have any feedback or questions, drop us an email at support@saemi.biz.\n\nCheck out EuroMillions Results on Facebook, http://www.facebook.com/EuroMillionsResultsApp.\nFollow EuroMillions Results on Twitter, @EMResults.\n\nEUROMILLIONS RESULTS IS AN ORIGINAL IDEA BY SAEMI.",
  "genres": [
   "News",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2014-09-09T23:04:45Z",
  "updated": "2017-10-15T19:08:01Z",
  "releaseNotes": "We update our app regularly to give you a better experience. Thank you for using our app.\n\nIf you have any feedback or questions, drop us an email at support@saemi.biz.",
  "version": "2.7.2",
  "price": 0,
  "developer": "Sam Tang",
  "score": 2.22,
  "reviews": 50,
  "currentVersionScore": 2.22,
  "currentVersionReviews": 50,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.todaytix.TodayTix",
  "title": "TodayTix - London Tickets",
  "description": "Getting tickets to the best performances in London has never been easier than with TodayTix, the highest-rated ticketing app in the App Store. Created by Broadway and West End producers, TodayTix provides insightful guidance into the world of culture, allowing users to discover new shows and unlock access to the best seats at the best prices.\n\nFirst launched for tickets to New York's Broadway and Off-Broadway shows, TodayTix is now available in London's West End, Chicago, Los Angeles, the San Francisco Bay Area, Boston, Washington D.C., Seattle, Philadelphia, Toronto, Connecticut, Houston, Dallas-Fort Worth, Melbourne and Sydney. So, don’t worry if you’re just visiting, your app will work on either side of the pond! \n\n----FEATURES----\n\n- Book tickets in 30 seconds or less, up to 30 days in advance.\n- Save money and take the guesswork out of buying London theatre tickets. A member of STAR, we only supply tickets we know to be authentic.\n- Enter daily lotteries to popular West End and Off-West End shows. Win free tickets, access to exclusive Front Row seats, and more deals.\n- Unlock on the day Rush tickets at deep discounts on a first-come, first-served basis every performance day.\n- Select the seat section and price point that is right for you with our seating charts and interactive maps.\n- Buy with confidence with our secure and simple card process. Unlike many other apps, we work directly with the theatre’s box office, never with brokers. \n- Sign up for alerts to find out when your favorite sold out show becomes available. Get reminders the next time Rush and Lottery deals are live.\n\n----THE BUZZ----\n\n“Will revolutionise buying tickets for West End shows and have as much impact as Uber has had on taxi services in London.” – London Evening Standard\n\n“It promises a future of no long lines, shady websites, and uncertainty.” – Associated Press\n\n“Save money, save time, and feel like a VIP while you’re doing it.” – Entertainment Weekly\n\n----CONNECT WITH US----\n\nFacebook: www.facebook.com/todaytix\nTwitter: www.twitter.com/todaytixuk\nInstagram: www.instagram.com/todaytix\nWebsite: www.todaytix.co.uk",
  "genres": [
   "Entertainment",
   "Lifestyle"
  ],
  "contentRating": "4+",
  "released": "2013-06-30T07:00:00Z",
  "updated": "2020-05-05T13:42:28Z",
  "releaseNotes": "What’s new? You might notice we have a new name and a new logo. Plus, we’ve launched the Save a Seat Fund to fill theaters with frontline workers.",
  "version": "2.7.4",
  "price": 0,
  "developer": "TodayTix, LLC",
  "score": 4.92316,
  "reviews": 16553,
  "currentVersionScore": 4.92316,
  "currentVersionReviews": 16553,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.wizits.slotagram",
  "title": "Win Fun Casino Slot Machines",
  "description": "Claim your 50,000 FREE COINS welcome bonus and start playing over 80 free fruit machines NOW!\n\nPlay the slots game with the widest selection of Las Vegas casino fruit machines, biggest bonuses, and other amazing free casino game features that will have you swimming in gold! Step into the magical Slotagram online casino, claim your 50,000 FREE COINS, and start spinning reels of the hottest video slots online!\n\nThe slots masters at Wizits, who brought you the WIN Vegas classic slots game, bring you another free casino like no other. Slotagram Slots puts the Las Vegas VIP experience straight in your hands with the biggest daily bonuses, HUGE JACKPOTS, weekly lottery, multiplayer games, and an exclusive VIP Club.\n\nSpin the hottest video fruit machines FREE!\n- Win the Superstar Jackpot with the popular 50x Wild and Triple Wild fruit machines.\n- Strike BIG WINS in the Las Vegas favorite Lightning Strike video fruit machine.\n- Feel the heat and climb the leaderboard in the Spicy Hot new free slots game!\n- The best new fruit machines with more HUGE JACKPOTS added weekly! \n\nThe online casino game with the best features!\nEveryone is a VIP in Slotagram’s free slots casino! Get the full Las Vegas experience anywhere you go. Cash in daily bonuses, hit the biggest jackpots in our roulette prize wheel and weekly lotteries, and claim casino bonuses as you climb each of the fruit machine online leaderboards. The more you play slots, the bigger the wins! Spin and win to achieve VIP Status and unlock amazing benefits that no other free online casino slots games offer!\n\nShare the excitement of big wins! Connect to Facebook to play free slots games with your friends and claim another 50,000 FREE COINS. Enjoy fun multiplayer online slots games, casino tournaments, and leaderboards! \n\nThe games are intended for an adult audience.\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\nPractice or success at social casino gaming does not imply future success at \"real money gambling.\"\n\nYour VIP experience starts now!",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-07-29T01:42:13Z",
  "updated": "2020-02-24T09:47:33Z",
  "releaseNotes": "Win Fun Casino keeps getting better! Here’s an update that includes additional bug fixes, new games and one huge exciting upcoming feature!\n\nBe sure to install it to stay tunes and improve your game experience!",
  "version": "12.0.8",
  "price": 0,
  "developer": "Wizits",
  "score": 4.77778,
  "reviews": 189,
  "currentVersionScore": 4.77778,
  "currentVersionReviews": 189,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.multiLotto.Maltalottery",
  "title": "Multilotto-UK Lottery App",
  "description": "******Multilotto – Bet on Lottery online and check latest lottery results anytime, anywhere\nAt Multilotto you can bet on the results of a wide range of international lotteries for a chance to win the same prizes, including the jackpots. Just choose your favorite lottery, pick your lucky numbers and wait for the draw – it’s that easy.\nSome biggest lotteries available on the Multilotto App are:\n ● US Powerball\n ● US Mega Millions\n ● EuroJackpot\n ● Irish Lotto\nMain features:\n- Bet on lotteries online – you can bet on the world’s biggest lotteries such Powerball, MegaMillions, Eurojackpot, Bitcoin Lotto, Irish Lotto, New York Lottery, Lotto 6/49, El Gordo, SuperEnaLotto, La Primitiva\n- Drawing results - Check up to date and historical lottery results\n- Statistics – you can find the most common winning numbers\n- Casino games – you can play hundreds of exciting online casino games, including slots, roulette, blackjack, table games, poker, classic card.\nDownload the Multilotto App now and get closer to the world’s biggest jackpots.\nQualifications:\nMultilotto is one of the world’s leading online lottery betting companies and is licensed by Curacao eGaming/Malta Gambling Authority/UK Gambling Commission/Irh National Excise License Office.\nYou have a guarantee of payouts if you win.\nThis is a real money gambling app. Gamble responsibly. www.gambleaware.co.uk, www.gamcare.org.uk.\n\nWhat’s new\n- Scratchcards are now live! Enjoy on the go!\n- We’ve added TouchID/FaceID login to make login easier than ever.\nNotes\nPlease note that:\n- Players must be aged 18 years or over to play.\n- For any questions, you can either visit: www.multilotto.com or contact us support@multilotto.com",
  "genres": [
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-04-21T22:45:03Z",
  "updated": "2019-12-17T03:01:46Z",
  "releaseNotes": "Merry Christmas!\n1.We've implemented some regulatory updates \n2.We've added a new feature: the lotto result notifications subscription! You can now subscribe and get lotto results instantly \n3.We've implemented some interaction optimization on signup and login pages",
  "version": "3.0.1",
  "price": 0,
  "developer": "MultiWarehouse",
  "score": 4.57143,
  "reviews": 7,
  "currentVersionScore": 4.57143,
  "currentVersionReviews": 7,
  "searchTerms": "lottery"
 },
 {
  "appId": "be.appsolution.loterie",
  "title": "Loterie Nationale",
  "description": "Avec l’app gratuite de la Loterie Nationale (la nouvelle version de l’app WinCheckr), vous placez vos jeux de tirage, jeux de grattage et jeux Woohoo! favoris sur votre écran d’accueil personnalisé. Jouer dans l’app n’est actuellement pas possible. Vous pouvez jouer en ligne via e-lotto ou chercher le point de vente le plus proche. Après chaque tirage EuroMillions, Lotto, Extra Lotto, Joker+, Keno ou Pick 3, il vous suffit de scanner votre ticket pour savoir immédiatement si vous avez gagné. Vous pouvez également ajouter votre carte Lottery Club dans l’app : de cette manière, vous avez vos avantages toujours en poche !",
  "genres": [
   "Entertainment",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2011-11-15T08:00:00Z",
  "updated": "2020-01-27T09:56:43Z",
  "releaseNotes": "Optimizations",
  "version": "4.1.12",
  "price": 0,
  "developer": "Loterie Nationale Loterij",
  "score": 4.63157,
  "reviews": 38,
  "currentVersionScore": 4.63157,
  "currentVersionReviews": 38,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.saavro.ctlotto",
  "title": "CT Lottery Results",
  "description": "View all the Connecticut lottery draw game results without needing to navigate multiple screens.  Up-to-date results for:\n\n * Powerball\n * Mega Millions\n * Lucky Links\n * Lotto\n * Lucky for Life\n * Cash 5\n * Play 4\n * Play 3\n\nAdditional features include:\n * Generate Quick Picks\n * View results history\n * Payouts for select games\n * Frequency charts for select games",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2019-03-24T05:48:46Z",
  "updated": "2020-03-11T22:03:52Z",
  "releaseNotes": "Fix connectivity issues",
  "version": "1.2.3",
  "price": 0,
  "developer": "Matthew SAAVEDRA",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.byterun.bingo",
  "title": "Bingo!!",
  "description": "American Bingo is a popular game played with 5x5 matrix cards that contains 24 random numbers and one central special marked square. \n\nThe object of the game is to complete a Bingo pattern, such as a line with five numbers vertical, horizontal, diagonal row or all four corner squares.",
  "genres": [
   "Games",
   "Entertainment",
   "Board",
   "Simulation"
  ],
  "contentRating": "12+",
  "released": "2014-06-11T07:51:31Z",
  "updated": "2019-08-09T01:55:10Z",
  "releaseNotes": "Adaptation for iPhone XR and XS Max screen size.",
  "version": "1.8",
  "price": 0,
  "developer": "DoraLogic",
  "score": 4.47518,
  "reviews": 141,
  "currentVersionScore": 4.47518,
  "currentVersionReviews": 141,
  "searchTerms": "lottery"
 },
 {
  "appId": "biz.saemi.NewYorkLottoResults",
  "title": "New York Lotto Results",
  "description": "New York Lotto Results : The simplest yet advanced way to check New York Lottery’s Lotto results.\n\nFEATURES\n\nCheck latest Lotto results\n- Check the latest and past Lotto results by swiping left or right on your iOS device.\n- Navigate to any past Lotto results quickly.\n\nView all Lotto results\n- View all Lotto results since January 2008.\n\nView next Lotto draw details\n- Includes next jackpot amount.\n\nSubscribe latest Lotto results push notifications\n- Receive push notification when the latest Lotto results is out.\n- Receive push notification when the latest Lotto results jackpots is out.\n- Receive push notification when the next Lotto draw details is out.\n\nShare Lotto results with your friends\n- Send Lotto results to your friends using iOS built-in sharing.\n\nPersonal Lotto Number Storage\n- Keep a list of your Lotto numbers that you bought or thinking of buying.\n\nLotto Results Number Checker\n- Check your Lotto numbers against any Lotto results.\n- View Lotto results with your favorite Lotto numbers highlighted.\n- View the prize group that you have won highlighted.\n\nLotto Number Generator\n- Generate random winning Lotto numbers by shaking your iOS device.\n\nUniversal\n- One app for your iPhone, iPod touch and iPad.\n\nNew York Lotto Results works for New York Lottery in United States only.\n\nSUPPORT\nIf you have any feedback or questions, drop us an email at support@saemi.biz.\n\nCheck out New York Lotto Results on Facebook, www.facebook.com/NewYorkLottoResultsApp.\nFollow New York Lotto Results on Twitter, @NYLLottoResults.\n\nNEW YORK LOTTO RESULTS IS AN ORIGINAL IDEA BY SAEMI.",
  "genres": [
   "News",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2016-02-18T18:08:22Z",
  "updated": "2017-10-15T19:13:08Z",
  "releaseNotes": "We update our app regularly to give you a better experience. Thank you for using our app.\n\nIf you have any feedback or questions, drop us an email at support@saemi.biz.",
  "version": "2.7.1",
  "price": 0,
  "developer": "Sam Tang",
  "score": 4,
  "reviews": 4,
  "currentVersionScore": 4,
  "currentVersionReviews": 4,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.euresults",
  "title": "Euromillions: euResults",
  "description": "With this app you can now get the Euromillions results very quickly and easily!\n\nFeatures:\n- Check the latest Euromillions draw and related list of prizes\n- View the past draws (and their prizes)\n- You can save your numbers and the app will check to see if they match any of the Euromillions results. Therefore you will always be aware of any potential prizes you may have won!\n- View the associated draws: Millionaire Maker (UK), My Million (France), El Millón (Spain), M1lhão (Portugal), Euromillions Plus (Ireland), Joker + (Belgium), 2 Chance (Switzerland) and ExtraLux (Luxembourg)\n- Receive optional push notifications to notify you when a new result is available, also when the next Prize value is available and more importantly will inform you have won by checking your saved numbers. \n- Share the Euromillions results with your friends and family (Email, SMS, Facebook, Twitter etc)\n- You can also share the results via the iMessage (SMS) app with your friends and family\n- App is available to use offline to avoid unnecessary data usage \n- Available for the iPhone, iPad and Apple Watch\n- And in English, German, Spanish, French, Portuguese, Italian, Russian, Swedish and Chinese (both simplified and traditional)\n- And there will be more features coming soon!\n\nPlease feel free to get in contact, if you have any suggestions or feedback\n\nGood luck! :)\n\n-------------------------------------\nThis application does not perform online betting. And this application is not linked to, or affiliated with, or approved by any of the European Operators of the EuroMillions lottery game.  EuroMillions® is a registered trademark of SLE.",
  "genres": [
   "News",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2017-03-16T16:03:42Z",
  "updated": "2020-05-11T17:55:39Z",
  "releaseNotes": "Thanks for using euResults! This release includes stability and performance improvements. Let us know what you think. Please send your feedback and ideas to feedback@euromillionsapp.com",
  "version": "1.7.6",
  "price": 0,
  "developer": "Daniel Fernandes",
  "score": 4.58629,
  "reviews": 394,
  "currentVersionScore": 4.58629,
  "currentVersionReviews": 394,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.foxbytes.prettyrandom",
  "title": "Pretty Random - RNG",
  "description": "A simple, beautiful, random number generator.",
  "genres": [
   "Utilities",
   "Entertainment"
  ],
  "contentRating": "4+",
  "released": "2016-06-21T22:05:12Z",
  "updated": "2020-04-18T23:21:09Z",
  "releaseNotes": "Added in app purchases to:\n\n- remove bottom banner ads\n- add 10 new gradients",
  "version": "3.0",
  "price": 0,
  "developer": "steven burnett",
  "score": 4.41934,
  "reviews": 31,
  "currentVersionScore": 4.41934,
  "currentVersionReviews": 31,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.topgame.PyramidSlots",
  "title": "Slots Casino™ - Fortune King",
  "description": "***The most innovative new slots game is here, download now for free!\n***\nTHE BEST SLOTS CASINO GAMES\n\nSlots Casino have all the best slots games.  You will never have to look for another slot game after playing Slots Casino.All new SLOTS CASINO has burst onto the scene.\n\nHUGE EXPERIENCE\n\nThe brand new version of SLOTS CASINO provides a new kind of slots experience! With a huge variety of payouts and no max bet limits, it’s the only slots game that’ll give you the tons of excitement and fun that you’re looking for.\n\nLAS VEGAS IN YOUR POCKET\n\nMultiple styles of gameplay will give you the experience of being at a Las Vegas casino, right on your iPhone/iPad!\n\nFUN AND SATISFYING EXPERIENCE\n\nWhat are you waiting for? Download Slots Casino now and winning BONUS, FREE SPINS, BIG WIN, MEGA WIN, HUGE WIN, EPIC WIN and JACKPOT.  Download now for FREE in this amazing slots casino experience!\n\nIf you love slots games, then you won’t want to miss out on Slots Casino. Now millions of players chose SLOTS CASINO, so play it now!\n\nHighlighted features:\n- Multiple styles of slots gameplay!\n- Huge payouts that are more satisfying than anything you’ve experienced before!\n- A huge variety of payouts means the winnings just keep on pouring in!\n- No max bet limits, the thrills never end!\n- Non-stop discounts, so you can always enjoy the best deals!\n- New slot machines added regularly, the fun never stops!\n\nThe Best Slots Casino Games are produced for you by TOPGAME™.\n\nThe game is intended for an adult audience. The game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-10-09T06:09:32Z",
  "updated": "2017-11-03T03:59:49Z",
  "releaseNotes": "SLOTS CASINO's brand-new machine - AMERICAN FREEDOM - is the most realistic slots machine yet. Including some of the best effects you've ever seen and the most exhilarating gameplay, come give it a try!\n\nOur brand-new Halloween mini game has lots of surprises in store for you!\n\nOur only objective is to make the most fun game possible!",
  "version": "4.10",
  "price": 0,
  "developer": "TOPGAME",
  "score": 4.7234,
  "reviews": 47,
  "currentVersionScore": 4.7234,
  "currentVersionReviews": 47,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.tw.tycoon.casino",
  "title": "Tycoon Casino - Vegas Slots",
  "description": "Tycoon Casino Slots is a new slot game to attract everyone’s attention. Different styles of games, huge prizes, big jackpots, and so on, everything you want in the slots game can be found here. Come and seek your luck here- Play Tycoon Casino Slots and Win huge prizes! \n\nStart your spins and enjoy the game, Tycoon Casino Slots can make you forget all the bad things and boring days, because we want to provide slots lovers and beginners with best slot machines and massive grand wins.\n\n►Get 100,000,000 free coins instantly as Welcome Bonus.\n►Every 12 minutes you will receive a store gift,and every 8 hours you can spin bonus wheel for one time. Keep spinning! \n►Interesting graphic, smooth animations and vivid sound offer you the best casino atmosphere.\n►Different feature games, huge prize and bonus, winning symbols like Scatter & expanding WILD.\n►Enjoy our gorgeous Slots Games like being in Vegas heart.\n►Authentic slot machines designed by casino professionals.\n►Hold on to Autospin and listen to the sweet casino melody. Plenty wins will tell you how time flies. \n\n►Enough free coins to bet large in a spin and win more back.\n►Lots of free spins, respin, hold&spin, bonus games.\n►Finish daily goals and get big reward!\n►Participate in different kinds of activities to win extra prizes in special slot machines.\n\n►Get five scatters in Dragon Spin and win free games.\n►Spin and get specific wolves in special reels to multiply your prizes. \n►Come to see the Star Panda and win big prizes.\n►Spin to get plenty respin chances in 88 Riches. \n►Make a big fortune in the volcano Riches, wins never ends.\n\nThe Tycoon Casino Slots can give you an incredible gambling feeling with its attractive appearance and the sound. Don't miss this opportunity to experience different styles of slots games! Come and download the game right now. Huge prizes and bonus are waiting for you!\n\nThis product is intended for use by those 21 or older for amusement purposes only. \nPractice or success at social casino gaming does not imply future success at real money gambling. \n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-10-21T10:44:15Z",
  "updated": "2020-04-30T01:53:04Z",
  "releaseNotes": "Hey Tycoon Lovers! Here's our new updates with:\n• New Slot: Legend Ages\n• New Event: Card Album \n• Great promotion and deals\nWe are always working hard to make Tycoon Casino the best casino slots game out there. Come and seek your luck here!",
  "version": "1.5.2",
  "price": 0,
  "developer": "Triwin Inc.",
  "score": 4.83474,
  "reviews": 3292,
  "currentVersionScore": 4.83474,
  "currentVersionReviews": 3292,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.bingo.scape.ios.free",
  "title": "Bingo Journey！Bingo Party Game",
  "description": "Bingo Journey is a free classic bingo game with lots of free Cash and Power-ups to claim every day! Take a tour in Bingo Journey with your friends and family to join a free bingo world and enjoy an odyssey to places of interest around the world. \n\n# You will get 500 cashes & 50 Power-ups to start the bingo journey. \n# Daily bonus of 180+ Cash for you to collect every day. The higher level you reach; the more daily bonus you can get. \n# In the club, you can complete quests in groups and send gifts to each other.\n# Free Power-ups and treasure boxes for you to collect every day!\n# Play against thousands of real players in real time. \n# Join Elite to challenge Elite Exclusive Quest.\n# Boost your cards for better rewards.\n# The more puzzles you complete, the more Cash you can claim as daily bonus. \n# Up to 7 various Power-ups to help you get more rewards.\n# The featured games are elaborately prepared with quality products and rewarding payout.  \n# Graphics are best quality among casino games and there are lots of featured bingo rooms for you to choose from.\n\nBingo Journey frequently updates and adds seasonal and featured bingo games. Our game is a good way to relax and de-stress you from the pressure of daily life. You can play with your family, friends and thousands of players around the world; You can play alone or group together in the club to complete quests! It is also a good way of Socializing to play our game!\n\nThe game is designed for people 21 years of age or older and is for entertainment purposes only. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n\nOur official website: https://bingo-journey.com/\n\nFacebook: https://www.facebook.com/BingoJourney\nInstagram: https://www.instagram.com/bingo_journey/\nYouTube: https://www.youtube.com/channel/UC3dh2DEocAWJcXf87U49FRw?view_as=subscriber\nTwitter: https://twitter.com/bingojourney20",
  "genres": [
   "Games",
   "Casino",
   "Board"
  ],
  "contentRating": "12+",
  "released": "2018-12-13T00:23:28Z",
  "updated": "2020-05-02T11:50:07Z",
  "releaseNotes": "1. Newly added Card Castle system. Enjoy the thrill of collecting precious cards!\n2. Bug fixed and game optimized.",
  "version": "1.6.5",
  "price": 0,
  "developer": "Elestorm Game Co., Ltd.",
  "score": 4.69468,
  "reviews": 5198,
  "currentVersionScore": 4.69468,
  "currentVersionReviews": 5198,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.shoutz.shoutz",
  "title": "LotteryHUB",
  "description": "- Track Mega Millions, Powerball, and state lottery results easily\n- Enter your Mega Millions and Powerball tickets into the app for tracking and convenient display of winning numbers\n- Jackpot information at your fingertips\n- Catch up on missed lottery drawings and winning results",
  "genres": [
   "News",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2011-10-21T00:01:00Z",
  "updated": "2018-12-27T21:55:54Z",
  "releaseNotes": "Bug Fixes\nBackend/API Updates",
  "version": "5.2.4",
  "price": 0,
  "developer": "Shoutz Inc.",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.steventroughtonsmith.lotto",
  "title": "Lotto Machine 4",
  "description": "The first random number generator with a physics engine!\n\nLotto Machine is purely designed to help you pick your numbers for the lottery - sounds boring, right? Wrong! With a gorgeous UI, a spinning drum and physics & parallax that you can control with the accelerometer, now playing the lottery can be fun no matter the outcome!\n\nYou can choose how many numbers to pick, and how many numbers to pick from, so you can use it for non-lottery related purposes, even for games. Roll 6D20? Easy!\n\nBring a little fun into your life, and who knows - you might even win (and if you do, please let us know)!\n\nLotto Machine supports VoiceOver and high contrast modes, and we endeavor to be accessible to all.\n\n----\n\nLife of Riley Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 3.0 License\nhttp://creativecommons.org/licenses/by/3.0/",
  "genres": [
   "Games",
   "Entertainment",
   "Simulation"
  ],
  "contentRating": "4+",
  "released": "2012-02-01T07:56:51Z",
  "updated": "2018-11-09T20:40:30Z",
  "releaseNotes": "• Support for iOS 12 and new devices",
  "version": "4.0.5",
  "price": 0.99,
  "developer": "Steven Troughton-Smith",
  "score": 4.65517,
  "reviews": 29,
  "currentVersionScore": 4.65517,
  "currentVersionReviews": 29,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.huge.slots.casino.vegas.ios.avidly",
  "title": "Double Win Casino Slots Game",
  "description": "Double Win Slots for free! Install Double Win Slots now to embrace the real thrill of true Las Vegas casino experience. best selection of casino slot machines, and huge payouts for free spins and jackpots.\nDouble Win Slots brings you the best slot machine gaming experience you have ever had with tons of fun!\nSpin this casino slots with gorgeous graphics, smooth animations and fantastic bonuses, collect daily FREE COINS and hourly FREE GIFTS! \nYou are starting an awesome casino journey in this best online casino Double Win Slots.\n\nGet ready to have fun?\nINSTALL NOW and make a fortune with excitement and entertainment!\n*******************************************************\nInstall Double Win Slots and Enjoy:\n► Huge payouts, incredible big wins, mega wins and super mega wins;\n► FREE daily login bonus, FREE mega wheel bonus and FREE coins every 3 hours;\n► Amazing new beautiful free slots games added on a weekly basis ;\n► WIN BIG with amazing jackpots, scatter slots and more\n► Lots of high quality slots with diverse thems and variety of gameplays;\n► Wild multipiers, free spins, expanding wilds makes you a fortune;\n► Wonderful quests will set you on the path to riches!\n► Install now to start having real slots fun!\n*******************************************************\nGo and install Double Win Slots now! You will discover an incredible world of Slots and Casino games. Wherever you are, you can open the Double Win Slots app to experience the wonderful night in real Vegas!\n*******************************************************\nFollow Double Win Slots on Facebook for free offers and exclusive coin packages.\nFacebook：www.facebook.com/DoubleWinSlotsGames",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-10-19T20:44:00Z",
  "updated": "2020-03-18T09:03:24Z",
  "releaseNotes": "Dear players：\n\nFixed some bugs in the game.\n\nMore rewards and more surprises in Double Win!\n\nGOOD LUCK!",
  "version": "1.71",
  "price": 0,
  "developer": "FG Games",
  "score": 4.89462,
  "reviews": 6339,
  "currentVersionScore": 4.89462,
  "currentVersionReviews": 6339,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.national-lottery.irish.results",
  "title": "Irish Lottery Results",
  "description": "Get the latest Irish Lottery results within seconds of the draws taking place. This easy-to-use app shows the National Lottery numbers, prize breakdown information and jackpots for the following lotteries:\n\nIrish Lotto (including Plus 1, Plus 2 and Lotto Plus Raffle)\nEuroMillions (including EuroMillions Plus, Irish Raffle and EuroMillionaires Raffle)\nDaily Million (including Daily Million Plus)\nTelly Bingo\nLotto 5-4-3-2-1 (including Plus 1 and Plus 2)\n\n\nThe following features are also included:\n\n\nTicket Checker\n--------------------------------------\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\n\n\nCustomisable Notifications\n--------------------------------------\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\n\n\nRandom Number Generator\n--------------------------------------\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on Quick Pick numbers!\n\n\nResults Archive\n--------------------------------------\nAccess to the full archive of results dating back to the first draw of each lottery.\n\n\nSettings\n--------------------------------------\nCustomise which lotteries display in the app and in which order.\n\n\nSupport\n--------------------------------------\nIf you have any feedback or suggestions on how we can improve this app, please get in touch via the in-app Support section.",
  "genres": [
   "Entertainment",
   "Reference"
  ],
  "contentRating": "17+",
  "released": "2020-04-07T07:00:00Z",
  "updated": "2020-04-07T18:58:32Z",
  "version": "1.0",
  "price": 0,
  "developer": "The Lottery Company",
  "score": 4.77778,
  "reviews": 54,
  "currentVersionScore": 4.77778,
  "currentVersionReviews": 54,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.appstreetsoft.Roulette",
  "title": "Roulette 42",
  "description": "Bring Vegas and Monaco to your iPhone and iPad with Roulette Multiplayer, a complete Roulette app. Impeccably designed and intuitive, this one is sure to make you go \"wow\". \n\nPlay with your friends in private tables or let us match you with anyone around the world automatically. Compete with your friends for interesting titles and achievements. \n\nPlay, compete, show off and make friends!\n\nThe complete game\n************************************\nPlay as many as 20 different types of bets. Master the inside and outside bets and then, graduate to call and full bets. We got everything covered!\n\nFun for free \n************************************\nGet thousands of free chips daily. Refer your friends and get referral bonus every time your friend joins the game. There are other ways to get free chips as well. Play and feel like a high roller without dropping a penny!\n\nOnline Friends and Invite to Match\n************************************\nSee who is online and join in your friends' table automatically. You can also invite your friends or share invite links. If you prefer, you can always play on a public table or play offline in single player mode. There is always a table waiting for you!\n\nFive different lounges \n************************************\nChoose the lounge you want to play in and compete with like-minded people. Start with the Silver lounge and move up to the Diamond lounge.\n\nJoin the league \n************************************\nPlay and make your way to the leader boards and pick up hilarious achievements. \n\nCrowning glory \n******************************\nAs you play and gain expertise in the game, conquer various crowns and show them off to the world.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-05-16T19:33:07Z",
  "updated": "2018-01-31T18:51:00Z",
  "releaseNotes": "Roulette Multiplayer is now part of Casino 42. Upgrade to Casino 42 now!\n\n- Invite friends using in app notifications and game links\n- View currently online friends to play with them\n- Complete revamp of user interface\n- Refer friends and get free chips when they join\n- New leaderboards\n- Multiple bug fixes",
  "version": "5.0.1",
  "price": 0,
  "developer": "App Street Software Private Limited",
  "score": 3.75,
  "reviews": 96,
  "currentVersionScore": 3.75,
  "currentVersionReviews": 96,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.speednet.LotteryPlaces",
  "title": "Lottery Places",
  "description": "Lottery Places is an essential app for every lottery player!\n\nWith Lottery Places, you can instantly find the nearest official lottery retailers, no matter where you are.\n\nFor the first time, we have created a centralized way of finding lottery retailers that crosses state and country boundaries.  No longer do you need to download apps or visit websites of individual lotteries, just to see where you can buy a lottery ticket.\n\nYou can search for lottery retailers closest to your current GPS position, or from any other location you specify.  Then, get driving directions to any retailer with a single tap of a button.\n\nOur comprehensive database of lottery retailers is updated regularly, to make sure you can find the newest lottery retailers — and not be led to stores that are no longer selling lottery tickets.\n\nBuilt into the app is an easy way for you to report any errors or problems with any lottery store location.  Just click the Report Error button on a retailer, and tell us what's wrong.\n\nLottery Places was created by the developer of Lottery Post (www.lotterypost.com), the world's most popular website for lottery players.  You'll find the same quality and dedication to excellence in Lottery Places that has been the hallmark of Lottery Post for more than 15 years.\n\n• Simple to use and get started\n• Lightning-fast searches\n• Great resource when you're traveling or planning a trip\n• Lottery retailers constantly updated with changes from the lotteries\n• Quick and easy reporting of errors and problems\n• Search for lottery retailers near your current GPS position or any other place\n• Just press and hold the map in another location to begin searching there, or enter an address for a precise search\n• See a list of found retailers, sorted by distance or store name\n• See a list of lotteries included in the app, which we update every time we add a new lottery",
  "genres": [
   "Navigation",
   "Entertainment"
  ],
  "contentRating": "4+",
  "released": "2015-06-15T21:18:09Z",
  "updated": "2016-03-31T23:26:16Z",
  "releaseNotes": "- Fixed bug that sometimes searches in your former location after traveling a distance away.\n- Updated several components for better compatibility with iOS 9.3.",
  "version": "1.0.4",
  "price": 0,
  "developer": "Speednet Group",
  "score": 2.75,
  "reviews": 4,
  "currentVersionScore": 2.75,
  "currentVersionReviews": 4,
  "searchTerms": "lottery"
 },
 {
  "appId": "biz.saemi.ThunderballResults",
  "title": "Thunderball Results",
  "description": "Thunderball Results : Probably, the most comprehensive, yet simplest way to check National Lottery’s Thunderball results.\n\nFEATURES\n\nCheck latest Thunderball results\n- Check the latest and past Thunderball results by swiping left or right on your iOS device.\n- Navigate to any past Thunderball results quickly.\n\nView all Thunderbolt results\n- View all Thunderball results since June 1999.\n\nView next Thunderball draw details\n- Includes next jackpot amount.\n\nSubscribe latest Thunderball results push notifications\n- Receive push notification when the latest Thunderball results is out.\n- Receive push notification when the latest Thunderball results jackpots is out.\n- Receive push notification when the next Thunderball draw details is out.\n\nShare Thunderball results with your friends\n- Send Thunderball results to your friends using iOS built-in sharing.\n\nPersonal Thunderball Number Storage\n- Keep a list of your Thunderball numbers that you bought or thinking of buying.\n\nThunderball Results Number Checker\n- Check your Thunderball numbers against any Thunderball results.\n- View Thunderball results with your favorite Thunderball numbers highlighted.\n- View the prize group that you have won highlighted.\n\nThunderball Number Generator\n- Generate random winning Thunderball numbers by shaking your iOS device.\n\nUniversal\n- One app for your iPhone, iPod touch and iPad.\n\nThunderball Results works for National Lottery in United Kingdom only.\n\nSUPPORT\nIf you have any feedback or questions, drop us an email at support@saemi.biz.\n\nCheck out Thunderball Results on Facebook, http://www.facebook.com/ThunderballResultsApp.\nFollow Thunderball Results on Twitter, @ThunderballRslt.\n\nTHUNDERBALL RESULTS IS AN ORIGINAL IDEA BY SAEMI.",
  "genres": [
   "News",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2015-12-21T23:29:20Z",
  "updated": "2017-10-15T19:09:55Z",
  "releaseNotes": "We update our app regularly to give you a better experience. Thank you for using our app.\n\nIf you have any feedback or questions, drop us an email at support@saemi.biz.",
  "version": "2.7.2",
  "price": 0,
  "developer": "Sam Tang",
  "score": 4.09999,
  "reviews": 10,
  "currentVersionScore": 4.09999,
  "currentVersionReviews": 10,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.leisureapps.lotterynews.tn",
  "title": "Lottery Results - Tennessee - TN Lotto",
  "description": "Winning lottery results for the TN Lottery. All Games Available!\n\nResults for each game are updated every 5 minutes! You can view hot and cold numbers, get smart picks, view frequency charts for each game, view game payouts, know how many winners there were for each game, see jackpot analysis, receive push notifications, or search past results! \n\nThis lottery app is very simple and easy to use. So if you are a lottery player - download this app now and get the winning numbers!\n\nCurrent TN Lotto games include:\n\nMega Millions\nPowerball\nHot Lotto\nTennessee Cash\nCash 4 Morning/Midday/Evening\nCash 3 Morning/Midday/Evening",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2016-12-16T01:22:52Z",
  "updated": "2016-12-16T01:22:52Z",
  "version": "1.0",
  "price": 0,
  "developer": "Leisure Apps",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.alottery.georgia",
  "title": "Lottery Results Georgia",
  "description": "This easy to use app shows the latest lottery numbers for all popular Georgia games including:\n\n- Jumbo Bucks\n- Fantasy 5\n- Powerball\n- Mega Millions\n- Cash 3 (Midday, Evening & Night)\n- Cash 4 (Midday, Evening & Night)\n- Georgia Five (Midday & Evening)\n- All or Nothing\n\nJumbo Bucks, Fantasy 5, Powerball and Mega Millions also include a full breakdown displaying the number of winners and amount paid out for each prize level.\n\nThe following features are also available:\n\nJumbo Bucks Ticket Checker\n------------------------------------------------------------------\nEnter and save your chosen Jumbo Bucks numbers to see if you have won or to see how often they have come up in the past.\n\nRandom Number Generator\n------------------------------------------------------------------\nStuck for numbers? Use this handy tool and let the app choose your lucky numbers.\n\nLotto Results Archive\n------------------------------------------------------------------\nAccess to the full archive of results for each lottery dating back to the first draw.",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2013-01-08T00:40:35Z",
  "updated": "2018-07-03T21:45:14Z",
  "releaseNotes": "Added Cash 3 Night and Cash 4 Night draws.",
  "version": "2.5",
  "price": 0,
  "developer": "The Lottery Company",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "net.lotto.app",
  "title": "Lotto.net Results",
  "description": "Find the latest lotto results from the world’s biggest games. View winning numbers, prize breakdowns and the number of winners in each tier.\n\nThe app also provides details of your favourite lotto’s next draw, including the value of the jackpot you could win.\n\nWhether you play Powerball, Mega Millions, EuroMillions or one of the many other lotteries included on the app, you’ll find everything you need to know about your chosen game here. \n\nLotto.net App Features:\n-----------------------\n\n● Lotto Archives - Find Lotto results from the entire history of each of the games featured on the app. \n\n● Lotto Checker - Input your regular numbers, store them and check them against the previous six months of results to see how much they have won.\n\n● Lotto Number Generator - The generator provides a random selection of numbers for your chosen lotto, which you can save to use in future draws.\n\n● Personalisation - You can choose which lotteries appear in the app.",
  "genres": [
   "Reference",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-03-03T15:20:10Z",
  "updated": "2017-12-01T17:23:41Z",
  "releaseNotes": "Added support for iPhone X.  Minor bug fixes and updates to performance.",
  "version": "2.0.1",
  "price": 0,
  "developer": "The Lottery Company Ltd.",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.redhotlabs.cashbingo",
  "title": "Bingo Lounge - Real Money Bingo Gambling Online App Game: 90, Instant, Multi & Classic Casino Play",
  "description": "Love Bingo, Keno and Lotto? Come play Bingo Lounge and watch your winnings roll!\n\n** New players can choose a 250% Bonus – up to £125! **\n\nChoose your Bonus Offer: Deposit £10 and get £35 to play!\nOr\nDeposit £20 and get £70 to play!\nDeposit £30 and get £105 to play!\nDeposit £40 and get £140 to play!\nDeposit £50 and get £175 to play!\n\nChoose your bet and play at your own pace with up to 12 tickets in 3 different and unique Bingo game modes: Classic, Instant and Multi Card Bingo.\n\nPick your own Most Popular version of 90 ball Bingo in UK :)\n\nEveryone can be a winner in this version of the game :) With great odds and generous payouts, just sit back and watch the Bingos - and the winnings - roll in!\n\nPlay Real Money Bingo and Win Real Cash!\n\nCheck out our other Real Money Casino or Gambling Games like Roulette, Baccarat, and Match 3!\n\n**What people are saying about us**\n\n“Very Addictive Game. Bingo lovers you are going to love this. Excellent” – Rebeccanoble8\n\n“No fuss. Nice and easy and nice not to have to see everyone’s life stories” – Baconxx\n\nSigning up is quick and easy. Simply create a safe and secure Betable Wallet to claim your free 250% Deposit Bonus of up to £125! For example deposit £10 to get £35.\n\nPlease note: some portions of this game have REAL MONEY GAMBLING FUNCTIONALITY POWERED BY BETABLE. The real-money gambling functionality of this application is only available to customers over the age of 18. A valid Betable account is required in order to use the real-money functionality of this application. Betable is licensed by the United Kingdom Gambling Commission to offer remote gambling services, license number 000-023328-R-307313-003.",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-08-20T04:58:16Z",
  "updated": "2016-05-03T17:36:53Z",
  "releaseNotes": "Fixed some login issues with the latest build",
  "version": "2.1.1",
  "price": 0,
  "developer": "Loot Winner Ltd",
  "score": 4.23386,
  "reviews": 124,
  "currentVersionScore": 4.23386,
  "currentVersionReviews": 124,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.leisureapps.lotterynews.tx",
  "title": "Lottery Results Texas - TX Lotto",
  "description": "Get the winning lottery numbers for the Texas Lottery (also known as the TX Lottery). Results for each game are updated every 5 minutes! You can see hot and cold numbers, get smart picks, frequency charts, game payouts, total game winners, and receive push notifications, or search past results! \n\nThe app is very simple and easy to use. So if you are a lottery player - download this app now and get the winning numbers!\n\n\nCurrent Texas lottery games include:\n\nMega Millions\nPowerball\nLotto Texas\nTexas Two Step\nAll or Nothing Morning/Day\nAll or Nothing Evening/Night\nCash Five\nDaily 4 Morning/Day\nDaily 4 Evening/Night\nDaily 3 Morning/Day\nDaily 3 Evening/Night",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2016-12-15T18:15:42Z",
  "updated": "2016-12-15T18:15:42Z",
  "version": "1.0",
  "price": 0,
  "developer": "Leisure Apps",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.limestudio.lottery.laos",
  "title": "Laos National Lottery",
  "description": "Play the biggest lottery in Laos from the palm of your hand!\n\nNever Miss a Jackpot!\n\nThe lottery app makes it quick and easy to:\n. check your numbers \n. keep up to date with the latest lottery jackpot information\n. view results\n\nAlso supporting Lao and English languages.\n\nThe app is FREE and available for download on any of your iOS devices, iOS 10+!",
  "genres": [
   "News",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2017-02-17T23:16:46Z",
  "updated": "2018-10-13T21:00:00Z",
  "releaseNotes": "• various internal bug fixes",
  "version": "1.0.7",
  "price": 0,
  "developer": "Lime Studio LLC",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.kuizu.ios",
  "title": "QuizNuts - Pub Quiz for Prizes",
  "description": "Welcome to the Quiz Nuts app! Guess or know the correct answers to 15 questions and enter the weekly competition for real prizes. Quiz Nuts is a simple, fast and free quiz game for everyone. We’ve had a fresh lick of paint, brushed away the cob webs and rebranded from Kuizu to Quiz Nuts. As well as our shiny new logo we’ve also partnered with the amazing team at Planet Offers (Part of Bauer Radio) to deliver our players more chances to win, a larger variety of prizes, discounts and rewards as well as delivering some exciting new features to enjoy.\n \nNow you can create your own leagues with friends, family or colleagues, join the master league table feature to compete with TV Egghead \"Tremendous Knowledge\", Dave Rainford, and World Quiz Champion Olav Bjortomt for additional prizes and rewards.\n \nPlay Quizzes, win prizes!\nWinning has never been that easy. With Quiz Nuts you can choose from 8 different trivia categories and prove your knowledge in quick rounds of 15 questions.\n \nGeneral Knowledge\nGeography\nSports\nMusic\nArt & Literature\nHistory\nEntertainment\nScience & Nature\n \nEvery week you can select up to 8 different prizes to compete for. Guessing most of the answers correctly grants you a ticket to enter the weekly prize draw. The more quiz categories you complete, the higher is your chance to be one of our lucky weekly winners.\n \nTrivia has never been more fun!\n \n* * * * *\n“Great quiz game! Lots of fun, challenging questions and free prizes! What isn't there to love about Kuizu”\n \n* * * * *\n“Great app with great prizes”\n \n* * * * *\n“Great game. A good variety of questions, really eye catching and easy to use. Excellent, fun way to pass the time”\n \nQuiz Nuts Key features:\n- Play Quizzes and answer questions from up to 8 question categories (General Knowledge, Arts and Literature, Music, Science, Geography, Sports, Entertainment, History)\n- Guess 80% or more correct answers to join the weekly prize draw\n- Choose the prize you want to win\n- Each trivia category can be played twice per day\n- Come back every day to increase your winning chance\n- 8 amazing new prizes every week\n- Create friends/family/colleagues leader boards to show off your quizzing prowess\n \nSo what are you waiting for? The questions won’t answer themselves! Join Quiz Nuts today - The free Quiz Game now and become one of our lucky winners!\n \nApple is not involved in any way with the contest for a prize.",
  "genres": [
   "Games",
   "Lifestyle",
   "Puzzle",
   "Trivia"
  ],
  "contentRating": "17+",
  "released": "2018-07-28T22:49:45Z",
  "updated": "2020-03-17T15:49:19Z",
  "releaseNotes": "-We have made some improvements to the invite friends areas of the app to hopefully simplify this experience.\n-General bug fixing",
  "version": "2.3",
  "price": 0,
  "developer": "NDT2017 Limited",
  "score": 4.54037,
  "reviews": 161,
  "currentVersionScore": 4.54037,
  "currentVersionReviews": 161,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.superant.doublehitcasino",
  "title": "Double Hit Casino: Vegas Slots",
  "description": "Double the payouts, double the thrill in DoubleHit Casino! Enjoy ultimate casino experiences in the top free mobile slot machines game for iPhone & iPad! Start to spin the reels anytime and anywhere with the biggest welcome bonus 2,000,000 FREE coins!\n\nExplore the real Vegas styled slot machines and play to win! Time to invite all your Facebook friends to join for a fun social casino video slots adventure like you never have before.\n\nChoose your favorite slot games varies from Classic to the latest unique one! \n• Spin over 40 FREE machines\n• Constantly delivery new contents and new machines\n• All slots unlocked! No level-based restriction in our game\n• STUNNING Slots graphics and animations!\n\nHIt the biggest wins with: \n• Incredible PAYOUTS for the most addictive Casino Slot Machine Games! \n• HOURLY and DAILY bonuses are rewarded frequently! \n• Exclusive weekly DEALS and GIFTS! \n• Interesting festival themed Events and BONUSES!\n\nGet social for a better online casino game experience \n• Invite all your friends on Facebook to play free slots together. \n• Participate in tournaments with your FRIENDS! \n• Earn and exchange FREE casino coins with our vibrant community!\n\nGet more FREE coins, latest events, and bonuses from our facebook social media at https://www.facebook.com/doublehitcasino/ \n\nWhat’s the hold-up? Double the fun and winnings NOW! \n\n--------------------------------\nOur official website: http://www.me2zen.com/\n\nPrivacy Policy: \nhttp://www.me2zen.com/privacypolicy.html\n\nTerms of Service:\nhttp://www.me2zen.com/termsofservice.html\n\nDoubleHit Casino is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-11-18T17:03:59Z",
  "updated": "2020-04-07T03:46:34Z",
  "releaseNotes": "Easter is coming! We have various Easter events waiting for you!\nAlso, we brought you the newest slot game: Big Money Cash!\nIf you love our game, please leave us a review.",
  "version": "1.5.8",
  "price": 0,
  "developer": "ME2ZEN Limited",
  "score": 4.4188,
  "reviews": 117,
  "currentVersionScore": 4.4188,
  "currentVersionReviews": 117,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.igg.ios.casinodeluxebyigg",
  "title": "Casino Deluxe - Vegas Slots",
  "description": "Gamble on your favorite Slots in Casino Deluxe, the best free online Las Vegas Casino Slots game, and become a rich billionaire overnight! \n Experience the thrill and excitement of realistic Las Vegas casino action during your idle time! Featuring all-time casino favorites to gamble on, like Slots, Video Poker, Blackjack, Mahjong, Solitaire, Roulette, and more. This is the casino experience you’ll never forget! Why aren’t you betting yet? Gamble on Casino Deluxe - Vegas Slots for free now!\n \n GAME FEATURES\n ► An Entire Casino in One App!\n Can’t choose your favorite casino game? Do you prefer slots, card games, or roulette? Fret not! Casino Deluxe gives you the chance to gamble and WIN BIG in Slots, Blackjack, Texas Hold'Em Poker, Video Poker, Roulette, Bingo, Baccarat, Solitaire, and more for free! \n \n ►Exciting Slot Machines with Exclusive Feature Games!\n Featuring your favorite exclusive casino slots like the Lucky Volcano, Spooky Spinners, Jackpot Diamond, Zeus Wild, Buffalo Stampede, Rage of Sparta, and many more coming soon!\n \n ►Slots Tournament and Progressive Jackpots!\n Join real-time slots tournaments and compete online against the best players in the world for the rich grand prize! Try your hand at the slot machines and score the biggest dramatic win of the day by winning the progressive Jackpot!\n \n ►Live-Play Texas Hold'Em Poker with Other Players in Real Time!\n Get rich quick in Texas Hold'Em Poker, which offers different game modes like Classic, Sit and Go, and Shoot Out, and supports multi-table plays. Experience a true dramatic Vegas card table atmosphere for free during your idle time! Betting has never been so fancy!\n \n ►Great Card Games Straight from Vegas Tables!\n Besides Texas Hold'Em, Casino Deluxe offers other exciting classic card games like Blackjack, Solitaire, Video Poker, and the fancy Baccarat! Enjoy a rich casual experience, or bet big and bluff behind shades like the professionals! Hold your cards close to the vest, know when to fold them, and bet big when that perfect hand comes along!\n \n ►Social Gaming on the Go!\n Invite all your friends or make new ones in Casino Deluxe! Win bragging rights by sharing your best hands and biggest wins on social media, and show off your rich billionaire status. Enjoy bonus rewards by signing in daily. You’ll never play alone again! Unless you want to, of course! Offline gaming is also available!\n \n \n Download now and get ready for a grand and fancy blast! Don’t gamble with your fun on just any casino game. You’ll be betting on the sure thing with Casino Deluxe - Vegas Slots for free!\n \n Want an early advantage like tips and tricks? Like us on Facebook: https://www.facebook.com/CasinoDeluxeGlobal/\n \n This game is intended for an adult audience and does not offer real money gambling or any opportunity to win real money or prizes. Any success in social casino gaming is not indicative of future success at real money gambling.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-11-27T02:06:15Z",
  "updated": "2020-04-26T06:38:47Z",
  "releaseNotes": "Thanks for playing Casino Deluxe! We've fixed some bugs and enhanced the app performance for a more enjoyable gaming experience!",
  "version": "1.11.7",
  "price": 0,
  "developer": "IGG.COM",
  "score": 4.34999,
  "reviews": 100,
  "currentVersionScore": 4.34999,
  "currentVersionReviews": 100,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.leisureapps.lotterynews.sc",
  "title": "SC Lottery Results - South Carolina Lotto Results",
  "description": "Winning lottery results for the SC Lottery (also known as the South Carolina Lotto).\n\nGet the winning numbers for the SC Lottery. Results for each lottery game are updated every 5 minutes! You can save your favorite numbers, receive push notifications, or search past results! \n\nThe app is very simple and easy to use. So if you are a lottery player - download this app now and get the winning numbers!\n\nCurrent lottery games include:\n\nMega Millions\nPowerball\nLucky For Life\nPalmetto Cash 5\nPick 4 Midday\nPick 4 Evening\nPick 3 Midday\nPick 3 Evening",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2016-12-14T14:37:15Z",
  "updated": "2016-12-14T14:37:15Z",
  "version": "1.0",
  "price": 0,
  "developer": "Leisure Apps",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.toystudio.casinotower",
  "title": "Casino Tower™ - Slot Machines",
  "description": "Play the next big thing in slots and download Casino Tower today for Free!\n\nWin big playing loads of unique slots, each with distinct bonus games! Easy to play, even easier to WIN! With slots added regularly there's always something new in Casino Tower.\n\nGreat graphics, Exhilarating sounds, and Detailed bonus games. Including Multiple slot types - All insure you'll feel just like you're in Vegas!\n\nPlayer's Love Casino Tower because:\n* New Slot Games added regularly!\n* Unique and quality Bonus Games!\n* Many ways to unlock slots and climb higher in the tower!\n* Ability to play offline without a required internet connection!\n* Game Center Achievements and Leaderboards!\n* Limitless ways to WIN coins!\n\nReach the top of the CASINO TOWER and become the greatest player of ALL! Download for FREE today!\n\n* This app is for entertainment purposes only!\n\n* No real money or any other real world goods and/or services can be won in this game!\nThis game uses virtual units called \"Coins\" to play the game. You can purchase additional credit-packs for real money via the \"Buy\" popup. These credits bought or won cannot be changed back to real money and cashed out, transferred, redeemed or collected in any other way or changed back to any other real world goods and/or services. Once purchased or won, the credits can only be used to play this game.\n\n* This app does not reflect the actual game play of any casino-, online- or other electronic gaming machine. The payout percentages, odds, payout methods and other features on our for-fun, entertainment only slots are higher/better/different than slot machines in regular/online casinos. You should not expect similar results!\n\n* The developer of this app takes no responsibility or liability with regards to the legal requirements to use this app in the relevant jurisdiction the player is resident and plays the game, and therefore the use of this app is the sole responsibility of the player.\n\n* The player agrees that he/she will comply fully with all applicable laws, regulations, statutes and ordinances which are applicable to use this app.\n\n* Only play this game if you have reached the respective legal age required in your country of residence. If so, play responsibly!\n\nPowered by the Starling Framework.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2014-05-01T22:33:59Z",
  "updated": "2018-11-02T18:03:32Z",
  "releaseNotes": "- General Performance Updates and Bug Fixes",
  "version": "4.6.0",
  "price": 0,
  "developer": "Toy Studio LLC",
  "score": 4.68627,
  "reviews": 51,
  "currentVersionScore": 4.68627,
  "currentVersionReviews": 51,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.limestudio.lottery.thailand",
  "title": "Thai National Lottery",
  "description": "Play the biggest lottery in Thailand from the palm of your hand!\n\nNever Miss a Jackpot!\n\nThe lottery app makes it quick and easy to:\n. check your numbers \n. keep up to date with the latest lottery jackpot information\n. view results\n. and watch the official video stream directly from the national TV channel\nanytime & anywhere!\n\nAlso supporting Thai and English languages.\n\nThe app is FREE and available for download on any of your iOS devices, iOS 9+!",
  "genres": [
   "News",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-04-21T06:48:48Z",
  "updated": "2020-03-18T00:41:08Z",
  "releaseNotes": "* general translation fixes",
  "version": "1.0.27",
  "price": 0,
  "developer": "Lime Studio LLC",
  "score": 4,
  "reviews": 4,
  "currentVersionScore": 4,
  "currentVersionReviews": 4,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.blackcircleapps.tropicalbingo",
  "title": "BINGO! Tropical Beach World",
  "description": "Welcome to the Bingo heaven for all those who love bingo, and willing to relax playing your favorite game with nice environmental paradisiac islands. Play & explore our several rooms and enjoy offline or online modes, so you’ll be able to play every time and everywhere. Play Loteria bingo tournaments with other players around the world and have unlimited hours of fun with the classic bingo rules and many other new modalities to discover. Try our quick & friendly interface integrated into our online bingo; you’ll never suffer delays anymore! Enjoy a real bingo experience in the multiplayer bingo challenges, stay sharp and don’t miss a number! Try also the new bingo slots mix, where you’ll find the best of the Vegas world combined in just one app!\n\nBe ready for a Tropical Paradise Island Bingo Party! Enter to the world of bingo maniacs and begin to win amazing prizes! Download NOW Tropical Island Bingo World for Free!!!\n\nFeel the furor or all the live action in our videobingo mode, send gifts to your friends and invitations to participate in private parties you can setup. Challenge your family and discover who the real champion is! Have a bash with the intuitive in-game amenities, spin the daily wheel of fortune and earn amazing boosters to double your earnings each time you get a number! Try our free social bingo; our always growing community is always ready for playing 24/7. You’ll never skip a blitz action day! Change the colors & themes of your cards as you please, and unlock new amazing skins by earning medals and special achievements. Collect valuable items by making winning strikes. The more consecutive wins you manage to gather, the more rewards you’ll obtain! \n\n Feel the Paradisiac golden sun & be part of wild party bingo community! Join our weekly special events and climb our online leaderboards! Start playing NOW Tropical Island Bingo World for Free!!\n\n*** Features of the Game***\n\n- Absolutely FREE to play, no deposit required.\n- New Content in Our Updates\n- Play alone & with players around the world\n- Video Bingo Special Rooms\n- Super High Quality Graphics & Friendly UI\n\nBegin your superstar career while enjoying the relaxing beaches! Download NOW FREE Tropical Island Bingo World for a Short Period Only!\n\n### SUBSCRIPTION PRICING AND TERMS ### \n\nSubscription options:\n\nSunset Beach Club Week Membership offers $2.99 weekly subscription after 3-day free trial for unlocking all content, features and removing ads.\nSunset Beach Club Month Membership offers $8.99 monthly subscription after 3-day free trial for unlocking all content, features and removing ads.\nSunset Beach Club Year Membership offers $69.99 annual subscription after 3-day free trial for unlocking all content, features and removing ads.\nSunset Beach Club Month 50% discount Membership offers $4.49 monthly subscription without trial for unlocking all content, features and removing ads.\n\nEnd of trial and subscription renewal:\n\nThis price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.\n\nPayment will be charged to iTunes Account at confirmation of purchase.\nSubscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.\nAccount will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.\n\nSubscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.\nAny unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.\n\nPrivacy Policy: https://support.dynamicgames.net/portal/kb/articles/privacy-policy\nTerms of Use: https://support.dynamicgames.net/portal/kb/articles/dynamic-games-terms-of-use\n\nDynamic Games Ltd.\n4 Gershon Shatz st., Tel Aviv, Israel, 6701738",
  "genres": [
   "Games",
   "Board",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-01-17T16:16:39Z",
  "updated": "2020-04-30T21:20:10Z",
  "releaseNotes": "A lot of minor improvements for you to enjoy a perfect Bingo game experience!",
  "version": "7.2.6.0",
  "price": 0,
  "developer": "Dynamic Games Ltd",
  "score": 4.72518,
  "reviews": 564,
  "currentVersionScore": 4.72518,
  "currentVersionReviews": 564,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.sgn.bingoblingo",
  "title": "Bingo Blingo",
  "description": "Now you can Bingo wherever you go with Bingo Blingo by Rock You! Play in LIVE multiplayer Bingo tournaments with your friends and sync progress anywhere you play! FREE on iPhone, iPad, and iPod touch – you’ll be playing all day!\n\nThe hit Bingo game that took Facebook by storm is now in the palm of your hand! Team up with your friends and work together to earn more bonus rewards! Send and receive free gifts to watch your team soar to the top. Charged power ups give you the advantage to win big and unlock room after room of bling. Plus, come back every day to try your luck on the daily spinner and win free extras…just for playing!\n\n* PLAY live multiplayer bingo rounds against other players from around the globe \n* WIN tickets, coins and amazing collectable prizes \n* EARN fantastic rewards just for playing every day \n* COMPETE in free daily tournaments\n* EXPLORE many different exotic jewel-themed bingo rooms \n* UNITE with your Facebook friends for even more prizes and rewards \n* ENJOY the world's best bingo game... today!! \n\nDon't just take our word for it. Here's what our players are saying: \n\n\"This is my favorite bingo game because I like all the power-ups, especially the Instant Win, because I like to win!\" ~ Katherine, Idaho USA \n\n\"Brilliant game! You've got me hooked and I can't stop playing!\" ~ Dana, Brighton UK \n\n\"Only two achievements left until I finish my Emerald room blingo! Virtual drinks for all my new bingo friends when I make it, lol :)\" ~ Robin, Chicago USA \n\nFacebook: www.facebook.com/BingoBlingo \nTwitter: @bingoblingo\nSupport: http://bingo-blingo.com\nPrivacy: http://bingo-blingo.com/privacypolicy",
  "genres": [
   "Games",
   "Board",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-08-02T12:27:00Z",
  "updated": "2018-11-06T04:56:16Z",
  "releaseNotes": "Bugfixes for Facebook login.",
  "version": "3.9.5",
  "price": 0,
  "developer": "The Games Platform Company",
  "score": 2.04,
  "reviews": 25,
  "currentVersionScore": 2.04,
  "currentVersionReviews": 25,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.leisureapps.lotterynews.nc",
  "title": "NC Lotto Results - Lottery Results",
  "description": "Get the winning lottery numbers for the NC Lottery (also known as the North Carolina Lottery). Results for each game are updated every 5 minutes! You can see hot and cold numbers, get smart picks, see frequency reports, know how many people have won each game, and receive push notifications, or search past results! The app is very simple and easy to use. So if you are a lottery player - download this app now and get the winning numbers!\nCurrent lottery games include:\n\nMega Millions\nPowerball\nCash 5\nAll or Nothing Day\nAll or Nothing Evening\nPick 4 Day\nPick 4 Evening\nPick 3 Day\nPick 3 Evening",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2016-12-14T00:22:15Z",
  "updated": "2016-12-14T00:22:15Z",
  "version": "1.0",
  "price": 0,
  "developer": "Leisure Apps",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "app.dpdpdp.bingocity",
  "title": "Bingo City 75: Bingo & Slots",
  "description": "Bingo City is a famous online bingo, Vegas SLOT and Video poker games for mobile and tablets. Play FREE BINGO and SLOT game and meet with players worldwide. Our 75 Ball Rooms offer everything any Bingo lover could ask for! \n\nYou'll find Huge Jackpots, tons of BONUS, gorgeous graphics and all day FREE Bingo. \n\nIt is very EASY TO PLAY. As each number is called, find and match numbers on your card and click it. \n\nIf your card matches for the pattern correctly, just call BINGO. \n\nBe careful! If you call Bingo 2 times incorrectly, you will lose your card. \n\nAfter the first player calls bingo, there will be 5 extra balls drawn to give everyone else a chance to get bingo. \n\n※Tips : You don't need to mark the number on your card to call bingo. \nIt helps you to make sure of the called number. \n\n※ You can on/off AUTO DAUB (Hint)",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Board"
  ],
  "contentRating": "17+",
  "released": "2011-03-24T00:33:20Z",
  "updated": "2020-04-27T01:38:07Z",
  "releaseNotes": "Thanks for using Bing75! To make our app better for you, we bring updates to the App Store regularly.\nEvery update of our Bing75 app includes improvements for speed and reliability. As new features become available, we’ll highlight those for you in the app.",
  "version": "12.50",
  "price": 0,
  "developer": "Fungrep Co.,Ltd",
  "score": 4.34177,
  "reviews": 237,
  "currentVersionScore": 4.34177,
  "currentVersionReviews": 237,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.aemobile.game.bingoholiday",
  "title": "Bingo Holiday - BINGO Games",
  "description": "Welcome to Bingo Holiday: the BEST Classic & Special Bingo games on iOS! 30+ Rooms, Multi Card Play, Epic Collections, Hourly FREE Credits! Amazing! Travel, Bingo, Send and receive gifts with friends! Let's Play Bingo and enjoy never-ending fun anywhere, anytime! FREE download & GO!\n\nOur AWESOME Features:\n\n*** EPIC POWER UPS ***\nTry your luck with the unique power ups: Daub Hint, Shield, Triple Free, Instant Bingo, Bombs, Double EXP, Flash Cooling...Use Power ups to win more Bingos!\n\n*** TRADITIONAL BINGO 75 ***\nPlay classic bingo games to have a fantastic exploration of World Tour with 20+ famous cities! Can’t wait to fly around the world and catch hold of the city scenery!\n\n*** SPECIAL BINGO STYLES ***\nMultiple Unique Bingo Styles bring you varieties of game plays! Constantly updated Super Bingo rooms are of great fun!\n\n*** THRILLING TOURNAMENT ***\nPlay with friends and compete with thousands of real-time multiplayers in the tournament, get thrills of the ranking entertainment! Collect tournament puzzle items to compose your Super Crown!\n\n*** MYSTERY PRECIOUS COLLECTIONS ***\nTravel the world and find mystery Collection items! Accomplish the epic collections with a lot of fun! Two ways to earn your exclusive collectables either from shadow cards or puzzle pieces.\n\n*** UNPRECEDENTED FREEBIES ***\nSign in every day to collect your daily bonus and HOURLY freebies! Challenge with global players to win more bingo credits!\n\n*** SOCIAL FRIENDS SYSTEM ***\nSharing is caring! Log in with your Facebook account, send and receive the gifts & collections with your friends! \n\nBingo Elite subscription\n\n-You can subscribe for new monthly updates for $12.99 USD every month\n-All prices are subject to change without notification. We occasionally run promotion prices as incentives or limited time opportunities for qualifying purchases made during the promotional time period. Due to the time sensitive and promotional nature of these events, we are unable to offer price protection or retroactive discounts or refunds for previous purchases in the event of a price reduction or promotional offering.\n-Payment will be charged to iTunes Account at confirmation of purchase\n-Subscription automatically renews for the same price and duration period as the original package unless auto-renew is turned off at least 24-hours before the end of the current period\n-Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the monthly package\n-Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase\n-No cancellation of the current subscription is allowed during active subscription period\n-You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must he done 24 hours before the end of the the subscription period to avoid being charged. Please visit http://support.apple.com/kb/ht4098 for more information. You may turn off the auto-renewal of your subscription via your iTunes Account Settings. \n-Any unused portion of a free-trial period, will be forfeited when the user purchases a Bingo Elite subscription\n\n* Links to our Terms of Service and Privacy Policy can be found below\nPrivacy Policy: http://www.bingoholiday.xyz/privacy.html\nTerms of Use: http://www.bingoholiday.xyz/termsofuse.html\n\n* Prices are equal to the value that \"Apple's App Store Pricing Matrix\" determines as the equivalent of the subscription price in $ USD.\n\nThe games are intended for an adult audience. The game does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at real money gambling.\n\nWe would love to hear from you! You can reach us at: customer.support@bingoholiday.xyz\n\nAlready a big fan of Bingo Holiday? Like us on Facebook!\nhttp://www.facebook.com/bingoholiday",
  "genres": [
   "Games",
   "Board",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-07-05T01:46:11Z",
  "updated": "2020-04-22T01:41:56Z",
  "releaseNotes": "Enjoy your Bingo at home!\n1.New Honor Collectibles -- Diamond, Legend, Supreme Scepters are added in the tournament! Win up to 300% scores now!\n2.Do you know how to turn on/off the Auto Daub and Daub Hint? We have a more detailed guide now.\n3.Background music has been upgraded. It's more relaxing and suitable for a journey now!\n4.Bug fixed and game optimized on connection issue.",
  "version": "1.9.23",
  "price": 0,
  "developer": "AE Mobile",
  "score": 4.63711,
  "reviews": 1816,
  "currentVersionScore": 4.63711,
  "currentVersionReviews": 1816,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.alottery.california",
  "title": "California Lottery",
  "description": "Get the latest California lottery results within minutes of the draws taking place. This easy-to-use app includes the following lotteries:\n\n- Powerball\n- Mega Millions\n- SuperLotto Plus\n- Fantasy 5\n- Daily 4\n- Daily 3\n- Daily Derby\n\nPowerball, Mega Millions and SuperLotto Plus also include a full breakdown displaying the number of winners and amount paid out for each prize level.                                                  \n\n\nThe following features are also included:\n\n\nTicket Checker\n----------------------------\nEnter and save your chosen numbers to see if you have won or to see how often they have come up in the past. You can also label your tickets – great if you play multiple lines or if you run a syndicate. The ticket checker also highlights prizes won on each ticket as well as calculating the total for each lottery. Only play lotteries on certain days of the week? Not a problem, you can exclude your checked tickets from draws you do not play.\n\n\nCustomizable Notifications\n----------------------------\nGet notified instantly when the latest lottery results and prize breakdowns become available. The App allows you to customise notifications for specific lottery games and you can also choose which days of the week you play. Want to know when the jackpot has rolled over or has reached a certain amount? Just head to the Notification section of the app to set up your alerts. There is also the option to set notifications at times that suit you - great for reminding you to purchase tickets before the draw.\n\n\nRandom Number Generator\n-----------------------------\nStuck for numbers? Use this handy tool and let the app choose your numbers rather than having to rely on house numbers and anniversary dates!\n\n\nResults Archive\n----------------------------\nAccess to the full archive of results dating back to the first draw of each lottery.\n\n\nSettings\n----------------------------\nCustomise which lotteries display in the app and in which order.\n\n\nSupport\n----------------------------\nIf you have any feedback or suggestions on how we can improve this app, please get in touch at contact@lottery.net.",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2011-03-17T01:13:52Z",
  "updated": "2020-01-16T12:02:18Z",
  "releaseNotes": "This version includes bug fixes and performance improvements.",
  "version": "3.0.1",
  "price": 0,
  "developer": "The Lottery Company",
  "score": 5,
  "reviews": 5,
  "currentVersionScore": 5,
  "currentVersionReviews": 5,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.saavro.idlotto",
  "title": "ID Lottery Results",
  "description": "View all the Idaho lottery draw game results without needing to navigate multiple screens.  Up-to-date results for:\n\n * Powerball\n * Mega Millions\n * Weekly Grand\n * Idaho Cash\n * Lotto America\n * Lucky for Life\n * Pick 3\n\nAdditional features include:\n * Generate Quick Picks\n * View results history\n * Payouts for select games\n * Frequency charts",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2019-04-05T00:29:05Z",
  "updated": "2020-03-16T13:36:59Z",
  "releaseNotes": "Fix connectivity issues",
  "version": "1.0.3",
  "price": 0,
  "developer": "Matthew SAAVEDRA",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.leisureapps.lotterynews.ny",
  "title": "Lottery Results NY",
  "description": "New York Lottery results (NY Lotto). Every game is available and results are updated every 10 minutes. Always accurate and fast.\n\nTons of features:\n- Search past lottery results and specific dates\n- Lottery game statistics, including hot and cold numbers and frequency of numbers.\n- Lottery news and updates\n- Alerts for your favorite lotto games\n\nCurrent games listed for NY Lottery:\n\nMega Millions\nPowerball\nNew York Lotto\nPick 10\nCash4Life\nTake 5\nWin 4 Midday\nWin 4 Evening\nNumbers Midday\nNumbers Evening",
  "genres": [
   "News",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-11-04T01:23:51Z",
  "updated": "2016-11-04T01:23:51Z",
  "version": "1.0",
  "price": 0,
  "developer": "Leisure Apps",
  "score": 3,
  "reviews": 1,
  "currentVersionScore": 3,
  "currentVersionReviews": 1,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.huuuge.casino.texas",
  "title": "Billionaire Casino Slots 777",
  "description": "The Billionaire welcomes you to his Casino with the best slots! Put on your top hat, and go on a quest to become one (a Billionaire, not a casino) yourself! This definitive casino experience guarantees insane amounts of fun and allows you to win incredible prizes! Whether you want to join your friends in a club, or play solo, we’re sure that you will enjoy yourself playing our selection of Casino games, with over 100 SLOTS, AS WELL AS POKER, BACCARAT, ROULETTE and many other games! Download Billionaire Casino™ now!\n\nTHE MOST FUN SLOTS & CASINO GAMES\n\nVegas at your fingertips! With incredible graphics and some of the coolest twists, our slots offer a unique experience!\n\nHit a guaranteed Jackpot every time you get a Bonus Game in Phoenix Garden!\nPlay Huuuge Quick Jackpots – the quickest way to win big prizes!\nHit big wins with the help of the legendary Helen of Troy!\nGo wild with amazing special symbols in Jade Gem Goddess 2!\nVisit King Arthur’s court and win big in Camelot Cash!\n\n\nTHE BIGGEST JACKPOT OF THEM ALL!\n\nCome and start spinning on HUUUGE LINK – a set of four Slots that share a truly HUUUGE Grand Jackpot to see how easy it is to win massive Jackpots in no time! \n\nA SOCIAL EXPERIENCE\n\nCreate a club with your friends, or join one and meet new people while playing slot machines! Compete with other clubs in Leagues and get massive rewards for helping out your fellow members!\n\n- Join your friends in a Club, or create a Club of your own\n- Meet awesome new people and spin together\n- Win awesome rewards for your dedication\n- Spin your Club to Masters League glory!\n\n\nBECOME A BILLIONAIRE\n\nNothing is impossible in Billionaire Casino™, which offers a collection of amazing casino games on top of Slots:\n\n- Video Poker: A classic way to have massive fun! Choose your favorite variant among a collection of fun variants such as Jacks or Better, Deuces Wild, Bonus Poker Deluxe and Double Bonus Poker Triple Double Bonus Poker,\n- Sit’n’Go Hold’em: Bet, bluff and win your way into massive prizes playing Texas Hold’em in our Sit’n’Go Tournaments! Are you all in?\n-  Roulette: Join various tables inspired by famous casino cities, from Vegas to Macau, place your bets and spin the wheel for some Huuuge Wins!\n- Baccarat: A game for those of you who love the true classics. With a selection of tables that will offer everyone a bet for their level, who do you think will win, the player or the dealer?\n-  Blackjack: Will you hit on a hard 15, or will you stay? Hitting 21 has never been this fun!\n-  The Lottery: Get Lottery Tickets by leveling up and win up to 3 Billion Chips by collecting all the required puzzle pieces! \n\n\nAWESOME BONUSES\nThat’s not all! You can win big with our collection of great bonuses:\n- Get the Billy Bonus in the Lobby every 15 minutes!\n- Visit the Shop every day to collect an additional bonus!\n\n\nWhat are you waiting for? Download Billionaire Casino™ now and start spinning the reels on our slots, hitting Wilds, getting Respins and winning Jackpots!\n\n\nSUPPORT & HELP:\n\nIf you need help or support, please contact us at support@huuugegames.com\n\nThe Best Casino, Slots Games and Slot Machines are produced for you by Huuuge™\n\n► The game is intended for a mature audience.\n► The game does not offer real money gambling or an opportunity to win real money or real prizes.\n► Wins made while gambling in social casino games can't be exchanged into real money or real rewards.\n► Past success at social casino gambling has no relationship to future success in real money gambling.\n\nRead our Terms of Use (www.huuugegames.com/terms-of-use), Privacy Policy (www.huuugegames.com/privacy-policy) and other important information.\n\nOur games are for entertainment only. All points in the game stay in the game and all game points have no cash value. Although in-game currency can be purchased for real money or won during gameplay, none of the items in the game have any cash value. Our games are intended for adult audiences only.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-10-20T09:54:23Z",
  "updated": "2020-04-27T09:01:21Z",
  "releaseNotes": "Hey, Spinners!\nWe've got a new update for Billionaire Casino. Read the below to see what changes you can expect!\nAs always, we're constantly working to improve the game experience for you. We've added minor tweaks and other bug fixes so you can feel even right at home while spinning!\nSee you at the Casino! Enjoy spinning and win big!\nLet's play together and #StayHuuuge!",
  "version": "5.3.1850",
  "price": 0,
  "developer": "Huuuge Games Sp. z o.o.",
  "score": 4.17896,
  "reviews": 1207,
  "currentVersionScore": 4.17896,
  "currentVersionReviews": 1207,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.leisureapps.lotterynews.dc",
  "title": "DC Lottery Results - DC Lotto",
  "description": "Get the winning lottery numbers for the DC Lottery (also known as the DC Lotto). \n\nResults for each lottery game are updated every 5 minutes! You can view game winners, see frequency chart, hot and cold numbers, receive push notifications, or search past results! \n\nThe app  is very simple and easy to use. So if you are a lottery player - download this app now and get the winning numbers!\n\n\nCurrent DC Lottery games include:\n\nMega Millions\nPowerball\nHot Lotto\nLuck For Life\nDC 5 Midday\nDC 5 Evening\nDC 4 Midday\nDC 4 Evening\nDC 3 Midday\nDC 3 Evening",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2016-12-14T22:20:27Z",
  "updated": "2016-12-14T22:20:27Z",
  "version": "1.0",
  "price": 0,
  "developer": "Leisure Apps",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "net.peakgames.SpadesPlus",
  "title": "Spades Plus - Card Game",
  "description": "Let’s join the LARGEST SPADES COMMUNITY in the world to play with millions of online players!\n\nSpades Plus offers you a great experience against many Spades players from all around the world!  You can play in many different game modes such as Classic, Solo, Mirror and Whiz. \n\nNow playing Spades is much better with Tournaments, Knock-Out and many other different modes!\n\nSpades is one of the traditional trick-taking card games like Bid Whist, Hearts, Euchre & Canasta, but this game is played in pairs in which spades is always the trump. \n\n==SPADES PLUS FEATURES==\n\n● FREE COINS\nGet 20,000 Free Coins as a “Welcome Bonus”, and get even more coins by collecting your “Daily Bonus” every day!\n\n● DIFFERENT MODES\nPlay Spades however you want!\n\nCLASSIC:  Make your bid with your partner and challenge other teams  \nVIP:  Play the classic Partnership Spades in custom Tables\nSOLO:  There is no partnership.  Each player gets his/her own points\nMIRROR:  You bid the number of your Spades Cards in your hand\nWHIZ:  You can bid “NIL” or the number of your Spades Cards in your hand   \n\n● TOURNAMENTS & CHALLENGES\nWin the 16 player-Tournament or Knock-Out Challenge to get amazing prizes!\n\n● GREAT SOCIAL EXPERIENCE\nMeet new people and add them as friends to be their best partner or challenge them in games!\nUse Public or Private Chat to stay in touch with other players.\n\n● CREATE YOUR OWN TABLES\nYou can create tables in different modes.  Choose your “Game Rule” type, set the “Bet Amount” and the “Final Point” or decide if there will be “Nil”, “Blind Nil” or “Chat” options.  If you don’t want to be found, create your own “Private Table” where games are “Invite Only”.\n\n● GET NEW DECKS\nJoin the seasonal competitions to get new deck designs.  Show your new decks to other users while playing against them!\n\n\nAdditional information:\n\n*Make sure you have a good internet connection to get the best experience.\n*The game is free to play; however, in-app purchases are available for additional content and in-game currency. In-app purchases range from $0.99 to $99.99 USD.\n*Use of this application is governed by Zynga’s Terms of Service, found at www.zynga.com/legal/terms-of-service.\n\nSpades Plus has monthly Subscriptions that allow you unlock Emoji, Table Colors and Remaining Cards features unlimited and get additional game currencies every day.\n\nPrices are in United States dollars and will be converted to the local currency or your country of residence. Pricing and other subscription details are subject to change upon prior notice by Zynga. \n\nAccount will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.  Additionally, auto-renewals may be turned off in your Device Settings after purchase. Your iTunes Account will be charged when the purchase is confirmed. Refunds will not be provided for the unused portion of any term.\n\n\n©2017 Zynga Inc.",
  "genres": [
   "Games",
   "Card",
   "Board"
  ],
  "contentRating": "17+",
  "released": "2014-05-19T17:21:04Z",
  "updated": "2020-04-14T14:24:22Z",
  "releaseNotes": "Performance improvements",
  "version": "4.30.0",
  "price": 0,
  "developer": "Zynga Inc.",
  "score": 4.68492,
  "reviews": 365,
  "currentVersionScore": 4.68492,
  "currentVersionReviews": 365,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.tinyhandsapps.lotto01",
  "title": "First words kids learn to read",
  "description": "*** Fun educational game for toddlers of age 1.5 and up \n*** English voice over – Learn first words\n*** Developed with certified child psychologists \n*** 10 beautiful mini-game boards \n\nAbout the game: \n----------------- \n\"TinyHands Lotto\" is an educational game for children of age 1.5 and up. \nThe game consists of 10 boards, each focused on a different theme from the child's world such as shapes, colors, clothes, animals and vehicles. \n\nThe game is designed to enhance the following: \n- Hand-eye coordination \n- Concentration \n- Categorization \n- Visual perception \n- Vocabulary \n\nGame Boards: \n-------------------- \nThe game consists of 10 beautiful boards organized in a book like structure with big colourful buttons. This unique structure allows the toddler to easily navigate between the different boards and play independently. The boards were CAREFULLY CHOSEN in order to represent basic concepts from the child's world. \n\nTinyHands Games:\n \nTinyHands Sorting Series\nA set of sorting games designed to help children acquire basic concepts such as shape, color, size seasons and animals. Game boards are organized in an ascending difficulty level starting from basic sorting followed by more complex context based sorting and classification environments.\n\nTinyHands Towers Series\nA set of stacking games. The game is designed to help children acquire basic concepts such as: big VS. small, before VS. after, and bottom VS. top. Game boards are organized in an ascending difficulty level.\n\nTinyHands What's My Pair Series\nA series of three pair matching games. The game challenges the child to match pairs, initially based on visual aspects alone and in more advanced screens based on logic and understanding of card content.\n\nTinyHands First Words Series\nA set of vocabulary games for children of age 1.5 and up.\nThe game consists of 10 boards, each focused on a different theme from the child's world such as shapes, colors, clothes, animals and vehicles.\n\nTinyHands Raccoon TreeHouse\nThis game is intended for toddlers aged 3+. The game presents 12 boards each focused on developing a set of basic concepts such as size, colors, numbers and patterns using everyday objects from the child's world such as clothes, food and many more.\n\nTinyHands Town Center\nEducational game recommended for age 3+. This game includes 10 beautiful boards each focused on developing a set of basic concepts such as size, colors, numbers and patterns using everyday objects from the child's world such as clothes, food and many more.\n\nTinyHands Connect The Dots\nThe game consists of 12 mini game boards each presents a beautiful and magical scene. Each board contains several parts. The parts can be completed by connecting the numbered dots in a specific order. Upon completion, each part is dragged to gradually build an object. When all parts are drawn the scene is magically created and revealed. Designed for children aged 3+.\n\nNote for parents:\nLike all our games, this game is designed to provide quality playtime for parents and children together. Playing along with your children is highly recommended and will surely make them benefit the most from this app and help them expand their vocabulary.\n\nWe are sure that your children will enjoy this exciting educational game that will encourage their thinking and contribute to the development of their basic skills.\n\nAbout the Team: \nWe believe that children learn best through playing. We teamed up with certified child psychologists and experienced educators out of desire to create fun games that will help our children acquire new concepts and improve their skills. In addition, we design our games to provide quality playtime for parents and children together.",
  "genres": [
   "Education",
   "Games",
   "Family",
   "Puzzle"
  ],
  "contentRating": "4+",
  "released": "2013-07-30T12:05:55Z",
  "updated": "2018-07-06T16:41:38Z",
  "releaseNotes": "- New hand-drawn mini-game boards designed with qualified child psychologists\n- A variety of new objects and themes, including shapes, colors, animals, and more!\n- Improved learning environment to facilitate visual perception and hand-eye coordination\n- Your feedback is important to us. Leave us a review! Having trouble? Send us an email at tinyhandsapps@gmail.com",
  "version": "2.5.1",
  "price": 0,
  "developer": "Kids Academy Co apps: Preschool & Kindergarten Learning Kids Games, Educational Books, Free Songs",
  "score": 3.80645,
  "reviews": 31,
  "currentVersionScore": 3.80645,
  "currentVersionReviews": 31,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.lottomart.lottery.bet",
  "title": "Lottomart: Games & Lottery App",
  "description": "Lottomart is the UK’s favourite games and lottery destination. It’s no wonder we are creating such a buzz - Lottomart creates winners! Here are a few of our recent winners:\n\n \n‣ Daniel B. of Stoke-on-Trent won £137k with a Boosted lotto bet on Irish Lotto\n‣ Desiree D. of London won £31k with a Boosted lotto bet on Great British Jackpot\n‣ Danny O. of New Town won £16k with a Boosted lotto bet on Mini Lotto\n‣ Rachael T. of Bradford won £30k on a Cleoscratcha scratchcard\n‣ John D of Glasgow won £100k on Europe Millions Scratch \n\n \nLottomart is the home of Boost - the most exciting new way to bet the lottery where you “slide to decide” between bigger jackpots or more chances of winning. Our biggest lottery winners won because they Boosted their bets! Will you be next?\n \n6 Reasons you should join the thousands who play at Lottomart:\n \n‣ MASSIVE SELECTION OF CASINO GAMES - With over 100 video slots and the most popular table games you won’t be disappointed.\n‣ LOTTO JACKPOTS - Bet on the biggest jackpots worldwide for chances to win hundreds of millions in lotto jackpots every week!\n‣ EXCLUSIVE SCRATCH GAMES - Win up to £150,000 on our unique selection of BIG prize scratch cards.\n‣ SIMPLE, FUN, and EASY - The quickest and easiest app to use on the market. If you like lotto, scratch cards or casino games you’ll love Lottomart.\n‣ BOOST for more chances to win - This unique feature allows you to choose between bigger jackpots or more winning chances on any lotto draw.\n‣ INSTANT REWARDS - Earn diamonds with every purchase and use them to pay for lotto bets or play scratchcards.\n \nTry our casino games tab which includes:\n \n‣ LIVE Deal or No Deal\n‣ LIVE Monopoly\n‣ LIVE Blackjack & Roulette\n \n‣ European Blackjack\n‣ Roulette\n‣ American Roulette\n‣ Queen of the Crystal Rays\n‣ Lara Croft - Temples and Tombs\n‣ Thunderstruck II\n‣ Mega Moolah\n‣ Lucky Leprechaun\n‣ Immortal Romance\n‣ Medusa\n‣ Wild Cats\n‣ Royal Gems\n‣ Gold'orado\n‣ Jackpot Quest\n‣ Hot & Heavy\n‣ Wild Thirst\n‣ Agent Jane Blonde Returns\n‣ Gallantry\n‣ Flower Fortunes\n \nCheck out all our US, UK and Euro lotto jackpots:\n \n‣ Irish Lotto\n‣ Mega Millions\n‣ US Powerball\n‣ Europe Millions*\n‣ EuroJackpot\n‣ Cash4Life\n‣ Superenalotto & More...\n\nTry our instant win lottery scratch cards and win up to £150k. Scratchcard tickets price range from 10p to £3 per ticket.\n \n*Only The National Lottery app can sell tickets on the Euromillions. If you like the Euro Millions you will love this similar draw.\n \nDefault Welcome Offers (See promotions section in app for full promo eligibility)\n \n‣ Welcome offers are available only on your first purchase:\n---Casino match bonus up to £100 - 100% Deposit bonus\n---Lotto buy 1 get 1 free Offer + 10 additional games spins on purchase of either a lotto bet\n---10 free 5k scratchcards Offer + 10 additional games spins on purchase of any scratchcards.\n‣ Minimum purchase required to qualify for welcome offers. \n‣ Stake limits and game contribution limits apply \n‣ Consult terms within the app for full promotion terms and general terms.\n \nPromotional Terms and Conditions apply and we reserve the right to modify, extend, or suspend a promotion at any time. Please see the Promotions area within the app for current offers and details.\n \nYou must be 18 years of age or older to play at Lottomart.\n \nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact BeGambleAware.org at 0808 8020 133 or visit www.begambleaware.org.\n \nWe are licensed by the UK Gambling Commission (UKGC), license 000-051833-R-329042-001, issued 20 July 2018. Our jackpot prize payouts are covered by leading insurers to guarantee the payment of your jackpot winnings.",
  "genres": [
   "Entertainment",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2018-11-28T08:21:28Z",
  "updated": "2020-04-28T14:04:35Z",
  "releaseNotes": "- 14 New Red Tiger Daily Jackpot Games!\n- Bug Fixes",
  "version": "2.52",
  "price": 0,
  "developer": "Lottomart",
  "score": 4.38204,
  "reviews": 780,
  "currentVersionScore": 4.38204,
  "currentVersionReviews": 780,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.tatts-lottery-results",
  "title": "Tatts Lottery Results",
  "description": "All the Tatts lottery results and updates.\nWe all want to be millionaires and we all want to win the money, in order to accomplish this you actually need to buy a lottery ticket and than be informed about the results.\nBut there are still lots of questions. \nThere are many factors to considered and we will bring you all the latest relevant updates, lotteries results, explanations and offers.\n\nThis application Include:\n•   The latest lotteries updates and results updates.      \n•   Watch videos explaining what each lotto platform offers you.\n•   Never miss a good lotto draw with our lotto news reports.\n•   Read and watch comparisons between different lotteries.\n•   See reviews of different lotteries including rating on\n     customer service ,reliability and ease of fund withdrawal if       \n     you win.\n\nThis app will bring you the best updates and reports so you can choose wisely where to spend your money.\nHere you will understand the chances, advantages and disadvantages of each lottery and know about all the best lottery opportunities.\nThis is your ticket to success and with a bit of luck to an abundance of wealth.\nGoodluck.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-01-27T18:56:08Z",
  "updated": "2017-01-27T18:56:08Z",
  "version": "1.0",
  "price": 0,
  "developer": "David Lewis",
  "score": 1,
  "reviews": 1,
  "currentVersionScore": 1,
  "currentVersionReviews": 1,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.vegas.casino.slots.game",
  "title": "Vegas Casino Slots - Big Win",
  "description": "The most popular slot machine game in 2020! Spin in real Vegas Casino and Win Big with more than 30 slot machines. Lots of bonus and jackpots, just enjoy Vegas Casino Slots!\n\nNow you can play real Vegas casino slots on your phone instead of going to Vegas. Whenever and wherever FREE! What you need to do is just a single tap to download and spin! Then you can enjoy the excitement and win the jackpot. This slot game must be the best casino slots you have ever played. Huge jackpots, wild patterns, mysterious themes, and amazing graphics… This pop slot game is on FIRE! \n\nWhen you first login to Vegas Casino Slots, you could get 2,000,000 welcome bonuses. It helps you to play in your favorite slot machines and win big. Slot machines such as QUAKE FLASH ZEUS, CORNUCOPIA GOLD, PANDORA’S BOX, ALL SAINTS’ GIFTS, HAPPY HAPPY, GOLD MINER, GOLD OF WEALTH, BUFFALO BATTLE, RHINO RUSH, TROVE OF PEARL, PANDA, PAPER CUTTING, PRINCESS OF JAGUAR, BEER CARNIVAL, NIGHT OF THE WOLF, DESERT TREASURE, WILD GREEN, SEASCAPE DIVING, CHILI CHILI, FLAME TO HEAVEN, MYSTERY OF MAYA are waiting for you! Play this slot game and enjoy a real Las Vegas style casino slot! \n\nGame Features\n2,000,000 Free coins as welcome bonus for you.\nGrand jackpot in every slot machine waiting for you to win!\nFree coins in every 1 hour and each time level up in Vegas Casino Slots!\nHigh payout with lots of feature games such as FREE SPIN, HOLD & RESPIN, RESPIN, BONUS GAMES.\nAll slot machines unlocked. Just choose your favorite slots.\nConnect to Facebook to collect 500,000 free coins.\nSpin the wheel of fortune every day to get bonus.\nSpecial challenge for you every week. Enjoy it and get a big prize!\n\nThis product is intended for use by those 21 or older for amusement purposes only. Practice or success at social casino gaming does not imply future success at real money gambling. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n\nCONTACT US\nFacebook:\nhttps://www.facebook.com/vegascasinofreeslots\nContact Support: contact@triwingames.com\nFind out more at: http://www.triwingames.com/",
  "genres": [
   "Games",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2018-09-28T00:44:44Z",
  "updated": "2020-04-24T08:44:31Z",
  "releaseNotes": "New slot machine coming soon!\n-Minor bug fixed",
  "version": "1.0.42",
  "price": 0,
  "developer": "Triwin Inc.",
  "score": 4.79751,
  "reviews": 242,
  "currentVersionScore": 4.79751,
  "currentVersionReviews": 242,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.DesignWorksGaming.DiamondSky",
  "title": "Diamond Sky: Slots & Lottery",
  "description": "Welcome to the world of Diamond Sky Casino games, the fastest growing app for sloto games and  scratch off games! If you want one source for the best free to play classic slot games, scratch off games, VIP slots, 777 slots and free daily lottery, then look no further than Diamond Sky! Our casino is filled with amazing slot machine games from real casinos (both video slots and classic stepper slots) and free lottery ticket games to give you the graphics and sounds you love from classic Vegas casinos! With more games and more features than ever, you’ll enjoy bonus slots, jackpots, wilds, free spins, progressives, immersive videos and bonuses galore!\n\nDIAMOND SKY SLOTS FEATURES:\n• 175+ free to play classic slots, video slots and scratcher games! \n• New sloto games added every two weeks \n• Scratch off games - scratch and win coins!\n• Free Daily Lottery - play the lottery every day for a chance to win billions!\n• Up to 10,000,000 coins daily and even more for VIP Slot Players.\n• More ways to win: Daily Wheel Spins, Daily Bonus, Friends Bonus, 4-hour Bonuses, Free Daily Lottery, Gifting, Scratch Off Games and more!\n• VIP Slot Games with better bonuses, bigger wins and exclusive games!\n\nCLASSIC SLOTS - THE BEST 777 SLOTS:\n• Star Spangled Stacks\n• Triple Crown\n• Wild Shift\n• And more!\n\nTRIPLE DIAMOND FAN FAVORITES - OUR BEST SLOTO GAMES:\n• Diamonds Sapphires and Rubies\n• Cabaret Cash\n• Golden Grand\n• Petsburgh\n• Armadillo Artie\n• And more!\n\nSCRATCH OFF GAMES!\n• On the Hook\n• Golden Grand\n• 3X a Lady\n• JaXPot 7s\n• Fire Company 5\n• Blitz Bucks\n• Groundhog Pays\n\nVIP SLOTS - FOR THE HIGH ROLLERS\n• Komodo Dragon\n• Shifting Hearts\n• Ocean Riches\n• Golden Cheetah\n\nFREE DAILY LOTTERY\n• Get 10 chances each day in our free lottery!\n• Daily lottery drawings \n\nDownload our sloto game app today start enjoying the best free to play classic slots, scratch off games and free daily lottery right from your own phone or tablet! \n\nThis game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money prizes. Practice or success at social gambling does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-06-02T22:45:40Z",
  "updated": "2020-01-17T16:30:37Z",
  "releaseNotes": "Our first table game, Baccarat, is here for a limited time (starting 1/21) Download the latest version so you can access the latest games, features and deals! \nJOIN OUR COMMUNITY FOR SPECIAL OFFERS AND THE LATEST INFO! \nLike us on Facebook: www.facebook.com/DiamondSkyCasino",
  "version": "2.4.9",
  "price": 0,
  "developer": "Design Works Gaming",
  "score": 4.66308,
  "reviews": 279,
  "currentVersionScore": 4.66308,
  "currentVersionReviews": 279,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.huuuge.casino.slots",
  "title": "Huuuge Casino Slots Vegas 777",
  "description": "Join the world’s biggest casino community with SLOT MACHINES HUUUGE CASINO. Play the best slot casino, compete in leagues, join clubs and have great fun - Las Vegas style. SLOT MACHINES HUUUGE CASINO is the ultimate slot casino experience! SLOT MACHINES HUUUGE CASINO lets you play over 130 TOP SLOT CASINO MACHINES, SIT’N’GO HOLD’EM, BACCARAT, ROULETTE, VIDEO POKER and many other casino games! Download Slot Machines Huuuge Casino now - The #1 slot casino on mobile!\n\n\nPlay the best Slots on the market!\n\n\nSLOTS™ HUUUGE CASINO offers the best Slots in the world, from retro classics to modern slot machines, you’re sure to find something to fit your fancy!\n\n\nHuuuge Diamond Wins – Spin the Wheel of Wins to win billions of Chips.\nAztec 2: Eclipse – Discover the secret wins hidden in the Sun and Moon temples.\nRespin Ranch – Check out the richest animals and hit massive wins!\nCash Madness – Hit Huuuge Jackpots in this classic hit!\nBlaster Cats vs Aliens – Get up to 130 Spins… IN SPACE!\nBuffalo Rush – Your screen will shake from the massive wins you will hit!\n\n\nThe biggest Jackpot of them all!\nPlay HUUUGE LINK – a set of four Slots that share a truly HUUUGE Grand Jackpot to see how easy it is to win massive Jackpots in no time! Prepare to be amazed with the wonders of Ancient Egypt and China in this amazing Slot adventure.\n\n\nJoin a Club and compete in the Billionaire League!\n\n\nThe Billionaire League is an amazing place where you can play with your friends in order to compete for the best prizes and earn your bragging rights against the top spinners in the world!\n\n\nJoin your friends in a Club, or create a Club of your own\nMeet awesome new people and spin together\nWin awesome rewards for your dedication\nSpin your Club to Masters League glory.\n\n\nIt’s not just Slots\nHuuuge Casino offers way more than Slots! If you’re not a slot maniac, we have other casino games that we’re sure will give you that same winning thrill!\nVideo Poker – Awesome, engaging, with multiple variants\nSit’n’Go Hold’em – Play thrilling tournaments!\nRoulette –  Place your bets and win big!\nBaccarat –  Get some old school wins!\n\n\nAwesome Bonuses\nHuuuge Casino offers many ways to win big on top of the Slots!\nGet the Betty Bonus in the Lobby every 15 minutes!\nVisit the Shop every day to collect an additional bonus!\nPlay the Lottery to win up to ONE BILLION CHIPS!\nParticipate in Daily Giveaways on our Facebook page and via Push Notifications!\n\n\nRead our Terms of Use (www.huuugegames.com/terms-of-use), Privacy Policy (www.huuugegames.com/privacy-policy) and other important information.\n\n\nOur games are for entertainment only. All points in the game stay in the game and all game points have no cash value. Although in-game currency can be purchased for real money or won during gameplay, none of the items in the game have any cash value. Our games are intended for adult audiences only.\n\n\nThe game is intended for a mature audience.\nThe game does not offer real money gambling or an opportunity to win real money or real prizes.\nWins made while gambling in social casino games can't be exchanged into real money or real rewards.\nPast success at social casino gambling has no relationship to future success in real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2015-09-11T12:39:43Z",
  "updated": "2020-04-27T09:00:34Z",
  "releaseNotes": "Hey, Spinners!\nWe've got a new update for Huuuge Casino.\nAs always, we're constantly working to improve the game experience for you. We've added minor tweaks and other bug fixes so you can feel even right at home while spinning!\nSee you at the Casino! Enjoy spinning and win big!\nLet's play together and #StayHuuuge!",
  "version": "5.3.1850",
  "price": 0,
  "developer": "Huuuge Global Ltd.",
  "score": 4.01511,
  "reviews": 1521,
  "currentVersionScore": 4.01511,
  "currentVersionReviews": 1521,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.onlinecasinoreports.lottery",
  "title": "Get Your Lottery Tickets - It's All About Numbers",
  "description": "Download the OnlineCasinoReports Lottery Tickets app for FREE and stay updated with the latest and biggest jackpot draws all over the world. Receive real-time updated and detailed information about upcoming lottery draws and lottery results from the biggest games, including Mega Millions, EuroMillions, US Powerball, and more. \n\n-Features\n\nLottery Results\n\nReceive the lottery results instantly. Get the winning numbers and the drawing date. \n\nDiscover Lotteries \n\nGet all the required information about the lotteries featured in the app - this includes rules, how to plays, guides and tips - as well as important info like jackpots history, results, rollovers and more.\n\nPopular Lotteries\n\nEuroMillions\nUS Mega Millions\nUS Powerball\nUK National Lottery\nEuroMillions UK\nCanada Lotto 649\nIreland Lotto\nItaly SuperEnalotto\nEl Gordo\nOz Lotto\nSupport\n\nDon't miss your winning lottery ticket! Get the OnlineCasinoReports Lottery Tickets app for free now! A world of lottery at the palm of your hand.",
  "genres": [
   "Entertainment",
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-11-07T17:28:05Z",
  "updated": "2016-11-07T17:28:05Z",
  "version": "1.0",
  "price": 0,
  "developer": "Redsquare Services Ltd.",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.saavro.orlotto",
  "title": "OR Lottery Results",
  "description": "View all the Oregon lottery draw game results without needing to navigate multiple screens.  Up-to-date results for:\n\n * Powerball\n * Mega Millions\n * Lucky Lines\n * Megabucks\n * Pick 4\n * Win For Life\n\nAdditional features include:\n * Generate Quick Picks\n * View results history\n * Payouts for select games\n * Frequency charts",
  "genres": [
   "Entertainment",
   "News"
  ],
  "contentRating": "17+",
  "released": "2019-05-18T10:32:10Z",
  "updated": "2020-04-10T08:34:42Z",
  "releaseNotes": "Fix connectivity issues",
  "version": "1.0.3",
  "price": 0,
  "developer": "Matthew SAAVEDRA",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.leisureapps.lotterynews.pa",
  "title": "PA Lottery Results",
  "description": "Lottery results for the Pennsylvania Lottery (PA Lotto). Every game is available and results are updated every 10 minutes. Always accurate and fast.\n\nTons of features:\n- Search past lottery results and specific dates\n- Lottery game statistics, including hot and cold numbers and frequency of numbers.\n- Lottery news and updates\n- Alerts for your favorite lotto games\n\nCurrent games listed for PA Lottery:\n\nMega Millions\nPowerball\nCash4Life\nMatch 6 Lotto\nCash 5\nTreasure Hunt\nPick 5 Day\nPick 5 Evening\nPick 4 Day\nPick 4 Evening\nPick 3 Day\nPick 3 Evening\nPick 2 Day\nPick 2 Evening",
  "genres": [
   "News",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-11-04T04:10:19Z",
  "updated": "2016-11-04T04:10:19Z",
  "version": "1.0",
  "price": 0,
  "developer": "Leisure Apps",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.getgreatmerchandise.ny",
  "title": "NY Lottery Results",
  "description": "As of Sep. 28, 2013 - We are currently repairing the IOS 7 version. It currently displays the recent results and has a date search. The menu will change when the other features are corrected. We apologize for the inconvenience.\n\nAs of 09/21/2012 - If this app is not working after you upgraded to IOS 6. Please power down your device and restart.\nIf you are still having problems please email us at info@getgreatmerchandise.com\n\nAs of 07/01/2012 we have expanded the Current search and Date search to display the last 4 drawing days instead of 2 days for all of the lottery games.\n\nSpecial Note as of Nov 12 20011: We have fixed the bug for this app when running the iPad2, iPhone 4S models and any iPhones that have the 5.0 and 5.1 OS. What does this mean? It means that this app works on all iPhone and iPad models. We welcome any feedback if you have problems with this app to our support group at info@getgreatmerchandise.com\n\nIt's a tool, it could be time consuming fun and enjoyment and it also provides the results of all of the New York Lottery games (NUMBERS, WIN4, TAKE5, LOTTO, MegaMillions, PowerBall, SweetMillions and the PICK10) and the current Jackpot Amounts for the MegaMillions, PowerBall and Lotto games.  We recently added a Hot Numbers section for the NUMBERS and WIN4 games. Just go the the screen and see what numbers have come out the most times in the past seven days. Scroll down the screen and see the top ten most popular numbers drawn since 1-19-2003.\n\nUse this App as a tool to analyze your numbers. See if they never came out or when they came out. See if your lucky numbers are hot or cold. The App provides the numbers and you decide if it is due to come out or not.\n\nUse this App for fun and enjoyment. Play by yourself or with friends. Pick the numbers and see if they came out recently or a while ago or if they never came out. It could get habit forming by searching for all of your favorite numbers, birthdays, addresses, etc. Try to pick numbers that came out more often. The LOTTO database stores the results going back to September 05, 2001. Other games go back to 2002 depending on the game. Have fun with this App and you can also become the Lottery expert amongst your friends by surprising them with the search results.       \n\nAlso, as you would expect, this App provides the results for all of the New York Lottery games and the current Jackpot amounts for the MegaMillions, PowerBall and Lotto games. With one tap, you get a glance of the current results for the last 4 drawing dates. Do a Date \nSearch to find the results for any day back to September 05, 2001. You can also do a search by numbers and find out how often they came out and when they came out. Finally look at the results of your favorite game for the last 30 drawings.\n\nEnjoy the App and please leave reviews and comments about future updates. Remember, if you ask for it, you might get it.",
  "genres": [
   "Entertainment",
   "Utilities"
  ],
  "contentRating": "4+",
  "released": "2010-04-17T04:23:57Z",
  "updated": "2010-04-17T04:23:57Z",
  "version": "1.0",
  "price": 0,
  "developer": "Get Great Merchandise",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "lottery"
 },
 {
  "appId": "com.glidingdeer.bingodrivemobile",
  "title": "Bingo Drive: Play Online & Win",
  "description": "BINGO DRIVE: THE #1 BINGO GAME to play!\nGet your bingo daubers ready for the best game of Bingo! Pop in and play our new FREE Bingo game! Celebrate seasonal events and any holiday in our various Bingo rooms, with FREE Casino Credits and bonuses!\n\nBingo Drive breaks the monopoly of big Casino games and delivers a fresh, high-quality, bonus-packed online Bingo experience, like no free Bingo games online you've seen before! It’s the ultimate, #1 Bingo experience.\n\nCelebrate and play with other free casino players across a huge variety of awesome Bingo Game Rooms, and WIN FREE Bingo Game Credits!\n\nA new bingo game experience with each new bingo Room! Play Free BINGO games with different BINGO Patterns for endless hours of fun casino games to play! These include: Collecting candy in the Sugar Rush room, looting lost treasures in Pillage & Plunder and many more…\n\nFREE BONUSES & CREDITS!\n- A multitude of Free Bingo Game Credits, Coins, and Power-ups to kickstart your path to bingo wins! Collect more every day!\n- Increase your Daily Bonuses even further by playing more online Bingo games and completing Rooms!\n- Play the Daily Spin for FREE and win incredible rewards and prizes!\n- Customize your very own Car. Car Parts have special perks that provide you with even more bonuses! Will you go for style or function?\n- Collect FREE Gifts and send them to friends!\n- Enjoy our daily community Freebies\n\nAdditional AMAZING Features:\n- NEW FREE BINGO ROOMS EVERY WEEK!\n- Our Weekend Saga is a blast! Win amazing prizes, every weekend!\n- Play mini-games and win while you daub:\n•        Spin our generous Wheel-O'-Fortune to win BIG!\n•        Scratch Cards deliver huge rewards!\n•        Pull the lever on our Slot Machine and score amazing rewards!\n- Win even more with Jackpot mode!\n- An awesome community: ride alongside like-minded players, or against them :wink:\n- Chat and complete Collections with the help of friends\n- LUCKY NUMBERS AND POWER-UPS!\n- Exclusive to Bingo Drive: guess and pre-daub numbers on your Cards to win even faster!\nYOU'LL LOVE BINGO DRIVE! I MEAN, EVEN BLUE CATS LOVE IT! :wink:\n\nNeed some help? Got a suggestion? Just want to talk? Get in touch with us at:\n- Support Hub: http://support.bingodrive.com\n- E-mail: support@glidingdeer.com\nLIKE us on Facebook, get in touch with the community, and collect Freebies:\n- Official App Page: https://www.facebook.com/bingodrive/\n\n* Bingo Drive is intended for mature audiences. The bingo game is a social casino game, made for entertainment purposes only and does not offer real money gambling or implies future success at real money gambling.",
  "genres": [
   "Games",
   "Entertainment",
   "Board",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-07-27T18:18:45Z",
  "updated": "2020-05-10T15:05:47Z",
  "releaseNotes": "Version 332\n* Quicker loading time\n* Support Request Improved\n* Nitro Room Issues Resolved\n* NEW Sky High Bonus Collection\n* NEW Room and Mini-Game!\n* New Featured Rooms Layouts\n* Quest Improvements\n* Weekend Saga Fixes\n* King of Swamp Mini-Game improvements",
  "version": "1.332",
  "price": 0,
  "developer": "Gliding Deer",
  "score": 4.62783,
  "reviews": 575,
  "currentVersionScore": 4.62783,
  "currentVersionReviews": 575,
  "searchTerms": "lottery"
 }
]