[
 {
  "appId": "com.iphonesoft3g.roulette",
  "title": "Casino Roulette: Roulettist",
  "description": "Play the best free roulette game with millions of players from all over the world! \nA realistic roulette table with 3D graphics, featuring all varieties of roulette: three-sector European, \"double zero\" American and French with additional betting on sectors. \nPlace bets, take risks, improve your skills, and gain experience! Experiment and win to become the best online roulette player!\n\nGame features:\n• FREE CHIPS – Play the game every day to get free chips!\n• 3 VERSIONS OF ROULETTE – Try European, French and American roulette and choose the best for you.\n• ROULETTE TOURNAMENTS – Compete against lots of worthy opponents and try your luck!\n• GET REWARDS – Up the stakes, win games, take risks and unlock achievements.\n• QUESTS - Complete daily quests to get free chips!\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level-up. See how many roulette games you've won and achievements you've completed. Get unique properties and display them on your profile! View other players' profiles to see how you compare! \n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other roulette players!\n• FAIR PLAY GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest roulette experience.\n• LEARN TO PLAY – Are you new to roulette but always wanted to try it?\nOur simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about roulette, from the rules of the game to betting combinations.\n• 3D GRAPHICS – An absolutely free roulette game with stunningly realistic 3D graphics.\n• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.\n• SINGLE ACCOUNT – Start playing free roulette on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.\n\nWant more than roulette?\nTry our other games for an unforgettable 3D experience: \n• TEXAS HOLD'EM POKER – The most popular casino game among professional gamblers! Test your skills in our amazing weekly poker tournaments!\n• SLOTS – Explore our themed slots with lots of unique features!\n• BLACKJACK – A simple game of \"21\". An exciting 3D game that any blackjack fan is sure to enjoy.\n• OMAHA POKER – A more dynamic version of poker, with 4 cards in your hand. Have more fun with amazing combinations!\n• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!\n• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!\n\nSubscribe to the official Facebook page of the game and be the first to find out about our promotions and news!\nhttps://facebook.com/Pokerist\n\nFollow us on Twitter and get free chips!\nhttps://twitter.com/KamaCasino\n\nThis game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-04-22T17:29:17Z",
  "updated": "2020-05-05T09:02:18Z",
  "releaseNotes": "Stay home. Be safe!\nWe've planned a lot of new features for you to enjoy!\n\nNew VIP System\nVIP mechanics have been completely reworked. Earn points, gain levels and get infinite benefits!\n\nWeekly Rankings\nCompete against other players and see how you rank each week!\n\nNow MTT starts every 40 minutes!\n\nQuicker Betting\nTry raising a bet and you'll find a new option to bet 1/2 or the full pot! Raise faster!\n\nImproved navigation in the lobby—now you can view playing tables in a chart.",
  "version": "32.6",
  "price": 0,
  "developer": "KamaGames",
  "score": 4.60354,
  "reviews": 903,
  "currentVersionScore": 4.60354,
  "currentVersionReviews": 903,
  "searchTerms": "roulette"
 },
 {
  "appId": "uk.pokerstarscasino.www",
  "title": "PokerStars Casino Games Online",
  "description": "Play exclusive Slots, popular Blackjack games and enjoy the best Roulette action (including double ball and live dealer tables) at the fastest-growing online casino.\n\nTOP 2 REASONS TO DOWNLOAD POKERSTARS CASINO\n\n1. WE HAVE IT ALL! Play a great variety of new and innovative games: From Multi-Player Blackjack and Roulette to Live Casino and our exclusive Slot game, Millionaires’ Island, you’ll find all your favourite games.\n\n2. REAL MONEY! Enjoy real money and free-to-play mobile casino games, available across a wide range of limits and formats. \n\nPokerStars Casino is brought to you by the world’s largest online gaming company – trusted by over 100m players worldwide.\n\nPOKERSTARS CASINO GAMES:\n\nA HUGE SELECTION OF SLOTS\n- Classic and themed Slot games\n- Special features that give you more chances to win cash prizes\n\nPLENTY OF DIFFERENT BLACKJACK FORMATS\n- Variety of Blackjack games – popular formats include Classic, Atlantic City, European and more!\n- Play online Blackjack in Single Player or Multiplayer mode.\n\nTHE THRILL OF ROULETTE\n- European roulette available, including standard and Double Ball tables.\n- Play Live Roulette games, including the award-winning Immersive Roulette.\n\nDownload PokerStars Casino today and make sure you accept push notifications, to ensure you don’t miss out on any of our great promotions.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-09-22T22:43:59Z",
  "updated": "2020-04-14T16:49:29Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "3.27.1",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.34567,
  "reviews": 1594,
  "currentVersionScore": 4.34567,
  "currentVersionReviews": 1594,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.rnftechnologies.roulette",
  "title": "Roulette - Casino Style",
  "description": "---#1 Roulette app on iPhone/iPad/iPod.---\nNow experience the excitement and thrill of playing roulette in the real Las Vegas casino surroundings on your iPhone/iPad.\n\nTake your gaming experience to the next level with new Roulette – Casino Style. Enjoy the fun of playing the real roulette in the amazing Las Vegas theme without ever dropping a single penny with never before sound effects and graphics.\n\n***Game Features ***\n\n- American & European tables\n- 20 different types of bets.\n- Free daily bonus chips. \n- Hourly bonus chips.\n- Five different tables\n- Achievements to unlock.\n- Nice casino style sound and music to give the casino ambience.\n- Leader-board.\n- free roulette\n\nGet ready for the intense gambling thrills of Las Vegas, this is the right roulette app for you to learn the basics and get your roulette strategy right!\n\nGo! Go! Go! Bring out the real gambler in you!\n\n***For Support and Feedback***\ncontact@phonato.com\nhttp://www.facebook.com/Phonato",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-04-18T01:52:40Z",
  "updated": "2019-09-27T14:29:47Z",
  "releaseNotes": "- Minor Graphics Enhancement.\n- More FREE Coins.\n- Deals have been introduced.\n\nShare feedback and let us know how we can make the game better.",
  "version": "2.5",
  "price": 0,
  "developer": "Rnf Technologies",
  "score": 4.7981,
  "reviews": 1793,
  "currentVersionScore": 4.7981,
  "currentVersionReviews": 1793,
  "searchTerms": "roulette"
 },
 {
  "appId": "sk.inlogic.rouletteprovip",
  "title": "Roulette VIP - Casino Vegas",
  "description": "Tremendous sound effects and graphics are making this game extraordinary. Try different strategies and learn for a real roulette in a casino.\n\nEnjoy Roulette VIP - Casino Vegas and play at friendly betting tables with easy controls in horizontal mode. Try your roulette tactics without risking your money and become a Professional Roulette Player.\n\nFeatures:\n\n- Real roulette simulator to test your strategies for a Vegas casino\n- A wide range of casino chips at your disposal to simulate the real casino feeling- \n- Piggy bank feature to receive back your lost chips\n- Choose the American or European table and play roulette as you wish\n- Spin the Lucky wheel and Royal wheel for extra prizes\n- Keep track of your playing with professional statistics and become a true casino player\n\n\nPrepare for Las Vegas!\nSpin the luxury wheel in landscape mode in Roulette VIP - Casino Vegas and win huge prizes. Push your luck and become a millionaire! Come every day and spin the lucky wheel for a free prize!\n\nBest offline roulette ever!",
  "genres": [
   "Games",
   "Simulation",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-08-05T01:33:33Z",
  "updated": "2020-04-02T14:16:40Z",
  "releaseNotes": "- Several bug fixes\n- Improved stability",
  "version": "1.0.28",
  "price": 0,
  "developer": "Inlogic Software s.r.o.",
  "score": 4.56121,
  "reviews": 392,
  "currentVersionScore": 4.56121,
  "currentVersionReviews": 392,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.Roulette.app",
  "title": "Best Roulette App - Real Money",
  "description": "PLAY ROULETTE \nIf you love playing roulette, download the best roulette app now!  Our roulette wheel is specifically developed for mobile play, with great close up views of the wheel, the betting table, statistics and other cool features that make playing roulette on the best roulette app even more exciting.  You can even set which side of the screen you prefer the spin button on.  \n\nCASINO BONUS\nWe offer one of the most generous bonus packages in the industry; Up to ‎£/€/$1,000 to play roulette in our casino. The roulette bonus is available immediately after you create an account and fund it.  Enjoy a generous deposit match bonus.  We will triple your first deposit amount up to $/€300 and we’ll throw in an extra 25 free spins which you can play Slots.\nTake advantage of our cashback bonuses.  Cashback bonuses are a cash payment calculated as a percentage of your losses back. Offline casinos cannot offer these types of bonuses, which is what makes this offer so special.\n\nCOMP POINTS\nIf bonus money isn’t enough, you can collect comp points as you play.  The more you play the more comp points you collect.  Comp points can be converted into withdrawable cash or into prizes.  Get in touch with the Casino VIP team for more information.\n\n24/7 SUPPORT\nWe have multilingual casino support staff ready to help and assist you in any question or request 24/7.  \n\nSLOTS\nWith 25 free spins try your luck at a great variety of the best slots casino has to offer. \n\nJACKPOTS\nSome of our jackpots can swell up to $8 Million in prize money.  This is life changing money.  Give it a spin today.\n\nCASHIER\nWith a wide variety of deposit methods you can fund your account in a convenient discrete fashion.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2017-12-13T22:48:17Z",
  "updated": "2017-12-13T22:48:17Z",
  "version": "1.0",
  "price": 0,
  "developer": "Ofir K",
  "score": 5,
  "reviews": 14,
  "currentVersionScore": 5,
  "currentVersionReviews": 14,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.mywavia.rr",
  "title": "Roulette Royale - Grand Casino",
  "description": "Join Virtual Casino on Roulette Royale with the best designed wheel and friendly tables. \n\nFREE to play. Immediate Bonus Chips.\n\nGame Features :\n\n• Offline European and American Roulette simulator. \n\n• Join Live Multiplayer Tables and Play Tournament Challenges world wide with thousands of players .\n\n• Last Five numbers and Full number statistics across games. Live robots play along to give the feel of an online multiplayer roulette table. \n\n• Track personal session stats. Shop to buy virtual items. \n\n• Leader Board to compare with friends & see world-wide, country-wide rankings.\n\n• HD Graphics support all iPhones, iPads and make table easy to read & place bets. Just spin the wheel and experience Las Vegas . \n\n• Bet on various odds and Try different strategies. Learnt strategy in this roulette game does not guarantee success in real money gambling.\n\nLike Us : https://www.facebook.com/RouletteRoyaleMywavia \n\nHelp with Roulette? Write to us at anddev@mywavia.com",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2011-07-13T07:00:00Z",
  "updated": "2019-05-27T18:50:22Z",
  "releaseNotes": "• Display bugs fixed\n• Live Multiplayer tables and Tournaments",
  "version": "9.86",
  "price": 0,
  "developer": "REGALTUSK PRIVATE LIMITED",
  "score": 4.52846,
  "reviews": 246,
  "currentVersionScore": 4.52846,
  "currentVersionReviews": 246,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.yesgnome.roulette",
  "title": "Roulette 3D Casino Style",
  "description": "Experience the Casino Roulette excitement and thrill of playing roulette in the real Las Vegas casino on your iPhone/iPad.\nFeaturing Multiplayer Roulette which can let you play against other players Real Time. \nNon stop excitement from the Roulette tables.\nDownload Roulette now and play Roulette game for free today.\nThe lobby has an amazing layout that lets you get straight to the action. \n\nTry our daily spin to win free chips & look out for the special bonus every 2 hours.\nGet free chip rewards for having your friends play the game.\n\n\n ***Game Features ***\n\n  - American & European tables\n- 20 different types of bets.\n- Free daily bonus chips. \n- Try different strategies. \n- Free Chips every 2 hours & a daily spin wheel which can give you more free chips.\n- Come back everyday for better rewards.\n- Easy & fun to play. \n- A free to play casino Roulette game with realistic 3D HD graphics. \n- Connect to Facebook & invite your friends in the game. \n- A simple & an attractive interface which is very easy to understand.\n- Play Single player or multi player Roulette mode. There is always a table waiting for you to join in.\n\n\nBeside our amazing roulette free game, we also have other top casino games\n\nBlackjack\nVideo Poker\nCraps\nBingo\nKeno\nSlots\n\nThere's always more! Our team is already developing content for our next major update!  \nThis game is for amusement purposes only & is intended for use by players 21 and over.\nThe game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money Roulette game.\n\nPrivacy Policy: http://yesgnome.com/privacy-policy/\nTerms of service: http://yesgnome.com/terms-of-service/",
  "genres": [
   "Games",
   "Board",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-09-05T13:04:54Z",
  "updated": "2020-04-02T11:11:14Z",
  "releaseNotes": "Performance improvements and Bug Fixes.",
  "version": "1.6.1",
  "price": 0,
  "developer": "YesGnome Gaming Solutions",
  "score": 4.85714,
  "reviews": 14,
  "currentVersionScore": 4.85714,
  "currentVersionReviews": 14,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.rl.iphone.dino",
  "title": "888 Casino: Real Money Games",
  "description": "Sign up & Get £88 Free Play - NO DEPOSIT BONUS \nTERMS & CONDITIONS\nNew players only • £88 is granted as FreePlay (FP) • FP must be claimed within 48 hrs of & expires within 14 days • FP wins are credited as bonus and capped at £15, exc. JP win • Bonus wins are capped at £500 • To withdraw bonus & related wins, wager bonus x30 within 90 days • Wagering req. vary by game • Deposit balance is available for withdrawal at any time • General withdrawal restrictions & full T&Cs apply - https://www.888casino.com/terms/88freeplay/\n\nPlay with 50 Real Spins - NO DEPOSIT BONUS \nTERMS & CONDITIONS\nNew players only • Real Spins (RS) must be claimed within 48 hours and expire in 14 days • RS valid for selected games only • Eligibility is limited only to players that are directed via specific marketing channels • RS wins credited as real money & are capped at £7, exc. JP wins • RS winnings granted once all RS have been used or once max winnings cap has been reached • Deposit balance is available for withdrawal at any time. General withdrawal restrictions & full T&Cs apply - https://www.888casino.com/terms/50-realspins/\n\nJoin 888 casino today & get £88 FREE PLAY, No Deposit Needed! Get the top online casino app and enjoy a huge selection of Live Casino games, hundreds of Slot machines and multiple Blackjack, Baccarat & Roulette tables. We have over 20 years of gaming excellence, so you’ve come to the right place!\n\nWhether you’re playing from the comfort of your own home or on-the-go, 888 casino is your ultimate ticket to Las Vegas-style casino entertainment. With millions of registered players from all around the world, you too could join the premier online casino app.\n\n888casino Top App Features:\n\nMobile Casino Games\n• Play Slot, Roulette and Blackjack games on-the-go, on your iPad and iPhone.\n• Wherever you are, you’re at the Live Casino! Feel the thrill of real Las Vegas anywhere, as a real dealer spins the Roulette wheel.\n\nReal Money Online Slots\n• There’s never a dull moment with over 900 of the most popular Slots.\n• With just a tap, you can choose from our selection of top-tier Slot games and unique slot games, exclusive to 888casino.\n• Go back in time to ancient Rome & Egypt in historical slots, search for the Leprechaun’s pot o’ gold or just keep it classic. Whatever theme you’re into, be sure to find your favorite game!\n• Enjoy a wide variety of features such as Bonus Games, Expanding Wilds, Free Spins and Huge progressive Jackpots galore.\n• Play our top slot games including: Millionaire Genie, Gonzo, Rise of the Pharaohs, Jack’s Pot, Spartacus, and Guns N’ Roses.\n\nLive Blackjack, Roulette & More\n• Experience a real life casino while you play at our Live Casino lounge and meet the most charming dealers under the sun.\n\nVegas-style Fun at Your Fingertips\n• Get lucky with the hottest Slot games under the sun!\n• These casino games have funky themes, dazzling audio-visuals and humungous progressive jackpots that are dropping all the time!\n\nBig Bonuses, Fantastic FreePlay & Fabulous Free Spins, there’s always a sizzling hot promotion waiting for you at 888casino.\n\nDownload 888 casino now and enjoy real money casino games at the tap of a button.\n18+\n\nhttps://www.888casino.com/security-and-privacy/responsible-gaming/\nBeGambleAware:\n\nhttps://www.begambleaware.org/\n888responsible\n\nhttp://www.888responsible.com/",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-12-21T19:23:40Z",
  "updated": "2020-02-20T08:09:40Z",
  "releaseNotes": "Bug fixes and performance improvements",
  "version": "2.6.86",
  "price": 0,
  "developer": "Virtual IP Assets Limited",
  "score": 4.44072,
  "reviews": 5820,
  "currentVersionScore": 4.44072,
  "currentVersionReviews": 5820,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.grosvenor.grosvenor",
  "title": "Grosvenor Casino Online Games",
  "description": "Bringing the thrill of the casino, to you. New players will be greeted with a 100% deposit match up to £20 when you sign up with Grosvenor Casinos* - you can do this quickly and easily through the app. Once you’re logged in, you’ll regularly be offered great promotions, competitive bonuses, boosted odds and more. \n\nAt home or on the go, the Grosvenor Casinos app puts you at the heart of every game, hand, race, bout and beyond. The ultimate experience in mobile gaming, our Grosvenor Casinos app combines the buzz of the casino floor with the excitement of online slots and puts it in the palm of your hand. \n\n\nSlots and Games\n\nThe full selection of slots and games in our app have been specifically chosen to bring you the best mobile experience possible. With slots varying from classics like Lucky Ladies Charm, Rainbow Riches and Cleopatra, to more modern games like Extra Chilli as well as exciting Daily Jackpots – we offer something for everyone. We’ve also got a great collection of Grosvenor Original titles on offer, like Egyptian Fortunes and Extra Fruity that you can play here first! \n\n\nLive Casino\n\nOur world-class dealers bring you a huge range of table games, including Roulette, Blackjack, Live Poker and Baccarat. As well as exclusive games, like Victoria Baccarat, that are streamed live from the heart of our very own London Victoria casino. All Live games are streamed straight to your device in stunning HD, ensuring you feel the thrills of every game in real-time, in the most realistic Live Casino experience around. Better still, all of our standard roulette tables offer half your stake back on Even Chance bets if the ball lands on 0!\n\n\nSports Betting\n\nBetting with Grosvenor Sport has never been easier, in this intuitive and easy to navigate app, you’ll get great odds at home, in casino or on the move! Bet on sports including Football, Tennis, Horse Racing, Cricket, Rugby, Boxing, UFC, NFL and lots more. Featuring Grosvenor Goals – our weekly free-to-play scorer prediction game, where you can win £1 Million. Find industry-leading live betting, a Cash Out feature, enhanced odds and accas and regular offers. \n\n\nPoker \n\nGrosvenor Poker offers Tournaments, Cash Games and Jackpot Sit and Go’s on all your favourite devices, with No Limit Holdem, Omaha, Fast Fold poker, Anonymous tables and more. Grosvenor Poker is the only place to qualify for the biggest poker events in the UK, such as Goliath and Grosvenor Casinos’ own GUKPT – the longest running poker series in the UK.\n\n\nGetting started\n\nIf you’re new to Grosvenor Casinos, you can sign up quickly and easily through the app. Or, if you already play online, simply log in with your account details and start playing immediately.\n\n\nSafety and security\n\nGrosvenor Casinos has been a trusted and respected operator of casinos in the UK for over 40 years and remains so today. As the largest land-based casino operator in the UK, we understand that the safety and security of your personal information is of vital importance. That’s why we’ve made every effort to protect your data and ensure that you can play with peace of mind and enjoy the games in our app.\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org/ and 0808 8020 133\n\n*Terms and Conditions apply",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-05-14T21:39:09Z",
  "updated": "2019-09-12T09:27:22Z",
  "releaseNotes": "In this version: \n- Bug fixes and service improvements",
  "version": "2.12",
  "price": 0,
  "developer": "Grosvenor Casinos Ltd",
  "score": 4.20465,
  "reviews": 6196,
  "currentVersionScore": 4.20465,
  "currentVersionReviews": 6196,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.phonato.roulette",
  "title": "Roulette Live!",
  "description": "**#1 Roulette app on iPhone/iPad/iPod.**\nEnjoy and perfect your game - play the most authentic roulette game on iOS. \n\nThis app comes closest to the real thing. The app has both American and European style roulette. Build your strategy by playing this app. Use the stats section to check your progress. The ambience, graphics and music has been made to resemble the real casino environment.\n\nGet free coins every now and then!\n\n***Game Features ***\n\n- American and European tables\n- 20 different kind of bets.\n- Hourly bonus chips.\n- Five different tables\n- Achievements to clear.\n- Free daily bonus chips. \n- Real casino style sound and music.\n- Leaderboard.\n\n***More About Roulette - For Beginners***\n\nRoulette is a casino game named after a French diminutive for little wheel. In the game, players may choose to place roulette bets on either a single number or a range of numbers, the colors red or black, or whether the number is odd or even. The roulette odds are based on probability.\nTo determine the winning number and color, a croupier spins a wheel in one direction, then spins a ball in the opposite direction around a tilted circular track running around the circumference of the wheel. The ball eventually loses momentum and falls on to the wheel and into one of 37 (in French/European roulette) or 38 (in American roulette) colored and numbered pockets on the wheel.\nRoulette players have a variety of betting options. Placing inside roulette bets is either selecting the exact number of the pocket the ball will land in, or a small range of pockets based on their proximity on the layout. Players wishing to bet on the 'outside' will select roulette bets on larger positional groupings of pockets, the pocket color, or whether the winning number is odd or even. The payout roulette odds for each type of bet are based on its probability.\nThe roulette table usually imposes minimum and maximum bets, and these rules usually apply separately for all of a player's inside and outside roulette bets for each spin. For inside roulette bets at roulette tables, some casinos may use separate roulette table chips of various colors to distinguish players at the table. Players can continue to place roulette bets as the ball spins around the wheel until the dealer announces no more roulette bets.\nWhen a winning number and color is determined by the roulette wheel, the dealer will place a marker, also known as a dolly, on that winning number on the roulette table layout. When the dolly is on the table, no players may place roulette bets, collect roulette bets, or remove any roulette bets from the table. The dealer will then sweep away all other losing roulette bets either by hand or rake, and determine all of the payouts to the remaining inside and outside winning roulette bets. When the dealer is finished making payouts, the marker is removed from the roulette board where players collect their winnings and make new bets. The winning chips remain on the roulette board.\nRoulette wheel number sequence\nThe pockets of the roulette wheel are numbered from 1 to 36.\nIn number ranges from 1 to 10 and 19 to 28, odd numbers are red and even are black. In ranges from 11 to 18 and 29 to 36, odd numbers are black and even are red.\nThere is a green pocket numbered 0 (zero). In American roulette, there is a second green pocket marked 00.\n\n***\nFor more information on the game or the app in general, feel free to contact us.\n***\n\n***For Support and Feedback***\ncontact@phonato.com\nhttp://www.facebook.com/Phonato",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-02-28T23:29:27Z",
  "updated": "2017-09-18T14:36:46Z",
  "releaseNotes": "-- Graphics enhancement.\n\n-- Minor fixes",
  "version": "1.1",
  "price": 0,
  "developer": "Phonato Studios",
  "score": 5,
  "reviews": 5,
  "currentVersionScore": 5,
  "currentVersionReviews": 5,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.bskyb.skycasino",
  "title": "Sky Casino Blackjack, Roulette",
  "description": "The Sky Casino App gives you the opportunity to enjoy an extensive range of Live Casino Table games, plus hundreds of Slots, blackjack and Roulette tables for you to experience either on the move or from the comfort of your own home.\n \nOur App is your gateway to thrills, possibilities and probabilities with every spin or stake. With a wide assortment of Live tables, just take a seat where our expert live dealers are posed to spin, or deal your way into your preferred table whenever you chose. Whether you enjoy Roulette, Blackjack, Baccarat, Casino Hold em or Hi Lo, we have the games for you!\n \nWe  are inviting you to come and play with Sky Casino where you enter a world of entertainment with vast array of promotions and campaigns you can access directly through the App providing a truly immersive online casino experience.\n \nOur easy to navigate and intuitive site, allows you manage your account with our Touch ID, make secure deposits and withdrawals, and choose a range of payment methods.\n \nDownload our App today to enjoy all of our Casino games, there’s something for everybody at Sky Casino. If you live for the unexpected then why not visit Sky Vegas to enjoy a world of exclusive and big name slots, or for a true sports betting fan immerse yourself in the world of Sky Bet, Britain’s most popular online bookmaker\n \n18+, BEGABLEAWARE.ORG\n \nPlease note all app images / previews shown here are for illustrative purposes only*. \n \nResponsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support in the United Kingdom please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/ and in Ireland please contact Gamble Aware at 1800 753 753 or visit http://www.gambleaware.ie/\n\nThe Sky Casino app is brought to you by Bonne Terre Limited, an Alderney registered company majority owned by CVC Capital Partners and licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Bet is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group. The Sky trademarks used in the app are owned by the Sky Plc group of companies and are used under license. To place a bet with Sky Bet you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Bet. Customers located outside of the UK or Ireland will be prohibited from using this app..\n\nPlease Note: Apple Inc. is in no way linked or associated with this or any other competition / contents run in this app.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2014-08-28T08:31:21Z",
  "updated": "2018-07-30T08:52:11Z",
  "releaseNotes": "The Sky Casino app is updated, upgraded and better than ever. We've been busy working on back end of the app so we can improve the overall experience. If you enjoy using our App please support us by leaving a review.",
  "version": "1.12.0",
  "price": 0,
  "developer": "Sky Betting & Gaming",
  "score": 4.56873,
  "reviews": 582,
  "currentVersionScore": 4.56873,
  "currentVersionReviews": 582,
  "searchTerms": "roulette"
 },
 {
  "appId": "uk.fulltilt.www",
  "title": "Full Tilt Casino & Poker Games",
  "description": "AN AMAZING POKER AND CASINO EXPERIENCE\n\nThe great thing about the Full Tilt mobile app is that it allows you to enjoy your favourite poker and casino games anytime, anywhere. Download the Full Tilt app now and jump into the game of your choice!\n\nTHE BEST ONLINE POKER EXPERIENCE\n\n• Hit No Limit Texas Hold’em and Pot Limit Omaha tables\n• Sit&Go and Multi-table tournaments with huge prizes\n• Play Spin&Go, Zoom or any other special poker game\n• Sit at real-money or play-money poker tables\n• Take advantage of the best poker promotions\n\nALL THE BEST CASINO GAMES\n\n• Play the world’s most popular casino games, such as blackjack, roulette and slots\n• Play Live Casino games on your mobile device with a real dealer\n• All the best Slots available, with huge real money Jackpots\n• Try Multi-Player mode and catch-up with friends at the tables\n\nGREAT FEATURES\n\n Multi-table functionality\n• ‘Find your seat’ feature\n• Table chat\n• Lobby filters\n• Built-in Contact Support Form, with our Support team available 24/7!\n\nVisit our website for more information on what we have to offer. Join our poker community on social media and connect with poker players from around the world.\n\nhttps://www.facebook.com/Fulltiltpoker\nhttps://twitter.com/FullTiltPoker\n\nPlay anytime, anywhere – download the Full Tilt mobile app now.\n\nThis is a real money gambling app. You must be at least 18 years old, and of the legal age of majority in your jurisdiction, to create a Stars Account.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at https://www.begambleaware.org or 0808 8020 133.\n\n************************\n\n£20 Free Play Promotion Terms and Conditions\n\n- Offer only available to players who have never made a real money deposit of £10 or more\n- The £20 Free Play will be credited daily from deposit date: Day 1 = 5 x $1 S&G (Spin & Go) tickets, Day 2 = 5 x $1 S&G tickets, Day 3 = 5 x $1 S&G tickets, Day 4 = $5 cash bonus, Day 5 =5 x $1 S&G tickets, Day 6 = $5 cash bonus\n- We reserve the right to withhold rewards if there is reason to suspect that a deposit is fraudulent, or that it has not been made with the intention of using it to play real money games\n- All Spin & Go tickets issued as part of the £20 Free Play promotion expire 21 days from issue\n- Any unused tickets issued as part of this promotion will be forfeited\n- Tickets cannot be redeemed for cash or any other value, or be transferred\n- A cashout at any time during the bonus period will leave you ineligible to claim this bonus",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-05-17T07:12:23Z",
  "updated": "2020-04-09T11:07:04Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "1.119.0",
  "price": 0,
  "developer": "Stars Mobile Limited",
  "score": 4.41836,
  "reviews": 1035,
  "currentVersionScore": 4.41836,
  "currentVersionReviews": 1035,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.ladbrokes.casino",
  "title": "Ladbrokes Casino & Games",
  "description": "The power’s in your hands with the Ladbrokes Casino & Games app. You’ll find hundreds of great games, including Bingo, Poker, Slots and much more. And best of all, you can play them wherever and whenever you like on your iPhone or iPad. Discover the ultimate online gaming experience today. \n\nIn addition to this you will also get a welcome bonus of £50 for selected games when you stake a minimum of £10 on any of the qualifying games.\n\n\n*GAMES*\nWhatever you’re in the mood for, you’ll find it on the Ladbrokes Casino & Games app. We’ve got a huge selection of table and card games, including casino classics like Blackjack, Roulette and Hold'em Poker.  We’ve also got plenty of Slots, where it only takes one lucky spin to win big. \n\nAnd you can also take on our Live Dealers at the Live Casino. HD streaming allows you to face a real dealer in real time! \n\nWe regularly add more games too, so there’ll always be something new to discover. \n\nHere are a few of our most popular titles:\n\n•\tPremium European Roulette\n\n•\tPremium Blackjack\n\n•\tBig Banker Slots\n\n•\tFishin' Frenzy\n\n•\tFrankie Dettori's Magic Seven Jackpot\n\n•\tGreat Blue\n\n•\tAge Of The Gods™\n\n•\tRainbow Riches\n\n•\tKing Kong Cash\n\n•\tWish Upon a Jackpot\n\n•\tExclusive Live Blackjack\n\n•\tAge of the Gods™ Live Roulette \n\nAnd many more!\n\n\n*ONLINE CASINO BONUSES*\nIt all starts with our fantastic Welcome Bonus of £50 on selected games when you stake a minimum of £10 on any of the qualifying games.  It could be the start of something special. \n\nKeep progressing to unlock even greater rewards, including prizes and real money casino bonuses. \n\n\n*FEATURES*\nThe Ladbrokes Casino and Games app puts the thrill of the casino floor right in your pocket. And it’s got plenty of features that enhance your gaming. \n\nHere’s a quick selection...\n\n•\tState-of-the-art graphics and sound \n\n•\tFaster gameplay\n\n•\tQuick pay-outs\n\n•\tSimple menu navigation\n\n•\tA wide variety of payment methods: Visa, Mastercard, PayPal and many more\n\n•\tSecure encryption technology for deposits and withdrawals\n\n•\t24/7 customer support via phone, email and Live Chat\n\nLet the games begin!\n\nLadbrokes Ltd - the world's leading sports betting and gaming company. \n\n\n\n£50 WELCOME BONUS:\n18+. New players only. Min bet £10 on qualifying games. 40x wager reqs (bonus only) on selected games. Bonus valid for 30 days. Exclusions: Paypal & other deposit types, bets covering >70% of Roulette table. T&Cs apply \n\nDirect link to offer full Terms and Conditions:\nhttp://casino.ladbrokes.com/en/promotions/50-welcome-bonus\n\n\n£10 SIGN UP BONUS\n18+ New Customers only. Promo Code CASINO10 required. £10 bonus for Big Banker slot, valid for 5 days (bonus and winnings removed) 40 x (bonus) wagering reqs apply. Paypal & other deposit types excluded. T&Cs apply\n\nDirect link to offer full Terms and Conditions:\nhttps://gaming.ladbrokes.com/promotions/72204\n\n\n\nWe’re confident you’ll love the Ladbrokes Casino & Games app, but if you find something that you think we can improve, send your feedback to reviewladbrokes@ladbrokes.com.\n\n18+, Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please see below contact details for Gamble Aware in both UK and Ireland.\n\nUK: https://www.begambleaware.org and 0808 8020 133\n\nIreland: https://www.problemgambling.ie and 1800 753 753\n\nLadbrokes Betting & Gaming Ltd. is licensed (licence no. 1611) and regulated by the British Gambling Commission for persons gambling in Great Britain and LC International Limited, Suites 6-8, 5th Floor, Europort, Gibraltar are licensed (RGL Nos. 010, 012) by the Government of Gibraltar and regulated by the Gibraltar Gambling Commissioner.\n\nCopyright © 2018 Ladbrokes\n\nThis App is not endorsed or sponsored by Apple for any of its contests or sweepstakes within this app and is solely the responsibility of LC International Limited. © 2018 Ladbrokes",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-10-31T06:53:29Z",
  "updated": "2019-02-10T09:45:53Z",
  "releaseNotes": "We regularly bring updates to the App Store to help the performance and stability of our app.\nThank you for choosing Ladbrokes Casino & Games",
  "version": "5.21",
  "price": 0,
  "developer": "Ladbrokes Sportsbook LP",
  "score": 4.17751,
  "reviews": 507,
  "currentVersionScore": 4.17751,
  "currentVersionReviews": 507,
  "searchTerms": "roulette"
 },
 {
  "appId": "uk.co.mFortune.roulette",
  "title": "Roulette by mFortune",
  "description": "*** £5 FREE BONUS for all new players! NO DEPOSIT REQUIRED! ***\n\nExperience the excitement of Roulette wherever you are with mFortune’s Classic Roulette - now in real 3D!  Enjoy this modern take on European roulette wherever you are with this exclusive mobile casino app!\n\nIt’s a question as old as the casino itself but what will you choose – Red or Black? Place your bets and see where the ball will land. Step up to the table, place your bets, and be transported to the most luxurious of casinos, wherever you are. \n\nThere’s no queue, just take your seats and see if Lady Luck is on your side with Classic Roulette by mFortune.\n•\t£5 welcome bonus*  with NO deposit required\n•\t100% match on your first deposit* up to £100\n•\tBet from just 10p up to a max bet of £100 a spin\n•\tPlay for free in Demo Mode\n\nIf a download bonus is available on this game it is valid only once per person, device and registered household\n\n*T&C’s apply. 18+. Full details can be found at https://www.mfortune.co.uk/legal/terms-and-conditions/",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-04-29T23:04:03Z",
  "updated": "2018-07-03T10:34:33Z",
  "releaseNotes": "Updated to make use of full 3D visuals.\nEnhanced sound - including voice announcements.",
  "version": "2.0.1",
  "price": 0,
  "developer": "In Touch Games",
  "score": 3.45652,
  "reviews": 46,
  "currentVersionScore": 3.45652,
  "currentVersionReviews": 46,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.gamesys.sunvegas-live",
  "title": "Sun Vegas Live",
  "description": "Download the incredible new The Sun Vegas Live Casino App and play Live Blackjack, Roulette and Baccarat for the realest feeling casino atmosphere around!  Make the most of your experience with a fantastic sign up offer, stake £10 and get £20 on Live Casino! \n\nUse your existing account or sign up to play the latest Live games with our friendly dealers on your devices. Stream the Live Games straight to your phone/tablet and join the fun in the highest quality. \n\nNotice the sleek studio design for the truest real-life casino experience around, with over 50 different tables to choose from giving you an even greater choice in amazing Live Casino games. \n\nJoin the best Live Roulette and blackjack tables where you can bet from as little as 20p. \n\n\nFind the greatest high definition graphics for your gameplay whilst you engage in some entertaining chat with our incredible Live Casino dealers. \n\nPlay fantastic games such as Live Blackjack, Roulette, Baccarat, Spin a Win Live plus the incredible new Kingdoms Rise Blackjack and the Jackpot Age of the Gods Roulette. \n\nDownload ‘The Sun Vegas Live Casino’ app and play today! Our brilliant customer service team will be available to assist you with any queries.\n \nShare you feedback and reviews, as these will help future updates as we continue to make further improvements to the app.\n\nThis is a real money gambling app. Please Gamble responsibly. \n\nTerms and Conditions\nNew Customers from Live Casino App Only, Stake £10 on Live Casino and receive a £20 bonus ·Min Deposit £10 · 50x WR with 20% contributions on Live Dealer Games. Offer must be accepted within 72 hours. Bonus Valid for 7 Days · Bet coverage rules apply · Max bet restrictions apply · Bonus can't be withdrawn. Bonus can only be spent on Live Casino Games · Skrill/Moneybookers and Neteller are not valid for this promo · Real money balance can always be withdrawn · T&C’s apply Begambleawre.org 18+ play responsibility",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2019-11-06T08:00:00Z",
  "updated": "2020-01-28T15:03:24Z",
  "releaseNotes": "* Minor fixes & improvements",
  "version": "1.3",
  "price": 0,
  "developer": "Playtech Bingo",
  "score": 4.33333,
  "reviews": 18,
  "currentVersionScore": 4.33333,
  "currentVersionReviews": 18,
  "searchTerms": "roulette"
 },
 {
  "appId": "uk.co.twentyone.livecasino",
  "title": "21.co.uk Live Casino",
  "description": "Join 21.co.uk and get a £10 free no deposit bonus. All new players will also receive a first deposit welcome offer up to £200.\n\nThe 21.co.uk Live Casino app brings you a wide range of live casino games, so you can enjoy an authentic casino experience in one handy mobile app. Sit back, relax and play a plethora of the most popular online casino and table games on the planet including Blackjack, Roulette and Baccarat from anywhere you like. \n\nLive Casino Show \n\nIf you're looking for an interactive gaming experience, then tune into Channel 5 between 1am and 3am for the 21.co.uk Live Casino Show. Play Blaze Live Roulette and watch as the wheel spins, will luck be on your side? \n\nReal-time Gameplay \n\nWhy go anywhere else? The 21.co.uk Live Casino app delivers an immersive, player focused experience. You can browse tables and get the key statistics you need to join and play with our 'Live Card' feature.  Browse seats, players and results in real-time and join the table you want to instantly with 'Direct Launch', making lobby waiting time a thing of the past. \n\nLive Blackjack, Roulette & Baccarat \n\nPull up a virtual chair today at one of our tables, including our very own 21.co.uk branded table, and enjoy a game of live blackjack, roulette, baccarat or a selection of other Live Casino titles like Live Dream Catcher. You will get that Monte Carlo experience from the comfort of your mobile or tablet, so what's it going to be? Red or black, hit or stand? You decide. \n\n21.co.uk Live Casino App Key Features  \t\t\t\t\t\n\n- Totally Live Experience - Browse seats, players and results in real-time and join the table you want instantly with 'Direct Launch', with no lobby waiting time. \n\n- Cutting edge 'Account Hub' - Up to date, modern and user-friendly features including Touch ID, Face ID, Card Scanning & 'Quick Deposit' making it faster and easier to access and play than ever before.\n\n- Fast Sign Up – We've made our sign-up process fast and simple to get you playing as quickly as possible.\n\n- Lightning Fast Play Speeds – The 21.co.uk Live Casino app has been uniquely designed for speed in load and gameplay. \n\n- Easy Navigation – The 21.co.uk Live Casino app is easy to navigate and intuitive simultaneously.\n\n21.co.uk Branded Tables\n\nThe branded 21.co.uk tables include plush branded felt, lower stakes and a professional live dealer who'll greet you to give you a real immersive experience. It's a casino game for all levels of players, so if you prefer to feel like a VIP but play with lower stakes this is the place to be. \n\nPopular Live Casino Games \n\n- Live Roulette \n- Live Blackjack \n- Lightning Roulette \n- Live Immersive Roulette \n- Live Auto Roulette \n- Monopoly Live \n- Live Dreamcatcher \n\n\n£10 Free - No Deposit Bonus\n\nT&C’s Apply. New players only. Opt in via the “My Promotions” page within 3 days of registration. 99x wagering target. Max single stake with a bonus is £5. £50 max win and withdrawal for non-depositors. Only bonus stakes contribute towards wagering requirements. Wagering contributions vary. 14 day expiry. Not all games contribute towards wagering requirements. £10 free paid as bonus funds.\n\nFirst Deposit Offer Up To £200\n\nT&C’s Apply. New players only. Opt in via the “My Promotions” page within 14 days of registration. Deposit £20, £50, £100, £150 or £200 as a single first deposit and wager 40x for a matched cash reward. Only cash stakes will qualify. Wagering contributions vary.\n\n21.co.uk online casino is owned and operated by LeoVegas Gaming PLC, who are licensed and regulated by the UK Gambling Commission (https://secure.gamblingcommission.gov.uk/PublicRegister/Search/Detail/39198).\n\nSafer Gambling\n\nFor gambling addiction help and support, please contact BeGambleAware at 0808 8020 133 or visit https://www.BeGambleAware.org. 18+",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-12-11T23:19:26Z",
  "updated": "2020-05-01T20:03:30Z",
  "releaseNotes": "Thanks for using 21.co.uk Live Casino. In this version, we've fixed some bugs, improved performance and added a few improvements. We would love to hear any feedback you have so don't forget to rate the app.",
  "version": "3.0.31",
  "price": 0,
  "developer": "LeoVegas Gaming Ltd",
  "score": 4.5061,
  "reviews": 164,
  "currentVersionScore": 4.5061,
  "currentVersionReviews": 164,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.nixwang.decision",
  "title": "Tiny Decisions",
  "description": "Tiny Decisions is an app that makes decisions fun & easy! Just input your question, add/import options, and spin the wheel to get a random answer.  Make quick decisions!\n\nIt’s always so hard to decide.  Should I get a pizza or a burger?  Should I get it in grey or black?  Should I do this or should I do something else? The Tiny Decisions app is created just for you!\n\nFeatures:\n\n* Make your own wheel\n* Touch to decide\n* Flip a coin\n* Built-in decision templates\n* Color themes\n* Add Siri shortcuts for your decisions\n* Set weights for the options\n* Select non-repeating options\n* Backup & restore your decisions\n\nPlease write a review if you like this app, it's very important to me.\n\nTwitter: @nixwang89\nMail: tinydecisions@qq.com",
  "genres": [
   "Entertainment",
   "Lifestyle"
  ],
  "contentRating": "4+",
  "released": "2018-03-30T22:07:42Z",
  "updated": "2020-04-11T10:00:05Z",
  "releaseNotes": "* Now you can adjust the volume of sound effect with volume buttons\n* UI improvements",
  "version": "2.2.1",
  "price": 0,
  "developer": "Xin Wang",
  "score": 4.62363,
  "reviews": 10216,
  "currentVersionScore": 4.62363,
  "currentVersionReviews": 10216,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.williamhill.vegas",
  "title": "William Hill Vegas",
  "description": "Welcome to William Hill Vegas!\nFrom classic slots such as Genie Jackpots, to casino card games and new and exclusive game releases, experience all the thrills of Vegas, wherever you are. You could even be a winner of one of our exclusive jackpots.\n\t•\tPlay our award winning Must Drop Jackpot games, for a chance to win one of 3 exclusive jackpots: the £2k Must Drop Jackpot, Daily Drop Jackpot and Big Drop Jackpot\n\t•\tThe Vegas Millions jackpots give our customers the chance to win massive jackpots, with over £7.5 million given away this year on great games like Wish Upon a Leprechaun or The Pig Wizard\n\t•\tLooking for something unique? We offer far more than just the classic slots. We’ve got loads of new slots for our customers to enjoy, that can’t be played anywhere else, including fantastic games like Good Feathers, Spin Doctor and Subbuteo\n\t•\tFancy taking on the dealer or a spin on roulette? Our exclusive Mayfair Roulette and Blackjack deliver every time\nSo, to experience the fun and excitement of Vegas wherever you are, download the app. \nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-11-06T18:15:15Z",
  "updated": "2018-11-14T13:49:29Z",
  "releaseNotes": "Bug fixes and performance enhancements to allow the App to run smoother and faster.",
  "version": "5.0.2",
  "price": 0,
  "developer": "WHG (International) Limited",
  "score": 2.76699,
  "reviews": 103,
  "currentVersionScore": 2.76699,
  "currentVersionReviews": 103,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.ellis.roulettevip",
  "title": "Roulette VIP - Free Casino Game",
  "description": "\"This roulette game is SOOO FUN! LOVE IT!\" ◆◆◆◆◆ - Craig \n\nPicture yourself arriving in Las Vegas.... You walk into your casino and hear the sounds of slot machines paying out, roulette wheels spinning, and people having FUN!! You can SMELL vegas already!!\n\nYou can hardly wait to get to the roulette table and bet on your favorites numbers!!! So you sit down, make your bets, and BOOM you HIT IT!! The croupier places the cradle on the winning number and begins to stack your winning chips up and SHIPS that huge pile of chips your way!! YOU FEEL GREAT!!!\n\nThe problem is that, we all can't afford to experience the thrill of vegas gambling as often as we like!!! :(((((\n\nIf only there was a roulette game on your iphone or ipad that could replicate that experience in a REALISTIC way to give you that same rush and fun experience!!!\n\nI am happy to tell you that your wish has come true!! Now you have this app Roulette VIP! It delivers the sounds, thrill, excitement, and smell of vegas!! ok... so maybe not the smell, but we promise you that everything else is REALISTIC and will make you FEEL like you are RIGHT THERE IN VEGAS!!!\n\nYou are probably thinking, \"yea, sure I have been promised this before.. whatever...\", but TRUST us, this roulette game is DIFFERENT! We have tried all the other ones and they just aren't very good :\\\n\nThat is the reason WHY we created Roulette VIP! So that you can experience the rush and high of gambling at roulette  in vegas from the comfort of your own home using your iPhone or iPad!!!\n\nDon't take our word for it though, look at the screenshots and testimonials below or better yet.. Download the free game and try it out for yourself!!\n\nP.S. This roulette game is THE BALLS, just try it! \n\nNOTE: \n- This app is for entertainment purposes only!\n- No real money or any other real world goods and/or services can be won in this game!\n\n√ NUMBER ONE Roulette game in the store! \n√ Realistic retina graphics!\n√ Realistic sounds, ambiance, and voice!\n√ Feels like you are ACTUALLY playing and winning roulette!\n√ Check out the screen shots & see for yourself \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬\n\n◆◆◆◆◆ - \"LOVE it because it is realistic!\" \n\n◆◆◆◆◆ - \"Love the sounds and graphics! Best roulette game for the iphone/ipad FOR SURE!\"",
  "genres": [
   "Games",
   "Board",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-01-18T20:28:35Z",
  "updated": "2014-09-14T17:45:10Z",
  "releaseNotes": "- Bug fixes",
  "version": "1.93",
  "price": 0,
  "developer": "Ellisapps Inc.",
  "score": 1,
  "reviews": 1,
  "currentVersionScore": 1,
  "currentVersionReviews": 1,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.abzorbagames.roulette",
  "title": "Roulette Live Casino",
  "description": "Roulette Live Casino captures the sprint of a truly awesome week-end in Vegas\n\nCome on in to the best casino game, spin the wheel at a turn-based table, feel\nthe tension and watch the fireworks if you win! Try out the “Strategy” feature\nand play like a Pro,  or check out the “Win Chance” meter to measure your\nchances of winning or loosing with your chip layout - thats awesome and\neducational too. there are loads of special features such as live chat,\nchallenge friends, swap cocktails and dress up in amazing outfits - be as cool\nas you feel and meet millions of gamers.\n\nIt is live so gather your friends or make news ones in this live multiplayer\nclassic at 100s of tables, VIP privilege suites, tournaments and challenges all\nwith Guest and Facebook sign in options.  And when you want to kick back from\nthe tables there are fantastic mini games such as Scratch ’n Match and Luck\nwheel to try your hand at winning a millions of chips!\n\nEvery game is fresh, new and exciting because its the mix of folks there that\nmake this so social. So come and join the fun you never know who you’ll meet.\n\nRoulette Live Casino is a free, online, game of chance and skill for\nentertainment purposes only. It is not possible to win real money, real\nitems/services/gifts or goods in kind by playing our skill games. The virtual\ncurrencies used in this game are called Chips and Diamonds and can be purchased\nin the ‘Store’ by using real money. Chips and Diamonds cannot be exchanged for\ncash or be paid out in any form and can only be used to play our game. Roulette Live Casino is intended for mature audiences and local legal age limits apply according to the App Store.\n\nPlaying Roulette Live Casino does not imply future success at real money gambling.\n\nTerms of Service: https://www.abzorbagames.com/terms-of-service",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-05-13T21:11:47Z",
  "updated": "2020-02-07T15:19:48Z",
  "releaseNotes": "New in the latest update!\n\n- Minor UI changes In our attempt to improve the user experience, we continue\nto deliver UI changes in each update",
  "version": "3.01",
  "price": 0,
  "developer": "AbZorba Games BetriebsgmbH",
  "score": 4.31579,
  "reviews": 38,
  "currentVersionScore": 4.31579,
  "currentVersionReviews": 38,
  "searchTerms": "roulette"
 },
 {
  "appId": "uk.co.pocketwin.roulette",
  "title": "Roulette by PocketWin",
  "description": "PocketWin Casino is proud to present: Roulette! This exclusive mobile roulette game puts a true casino classic in the palm of your hand, and with its stylish 3D graphics, you’ll feel like you’re taking a seat at the table for real!\n\nPlacing your bets is quick and easy, putting you in total control, so all you need to do is decide whether you’re backing red, or black!\n\nRoulette by PocketWin has been built exclusively in-house and is optimised for play on-the-go, so now you can spin that roulette wheel wherever you are!\n\n•\tAn exclusive 3D mobile version of this classic casino game\n•\tStylish graphics and streamlined gameplay\n•\tEasy to place your bets and see your cost per spin\n•\tPlay from just 10p a spin\n•\tFree welcome bonus for all new players\n•\tCompatible with 99% of mobile devices\n•\tPlay for real money prizes \n•\tCustomer support available 24/7\n\nIf a download bonus is available on this game it is valid only once per person, device and registered household.\n\n*T&Cs apply. 18+. Full details can be found at https://www.pocketwin.co.uk/legal/terms-and-conditions/",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-08-29T02:41:34Z",
  "updated": "2018-11-19T07:42:55Z",
  "releaseNotes": "Minor performance improvements.",
  "version": "2.0.3",
  "price": 0,
  "developer": "PocketWin",
  "score": 3.10526,
  "reviews": 57,
  "currentVersionScore": 3.10526,
  "currentVersionReviews": 57,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.betvictor.casino.app",
  "title": "BetVictor: Online Casino Games",
  "description": "Wager £10 Get £70: Our best ever Welcome Offer!\n\nThe BetVictor Casino app has the perfect Welcome Offer to get you started. New customers can get ahead with £70 in bonuses when you wager just £10. Already a customer? There’s an offer for you too! BetVictor offers some of the best betting and casino welcome offers out there.\n\nWhat you get:\n\nA £20 Slots Bonus, which can be used on any of our Slots;\nA £20 Table Games Bonus, which can be used on any of our table games except for Baccarat (all versions) or any Live Casino table games;\nA £10 Bonus for any of our Blackjack tables on Casino or Live Casino\nA £10 Bonus for any of our Roulette tables on Casino or Live Casino\nA £10 Game Show Bonus\n\nNew customers only. Wager £10 to get £70 bonus.Card Payments only. Up to 60 x wagering applicable. Deposit and wager within 7 days of opening new account. begambleaware.org. Please Gamble Responsibly. T&Cs apply https://bit.ly/2Je8qAZ\n\n\n\nAll The Best Online Games\n\nBetVictor has a live casino, slots and table game selection of over 1,000 of the world’s favourite games for you to explore. From traditional casino games like Blackjack and Roulette, to fun new games, you will find them all here. Enjoy placing a bet? Get great odds on your bets! Browse through games from the biggest and most trusted names in the industry. Easily view games and slots by most played, most popular and newest.\n\nNot sure which game is for you? Not sure if you’re better at blackjack or roulette?Try them out for fun and perfect your strategy before playing with real cash.\n\nHuge Jackpots\n\nThere’s millions to be won on BetVictor’s ready-to-drop Jackpot slots, so try your luck and keep your eyes out for that 777! It’s like being right there at the slot machine. Take part in our Game of the Week promotion each week. One featured game is chosen, and for each £10 wagered, you get one entry to win a share of £5,000. Whether your money is on red or black, experience the thrill and adrenaline rush of playing online. All that’s missing is a winner – will it be you?\n\nGuaranteed Winners With Daily Jackpots\n\nJackpots are dropping TODAY. Guaranteed! Try our selection of Daily Jackpots for your chance to win big at BetVictor Casino. \n\nAll 10 of our exclusive Daily Jackpot Slots come loaded with a Flash Jackpot that can drop multiple times a day, the bigger Daily Jackpot guaranteed to drop by 11pm, and the huge Mega Jackpot – the big progressive you can win any time!\n\nLove, Laugh, LIVE Casino!\n\nWant that authentic Casino experience? Then head over to our Live Casino where our friendly Live Dealers are ready to take your bets. Whether it’s Live Blackjack, Live Roulette or Live Baccarat you prefer, there’s always a seat for you at the table. \n\nBut the fun doesn’t stop there – not when you’ve got our all new Live Game Shows to play! Spin the wheel on Dream Catcher, beat the Banker in Deal Or No Deal, or build your property empire on MONOPOLY Live – all available to play now at BetVictor Casino!\n\nCasino bonus notifications\n\nIn addition to the frequent bonuses offered, you will receive notifications on your casino bonuses the minute it has been credited to you.\n\nAnd if you have a question or comment about a game, bet, or offer, our team is on call 24/7 to help you.\n\nNo matter if you’re more of a table game or jackpot slots kind of gambler, you’ll find what you’re looking for (and more) on the BetVictorCasino app. Download the app to play and enjoy the lights, sounds and thrill of winning!\n\nDisclaimer:\n\nThis is a real money gambling app. Please gamble responsibly and only what you can afford. For gambling addiction help and support, please Contact Gamble Aware UK (call 0808 8020 133 or visit begambleaware.org) or Problem Gambling Ireland (call 089 241 5401 or visit problemgambling.ie)",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-11-30T16:25:33Z",
  "updated": "2020-05-11T09:44:21Z",
  "releaseNotes": "We make regular improvements to the BetVictor Casino app. Our latest update focuses on bug fixing and improved performance.",
  "version": "11.9",
  "price": 0,
  "developer": "BetVictor Ltd",
  "score": 4.47965,
  "reviews": 565,
  "currentVersionScore": 4.47965,
  "currentVersionReviews": 565,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.playojo.skillonnet",
  "title": "Play Casino Games at PlayOJO",
  "description": "The PlayOJO casino app brings over 3,000 of the best REAL MONEY CASINO GAMES to your fingertips so you can win JACKPOT PRIZES wherever you are. Play VEGAS style, LIVE CASINO table games like BLACKJACK, ROULETTE and BACCARAT, or leading casino slots like STARBURST, RAGING RHINO, MEGA FORTUNE and MEGA MOOLAH where players can win jackpots worth millions in seconds! \n\nPlay at OJO today and get 50 FREE SPINS on your first deposit on our casino slot machines. At PlayOJO, there are no wagering requirements to withdraw and with OJO Plus, players earn MONEY BACK on every bet - win or lose. What’s more, OJO has no withdrawal limits!\n\nSo, what are you waiting for? Download the UK's favourite mobile casino today!\n\nWhy PlayOJO? \n\nMONEY BACK on every bet - win or lose with no restrictions\nHUGE JACKPOTS ready to be won!\nAll rewards paid in CASH - with ZERO WAGERING REQUIREMENTS ever!\nKickers – rewards offered every day to give you more playtime!\nReel Spinoffs – daily slot tournaments with big FREE SPIN packages to win.\nThe OJO Wheel – win FREE SPINS and get paid in cash!\nNo withdrawal limits!\n\nWith OJO’s innovative search function, players can search for their favourite game by category, what’s new, most popular, jackpot size, rating or by minimum/maximum bet size. \n\nAt PlayOJO, we want all our customers to enjoy:\n\n• The MOST POPULAR SLOT GAMES – like Rainbow Riches, Starburst, Slots of Gold and Fortunes of the Amazons \n• Huge PROGRESSIVE JACKPOT SLOTS like Mega Moolah and Mega Fortune. \n• All of the LATEST SLOTS like Vikings Go Berzerk, Valley of the Gods, The Reel Deal, Jewell Quest Riches and Orient Express\n• A top LIVE DEALER CASINO from Evolution Gaming that offers Roulette, Blackjack and Baccarat.\n• Fast withdrawals from 12 leading payment providers - each offering 24/7 support. \n• A high performance gaming platform that offers both real money and play money modes.\n• The safety and protection of PlayOJO's Gaming Commission of Great Britain license\n\n2017 Awards \n'Rising Star of the Year' - eGaming Review Operator Awards \n'Casino of the Year' - Malta iGaming Awards \n\nEvery time you play, you’ll move through the OJO Levels, picking up regular rewards like a spin on the OJO Wheel game where you can pick a prize wheel based on risk and reward. Win from a free spin and GET PAID IN CASH! \n\nEnjoy plenty of casino action with OJO’s Reel Spinoff tournaments in the form of FREEROLL and BUY-IN  SLOT TOURNAMENTS throughout the day. Simply enter, spin the selected slot and all wins will convert to points on a leader-board. You can win yourself a generous FREE SPINS package with no absolutely ZERO WAGERING RESTRICTIONS on wins.\n\nBut, it’s our PROGRESSIVE JACKPOT SLOTS where the BIG wins are. These slot games have jackpots that increase incrementally as players (from all around the world) play. The jackpot amount keeps progressing until the right symbols are aligned and the jackpot is triggered. There are many progressive jackpot games to play, with big and small jackpots. The top progressive jackpot slots are MEGA MOOLAH (which paid out the highest jackpot ever – £13.2 million) and MEGA FORTUNE.\n\nWith the Play OJO app you can enjoy all the excitement of the desktop casino straight from your mobile device. Enjoy OJO’s brilliant rewards and player-friendly platform through your touchscreen and get a fully interactive experience whether you’re on the commute, a work break or simply lounging at home!\n\nPlay OJO Casino is completely safe to play with all deposits protected with state-of-the-art security software.\n\nSo, what are you waiting for? Download today and enjoy all the fun of your favourite casinos the OJO way. \n\nConnect with OJO on Social!\nWebsite: www.playOJO.com\nTwitter: www.twitter.com/playOJO\nFacebook: www.facebook.com/playOJO\nInstagram: www.instagram.com/playOJO\n\n18+ only. www.BeGambleAware.org",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2017-03-20T19:23:21Z",
  "updated": "2019-10-16T20:01:49Z",
  "releaseNotes": "We’ve added performance improvements as well as new games for you to enjoy!",
  "version": "iOS APP 2.6",
  "price": 0,
  "developer": "Skill On Net Ltd",
  "score": 4.56968,
  "reviews": 5754,
  "currentVersionScore": 4.56968,
  "currentVersionReviews": 5754,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.RouletteEmperor.Casino",
  "title": "RouletteEmperor",
  "description": "Roulette Emperor is a casino game named after a French diminutive for the little wheel. In the game, players may choose to place bets on either a single number or a range of numbers, the colors red or black, or whether the number is odd or even.\n \nYou can hardly wait to get to the roulette table and bet on your favorites numbers! So you sit down, make your bets, and BOOM you HIT IT!! The croupier places the cradle on the winning number and begins to stack your winning chips up and SHIPS that huge pile of chips your way!! YOU FEEL GREAT!!!\nGet ready to spin your luck in this addictive and real looking roulette!\nGo! Go! Go! Bring out the real gambler in you!\n \nFeatures\n1 Realistic retina graphics\n2  Realistic sounds, ambiance, and voice\n3  Feels like you are ACTUALLY playing and winning roulette\n4 Check out the screen shots & see for yourself",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2013-06-18T21:19:47Z",
  "updated": "2017-03-03T22:21:15Z",
  "releaseNotes": "# New cool Graphics\n# Gameplay improvements\n# Bug Fixes",
  "version": "2.0",
  "price": 0,
  "developer": "Seasia Infotech",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.appstreetsoft.Roulette",
  "title": "Roulette 42",
  "description": "Bring Vegas and Monaco to your iPhone and iPad with Roulette Multiplayer, a complete Roulette app. Impeccably designed and intuitive, this one is sure to make you go \"wow\". \n\nPlay with your friends in private tables or let us match you with anyone around the world automatically. Compete with your friends for interesting titles and achievements. \n\nPlay, compete, show off and make friends!\n\nThe complete game\n************************************\nPlay as many as 20 different types of bets. Master the inside and outside bets and then, graduate to call and full bets. We got everything covered!\n\nFun for free \n************************************\nGet thousands of free chips daily. Refer your friends and get referral bonus every time your friend joins the game. There are other ways to get free chips as well. Play and feel like a high roller without dropping a penny!\n\nOnline Friends and Invite to Match\n************************************\nSee who is online and join in your friends' table automatically. You can also invite your friends or share invite links. If you prefer, you can always play on a public table or play offline in single player mode. There is always a table waiting for you!\n\nFive different lounges \n************************************\nChoose the lounge you want to play in and compete with like-minded people. Start with the Silver lounge and move up to the Diamond lounge.\n\nJoin the league \n************************************\nPlay and make your way to the leader boards and pick up hilarious achievements. \n\nCrowning glory \n******************************\nAs you play and gain expertise in the game, conquer various crowns and show them off to the world.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-05-16T19:33:07Z",
  "updated": "2018-01-31T18:51:00Z",
  "releaseNotes": "Roulette Multiplayer is now part of Casino 42. Upgrade to Casino 42 now!\n\n- Invite friends using in app notifications and game links\n- View currently online friends to play with them\n- Complete revamp of user interface\n- Refer friends and get free chips when they join\n- New leaderboards\n- Multiple bug fixes",
  "version": "5.0.1",
  "price": 0,
  "developer": "App Street Software Private Limited",
  "score": 3.75,
  "reviews": 96,
  "currentVersionScore": 3.75,
  "currentVersionReviews": 96,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.bet365.bet365CasinoApp",
  "title": "bet365 Casino: Games & Slots",
  "description": "bet365 Casino app is the place to play Blackjack, Roulette and Slots. We have a large selection of games, jackpots and slots.\n\nWhether you’re an aspiring spinner or a vegas veteran, the bet365 Casino app is the perfect casino app for you. \n\nJoin bet365 Casino today and play straight away. \n\nPlay all the latest games on your device with the bet365 Casino app, with a huge selection of Casino table games such as Roulette, Blackjack and Baccarat. \n\nPersonalise your play and access to your favourite real money games, whether you prefer Casino classics such as Blackjack and Roulette or the thrill and excitement of Slots - there’s something for everyone.\n\nPlay Live Casino, where you can play Blackjack, Roulette, Baccarat and Dragon Tiger with real life dealers. \nUse your existing bet365 account to log in, or sign up now.\n\nSpin to win across a wide range of slots - keep an eye out for familiar faces such as Superman and Batman. Play a range of video slots, search for the pot of gold with Plenty of Fortune or keep it classic with Crazy 7 and Lotto madness.\n\nGo for big cash jackpot slots in Age of the Gods and Jackpot Giant.\n\nGet lucky with fantastic slot games with bonus games, free spins and massive progressive jackpots.\n\nExperience live Roulette, Blackjack and other table games, when you play Live Casino with real life dealers. Sitting across from our live dealers who are ready to chat and waiting to spin the Roulette wheel or deal you in to Blackjack, Poker, Baccarat and lots more Live Casino games.\n\n•\tCompete in a range of exciting bet365 exclusive monthly promotions\n•\tLive Casino games\n•\tTable games\n•\tJackpot Slots\n•\tInstant Wins\n•\tNew games every week\n\nDownload the bet365 Casino app and start playing today! \n\nOur customer support team is on hand 24/7 to help with any queries.\n\nYou must be 18 or over to have a bet365 account.\nThis is a real money gambling app. Please gamble responsibly.\n\nFor the full terms and conditions please follow the link to the Developer Website below.\nPlease read the bet365 Privacy Policy (see link below) before installing this application. By installing and opening the application you are accepting this policy.\n\nFor gambling help and support in the UK, users can contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org.\nFor gambling help and support in IE, users can contact Gamble Aware at 1800 753 753 or visit http://www.problemgambling.ie.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2014-10-16T14:13:31Z",
  "updated": "2020-01-08T09:48:40Z",
  "releaseNotes": "We've made a number of enhancements and improvements. Please send us any feedback you have as we're always looking to improve our app!",
  "version": "19.60.8",
  "price": 0,
  "developer": "bet365",
  "score": 2.93373,
  "reviews": 166,
  "currentVersionScore": 2.93373,
  "currentVersionReviews": 166,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.gamesys.virgingamesslots",
  "title": "Virgin Games: Casino Slots",
  "description": "Everyone likes free stuff, so we’re giving you 30 Free Spins on our Double Bubble Slot when you play £10* at Virgin Games.\n\nDiscover the best Casino games, Poker tournaments and Slot machines, plus games you won’t find anywhere else. There’s also unmissable offers from the Virgin family, making Virgin Games the best online casino in the market.\n\nWhether you want the thrill of winning big money or just a bit of fun, you’re guaranteed to find a casino slot game or roulette table for you.\n\n- Enjoy POPULAR SLOTS like Rainbow Riches, Cleopatra, Da Vinci Diamonds, Pharaoh’s Fortune, Family Guy and Super MONOPOLY Money.\n\n- Play DAILY FREE GAMES like Search for the Phoenix or Doubly Bubbly to pick up CASH PRIZES or FREE SPINS. You just need your first deposit to be £10 or more.\n\n- Get the excitement of Vegas and win more with action-packed BONUS SLOT GAMES, Wild Symbols, Multipliers and FREE SPINS features.\n\n- Try all our MULTI-LINE slot machine games for FREE in Demo mode.\n\n- You could win a fortune playing PROGRESSIVE JACKPOT SLOTS.\n\n- Master classic table games like EUROPEAN ROULETTE, Roulette Streets of Gold, single deck BLACKJACK or Multiplayer Blackjack. There’s also Vegas Down Town Blackjack and Vegas Strip Blackjack for our thrill-seeking players.\n\n- Play INSTANT WIN games like Scratchcard Shop and Pillars of Fortune. \n\nPromotions\n - Buy into any Poker game to get a ticket into our exclusive ‘Chip and a Chair’ daily tournaments.\n\n- Discover exclusive offers from across the Virgin family, from holidays, to experience days, discounted train tickets, Virgin Media deals and much more.\n\nVirgin Games is a real money gambling app, featuring Roulette, Blackjack, table and Slot Machine games. \n\nAll customers enjoy 24/7 Customer Support and FAST withdrawals.\n\nAlready a member? Just download the app and log in with your existing details \n\nLike us on Facebook, Twitter or Instagram @virgingames\n\n18+ Please play responsibly. BeGambleAware.org\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits. \n\n*Welcome Offer\n1.\t30 Free Spins (1p coin size, maximum lines) for the game Double Bubble for new members only who: a) register; b) opt in to this promotion on first deposit of at least £10 (no retrospective opt in); and c) wager at least £10 in cash (“Qualifying Requirements”).\n2.\t30 days from when you make your first deposit and opt in to complete the Qualifying Requirements and play any Free Spins before they expire. Allow up to 72 hours for credit of Free Spins.\n3.\tOne promotion entry per member – no multiple accounts.\n4.\tYour deposit balance (if any) and any winnings related to either your deposit balance or the Free Spins are withdrawable at any time during this promotion.\n5.\tFull Welcome Offer Rules: www.virgingames.com/terms#welcomebonus",
  "genres": [
   "Games",
   "Casino",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2014-12-17T18:33:03Z",
  "updated": "2020-03-11T11:39:09Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.56012,
  "reviews": 9232,
  "currentVersionScore": 4.56012,
  "currentVersionReviews": 9232,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.paddypower.casino",
  "title": "Paddy Power Casino & Roulette",
  "description": "Deposit £/€10, Play with £/€50 + 20 FREE SPINS FOR BERRY BERRY BONANZA FOR NEW CASINO CUSTOMERS | T&Cs Apply\n\nOur new Paddy Power Casino app comes complete with Blackjack, Roulette, Slots and more, so you can now enjoy the Paddy Power Casino experience in the palm of your hand, on either iPhone or iPad.\n\nFEATURES\n- Play 150+ of your favourite Paddy Power Casino games for real money. This includes Roulette, Blackjack, Slots, Frankie Dettori’s Magic Seven, Jackpot Slots, and a hell of a lot more.\n- Our Casino app features games designed especially for iPhone, iPad.\n- Quick to load and easy to navigate.\n- Free play and real money, cash play.\n- Players can use the same login credentials as on online Casino, or Paddy Power Sports betting.\n- Deposit directly through the Casino app. \n- Register and deposit securely in 5 minutes. \n- Works just as well on 3G/4G as it does on WiFi.\n\nPaddy Power Casino is a product of the Paddy Power PLC, one of Europe’s largest gaming groups listed on the UK and Irish stock exchanges. We’re fully licensed and regulated by the Alderney Gaming Control Commission. Paddy Power Casino is only available to customers over the age of 18.\n\nT&C’s Deposit £/€10, Play with £/€50 offer:\n\n•Only new players from UK and Ireland who have never before played Paddy Power Casino\n•Deposits made with e-wallets (Paypal, Neteller, Moneybookers etc.) are not valid \n•Claim with a minimum of £/€10. The maximum bonus you can receive is £/€40 (400% of your deposited amount) \n•Once your bonus has been redeemed or lost, 10 free spins will become available to you.\n•All winnings from the initial bonus are capped at £/€500.\n•If you choose to ‘claim’ this bonus, you’ll need to wager the amount of the bonus 35 times.\n•Stakes on some of our games don't count in full towards the wagering requirement. Instead they have a percentage contribution:\n-Slots (Excluding double options)\t100%\n-Arcade, Scratchcards, Fixed Odds Games (Excluding Spin A Win/Lucky Wheel) 100%\n-Roulette (Excluding Zero Roulette and 3D) 50%\n-Card Games (Excluding Red Dog, Casino Hold'em, Casino War & Wild Vikings) 25%\n-Blackjack (Excluding Pontoon, Blackjack Surrender, Blackjack Switch, Zero Blackjack and Stravaganza) 25%\n-Sic Bo, Craps, Video Poker (All varieties), Pontoon, Blackjack Switch, Red Dog, Spin A Win/Lucky Wheel, Casino War, Casino Hold'em, Wild Vikings and Stravaganza, Zero Games, Blackjack Surrender and all double options on slots and on Video Poker (All varieties), 3D Roulette and any other games not in the eligible games list 0%\n•Once you complete the wagering requirements or lose your bonus, the free spins will appear on the casino promotion page. Accept your free spins and play them on Berry Berry Bonanza. Unused free spins expire in 24 h. Free spins have no wagering requirements. \n•If you cancel your bonus you also forfeit any pending winnings you have accrued. Cancelled bonuses and winnings cannot be refunded.\n•When a player chooses to participate in buy-in/match deposits, the combined value of their real cash buy-in amount is combined with a specified bonus. This is referred to as the Casino Promotional Balance. \n•You will only be able to qualify for one casino sign-up bonus. If you trigger any other promotional bonus while another is still active, the bonuses will queue in your bonus balance. \n•We reserve the right to govern how bonuses are used before a player is allowed to cash them in. As such we deem it necessary to restrict certain types of wagering from contributing to the wagering/turnover requirements.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-11-21T11:58:40Z",
  "updated": "2018-11-28T12:49:19Z",
  "releaseNotes": "We have been busy making sure our customers get the best possible casino experience. This version has improvements to load times along with bug fixes and we have updated our sign up offer for all you new customers - sign up now, deposit £/€10 and play with £/€50, T&C's Apply.",
  "version": "5.0.5",
  "price": 0,
  "developer": "Paddy Power PLC",
  "score": 3.19048,
  "reviews": 42,
  "currentVersionScore": 3.19048,
  "currentVersionReviews": 42,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.huge.slots.casino.vegas.ios.avidly",
  "title": "Double Win Casino Slots Game",
  "description": "Double Win Slots for free! Install Double Win Slots now to embrace the real thrill of true Las Vegas casino experience. best selection of casino slot machines, and huge payouts for free spins and jackpots.\nDouble Win Slots brings you the best slot machine gaming experience you have ever had with tons of fun!\nSpin this casino slots with gorgeous graphics, smooth animations and fantastic bonuses, collect daily FREE COINS and hourly FREE GIFTS! \nYou are starting an awesome casino journey in this best online casino Double Win Slots.\n\nGet ready to have fun?\nINSTALL NOW and make a fortune with excitement and entertainment!\n*******************************************************\nInstall Double Win Slots and Enjoy:\n► Huge payouts, incredible big wins, mega wins and super mega wins;\n► FREE daily login bonus, FREE mega wheel bonus and FREE coins every 3 hours;\n► Amazing new beautiful free slots games added on a weekly basis ;\n► WIN BIG with amazing jackpots, scatter slots and more\n► Lots of high quality slots with diverse thems and variety of gameplays;\n► Wild multipiers, free spins, expanding wilds makes you a fortune;\n► Wonderful quests will set you on the path to riches!\n► Install now to start having real slots fun!\n*******************************************************\nGo and install Double Win Slots now! You will discover an incredible world of Slots and Casino games. Wherever you are, you can open the Double Win Slots app to experience the wonderful night in real Vegas!\n*******************************************************\nFollow Double Win Slots on Facebook for free offers and exclusive coin packages.\nFacebook：www.facebook.com/DoubleWinSlotsGames",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-10-19T20:44:00Z",
  "updated": "2020-03-18T09:03:24Z",
  "releaseNotes": "Dear players：\n\nFixed some bugs in the game.\n\nMore rewards and more surprises in Double Win!\n\nGOOD LUCK!",
  "version": "1.71",
  "price": 0,
  "developer": "FG Games",
  "score": 4.89462,
  "reviews": 6339,
  "currentVersionScore": 4.89462,
  "currentVersionReviews": 6339,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.partycasino.casino",
  "title": "PartyCasino: Play Casino Games",
  "description": "Play all of your favourite REAL MONEY CASINO GAMES at PartyCasino, including SLOTS, BLACKJACK, ROULETTE, baccarat and INSTANT WIN games. Slick and easy to use, play anywhere, anytime using your iPhone or iPad.\n\nLOVE SLOTS?\nPlay over 1,500 slots and jackpot slot games including BUFFALO BLITZ, STARBURST, THUNDERSTUCK, ALIENS, CLEOPATRA, SOUTH PARK, WOLF RUN, BOOK OF DEAD and RAINBOW RICHES, or any of our many progressive jackpot slots like MELON MADNESS, BOOK OF MYTHS and MEGA FORTUNE WHEEL. All jackpots increase daily, with some reaching over £2 MILLION.\n\nLIVE CASINO\nGet even closer to the thrill of an authentic casino by playing a wide selection of table games in our LIVE CASINO suite. Powered by live casino specialists, Evolution Gaming, we have titles like Speed Live Roulette, Blackjack, Casino Hold’em and Baccarat.\n\nPLAY TABLE GAMES\nAre you a BLACKJACK whizz? Play one of a dozen blackjack variations, including Pro, Hi Lo, Charlie 7 or a live dealer version in our LIVE CASINO. We also have a choice of ROULETTE games to play on the go, from American to European and LIVE ROULETTE.\n\nINSTANT WIN GAMES\nLove INSTANT WIN games? Download the app to play over 50 different instant win games, from SLINGO, SUPER CASH BUSTER and BREAKING BAD to CLEOPATRA, GHOST BUSTERS and WHEEL OF FORTUNE.\n\nBONUSES AND PROMOTIONS\nAt PartyCasino, you can look forward to a personalised selection of easy-to-understand promotions, including WELCOME BONUSES, RELOAD BONUSES and FREE SPINS.\n\nBECOME A VIP\nHere at PartyCasino, we believe that our most valued players deserve the best possible rewards. That’s why we’ve set up an exclusive VIP SCHEME to bring them all of these personalised benefits and more:\n• bespoke bonuses\n• gifts and rewards\n• exclusive VIP events\n• personal account manager\n• dedicated 24/7 support\n• tailored cashier service\n\nGET CASHBACK\nOur new and improved CASBACK SCHEME provides instant, easy to claim REWARDS that build up every time you place a real money wager.\n\nSo what are you waiting for? Download the all new PartyCasino app for the ultimate casino experience.\n\nFor the best offers, follow us on social media;\n\nFacebook: facebook.com/partycasinouk/\nBlog: casino.partycasino.com/en/blog/\nTwitter: twitter.com/partycasino\nInstagram: Instagram.com/partycasino\n\nCUSTOMER SERVICE\nAt PartyCasino, we pride ourselves on our friendly and responsive customer service team, who are on hand 24/7 to answer any questions or issues you may have. Making a deposit is super quick and easy and if you win, cash outs are super-fast, so you will receive your winnings in no time at all.\n\nResponsible Gambling\n18+ T&Cs apply. begambleaware.org. Play responsibly.\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org\n\nLicensing \nPartyCasino operates under licence and in accordance with applicable laws and regulations.  For further licence information, please visit our website at www.partycasino.com.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-06-29T02:22:27Z",
  "updated": "2020-05-05T06:48:08Z",
  "releaseNotes": "In this version of PartyCasino, we've fixed some bugs, made load times faster, and improved overall app performance. We hope you like it!",
  "version": "20.04.06",
  "price": 0,
  "developer": "ElectraWorks Limited",
  "score": 4.67997,
  "reviews": 1303,
  "currentVersionScore": 4.67997,
  "currentVersionReviews": 1303,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.foxycasino.stage",
  "title": "Foxy Casino - Slots & Games",
  "description": "At Foxy Casino you can play all the best table, slots and Live Casino games plus win real money prizes with huge jackpots! Whether it’s Blackjack, Roulette, Starburst or any number of other games, the Foxy Casino app has you covered.\nDownload the app for your chance to experience the thrill of winning big.\nWhen the fun stops, stop.\n*TERMS & CONDITIONS\n• 18+ only\n• Players who join Think bingo agree to adhere to Company's general terms and conditions.\n• When The Fun Stops. Stop.\n• begambleaware.org\n--------------------------------------------------------\nThis app requires you to be over 18 in order to participate in any betting activity. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit begambleaware.org.\n \nWe're always happy to hear from you guys! If you have any feedback or questions please call us on 0800 376 7967 or email us at: support@foxycasino.com",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-03-03T23:55:57Z",
  "updated": "2018-09-14T09:16:12Z",
  "releaseNotes": "New and improved app",
  "version": "18.08.08",
  "price": 0,
  "developer": "Cashcade LTD",
  "score": 4.66714,
  "reviews": 703,
  "currentVersionScore": 4.66714,
  "currentVersionReviews": 703,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.idorweb.fma",
  "title": "Fruity Cashino Fruit Machines",
  "description": "Fruity Cashino lands on the iPhone and iPad in glorious free to play 3D. A collection of real pub and arcade fruit machines including Jackpot Genie, Luck O’ The Irish, Bar-X, 5 Star Roulette, and other familiar names such as Double up the Diamond, iFruitBomb Revolution and VIZ Showtime. With a raft of trophies to be won, you’re gonna love this compilation.\n\nJackpot Genie\nAn all new pub fruit machine, packed with features such as Ali Grabba, Aladdin Riches, Golden Wonders, Dream Maker, and plenty more.\n\nBar-X Classic Deluxe\nThe most popular fruit machine in the UK for many years, Bar-X has been in constant production since 1981. With over 100,000 machines sold to arcades, clubs and bingo halls, Bar-X now lands on your iPhone and iPad in glorious free to play 3D.\n\nLuck O’ The Irish\nThe hilarious tongue in cheek, Irish themed fruit machine. Packed with features such as Lotta Luck, On the Fiddle, Clover Cash, The Little Fella, In the Money, Make a Wish, and a whole lot more.\n\nAlice in Bonusland\nAn all new slots game, based around a well known theme, packed with fun features.\n\niFruitBomb Revolution\nThe iFruitBomb games have been available on the iPhone and iPad since 2009. The first in the series was originally launched as a 2D game, being transformed with the introduction of 3D gameplay very early in its evolution. iFruitBomb Revolution is a real machine arcade prototype based around these existing games.\n\nDouble up the Diamond\nBased on a real pub fruit machine, packed with features such as Reel Roulette, Diamond Scatter, Rise and Fall, Filthy Rich, Diamond Dash, and plenty more.\n\nKingdom of Wealth\nBased on the real machine of the same name, head into battle as the Queen, Monk and Barbarian attempt to take control of the kingdom.\n\n5 Star Roulette\nBased on the pub roulette game of the same name, 5 Star Roulette brings the high stakes world of the roulette table to your fingertips. Featuring bonus in-game scratch cards when you grab your winnings.\n\nVIZ Showtime\nRoger Mellie, the Man on the Telly presents his gameshow themed fruit machine, VIZ Showtime, on the iPhone and iPad in glorious free to play 3D. Based on the real pub fruit machine of the same name, it packs a punch with a stack of features including Morning Glory, Cash Convoy, Razzle Dazzle, Mellie’s Money, Roger’s Big Deal and plenty more.\n\nFree Gameplay Credit - Run out of credit? You’ll get free virtual scratch cards to play with every hour (Requires an online connection) to try your luck and grab free credit awards.\n\nHighscores - On the Bank Run you have 10 minutes to cash out with as much virtual cash as possible\n\nPlease note: All wins are simulated with the award of virtual credits for use within this game compilation. An internet connection is required in order to download the games within this compilation.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2016-01-27T01:55:54Z",
  "updated": "2018-03-31T16:16:12Z",
  "releaseNotes": "Head into battle with our exciting new game, Kingdom of Wealth.\nAlso contains updates and full screen support for the latest devices.",
  "version": "1.20",
  "price": 0,
  "developer": "Idor Interactive Ltd.",
  "score": 4.09837,
  "reviews": 1047,
  "currentVersionScore": 4.09837,
  "currentVersionReviews": 1047,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.GalaInteractive.GalaCasino",
  "title": "Gala Casino: Real Money Games",
  "description": "Play all of your favourite REAL MONEY CASINO GAMES at Gala Casino, including SLOTS, BLACKJACK, ROULETTE, baccarat and INSTANT WIN games.  Play anywhere, anytime using your iOS device.\n\nWhy Gala Casino? \n\nSLOTS \nPlay hundreds of slots and jackpot slot games including STARBURST, Big Banker Slot, The Goonies and Rainbow Riches or any of our many jackpot slots like DRAGON’S FIRE, Mystery Reels Megaways™ and Slot O Gold™.  \n\nLIVE CASINO\n\nGet even closer to the experience of an authentic casino by playing a wide selection of table games in our LIVE CASINO suite, from Blackjack, Roulette, Baccarat and Hi-Lo to Spin a Win, 3 Card Brag and Casino Hold’em.\n\nASIAN GAMES\nLove Macau Slots?  Download the app to play over a dozen Asian slot games like Astro Cat, Emperor’s Garden, Pai Gow Poker, Craps and Eastern Emeralds.\n\nBecome a Gala Casino VIP!\n\n•\tWelcome Bonus\n•\tWeekly Cashback \n•\tExclusive VIP Promotions & Events\n•\tDedicated Personal Account Manager\n•\t24 Hour VIPA Team Support\n•\tBespoke Offers & Bonuses\n•\tPriority Withdrawals\n•\tVIP Table Limits\n•\tExclusive VIP Promotions & Events\n\nFor a full list of VIP benefits, visit www.galacasino.com/vip\n\nFor the latest offers, follow us on Social Media \nwww.facebook.com/galacasinoofficial\nwww.twitter.com/GalaCasinocom\n\nFor Full Terms & Conditions on each bonus: \nhttps://www.galacasino.com/promotions/first-deposit-bonus\n\nResponsible Gambling \n18+.   This is a real money gambling app.  Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org.  \n\nFor users in the Republic of Ireland, please contact telephone 1800 753 753 or visit www.problemgambling.ie.\n\nGala Casino operates under licence and in accordance with applicable laws and regulations.  For further licence information, please visit our website at www.galacasino.com.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-10-08T22:35:05Z",
  "updated": "2020-01-06T10:51:41Z",
  "releaseNotes": "We regularly bring updates to the App Store for your enhanced Casino experience.This update includes:\nChanges to enhance the push updates \nBetter crashlytics tracking \n\nThe Gala Casino Team!",
  "version": "19.12.03",
  "price": 0,
  "developer": "Gala",
  "score": 4.60044,
  "reviews": 458,
  "currentVersionScore": 4.60044,
  "currentVersionReviews": 458,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.bskyb.SkyVegas",
  "title": "Sky Vegas: Casino Games",
  "description": "Sky Vegas is the ultimate destination for new, exclusive and exciting online slots. Download the Sky Vegas app to enjoy exclusive games, head-turning bonuses and offers, and the thrill of the unexpected, wherever you choose to play.\n\nEvery spin at Sky Vegas is another chance for a bonus game to kick in, a line to win or a jackpot to hit – the best bit is it could happen at any moment.\n\nSigning up is quick and easy. If you already have an account with Sky Vegas, Sky Bet, Sky Casino, Sky Poker or Sky Bingo, you can log in with your existing account details and discover all that Sky Vegas has to offer!\n\nPlay your way… \nOur app gives you complete control over your gameplay as you can…\n\nManage your account within the app\nRegister and log in\nRecover login details\nAdd payment details \nDeposit and withdraw funds \nView your account history\nAccess help & support\nUse Apple Pay to deposit quicker and easier than ever before\n\nSee this link for details on how to set up Apple Pay on your device: https://support.apple.com/en-gb/HT204506\n\nLike us on Facebook at: https://www.facebook.com/SkyVegas/\n\nFollow us on Twitter at: @skyvegas\n\n18+, BEGABLEAWARE.ORG\n\nPlease note all app images / previews shown here are for illustrative purposes only. Live promotions and offers on Sky Vegas may differ to those shown. See skyvegas.com for full details.\n\nResponsible Gambling: We’re responsible members of Senet Group that promotes sensible, socially responsible gambling. This is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support in the United Kingdom please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/ and in Ireland please contact Gamble Aware at 1800 753 753 or visit http://www.gambleaware.ie/\n\nThe Sky Vegas app is brought to you by Bonne Terre Limited, an Alderney registered company, and member of a group of companies known as “The Stars Interactive Group”.  Bonne Terre Limited is licensed by the UK Gambling Commission and Alderney Gambling Control Commission. Sky Vegas is a trading name of Bonne Terre Limited and part of the Sky Betting and Gaming group of products. The Sky trademarks used in the app are owned by the Sky UK Group and are used under license. To place a bet with Sky Vegas you will have to register an account with Bonne Terre Limited. You must be over 18 years of age to register with Sky Vegas. Customers located outside of the UK or Ireland will be prohibited from using this app.\n\nPlease Note: Apple Inc. is in no way linked or associated with this or any other competition / contents run in this app.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-01-11T10:07:40Z",
  "updated": "2019-08-05T09:42:19Z",
  "releaseNotes": "Maintenance release with bug fixes to keep Sky Vegas running as smoothly as possible for you.",
  "version": "2.9.0",
  "price": 0,
  "developer": "Sky Betting & Gaming",
  "score": 4.62579,
  "reviews": 3319,
  "currentVersionScore": 4.62579,
  "currentVersionReviews": 3319,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.gamesys.monopolycasino",
  "title": "MONOPOLY Casino",
  "description": "Welcome to the UK’s official MONOPOLY Casino – the home of the best Casino and Slot games. Download the free app now.\n\nGet 30 Free Spins on MONOPOLY Paradise Mansion when you spend £10*\n\nMONOPOLY Casino offers a wide range of themed Slots, including MONOPOLY Paradise Mansion as well as classic games Secrets of the Phoenix and Double Bubble. \n\nAny real money spin on one of our Slots could see you win one of four Community Chest Jackpots. You can also win a share of a Community payout if you are playing in the three minutes before another person wins a Community Chest Jackpot.\n\nA selection of Casino games are also available on the app, including your favourite classic casino game roulette.\n\nThere’s also MONOPOLY Daily Free Parking, the Daily Free Game that gives you the chance to win up to 50 Free Spins and £750 in real cash. You just need your first deposit to be £10 or more.\n\nNew MONOPOLY content and promotions are added to the app all the time, so keep an eye out for all of our latest releases.  \n\n18+ Please play responsibly. BeGambleAware.org.\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits. \n\n*Welcome Offer\n1.\t30 Free Spins (1p coin size, maximum lines) for the game MONOPOLY Paradise Mansion for new members only who: a) register; b) opt in to this promotion on first deposit of at least £10 (no retrospective opt in); and c) wager at least £10 in cash (“Qualifying Requirements”).\n2.\t30 days from when you make your first deposit and opt in to complete the Qualifying Requirements and play any Free Spins before they expire. Allow up to 72 hours for credit of Free Spins.\n3.\tOne promotion entry per member – no multiple accounts.\n4.\tYour deposit balance (if any) and any winnings related to either your deposit balance or the Free Spins are withdrawable at any time during this promotion.\n5.\tFull Welcome Offer Rules: https://play.monopolycasino.com/terms#welcomebonus\n\n\nThe MONOPOLY name and logos are trademarks of Hasbro. The distinctive design of the gameboard, the four corner squares, the MR. MONOPOLY name and character, as well as each of the distinctive elements of the board and playing pieces, are trademarks of Hasbro, Inc. for its property trading game and game equipment. ©1935, 2015 Hasbro, Pawtucket, RI 02862. All Rights Reserved",
  "genres": [
   "Games",
   "Simulation",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-10-20T15:46:20Z",
  "updated": "2020-03-11T11:41:54Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.59114,
  "reviews": 2348,
  "currentVersionScore": 4.59114,
  "currentVersionReviews": 2348,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.ladbrokes.pt.livecasino",
  "title": "Ladbrokes Live Casino Games",
  "description": "Fix up, look sharp for the banging full Live casino experience, all on the go. The new Ladbrokes Live Casino app allows you to take on the dealer wherever you are ! \n\nOur Live Casino provides all the thrill of a high-end casino with none of the hassle. Get ready for Live Roulette, Live Blackjack, Live Baccarat and more against a real dealer in the comfort of your own home.\n\nWe’ve got over 60 exclusive Live Casino dealers, who all add their own flavour to proceedings. With our new and improved app, you can ‘Pin’ your favourite dealers and tables. They’ll be right there for you when the app opens. \n\nOur studio design puts you at centre stage with its truly immersive experience. And now you can see a video preview and real-time info of every Live Casino table before you play.\n\nBut don’t worry, you’ll still get top-notch service from our live dealers, stunning HD graphics and unbeatable gameplay!  \n\nIt’s the Laaaaaaaaaadbrokes Live Casino you already know. But even better.\n\n\nUnique Features: \n\n•\tSlick new studio design offers enhanced realism and immersion\n•\tVideo preview and real-time information for every table\n•\tDynamic HD cameras bring the action to life on our exclusive Live \n        Roulette and Live Blackjack tables\n•\tLive Casino dealers\n•\tExclusive offers for Ladbrokes players\n•\tSimple sign-up process\n•\tSuperfast performance, whether you’re connected over wifi, 3G or 4G\n•\tSpecially designed for iOS and Apple products\n•\tLog in and play with your existing Ladbrokes Casino username and \n        password\n•\t24/7 Customer Service \n\n\n\nWe’re confident you’ll love the Ladbrokes Live Casino app, but if you find something that you think we can improve, send your feedback to reviewladbrokes@ladbrokes.com \n\n18+, Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please see below contact details for Gamble Aware in both UK and Ireland.\n\nUK: https://www.begambleaware.org and 0808 8020 133\n\nIreland: https://www.problemgambling.ie and 1800 753 753\n\nLadbrokes Betting & Gaming Ltd. is licensed (licence no. 1611) and regulated by the British Gambling Commission for persons gambling in Great Britain and LC International Limited, Suites 6-8, 5th Floor, Europort, Gibraltar are licensed (RGL Nos. 010, 012) by the Government of Gibraltar and regulated by the Gibraltar Gambling Commissioner.\n\nCopyright © 2018 Ladbrokes\n\nThis App is not endorsed or sponsored by Apple for any of its contests or sweepstakes within this app and is solely the responsibility Ladbrokes Betting & Gaming Ltd. © 2018 Ladbrokes",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-04-28T07:00:00Z",
  "updated": "2019-09-25T07:04:14Z",
  "releaseNotes": "Play HD live casino games such as Blackjack, Roulette, Baccarat and more from the comfort of your home with a real live dealer!\nIn this version:\n- Stability improvements\n- Bug fixes\nThe thrills of table games await you - only at Ladbrokes Live Casino Games App.",
  "version": "18.48",
  "price": 0,
  "developer": "Ladbrokes Sportsbook LP",
  "score": 4.63873,
  "reviews": 346,
  "currentVersionScore": 4.63873,
  "currentVersionReviews": 346,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.betfair.innovation.casino",
  "title": "Betfair Casino & Roulette",
  "description": "New players can sign up to Betfair Casino today and claim their 25 Free Spins. T&C's Apply.\nBetfair Casino also offers new customers the opportunity to choose their welcome bonus on their first deposit. Download the Betfair Casino App & start playing now. \nFeatures\n•\tBrand New Live Casino \n•\tOur Casino app features games designed especially for iPhone and iPad\n•\tQuick to load and easy to navigate\n•\tFree play and real money, cash play\n•\tPlayers can use the same login across all Betfair products\n•\tEasily deposit within the Betfair Casino app\n•\tRegister and deposit securely in 5 minutes\n•\tWorks just as well on 3G/4G as it does on WiFi.\nPick a game, strap yourself in and feel the Gs. Whatever you’re looking for, we’ve got you covered: cards, casino games, slots, you name it. \nPlay classics like roulette and blackjack or try our latest additions ‘Green Lantern and Batman’. Enjoy the high life without having to get dressed up.\nWhatever you’re in the mood for, you’ll find something to keep that buzz going. The Casino is open 24/7/365. \nWith so many options, you’re bound to find something you like. So start spinning, hitting, sticking and winning now. \nYou must be 18 or older and have a valid Betfair account to use this app.\n\nT&C’s: 25 Free Spins\nOnly for new players in UK and Ireland\nOne account per customer\nAny customer who has received a separate new customer free offer in the casino will be excluded. \nThis promotion will run from 6th June 2018 until further notice.\n\nVerify your account using our SMS verification tool displayed within the promotion. Insert your mobile telephone number and we’ll send an instant SMS with your unique activation code to your mobile. Insert this code into the promotion page where indicated and your 25 free spins will instantly become available to you. Your mobile number will not be used for marketing purposes. \nIf you do not wish to verify your account with our SMS verification tool, you can verify your account by sending us a copy of your documents. Once we have verified your account, your bonus will be available on your promotions page. Please note this can take up to 72 hours. \n\nFrom the promotions page, you will be able to accept your free spins and start playing any of the eligible games. The spins are valued at 1p per line. \nYour free spins expire after 7 days of accepting them, if they are not used. \nWinnings from the free spins have no wagering requirements.\nIf you trigger any other promotional bonus while another is still active, the bonuses will queue in your bonus balance. \n•\tOne account per customer.\n•\tIf a player is ineligible, or if a player is found to have multiple accounts, we reserve the right to withhold payment of the prize/bonus and any pending winnings\n•\tWe reserve the right to change or discontinue this promotion at any time for any reason \n•\tIf any term of the promotion is breached, or if there is evidence that a customer is using the promotion to guarantee profits regardless of the outcome, we reserve the right to reclaim the bonus element, and any pending winnings from play generated using the bonus funds.\n\nThe casino reserves the right to withhold any withdrawals and/or confiscate all winnings for irregular play. Irregular play includes, but is not limited to: \no\tPlacing single bets equal to or in excess of 30% of the value of the bonus + deposit before the wagering requirements for that bonus have been met.\no\tMoving from a low weighted game (25% or less) to a high weighted game (100%) after large wins for the purpose of clearing wagering requirements.\no\tPlaying equal to or more than 500 auto spins on a Slot machine and/or playing a Slot machine consistently for a period longer than two hours while a bonus is active.\no\tLow risk Roulette bets. ANY bet spread combination on Roulette games covering 25 or more (67%) of the 37 unique number spots on the table.\nBetfair Casino Standard T&C’s apply. Full T&C’s: https://promotions.betfair.com/casino-25freespins-new-1/",
  "genres": [
   "Games",
   "Sports",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-06-10T08:38:29Z",
  "updated": "2019-01-01T08:48:07Z",
  "releaseNotes": "New feature: You can now contact a customer service agent in real-time using our new messenger app. Access it via the “Contact Us” page in the app.",
  "version": "5.0.6",
  "price": 0,
  "developer": "Betfair",
  "score": 3.73494,
  "reviews": 83,
  "currentVersionScore": 3.73494,
  "currentVersionReviews": 83,
  "searchTerms": "roulette"
 },
 {
  "appId": "uk.co.mrspin.roulettegold",
  "title": "Roulette Gold by Mr Spin",
  "description": "*** 100% FIRST DEPOSIT MATCH for all new players! ***\n\nMr Spin’s mobile casino offers all of the glitz and glamour of Las Vegas from the comfort of your own home with their European Roulette game!\n\nRoulette Gold is an absolute icon of the casino, with the classic red or black question being an adage as old as the casino itself. Built exclusively for Mr Spin and optimised from the ground-up for use on smartphones and tablets, this title is sure to get you in a whirl with its portability and ease of use.\n\nWhat’s more, there’s a hidden multiplier mini-game in this version of Roulette, which could see players turn their original bet into a small fortune! That’s sure to get you in a spin!\n\n•\t100% first deposit match up to £100*\n•\tClassic slots style mini-game offers chance to win 300x original bet\n•\tBet from 10p\n•\tDeposit in-app from £5 using a debit or credit card\n•\t£3 deposits accepted when paying by phone bill\n\nIf a download bonus is available on this game it is valid only once per person, device and registered household\n\n*18+. New players only.  100% deposit match of first deposit, up to £100 awarded as bonus credit with a 1x wagering requirement.  Bonus credit is not withdrawable.  T&Cs apply.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-09-12T10:17:40Z",
  "updated": "2018-04-23T12:03:35Z",
  "releaseNotes": "Minor improvements to enhance the overall experience.",
  "version": "1.0.2",
  "price": 0,
  "developer": "Mr Spin Limited",
  "score": 3.47059,
  "reviews": 17,
  "currentVersionScore": 3.47059,
  "currentVersionReviews": 17,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.tripledot.blackjack",
  "title": "Blackjack",
  "description": "The Best Blackjack game is out now! Bet big to win big, or play the long game and prove you can beat the dealer! With free chips, you can play this casino style game with no risks, and with random cards, our games are guaranteed fair and fun!\n\nNever played Blackjack before? This is your chance to learn the game in and out. With no real money at risk, you can play this classic casino game just for fun! You'll be winning in no time.\n\nBlackjack is easy to play! Place a bet, and you'll receive 2 cards. Picture cards are worth 10 points and Aces are worth either 1 or 10. \"Hit\" for another card, and get your score as close to 21 as you can without going bust.\n\nIf you like Poker, Roulette or Slots we know you will love this Casino Classic!\n\nBy playing Blackjack, you agree to our Terms of Use and Community Guidelines available at https://www.tripledotstudios.com/tos",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2019-08-30T07:00:00Z",
  "updated": "2020-04-23T07:42:39Z",
  "releaseNotes": "This update to Blackjack brings a number of improvements:\n\n* You can bet even higher with some of our new high-value chips!\n* More levels are coming soon!\n* A new auto-deal feature to increase game speed.\n* We've also made various behind-the-scenes fixes and improvements.\n\nWe hope you'll enjoy this update! Good luck!",
  "version": "1.5.5",
  "price": 0,
  "developer": "Tripledot Studios",
  "score": 4.51206,
  "reviews": 373,
  "currentVersionScore": 4.51206,
  "currentVersionReviews": 373,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.mansion.mcslots",
  "title": "MansionCasino.com",
  "description": "### DOUBLE YOUR MONEY WITH OUR WELCOME BONUS ###\n\nEnjoy all the thrills of MansionCasino.com wherever you are with our super speedy app, and if you’re a new customer we’ll double your first deposit up to £200! \n\nJOIN NOW AND GET 100% EXTRA ON YOUR FIRST DEPOSIT!\n\nIf you’re already a member of MansionCasino.com you won’t need to register – simply download our snazzy app and get spinning. We want to double your fun, with double the funds… Simply download our app and register, and we’ll give you 100% extra on your first deposit, up to a juicy £200. What a way to start your mobile gaming fun with us!\n\nBut that’s not all! Get used to doubling your money when you play with us – as with our monthly promotion ‘Make your Match’, you can grab a 100% reload bonus on your first deposit of each month.\nAnd with a whole host of exciting online slots, blackjack, roulette and classic casino games all just a tap away, you’re spoilt for choice with where to play your bonuses. So if you’re looking for a new favourite casino, look no further than MansionCasino.com! \n\nSignificant Terms: **New customers only**\n•\tMaximum bonus £200, wagering 20x, Minimum deposit £20\n•\tGame weighting applies, see below table \n•\tBonus betting limits: Slots - £5 All other games – 10% of bonus amount.\nFor more info and full T&Cs please go here: http://mobile.mansioncasino.com/promotions/welcome-bonus\n\n*** GAMES FEATURES GALORE ***\nThere’s something for everyone at MansionCasino.com! If you fancy a spin on our action-packed slots, you’ll be spoilt for choice. We have a huge selection offering multiple reels and paylines, boasting all the features you’ll find on desktop and more.\n\nIf you prefer, you can enjoy the classic casino games such as blackjack, roulette or poker, or try out one of our more unique games. Whatever your favourite is – you’re sure to find it here!\n\nMobile gaming has never been better, and offers a host of touch-screen benefits to add to the fun! Get ready to spin your own reels and tap and drag your own chips, with a host of interactive features to enjoy.\nMansionCasino.com has been designed purely with the player in mind, ensuring it’s easy to use and intuitive to navigate.\n\n*** PLAY FOR REAL MONEY OR FOR FUN ***\nWhether you want to practice your skills first, or get straight to spinning and (hopefully!) winning – you can play all our games in either fun mode, or for real money once you create an account. The choice is yours!\n\n*** 24/7 CUSTOMER SERVICE ***\nMansionCasino.com are committed to providing unrivalled customer care to our players. Our friendly support team is available 24 hours a day, 7 days a week! Simply email support@mansioncasino.com or call us on 0800 376 8375 – our free phone number in the UK – and we’ll be happy to help.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-12-17T03:35:03Z",
  "updated": "2019-10-01T21:55:15Z",
  "releaseNotes": "General bug fixes, improved localisation and welcome offer to enhance your app experience.",
  "version": "4.3.1",
  "price": 0,
  "developer": "Casino.com",
  "score": 4.91327,
  "reviews": 1349,
  "currentVersionScore": 4.91327,
  "currentVersionReviews": 1349,
  "searchTerms": "roulette"
 },
 {
  "appId": "uk.co.drslot.casinoroulette",
  "title": "Roulette by Dr Slot",
  "description": "*** Deposit £10 and play with £20! ***\n\nDr Slot is well known for his top secret casino experiments, but this time, he’s set his sights on a true casino classic: Roulette! He’s taken this timeless table game and turned it into a slick and streamlined mobile casino experience, incorporating real 3D, his trademark neon lights and a super-straightforward way to place your bets. \n\nHe’s taken care to cater for experienced casino explorers and first-time adventurers alike, so everyone can experience the thrill of spinning the Roulette wheel, anytime, anywhere! Will you be rocking it on red, or having a blast on black? Step up to the table and see what Dr Slot has in store for you! \n\nRoulette by Dr Slot is completely exclusive to Dr Slot Casino, so you won’t find it anywhere else! Download Roulette by Dr Slot today, deposit £10 in-game and get £20 to play with!* \n\n•\tPlay Roulette on your mobile in glorious real 3D\n•\tBet from as little as 10p a spin\n•\tEasy betting – just drag and drop your chosen chips\n•\tNeon styling and super-smooth gameplay\n•\tAvailable to play on 99% of mobile devices\n•\tTry your luck to win real money prizes\n•\tGenerous welcome bonuses for new players\n•\t24/7 UK-based customer support\n\nIf a download bonus is available on this game it is valid only once per person, device and registered household\n\n*18+. New & existing players. First deposits of £10 or more in Dr Slot Roulette will be rewarded with £10 of bonus credit. Deposit treated as cashable credit. Withdrawals on cashable and bonus credit are subject to wagering requirements. Full T&Cs apply.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-05-07T13:41:59Z",
  "updated": "2018-07-12T11:54:06Z",
  "releaseNotes": "Minor performance improvements.",
  "version": "1.0.2",
  "price": 0,
  "developer": "Dr Slot Limited",
  "score": 2.6,
  "reviews": 15,
  "currentVersionScore": 2.6,
  "currentVersionReviews": 15,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.aspire.karamba",
  "title": "Karamba Casino Games & Slots",
  "description": "Karamba Casino App – Play Online Casino Games, Slots, Roulette, Blackjack, Scratch Cards and More. We at Karamba have an astonishing selection of games that are suitable for everybody, regardless of your preference. Encounter the thrill of REAL Karamba casino.  \n\n You must be 18+ to access our site. Get ready to have fun! We prefer to celebrate responsible fun gaming the “Karamba Way” by greeting our lucky, newly hatched players, with a Welcome Bonus – 100% bonus on your first deposit up to £50 for UK players unless otherwise stated. This bonus only applies for first deposits of £10 or higher! We also offer secure payment solutions & quick secure withdrawals. Our live support is here to assist you anytime wish. \n\nWith Karamba you're finally ready to enjoy online casino the Karamba way!  \n\n  \n\nCASINO   \n\nKaramba casino opens its virtual doors and offers you access to everything from video slots, bonus slots and progressive jackpot slots, to online scratch cards, table games, and more.  \nThe thrills don’t stop there either!   \n\n  \n\nKARAMBA SPORTS BETTING  \n\nKaramba puts Sports Betting right at the center of its thrills mandate with soccer, tennis, basketball, rugby league, boxing, ice hockey, cricket, darts and snooker to mention only a few! Karamba also has markets for just about every other popular sport and takes sports betting seriously, adding even more thrills to an afternoon of sporting action. If there's a significant sport or event generating interest within the UK, we’ve got the coverage; if there's a big match, game or fight that's getting the country excited, we’ve already compiled the markets.  \n\n   \n\nLIVE CASINO UK  \n\nLive casino games offer a similar experience to playing in a land-based casino, complete with all the mod cons right in your front room or while you’re on the move! You can play variations that use French rules or American rules, and there are also games that permit you to spin multiple wheels at once, as you place all types of unique bets. The live casino games you'll find on Karamba include UK players' favourites from multiple games of blackjack and roulette, covering all rule systems. \n\n   \n\nPLAY UK ONLINE SLOTS  \n\nKaramba is the ultimate place to hone your gaming groove and party with the most well-liked UK casino slots! We've got a huge selection of slot machines, covering best in class games like Book of Dead, Starburst, Fire Joker and our bespoke branded game Karamba Clan! There are many video slots with immersive themes, wide varieties of pay lines and multipliers. Games like Myth, Viking Runecraft and Legacy of Egypt will transport you back to ancient worlds; while games like Ninja Fruits, Fruit Spin and Bust the Bank combine old-school symbols with modern features. Not forgetting King Kong Cash and Fortunium, which use advanced, near-3D graphics, to make something that appears and feels likes a mobile movie experience! \n\n   \n\n \n\nONLINE VIRTUAL SCRATCH CARDS  \n\nScratch Away... You only need a Karamba account, and you’re good to go. If you've taken part in our Welcome Bonus, then you'll even be ready to use your bonus credit to play a number of these cards. Scratch cards are easy to select & play.  \n\n\n18+ ONLY, Gambling is often addictive, Please Play Responsibly, www.begambleaware.org. 0808 8020 133 (UK) - 089 241 5401 (Ireland). Our responsible gaming page is out there at https://www.karamba.com/info/responsible/  \n\nT&Cs Welcome bonus:   \n\nAvailable at https://info.karamba.com/BonusPolicy.aspx?popup=1&cur=GBP&LNG=ENG&BackBtn=0 https://www.karamba.com/info/bonus-policy/  \n\n   \n\nBe the one to settle on everything: the sport you would like to play, the duration of your playing encounter and the way you select to play. – The selection is all yours.  \n\nFollow us on Facebook for more exclusive offers and bonuses:    \n\n• Website: https://www.karamba.com/",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-06-18T02:40:08Z",
  "updated": "2020-04-24T14:09:18Z",
  "releaseNotes": "Bug fixes and performance improvements",
  "version": "1.227",
  "price": 0,
  "developer": "ASPIREGLOBAL MARKETING SOLUTIONS LTD",
  "score": 3.88889,
  "reviews": 252,
  "currentVersionScore": 3.88889,
  "currentVersionReviews": 252,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.bwin.casino",
  "title": "bwin Online Casino Games",
  "description": "Download the new bwin Casino app and grab your Welcome Bonus!*\n\n\nEnter the new bwin Casino and play slots, Roulette games and Blackjack. Beside these classics, we offer lots of different casino games and great promotions. So make your start into the exciting world of our bwin Casino and why not try to crack the casino jackpot, or get cashback!\n\nThis is what awaits you in our bwin Casino:\n\n•\tPlay Blackjack and Roulette games – various versions of these classic casino games are right at your fingertips. Simply select your favourite and start playing for real-money stakes at our casino!\n•\tLive Casino with Live Dealers: no need to suit up, simply log in hit the tables and play Blackjack & Roulette games with our gorgeous Live Dealers. \n•\tWe’ve optimised the interface of the bwin Casino app. What awaits you is an easier navigation and new bonus notifications – so you’ll never miss out on your chance to play for real-money stakes at the bwin Casino.\n•\tIn the new “Recently played” category of the bwin Casino, you can find your favourite casino games even faster.\n•\tA large collection of proprietary casino games - and also from industry leaders like NetEnt and Evolution. \n•\tHead over to the “Top Games” tab for our popular casino games. New slots online? Want to play Blackjack? Updated Roulette games available? How heavy is the current casino jackpot? Where can I get the next slot bonus? Here’s the right place to stay informed. \n\nConvinced? Then download the bwin Casino app now and enter the thrilling world of our online casino games! For players who have a bwin account already, it’s easy to update or install the new bwin Casino app and start playing. For all new customers, there is a casino Welcome Bonus worth up to €200 waiting for you. So download, open a bwin account, deposit, play for real-money stakes at the bwin Casino and grab your casino bonus on the way!\n\nKnow your limits\nNo matter how much you love playing casino games, everyone needs to know their limits. \nYou must be 18 years of age or over to use the bwin Casino application.\n\n*For the full promotional Terms and Conditions, please follow this link: https://casino.bwin.com/en/casino/p/promotions/6000/65/6581 (the “T&Cs”)\n\nOnline Support:\nhttps://www.bwin.com/en/account/contact",
  "genres": [
   "Entertainment",
   "Casino",
   "Games"
  ],
  "contentRating": "17+",
  "released": "2015-01-14T01:16:19Z",
  "updated": "2018-06-18T05:54:24Z",
  "releaseNotes": "Thanks for using bwin! To make our app better for you, we bring updates to the App Store regularly. Every update of our bwin app includes improvements in speed and reliability. As new features become available, we’ll highlight those for you in the app.",
  "version": "18.05.06",
  "price": 0,
  "developer": "ElectraWorks Limited",
  "score": 4.66474,
  "reviews": 173,
  "currentVersionScore": 4.66474,
  "currentVersionReviews": 173,
  "searchTerms": "roulette"
 },
 {
  "appId": "WilliamHillCasino",
  "title": "William Hill Casino",
  "description": "Big fan of the slots, or fancy your luck at the tables? Prefer to play live or are you dreaming of that big jackpot win? Whatever you’re into, William Hill casino is bursting with entertainment.\n  \nOur app is designed around you and how you like to play. Which means you can get to the games you love, faster. Wherever you are.\n \n•\tHave you seen our impressive range of huge jackpots? Get involved and you could be our next big winner\n\n•\tWhy go anywhere else? We’ve got all the casino classics, live tables, plus a wide range of slots including blockbuster games such as Superman the Movie and American Dad\n\nThe app requires you be over 18 to participate in any gambling activity. Full details can be found on www.williamhill.com\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-03-05T17:25:58Z",
  "updated": "2018-02-26T09:50:21Z",
  "releaseNotes": "You will find our smart new look and feel when accessing the account menu!",
  "version": "3.8",
  "price": 0,
  "developer": "WHG (International) Limited",
  "score": 4.33814,
  "reviews": 763,
  "currentVersionScore": 4.33814,
  "currentVersionReviews": 763,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.roxypalace.mobile",
  "title": "Roxy Palace Casino & Games",
  "description": "The latest version of the Roxy Palace Casino app is now available in the App Store! Get the best real money experience straight on your iOS device and other smartphones. With the newest blockbuster slots added every month & very best live table experiences – what are you waiting for? Install the app and play your favourite games today!\n\nROXY PALACE WELCOME OFFER: \n\n◆ JOIN TODAY TO GET £10 ABSOLUTELY FREE - NO DEPOSIT REQUIRED! \n◆ MAKE YOUR FIRST DEPOSIT TO GET A 100% BONUS UP TO £100 – PLUS 50 FREE SPINS! \n\nAt the world-class Roxy Palace you can play some of the best online slots in HD to win real money! With a wide range of games on offer, Roxy Palace allows you to have the very best casino experience in the palm of your hand. Claim your welcome bonus today and spin the reels on classics such as Thunderstruck II & Immortal Romance – or take a seat at the live tables and experience the thrills of a casino straight from your device!\n\n\nRoxy Palace Features:\n\n◆ All the best games in one place – Enjoy a premium casino experience with hundreds of the best slot titles available including Thunderstruck II, Immortal Romance, Highlander & Jurassic World!\n\n◆ Enjoy the realism of a live casino – Nothing says excitement quite like sitting at the live tables. Play roulette & blackjack with the very best dealers… All in HD quality! \n\n◆ Spin for the jackpots – Mega Moolah & Major Millions are just a couple of the progressive jackpot slots available at Roxy Palace with whopping million pound payouts!\n\n◆ 24/7 support – Our award-winning support team is always on hand to help! \n\n\nRoxy Palace Bonuses: \n\n◆ Love a bonus?  From welcome offers, daily promotions, leaderboards and tournaments… It’s all covered for both new and existing players!\n\n \nRoxy Palace Feature Online Slots:\n\n◆ Highlander \n◆ Avalon\n◆ Thunderstruck II\n◆ Immortal Romance\n◆ Mega Moolah\n◆ Lucky Leprechaun\n◆ Jurassic World\n◆ Lost Vegas \n◆ Castle Builder II\n\n\nInstall the Roxy Palace Casino app today to enjoy a premium casino experience!\n\n\nWelcome Bonus terms and conditions:\n\n**** £10 Free - No Deposit Bonus ****\nNew accounts only. Max. withdrawal £100. 50x wagering, game contributions vary, max. stake applies. 7 day expiry. Full terms apply.\n\n**** 100% Bonus up to £100 – Plus 50 Free Spins on Highlander ****\nNew accounts only, Min £10 deposit, debit/credit card and Paypal only, up to 50x wagering, game contributions vary, max stake applies. Full terms apply.\n\nYou must be over 18 to install & play on the Roxy Palace app. \nThis is a real money gambling app. Please gamble responsibly.\nbegambleaware.org.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2014-02-14T19:05:57Z",
  "updated": "2018-09-27T20:45:36Z",
  "releaseNotes": "Thank you for using the Roxy Palace Casino app – we’ve added some fantastic features to this new update to give you the very best casino experience!\n\n◆ BETTER PROMOTIONS – Our promotions team are always looking to give our players the best experience, and with new daily offers, leaderboards & tournaments there’s something for everyone!\n◆ BIGGER TITLES – We’ve added to our wide game portfolio with some new blockbuster titles – packed full of features & top-notch graphics! Whatever you are in the mood for, you’ll find it in the app\n◆ FASTER SPEED – It’s quicker than ever before… Play your favourite games seamlessly and enjoy the thrills of the casino on all iOS devices",
  "version": "2.2.0",
  "price": 0,
  "developer": "32Red",
  "score": 2.375,
  "reviews": 8,
  "currentVersionScore": 2.375,
  "currentVersionReviews": 8,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.bamwl.partygame",
  "title": "Sex Roulette: Couple games",
  "description": "We’ve worked hard on this last update and we firmly believe there’s never been a better time to (re)discover Sex Roulette! Lovingly crafted, truly titillating content, guaranteed to satisfy your most carnal needs.\n\nThe app contains 4 couples games adapted to you whether your relationship happens to be lesbian, gay, straight...\n\n● Naughty scenarios ● \n\nBreak the routine with this unique concept: you’ll make your way through stages that progress as you play and are tailored to your sexual orientation. You’ll quickly find yourself swept along by the game - as you move up through the stages, the temperature will steadily rise too… will you make it all the way to the end?\n\n3 free modes are available.\n- “Get me going”: (re)discover some hot foreplay with this (supposedly) softer mode.\n- “Unleash”: a much wilder mode. Pleasure guaranteed, but for the more daring couples.\n- “Fantasy to reality”: a mode specially designed to make your secret turn-ons come to life.\n\n● Wheel to decide ●\n\nLooking for some inspiration in the bedroom? Maybe you’re just always open to new experiences? Well, roll the dice and try out some new positions. Standing, lying down, on your side, on your knees… from the simplest to some truly acrobatic poses, there’s something here for every taste.\n\n● Red-hot dice ●\n\n4 dice to turn up the heat with actions that are as unpredictable as they are dirty. In the hot version they’ll even have you getting right down to business. Apart from from a dirty action to be applied to an erogenous zone, our dice will add an extra challenge and a time limit in which it must be completed.\n\n● A Truth or Dare to play as a couple… or as a group! ●\n\n5 full Truth or Dare modes. From soft to hardcore, and with a mode specially conceived for couples, play the hottest version of your childhood favourite. If you feel like playing with fire, you could invite some friends. Just be careful not to get burnt!\n\n● All lovingly crafted by passionate app developers ● \n\nHere at GreenTomatoMedia, we respect your privacy: we refuse to integrate targeted ads and are totally against this as a business model. Experts in all things party app - couples games, drinking games, games between friends… - we update our apps every month with new content and new features.\n\nWe hope you’ll enjoy them all as much as we’ve enjoyed creating them for you!",
  "genres": [
   "Entertainment",
   "Games",
   "Trivia"
  ],
  "contentRating": "17+",
  "released": "2016-03-22T23:48:35Z",
  "updated": "2020-05-04T11:43:12Z",
  "releaseNotes": "Relax and enjoy yourself during this lockdown time ;) The Sex Roulette team is bringing you a bunch of improvements:\n- the Sexy Dice have been redone—you'll now get hotter, funnier and more clever combinations than ever!\n- new, hot Never Have I Ever game with questions to uncover your partner or date's secrets <3\n- several languages added, for those of you who are quarantined with a sexy Swedish person or who are enjoying the company of a beautiful Brazilian...\n- part of the app redesigned",
  "version": "5.7.2",
  "price": 0,
  "developer": "GreenTomatoMedia",
  "score": 4.32645,
  "reviews": 242,
  "currentVersionScore": 4.32645,
  "currentVersionReviews": 242,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.funstage.gta",
  "title": "GameTwist Online Casino Games",
  "description": "Play some of the most legendary slots in the ultimate casino for Novoline slot machines! Enjoy Book of Ra, Sizzling Hot, Lucky Lady's Charm and many more popular slots & casino games in the GameTwist online casino! Play these exciting games whenever you want and wherever you are on your smartphone and tablet. In addition to slot machines, you can also play real casino classics such as roulette or blackjack! \n\nThe GameTwist app also provides you with a wealth of exciting Challenges to enjoy your favourite casino games and earn exciting rewards. From Spin Challenges to Stake Challenges and much more, spinning the reels is extremely rewarding on GameTwist! \n\nOne of the most popular features on GameTwist are our Leaderboard games that allow you to compete against other players in our community and fight for top positions and huge rewards! \nOr how about linked jackpots or promotions with Free Spins? There are many ways to have fun at GameTwist Casino!\n\nHere are just a few of our top titles:\n- Book of Ra™ \n- Faust™ \n- Lucky Lady’s Charm™ deluxe \n- Sizzling Hot™ deluxe\n- Roaring Forties™\n- Reel King™\n- Book of Ra™ deluxe\n- Dolphin’s Pearl™\n- Fruit Sensation™\n- Just Jewels™ deluxe\n- Dolphin’s Pearl™ deluxe\n- Ultra Hot™ deluxe\n- Lord of the Ocean™\n- Mystic Secrets™\n- Pharaoh’s Tomb™\n- Fruits’n Royals™\n- Golden Sevens\n- Fruits’n Sevens™\n- Golden Ark\n- Gorilla™\n- African Simba™\n- Katana™ \n\nAlso included in our gaming universe: \n\n+++ Legendary table games from Poker to Roulette to Blackjack +++ Hugely popular skill games like Pool and Solitaire +++ Bingo in a range of exciting variations +++\n\nAnd then there are our extra features: Daily Bonus (Wheel of Fortune game), Time Bonus, level system, VIP Club, special holiday promotions, leaderboard games, slot battles and much more! \n\nReady to become part of a vast community and take your gaming fun to the next level? \nThen get the GameTwist app now!\n\nPlease note: \nGameTwist is a free online game of chance for entertainment purposes only. It is not possible to win real money or real items/services/gifts or goods in kind by playing our slot machines. The virtual currency used in this game is called ‘Twists’ and can be purchased in the ‘Shop’ using real money. ‘Twists’ cannot be exchanged for cash or be paid out in any form. ‘Twists’ can only be used to play these games. The games are intended solely for an adult audience which is 18+ years.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2011-12-12T11:07:15Z",
  "updated": "2020-04-28T09:14:30Z",
  "releaseNotes": "Hi GameTwist Fans!\nHere's a new update with fixes to improve your game experience!\nEnjoy playing the GameTwist App? Then please consider rating us. Your feedback counts!",
  "version": "5.20.1",
  "price": 0,
  "developer": "Funstage Spielewebseiten Betriebsges.m.b.H.",
  "score": 4.58424,
  "reviews": 1751,
  "currentVersionScore": 4.58424,
  "currentVersionReviews": 1751,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.32red.casino",
  "title": "32Red Casino & Slots",
  "description": "The award-winning casino, 32Red, presents the best mobile real money casino app straight to your iOS device and other smartphones... Play a huge range of casino games all under one app, including the latest slots and old favourites like Roulette and Blackjack - you can also take a seat at the live tables too!\n\n◆◆JOIN TODAY TO CLAIM £10 ABSOLUTELY FREE – NO DEPOSIT REQUIRED◆◆ \n\nExperience the thrill of a casino right in the palm of your hand, with over 150 top quality games available, fantastic daily bonuses and the chance to win life changing jackpots! The multi-award winning 32Red Casino has it all. \n\nInstall the app today and not only will new customers get £10 absolutely free – but you can also take advantage of our exclusive first deposit bonus! What are you waiting for? Win real cash today!\n\n32Red Games & Features:\n\n◆ Play new and exclusive slots only at 32Red including Ant & Dec’s Saturday Night Takeaway™ and I’m A Celebrity… Get Me Out Of Here!™\n\n◆ Get the very best real Roulette experience straight from your device, our Live Roulette tables provide the full package - expert, friendly dealers and an exciting real-time environment.\n\n◆ Enjoy our selection of Live Blackjack tables which take the game to a new level of excitement, realism and fun.\n\n◆ Play classics such as European Roulette & Blackjack, the mainstay of all top casinos.\n\n◆ Huge Progressive Jackpot slots such as Megah Moolah (guaranteed £1 million) and Major Millions, with life changing sums up for grabs.\n\n◆ Round the clock help from an award winning player support team.\n\n◆ The very best VIP experience… Become casino royalty!\n\n\n32Red Bonuses:\n\n◆ Get industry leading promotions - from welcome bonuses, daily offers, leaderboards and tournaments… It’s all covered for both new and existing players!\n\n\n◆◆Install the 32Red app today for the very best casino experience!◆◆ \n\nWelcome bonuses apply to new accounts only. Wagering and terms apply. 18+. Begambleware.org.\n\nAnt & Dec © is a registered trade mark of Anthony McPartlin and Declan Donnelly. SATURDAY NIGHT TAKEAWAY™ & © ITV Studios Limited 2018. Licensed by ITV Broadcasting Limited. All rights reserved.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-01-10T22:44:10Z",
  "updated": "2018-05-25T00:17:14Z",
  "releaseNotes": "Thank you for using the 32Red Casino app – we’ve added some fantastic features to this new update to give you the very best gaming experience!\n \n◆ LATEST RELEASES – With over 150+ games already we don’t want to stop there. We’ve added some more thrilling games to keep you entertained including Highlander™ & Deco Diamonds – packed to the brim with exciting features and each offering you the chance to win whopping payouts!\n \n◆ PROMOTIONS – Cash in on some of our latest promotions available to our app players. From leaderboards to free game giveaways – it’s all covered!\n \n◆ SPEED – It’s quicker than ever before… Play your favourite games seamlessly and enjoy the thrills of the casino on all iOS devices",
  "version": "2.1.1",
  "price": 0,
  "developer": "32Red",
  "score": 1.98684,
  "reviews": 228,
  "currentVersionScore": 1.98684,
  "currentVersionReviews": 228,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.betway.livedealer",
  "title": "Betway- Live Casino & Roulette",
  "description": "You’re sat in a casino. You know what it's like to have the urge to win. You know what it feels like when your luck comes in. Now all the thrills and excitement of the Live Casino experience are available at your fingertips! \n\nThe Betway Live Casino App brings high definition live streamed Roulette, Blackjack, Poker and Baccarat casino games from our many studios across the globe!\n\nInteract and chat with our world class croupiers and dealers, who bring you the best possible chance of taking down the house. This way you can play without the hassle of trawling your money down the local Casino. Just cash out your winnings on your mobile in a matter of hours. \n\nCouple this with our exclusive Welcome Bonus* to get you started, which is available to all new players, and you’ll be able to kick start your adventure and explore everything we’ve got to offer. \n\nYou’ll have access to our regular exclusive Live Casino Bonuses and tournaments that can now be claimed straight from your mobile, allowing you instantly join the action - even when you’re on the go!\n\nWe want you to make the most out of your time with us here which is why we’re giving you the power to make your Betway experience a unique one, with our Betway Plus loyalty scheme. Each and every time you play with us you’ll earn Plus Points that let you progress up through our loyalty tiers, where you’ll gain exclusive bonuses and tailor-made offers! \n\nThe good times don’t stop there, because when you download the Betway Live Casino App we’ll give you exclusive promotions and plus point initiatives. You can even redeem your points straight from your mobile to keep the good times rolling!\n\nEnter a world of sleek graphics, immersive sound effects and top notch gaming, all brilliantly optimised to work seamlessly on your iOS device and replicate the thrills of a real casino. \n\nChoose from the following game types:\n\nRoulette, Blackjack, Poker and Baccarat \n\nABOUT US: \n\nBetway was launched in 2006 and has become one of the world’s leading online and mobile gaming sites. We offer both Sports Betting and Casino and have a wide variety of games and markets to bet on. \n\n*Apple is in no way associated with this Betway Welcome Bonus promotion. £250 Welcome Bonus is split over the following deposit match promotions: \n\nNew customers only. Opt-in required. 100% Match Bonus up to £250 on 1st deposit of £20+. 50x bonus wagering applies as do weighting requirements. Debit Card & PayPal deposits only. Advantage Play may invalidate your bonus. Terms apply.\n\nSee http://casino.betway.com/terms-welcome-bonus/ for Welcome Bonus T&Cs and http://casino.betway.com/terms-and-conditions/ for full T&Cs.\n\n**Please be aware the continued use of GPS running in the background can dramatically decrease battery life.\n***Please note, in light of new regulations, if you are using the app in the UK, to make use of the Session Reminder feature, please update to the latest version of the app.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2015-07-13T09:13:57Z",
  "updated": "2020-05-07T08:36:13Z",
  "releaseNotes": "Take a seat at your favourite casino game, we’ll take care of the rest. From slots to blackjack and roulette, we’ve got all the top games for you to choose from, including:\n\n• Slots: Starburst, Mega Moolah \n• Roulette: European Roulette Gold, Evolution Roulette & Live Roulette HD\n• Blackjack: European Blackjack Gold, Evolution Blackjack & HD Live Blackjack\n• Wheel of Fortune: Evolution Dream Catcher\n\nAre we your favourite casino app or could we do better? Let us know & leave a review.",
  "version": "7.5.2",
  "price": 0,
  "developer": "Betway",
  "score": 4.81081,
  "reviews": 148,
  "currentVersionScore": 4.81081,
  "currentVersionReviews": 148,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.yourcompany.asd-roulette",
  "title": "Euro Roulette",
  "description": "Added daily bonus.\nWITH NEW BETS!!!\n\nRoulette - the most common game in casino. Excitement, the dynamics of games, fantastic prizes - all of this is based on its popularity around the world. It is attributed to various magical properties, the relationship with the devil, felt the finger of fate, etc. Maybe they are right - the sum of the numbers on the wheel = 666. \nDo not lose your head and just enjoy the game. \nThe rules are very simple: you put the chips of different value in the area of playing field and expect to drop the ball, which will specify the winning number. \nWe hope our software will give you a lot of fun. \nEnjoy the game!",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2009-08-04T01:10:44Z",
  "updated": "2018-12-08T02:08:40Z",
  "releaseNotes": "Improved application performance.",
  "version": "2.5",
  "price": 0,
  "developer": "ASD Soft",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.gtm.drinkingwheel",
  "title": "Drink Roulette: Drinking Games",
  "description": "So, you’re with your mates, maybe pre-gaming, maybe after-gaming. Maybe right in the middle of the game…\nYou love roulettes but let’s face it: you’re too skint to go to an actual casino. \n \nWorry not, dear, friends.\n \nWe have JUST what you need to step your night up a notch: a drinking game that is quite frankly the dog’s b...\n \n- A tidy little design\n- Totally original rules\n- Battles where the winner takes all and the loser… DOWNS THE LOT.\n- Dirty “never have I ever” games\n- Crazy “would you rather” games\n- Speed and reflex games\n- Hilarious “most likely to…” votes\n \nSo, that’s what awaits in Drink Roulette with its 5 game modes, each designed around the mood of your soiree, from “Lads, I’ve a big day tomorrow” to “I’m pulling a sicky!”\n \nAnd, since we’re good blokes and you’ve already forked out for booze, the first game mode is absolutely FREE, with no pop-up ads or annoying subscription requests.\n \nBy the way, we are GreenTomatoMedia. If you take a look at what we do, you’ll see we like livening up your nights and just making fun happen whatever ways we can. If you want to support a team of young guys, passionate about mobile games to fire up when the sun goes down, play Drink Roulette and let us know what you think by leaving us a comment. We are always updating our apps based on what we hear from all of you out there. So, thanks!\n \n________________________________________\n \n- Includes in-app purchases\n- Please drink responsibly\n- Never EVER drink and drive\n- No one should ever be forced to complete a challenge they’re not comfortable with.\n\n________________________________________\n\nPremium pack & features subscription: \n\nDrink Roulette offers an auto-renewing subscription option: $4.99 per week. Once you've confirmed your order, the payment will be charged to your account, with the right price for your country. The subscription will automatically renew at its end date. You can stop the automatic renewal any time. To avoid the renewal, cancel it at least 24h before the end date of your subscription. No refund is available for unused time. \n\nTerms & conditions: https://www.applicationiphone.info/drinkroulette-terms-conditions/\n\nPrivacy policy: https://www.applicationiphone.info/drinkroulette-privacy-policy/",
  "genres": [
   "Entertainment",
   "Board",
   "Games"
  ],
  "contentRating": "17+",
  "released": "2016-05-05T03:58:33Z",
  "updated": "2020-04-24T02:22:55Z",
  "releaseNotes": "We're still improving our Drink Roulette app by bringing the special touch that was missing from our game screen design. Let us know what you think. Have a good game!",
  "version": "3.2.2",
  "price": 0,
  "developer": "GreenTomatoMedia",
  "score": 4.36262,
  "reviews": 8855,
  "currentVersionScore": 4.36262,
  "currentVersionReviews": 8855,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.adchat.access",
  "title": "Adult Chat - random live video",
  "description": "It isn’t easy to escape from loneliness. Don’t beg your friends, seniors and co-workers for a blind date anymore.The Adult Chat app is a collection of all the hot women and handsome men.\n\nWith Adult Chat you can,\nCreate an eye-catching profile\nMake your search more accurate\nMeet, chat and flirt in the chat room\nEasily contact with you interested\nEnjoy a private video chat with your match\n\nThe application uses your location and shows you people nearby.(We're all about using technology for your convenience. We use location but we never tell people where you are)\n\nReady to have some fun?\nWhat are you waiting for?\nBegin your love journey, chatting now!!\n\nPlease Note:\n- We provide 2 length of membership subscription, all of them can get membership only vary in length and price, you can simply select one of the them to upgrade\n- 1 month: $19.99 USD, 3 months: $49.99 USD\n- Payment will be charged to your iTunes Account upon confirmation of purchase\n- Subscription is automatically renewed unless auto-renewal is turned off at least 24-hours before the end of the current period\n- Your account will be charged for renewal within 24-hours prior to the end of the current period, and will identify the cost of the renewal\n- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase\n- No cancellation of the current subscription is allowed during an active subscription period\n- Any unused time left on your trial subscription will disappear if you upgrade to the paid version before its time has lapsed.\n- Our privacy policy can be viewed at\nhttps://sites.google.com/view/adchat/privacy\n-Our Terms of Use can be viewed at\nhttps://sites.google.com/view/adchat/terms\n\nIf you don’t choose to purchase any subscription, you can simply continue using Adult Chat app for free.",
  "genres": [
   "Social Networking",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2019-12-31T08:00:00Z",
  "updated": "2020-01-01T02:15:14Z",
  "version": "1.0",
  "price": 0,
  "developer": "JUE HE",
  "score": 4.68243,
  "reviews": 296,
  "currentVersionScore": 4.68243,
  "currentVersionReviews": 296,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.mansion.casinoslots",
  "title": "Casino.com: Live Games & Cards",
  "description": "Play for a chance to win jackpots on slots and Live Casino games such as Roulette, Blackjack and other fun card games. \n\nJoin in the fun! Whether you’re a whizz on live slots or a master at Roulette, check out our Welcome Offers today! You’ll get a double your money, plus 200 spins Welcome Package. Or you can choose our Table Welcome Bonus and get 20 Golden Chips - wager free.\n\n3 reasons you’ll love to play with Casino.com:\n\n1. There’s never a dull moment - Play one of our many live slots and casino games. Plus, you could win big on a progressive jackpot. \n2. Practice or play for real - Practice playing our games until you find one you love. Our demo mode option lets you experiment as much as you like. \n3. Get rewarded when you play - Enjoy a double-your-money plus 200 spins Welcome Package, and other exciting promotions.\n\nBrowse through your favourite games easily. Play anywhere, anytime with our easy to use app design. Don’t miss out on any fun and games - there’s something for everyone at Casino.com. \n\n>>>> DOWNLOAD FOR A DOUBLE-YOUR-MONEY WELCOME BONUS AND 200 SPINS* <<<< \nPlay all your favourite games with Casino.com including slots, Roulette, Blackjack and more for the chance to win big! \n\nWe are thrilled to introduce you to the latest generation casino app, built exclusively for your iPhone and iPad. \n\nWelcome Package \n\nSpins\n• New customers only\n• Total of 200 spins available upon first deposit \n• 20 spins given on registration (UK only)\n• Spins and bonus wagering on Age of the Gods slot games only\n• Wager 20x before withdrawing\n\nWelcome Bonus\n• New customers only\n• Minimum deposit $/£/€20\n• Maximum bonus $/£/€100\n• Wager 40x before withdrawing\n• Game weighting applies – please see below table\n• Bonus Betting limits: Slots - £5 All other games – 10% of bonus amount\n• Full T&Cs: https://www.casino.com/promotions/welcome-bonus/ \n\nTable Welcome Bonus Significant Terms and Conditions \n\n• New customers only.\n• Min deposit $/£/€20.\n• $/£/€20 real money stake on selected Blackjack games or Roulette to earn 20 Golden Chips.\n• Roulette wagering contribution weighting applies.\n• Golden Chips wagering on selected Blackjack and Roulette games only, expire within 14 days.\n\nFull T&Cs: https://www.casino.com/uk/promotions/table_card/ \n\nUNBEATABLE CUSTOMER SUPPORT\nCasino.com offers unrivalled customer care – if you need help with a specific issue the Customer Support team are ready to listen 24/7. \n\nSAFE AND SECURE\nLicensed and regulated to operate in the UK, Casino.com is a key player in the highly respected Mansion Group. Our online casino is safe, secure, and second-to-none. From cleverly engineered games for mobile devices and tablets, to an interactive Live Casino where you can enjoy all the action in the company of a real croupier, Casino.com UK has your online casino experience covered.\n\nDownload Casino.com and join the fun today.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-10-13T11:24:02Z",
  "updated": "2020-01-08T16:46:59Z",
  "releaseNotes": "General improvements and optimizations.",
  "version": "5.5.0",
  "price": 0,
  "developer": "Casino.com",
  "score": 4.88919,
  "reviews": 1101,
  "currentVersionScore": 4.88919,
  "currentVersionReviews": 1101,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.agilepixel.genting",
  "title": "Genting: Real UK Online Casino",
  "description": "New Player Welcome Bonus details:\nValid from 17/06/18 to 27/02/19. New players only (first deposit). 100% Deposit Match Bonus from £20 to £200: Min 50x wagering (% game weightings apply https://www.gentingcasino.com/bonus-and-promo/wagering-new/), play restrictions apply. Max bonus bet of £5, 15 days to accept & 30 days to complete wagering. Deposited funds locked to casino platform until wagering met. Your own deposited funds can be withdrawn at any time. Real money funds used first. Free Spins: Available after deposit bonus is redeemed/lost, credited as £2 bonus. Dream Catcher https://www.gentingcasino.com/game/dream-catcher/ only. 1x wagering and Max bonus bet of £5 applies to winnings. 7 days to accept & 7 days to complete wagering, maximum withdrawal from winnings is £200. Bonus funds used first. Full T&C's https://www.gentingcasino.com/bonus-and-promo/new-player-welcome-bonus/.\nYou must be over 18 to participate in any gambling activity. Begambleaware.org. Play it Safe. \n\nPlay Casino on exclusive tables, live from Genting Casinos. Enjoy a huge selection of favourite games: Blackjack, Roulette, Baccarat, Wheel of Fortune, or slots and jackpot slots. Download the app and deposit now! \n\nLive Casino\n\nImmerse yourself in a full range of Real Casino, Live & Online table games including:\n\n● Genting Live Blackjack\n● Genting Live Roulette\n● Genting Live Baccarat\n● Genting Live Three Card Poker\n\nFor an altogether superior experience, why not step into our online recreation of Mayfair's premium gaming club, Crockfords. Now featuring Baccarat Squeeze!\n\nSlots \n\nWe have over 300 of the biggest, best known and most played titles in the slots world with a selection of games featuring progressive jackpots which can exceed £1 million!\n\n● Cleopatra\n● Mega Jackpots Cleopatra\n● Da Vinci Diamonds\n● Lucky Lady's Charm Deluxe\n● Book of Ra Deluxe\n● Wish upon a Jackpot\n\nAdvocates of safe and responsible gaming, Genting Casinos UK Limited (Genting) are committed to providing our customers with a safe and secure environment in which to gamble. If you are subject to self-exclusion from Genting then please do not install this app. Furthermore, Genting holds no liability for notifications received on a device if this app has not been deleted.\nGenting understand that the safety and security of your personal data is of paramount importance and make every effort to protect personal data to ensure you can play online with peace of mind.\n\nThis website is owned and operated by Genting Casinos UK Limited who is licensed and regulated by the UK Gambling Commission (licence number 537). Details of its current licensed status as recorded on the Gambling Commission's website can be found at https://secure.gamblingcommission.gov.uk/PublicRegister/Search/Detail/537",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-02-10T15:35:43Z",
  "updated": "2019-02-21T17:23:16Z",
  "releaseNotes": "We regularly update the Genting app in order to give you the best possible user experience.\nIn this release we have:\n\nUpdated the SR logos",
  "version": "1.3.10",
  "price": 0,
  "developer": "Genting",
  "score": 2.9697,
  "reviews": 33,
  "currentVersionScore": 2.9697,
  "currentVersionReviews": 33,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.grosvenor.livecasino",
  "title": "Grosvenor Live Casino Online",
  "description": "The UK’s premier Live Casino mobile experience with a £20 Welcome Bonus for all New Customers*\n\nOr if you’re a member of any of the Grosvenor Casinos across the UK, join today and get up to £200 in welcome bonuses*\n\nEnjoy the thrill of playing Live Casino games with the UK’s biggest casino brand, Grosvenor Casinos, on your phone or tablet.\n \nTake a seat at our Live Roulette, Blackjack, Baccarat, 3 Card Poker or Hold’em tables and enjoy top quality gaming provided by friendly, professional, and experienced dealers in an app that puts the power of the casino in the palm of your hand.\n \nWith HD quality video streaming\n \nImmerse yourself in the full casino experience and never miss a moment of the action thanks to crystal clear video, streamed straight to your device in stunning HD. \n \nAvailable where you want, when you want\n \nThe action never stops in our mobile Live Casino with games available to play 24/7 with a dedicated helpline to provide you with comprehensive support if you need it. Download the app today and you’ll be able to access our full range of features and games wherever you go.\n \nGames currently available\n- Live Roulette \n- Live Lightening Roulette \n- Live Blackjack \n- Live Hold’em \n- Live Baccarat \n- Live 3 Card Poker \n- Live Ultimate Texas Holdem \n- Live Caribbean Stud Poker \n- Live Dream Catcher \n \nGetting started\n \nIf you’re new to Grosvenor Casinos, you can sign up quickly and easily through the app. Or, if you already play online, simply log in with your account details and start playing immediately, with fast Face ID login. \n\n\nSafety and security\n \nGrosvenor Casinos has been a trusted and respected operator of casinos in the UK for over 40 years and remains so today. As the largest land-based casino operator in the UK, we understand that the safety and security of your personal information is of vital importance. That’s why we’ve made every effort to protect your data and ensure that you can play with peace of mind and enjoy the games in our app.\n\t\n*Terms and Conditions apply, see grosvenorcasinos.com for further details.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-05-30T08:09:00Z",
  "updated": "2019-10-22T11:16:10Z",
  "releaseNotes": "In this version: \n• Bug fixes and performance improvements",
  "version": "3.12.1",
  "price": 0,
  "developer": "Grosvenor Casinos Ltd",
  "score": 4.3348,
  "reviews": 911,
  "currentVersionScore": 4.3348,
  "currentVersionReviews": 911,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.greenpanda.blackjack",
  "title": "Blackjack ∙",
  "description": "Welcome to the #1 Blackjack! Play as in real casinos and beat the dealer to win tons of dollars!Blackjack, also known as twenty-one, is the most widely played casino banking game in the world.\n\nRULES AND OPTIONS\n\nBlackjack is a card game between a player competing against the dealer. It is played with two or more decks of 52 cards.\nThe object of the game is to beat the dealer in one of the following ways:\n\n- Get a BlackJack on the player's first two cards (21 points), without a dealer blackjack.\n- Reach a final score higher than the dealer without exceeding 21\n- Let the dealer draw additional cards until his or her hand exceeds 21.\n\nCASINOS\n\nTravel all around the world and play in the most popular casinos: \n- Casino of Las Vegas\n- Casino of Paris\n- Casino of Macau\n- Casino of London\n- Casino of Monte Carlo\n- Casino of The Bahamas\n\nFEATURES\n\n- Blackjack pays 3:2 \n- Dealer must stand on a 17 and draw to 16\n- Insurance pays 2:1\n- Hit, Stand, Double Down, Split or Surrender\n\nIMPORTANT NOTICE\n\nThis game contains an algorithm that strictly respects Blackjack rules. Cards are shuffled and dealt in the exact casino way to ensure a 100% fair gameplay.\nIn-app purchases cost real money - be responsible when playing games including money. \nThis Blackjack game is a gambling simulation game, it neither involves real money gambling, nor provides any means to win real money or prize.\n\nCONTACT\n\nPlease feel free to contact us at support@greenpandagames.com if you encounter any problem regarding this app.\nFor the latest news and updates on Green Panda Games:\n\nLIKE us on Facebook\nhttps://www.facebook.com/Green-Panda-Games-1696022237280275/\n\nFollow us on Twitter\n@greenpandagames\n\nVisit us at:\nhttp://www.greenpandagames.com",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-06-08T07:32:10Z",
  "updated": "2018-07-16T13:11:18Z",
  "releaseNotes": "- GDPR update\n- Minor bugs fix\n\nIf you encounter any problem regarding this app, please feel free to contact us at support@greenpandagames.com",
  "version": "2.1",
  "price": 0,
  "developer": "Solitaire Games Studio",
  "score": 4.65751,
  "reviews": 946,
  "currentVersionScore": 4.65751,
  "currentVersionReviews": 946,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.gt.playbfc",
  "title": "Admiral Casino - Online Slots",
  "description": "Download the Admiral Casino app for FREE.\n\nPlay your favourite Admiral Casino, Astra & Novomatic slots on the Admiral Casino app, the most exciting mobile real money casino in the UK! A fantastic range of Casino games and Slot games, with the added bonus of a great Live Casino! Claim your 1st Deposit BONUS 100% up to £200!\n\nThe most popular slot games Cops ’n’ Robbers, Reel King ™, Book of Ra ™ Deluxe, Sizzling Hot™ and Lucky Lady’s Charm™ all in one app! \n\nAdmiral Casino has added classic slot favourites such as Rainbow Riches, Spartacus, Sevens to Burn and Monopoly slots. \n\nThe app comes with improved navigation, intelligent search, enhanced speed and performance. \n\nNow you can personalise your experience by using the favourite games feature; group all your favourite games in one location.  Games are optimised for all mobile devises, so you can enjoy a great Casino experience on the move.  \n\nFEATURES\n- Premium real money slots and casino games\n- New Slots and Casino game regularly launched\n- 1st DEPOSIT BONUS up to £200*\n- Easy registration\n- Jackpot slot games\n- Secure payment systems\n- One account for all devices\n- Dedicated customer support\n- Personalise your website with the Favourite Game feature \n- New intelligent search and recently played feature. \n\nREGISTER EASILY\n1: Download the Admiral Casino app for FREE\n2: Register (in less than 2 minutes) or log in with your existing Admiral Casino account\n3: Deposit and immediately get your welcome BONUS deposit match 100% up to £200*\n\n+++PLAY on our real money slot & casino games+++\nALL THE MOST POPULAR GAMES IN ONE APP\n\nOriginal content from Admiral Casino, Astra, SG Gaming and Novomatic, including the most popular games in the UK & Ireland:\n- Reel King™\n- Cops ’n’ Robbers\n- Lucky Lady’s Charm™ Deluxe\n- Sizzling Hot™ Deluxe\n- Book of Ra™ Deluxe\n- Rainbow Riches\n- Monopoly\n- Rainbow Reels\n- Happy Fruits\n- Rainbow King™\n- Clockwork Oranges\n- Royal Crown Roulette European\n- Lord of the Ocean™\n- Wizard of Odds\n- Spartacus\n- Zeus \n- Just Jewels™ Deluxe… \nAnd many more!!\n\nSignificant Offer Terms and Condition\n*18+, new players only, 100% bonus on min. £10 deposit, 35X wagering on slots, other game types vary. T&Cs apply\n\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at (UK: 0808 8020 133 and Ireland: 1800 753 753) or visit (UK: https://www.begambleaware.org/ and Ireland: http://www.gambleaware.ie/).",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2015-01-20T22:13:09Z",
  "updated": "2018-06-07T08:18:19Z",
  "releaseNotes": "Great new games, including favourites like Rainbow Riches, Spartacus and Monopoly.\nGames are optimised for all mobile devices, so you can enjoy a great Casino experience on the move.\nNew faster app, improved navigation & intelligent search.\nBonuses that now start turning to cash in increments, making bonus waging much simpler and easier.\nNow you can personalise your experience by using the favourite games feature; group all your favourite games in one location.",
  "version": "5.0.1",
  "price": 0,
  "developer": "Greentube Alderney Ltd.",
  "score": 2,
  "reviews": 87,
  "currentVersionScore": 2,
  "currentVersionReviews": 87,
  "searchTerms": "roulette"
 },
 {
  "appId": "me.tango.roulettist-ios",
  "title": "Roulette for Tango",
  "description": "A realistic game with 3D graphics featuring all sorts of roulette: European with three sectors, American with a “double zero” or French with additional bets on sectors. Experiment and win!\n\nGame features:\n\nFREE CHIPS – Come back to the game every day and get free chips.\n\n3D GRAPHICS – An absolutely free roulette game with stunningly realistic 3D graphics.\n\nPLAY WITH FRIENDS – Invite your friends to the game through email or Facebook and get bonuses as a reward.\n\n3 VERSIONS OF ROULETTE – Try European, French and American roulettes and chose the best for you.\n\nCHAT WITH OTHER PLAYERS – Use the convenient chat and message system to discuss rounds you've won and get even more fun out of the game.\n\nCONVENIENT INTERFACE – A simple and attractive interface which gives you the ability to make bets quickly.\n\nLEARN TO PLAY – Are you new to roulette, but always wanted to try it? We'll help you take the first step and teach you how to play three roulette versions.\n\nNO REGISTRATION – Use guest mode to play roulette without registration.\n\nGET REWARDS – Place bets, take risk and unlock achievements.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-07-13T03:09:00Z",
  "updated": "2016-10-28T15:35:44Z",
  "releaseNotes": "We have made our game more exciting!",
  "version": "5.14.32",
  "price": 0,
  "developer": "TangoMe, Inc.",
  "score": 4.66667,
  "reviews": 3,
  "currentVersionScore": 4.66667,
  "currentVersionReviews": 3,
  "searchTerms": "roulette"
 },
 {
  "appId": "jp.gsoft.Roulette",
  "title": "Roulette.",
  "description": "------------------------------\nMain Feature\n------------------------------\nIt is roulette that can play up to ten people.\nIt is possible to play enjoy by combining various functions.\nPartition and the shuffle can be used while even rotating. \n\n-Partition\n-Shuffle\n-Handicap\n-Mono Color\n-Blindfold",
  "genres": [
   "Entertainment",
   "Games"
  ],
  "contentRating": "4+",
  "released": "2010-08-21T21:56:26Z",
  "updated": "2019-09-15T22:17:01Z",
  "releaseNotes": "Support iOS 13\nBugfix",
  "version": "3.5",
  "price": 0,
  "developer": "G-SOFT",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.reflex.arcade",
  "title": "Pub Fruit & Roulette by Reflex",
  "description": "Ever wanted to take your favourite fruit machine with you? Now you can! Play all the great fruit machines you see in pubs, clubs, arcades and bingo halls up and down the UK in one fantastic app!\n\n* 500 free credits collectable every 90 minutes, boost this to *1000* credits when purchasing credit!\n\n* Free credit for telling your Twitter and Facebook friends about the app!\n\n* All fruit machines now support portrait and landscape modes on both iPad and iPhone!\n\n* Pinch to zoom anywhere on the screen to get a closer view of the action!\n\n* Double-tap on important gameplay areas to quickly zoom in! \n\nLoads of fantastic games covering our entire fruit machine product range available right now, with more coming soon, along with some great new features that we're really excited about... stay tuned!\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nAlthough the games can be played without a network connection, you need to be connected to the internet to be able to receive free credit.\n\nEach game included in this app is for amusement only and does not replicate the odds of winning or the payouts of it or similar games from Reflex Gaming.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2013-11-01T07:42:31Z",
  "updated": "2019-02-21T10:19:36Z",
  "releaseNotes": "Fixed audio issue on Crazy Crowns",
  "version": "1.38.3",
  "price": 0,
  "developer": "Reflex Gaming",
  "score": 4.3724,
  "reviews": 2978,
  "currentVersionScore": 4.3724,
  "currentVersionReviews": 2978,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.smallscreencasinos.thephonecasino",
  "title": "Play Slots at The Phone Casino",
  "description": "At The Phone Casino, we don't believe in phoney cash bonuses, we believe in giving all players FREE SPINS that can be spun into CASH PRIZES and withdrawn with NO WAGERING REQUIREMENTS.\n\nThe Phone Casino brings you all of your favourite REAL MONEY CASINO games straight to your iPhone or iPad.\n\nPlay favourite Slots like;\n- Monopoly\n- Rainbow Riches\n- Foxin' Wins\n- Reels of Luck\n- Kings of Cash\n- Irish Eyes\n- Bingo Billions\n\nPlay classic casino table games like;  \n- Blackjack\n- Roulette\n- Bacarrat \n- Video Poker\n\nOr enter our LIVE CASINO to play; \n- Blackjack\n- Roulette\n- Bacarrat\n- Casino Hold'em\n\nLooking for an alternative to casino games?  How about our enormous range of INSTANT WIN Games like KENO, SCRATCH CARDS or SKILL GAMES?  \n\nDaily Slots Freeroll Tournament: \nEvery day, we give players one entry into our daily freeroll tournament.  Place in the top 20 to win cash you can either use on other games or withdraw with NO WAGERING REQUIREMENTS.  The choice is yours.  Players can also win prizes like iPhones, computers, TV’s, VIP holidays or the chance to win £1 million….that’s right £1 million.  Its that simple!\n\nWith 100's of games and new games added weekly, there's plenty to do at The Phone Casino.\n\nWe offer fast, secure, encrypted deposits and withdrawals and you can even top up using your mobile, debit card. credit card, Paysafe or Skrill.\n\nWhat are you waiting for? Download today!\n\nWe’d love to hear from you, so please rate us here in the App Store.  Or, if you’re not 100% satisfied feel free to email \nsupport@smallscreencasinos.com and we’ll happily help you. Or follow us on Social here\n\nwww.facebook.com/PhoneCasino/\nTwitter - @thephonecasino\nwww.instagram.com/thephonecasino\n\nThe Phone Casino is licensed by the UK Gambling Commission and the Alderney Gambling Control Commission. All communications are encrypted making The Phone Casino a safe, secure and trusted. UK Gambling Commission, licence number: 000-039397-R-319363-002.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-04-24T15:58:29Z",
  "updated": "2018-12-11T13:46:06Z",
  "releaseNotes": "We’ve updated our bonus system to enable users to cash out all bonuses with no wagering requirements. Plus, we’ve also added enhanced ID document security to keep players even more safe and secure.",
  "version": "3.0",
  "price": 0,
  "developer": "SmallScreenCasinos Ltd",
  "score": 2.35417,
  "reviews": 48,
  "currentVersionScore": 2.35417,
  "currentVersionReviews": 48,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.abzorbagames.tango.roulette",
  "title": "Roulette Live for Tango",
  "description": "Roulette Live for Tango captures the sprint of a truly awesome week-end in\nVegas\n\nCome on in to the best casino game, spin the wheel at a turn-based table, feel\nthe tension and watch the fireworks if you win! Try out the “Strategy” feature\nand play like a Pro,  or check out the “Win Chance” meter to measure your\nchances of winning or loosing with your chip layout - thats awesome and\neducational too. there are loads of special features such as live chat,\nchallenge friends, swap cocktails and dress up in amazing outfits - be as cool\nas you feel and meet millions of gamers.\n\nIt live so gather your friends or make news ones in this live multiplayer\nclassic at 100s of tables, VIP privilege suites, tournaments and challenges all\nwith Guest and Facebook sign in options.  And when you want to kick back from\nthe tables there are fantastic mini games such as Scratch ’n Match and Luck\nwheel to try your hand at winning a millions of chips!\n\nEvery game is fresh, new and exciting because its the mix of folks there that\nmake this so social. So come and join the fun you never know who you’ll meet.\n\nRoulette Live for Tango is a free, online, game of chance and skill for\nentertainment purposes only. It is not possible to win real money, real\nitems/services/gifts or goods in kind by playing our skill games. The virtual\ncurrencies used in this game are called Chips and Diamonds and can be purchased\nin the ‘Store’ by using real money. Chips and Diamonds cannot be exchanged for\ncash or be paid out in any form and can only be used to play our game. Roulette\nLive for Tango is intended solely for an adult audience which is eighteen years or\nover.\n\nPlaying Roulette Live for Tango does not imply future success at real money gambling.\n\nTerms of Service: https://www.abzorbagames.com/terms-of-service",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-08-03T19:06:21Z",
  "updated": "2018-04-30T17:12:24Z",
  "releaseNotes": "We are always improving our games by adding great new features and tweaking\nperformance to bring you the very best entertainment and we hope you enjoy this\nlatest version.\nSee you at the tables!",
  "version": "2.80",
  "price": 0,
  "developer": "AbZorba Games BetriebsgmbH",
  "score": 3.6,
  "reviews": 5,
  "currentVersionScore": 3.6,
  "currentVersionReviews": 5,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.tw.tycoon.casino",
  "title": "Tycoon Casino - Vegas Slots",
  "description": "Tycoon Casino Slots is a new slot game to attract everyone’s attention. Different styles of games, huge prizes, big jackpots, and so on, everything you want in the slots game can be found here. Come and seek your luck here- Play Tycoon Casino Slots and Win huge prizes! \n\nStart your spins and enjoy the game, Tycoon Casino Slots can make you forget all the bad things and boring days, because we want to provide slots lovers and beginners with best slot machines and massive grand wins.\n\n►Get 100,000,000 free coins instantly as Welcome Bonus.\n►Every 12 minutes you will receive a store gift,and every 8 hours you can spin bonus wheel for one time. Keep spinning! \n►Interesting graphic, smooth animations and vivid sound offer you the best casino atmosphere.\n►Different feature games, huge prize and bonus, winning symbols like Scatter & expanding WILD.\n►Enjoy our gorgeous Slots Games like being in Vegas heart.\n►Authentic slot machines designed by casino professionals.\n►Hold on to Autospin and listen to the sweet casino melody. Plenty wins will tell you how time flies. \n\n►Enough free coins to bet large in a spin and win more back.\n►Lots of free spins, respin, hold&spin, bonus games.\n►Finish daily goals and get big reward!\n►Participate in different kinds of activities to win extra prizes in special slot machines.\n\n►Get five scatters in Dragon Spin and win free games.\n►Spin and get specific wolves in special reels to multiply your prizes. \n►Come to see the Star Panda and win big prizes.\n►Spin to get plenty respin chances in 88 Riches. \n►Make a big fortune in the volcano Riches, wins never ends.\n\nThe Tycoon Casino Slots can give you an incredible gambling feeling with its attractive appearance and the sound. Don't miss this opportunity to experience different styles of slots games! Come and download the game right now. Huge prizes and bonus are waiting for you!\n\nThis product is intended for use by those 21 or older for amusement purposes only. \nPractice or success at social casino gaming does not imply future success at real money gambling. \n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-10-21T10:44:15Z",
  "updated": "2020-04-30T01:53:04Z",
  "releaseNotes": "Hey Tycoon Lovers! Here's our new updates with:\n• New Slot: Legend Ages\n• New Event: Card Album \n• Great promotion and deals\nWe are always working hard to make Tycoon Casino the best casino slots game out there. Come and seek your luck here!",
  "version": "1.5.2",
  "price": 0,
  "developer": "Triwin Inc.",
  "score": 4.83474,
  "reviews": 3292,
  "currentVersionScore": 4.83474,
  "currentVersionReviews": 3292,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.tljtek.www",
  "title": "Casino & Sportsbook",
  "description": "Are you tired of Casino apps that make you buy your chips via in-app purchase?  Quit spending your hard-earned money on fake chips.  31-in-1 Casino and Sportsbook gives you unlimited Casino chips without needing to buy more if you lose them all!\n\ngApp Technology is proud to bring you the latest update for their flagship Casino app for the iPhone.  31-in-1 Casino and Sportsbook now has a brand new interface and a great new slot game.  \n\nUse Your iPhone or iPod Touch to experience all the fun & excitement of 31 classic Las Vegas casino games without ever losing a cent!   31-in-1 Casino offers authentic casino sounds, life-like animations, and a full cashier where you can control your chip count. \n\nTry your luck, hone your skills and become an expert at the following action-packed casino games:\n\n\nBlackjack \nFaceup Blackjack \nCount Blackjack \nPlus Blackjack\nPerfect Pair Blackjack\nRoulette \nCraps \nFishing Slots\nBaseball Slots\nWild Slots\nOr Nothing Slots\nLucky Spin Slots\nSports Slots (5 Reel)\nGold Rush Slots (5 Reel)\nBaccarat \nJacks or Better Video Poker \nDeuces Wild Video Poker \nJokers Wild Video Poker \nTens or Better Video Poker\nAcey Deucey Video Poker\nGoing For Fours Video Poker\nCaribbean Poker \nTexas Poker\nSportsbook\nKeno\nRed Dog Poker\nSlot Farmer Slots\nGrocery Shopper Slots\nCasino Gold Slots\nKitchen Heat Slots\nRockin' & Rollin' Slots\n\nImmerse yourself in the atmosphere of a miniature Las Vegas casino without ever leaving your home or office with 29-in-1 Casino!",
  "genres": [
   "Games",
   "Sports",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2008-09-27T19:37:32Z",
  "updated": "2018-08-17T01:34:51Z",
  "releaseNotes": "Fixed crash in sportsbook teasers screen.",
  "version": "6.0.0",
  "price": 0,
  "developer": "gApp Technology, Inc.",
  "score": 3.33333,
  "reviews": 3,
  "currentVersionScore": 3.33333,
  "currentVersionReviews": 3,
  "searchTerms": "roulette"
 },
 {
  "appId": "uk.co.coral.livedealer",
  "title": "Coral Live Casino Games App",
  "description": "Download the Coral Live Casino app and get a £50 Welcome Bonus to get you started.\n\nThe first thing you’ll notice with our superb app is a sleek Live Casino studio design for the most immersive, true to life casino experience it’s possible to find.\n\nOther updates include a new line-up of expert, exclusive live dealers which now stands at over 60, giving you an even greater choice in the casino.\n\nChoose from a huge selection of tables and play your favourite games including Live Roulette, Live Blackjack, Live Baccarat and Live Hi-Lo. \n\nIn addition to that, you now have the ability to ‘Pin’ your favourite dealers and tables to your own customised homepage – no need to go searching for them every time you open the new app.\n\nAnd of course, you’ll still find the same great high-definition graphics and gameplay coupled with great chat and engagement from our wonderful dealers.\n\nIn short, we’ve kept all the good bits and made improvements where they were needed. All reviews are much appreciated – these help inform our decisions and prioritise issues as we continue to make further improvements to the app.\n\n\nUnique Features:\n\n• A Sleek new studio design, for the most realistic, fully immersive Live Casino experience\n\n• Personalize your homepage and ‘Pin’ your favourite dealers and tables\n\n• Enjoy real-time information and a video preview of each table \n\n• Play on the dedicated and Exclusive Live Roulette and Blackjack tables with dynamic HD cameras, making you feel like you’re closer to the casino floor than ever before\n\n• 60 real-life Live Casino dealers exclusive to Coral\n\n• Exclusive promotions and offers including studio entertainment \n\n• Quick and easy registration process\n\n• Fast performance on 3G/4G and WIFI connections\n\n• Designed specifically for Apple products\n\n• Existing Coral Casino customers can log-in and play with their current username and password\n\n• 24 Hour customer service assistance\n\n\n\nGET A £50 WELCOME BONUS\n18+. New customers only. Min bet £10 on qualifying games. £50 Bonus subject to 40x wager req. Certain deposit types and countries excluded. Bonus valid for 30 days on selected games.T&Cs Apply.\nhttps://gaming.coral.co.uk/promotions/casinowelcomebonus\n\n\n\nWe KNOW you’ll love the Coral Live Casino App, but are always looking to do things better. So if you find something you think we can improve please send your feedback to: reviewcoral@coral.co.uk\n\n18+. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please see below contact details for Gamble Aware in both UK and Ireland.\n\nUK: https://www.begambleaware.org and 0808 8020 133\n\nIreland: https://www.problemgambling.ie and 1800 753 753\n\nCoral is operated by LC International Limited (Suite 6, Atlantic Suites, Gibraltar) and licensed (ref 54743) and regulated by the British Gambling Commission for persons gambling in Great Britain. For persons gambling outside Great Britain, Coral is licensed (ref 010, 012) by the Government of Gibraltar and regulated by the Gibraltar Gambling Commissioner.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2014-06-15T03:08:53Z",
  "updated": "2020-01-14T12:37:12Z",
  "releaseNotes": "Every time we release an update to the App Store we look to improve the performance and stability of the app.",
  "version": "19.1",
  "price": 0,
  "developer": "Coral Interactive",
  "score": 4.75054,
  "reviews": 453,
  "currentVersionScore": 4.75054,
  "currentVersionReviews": 453,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.vegas.casino.slots.game",
  "title": "Vegas Casino Slots - Big Win",
  "description": "The most popular slot machine game in 2020! Spin in real Vegas Casino and Win Big with more than 30 slot machines. Lots of bonus and jackpots, just enjoy Vegas Casino Slots!\n\nNow you can play real Vegas casino slots on your phone instead of going to Vegas. Whenever and wherever FREE! What you need to do is just a single tap to download and spin! Then you can enjoy the excitement and win the jackpot. This slot game must be the best casino slots you have ever played. Huge jackpots, wild patterns, mysterious themes, and amazing graphics… This pop slot game is on FIRE! \n\nWhen you first login to Vegas Casino Slots, you could get 2,000,000 welcome bonuses. It helps you to play in your favorite slot machines and win big. Slot machines such as QUAKE FLASH ZEUS, CORNUCOPIA GOLD, PANDORA’S BOX, ALL SAINTS’ GIFTS, HAPPY HAPPY, GOLD MINER, GOLD OF WEALTH, BUFFALO BATTLE, RHINO RUSH, TROVE OF PEARL, PANDA, PAPER CUTTING, PRINCESS OF JAGUAR, BEER CARNIVAL, NIGHT OF THE WOLF, DESERT TREASURE, WILD GREEN, SEASCAPE DIVING, CHILI CHILI, FLAME TO HEAVEN, MYSTERY OF MAYA are waiting for you! Play this slot game and enjoy a real Las Vegas style casino slot! \n\nGame Features\n2,000,000 Free coins as welcome bonus for you.\nGrand jackpot in every slot machine waiting for you to win!\nFree coins in every 1 hour and each time level up in Vegas Casino Slots!\nHigh payout with lots of feature games such as FREE SPIN, HOLD & RESPIN, RESPIN, BONUS GAMES.\nAll slot machines unlocked. Just choose your favorite slots.\nConnect to Facebook to collect 500,000 free coins.\nSpin the wheel of fortune every day to get bonus.\nSpecial challenge for you every week. Enjoy it and get a big prize!\n\nThis product is intended for use by those 21 or older for amusement purposes only. Practice or success at social casino gaming does not imply future success at real money gambling. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n\nCONTACT US\nFacebook:\nhttps://www.facebook.com/vegascasinofreeslots\nContact Support: contact@triwingames.com\nFind out more at: http://www.triwingames.com/",
  "genres": [
   "Games",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2018-09-28T00:44:44Z",
  "updated": "2020-04-24T08:44:31Z",
  "releaseNotes": "New slot machine coming soon!\n-Minor bug fixed",
  "version": "1.0.42",
  "price": 0,
  "developer": "Triwin Inc.",
  "score": 4.79751,
  "reviews": 242,
  "currentVersionScore": 4.79751,
  "currentVersionReviews": 242,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.gamesys.jackpotjoy",
  "title": "Jackpotjoy: Bingo & Slot Games",
  "description": "Enter a world of fun at the award-winning Jackpotjoy and play our fantastic Bingo, Slots and Casino games. \n\nThere's Bingo and Slot game jackpots worth thousands, which can be won from as little as 1p. As well as super promotions to play in our entertaining Chat rooms, Jackpotjoy is the place to be!\n\nSo join Jackpotjoy today, the proud winners of Global Gaming’s ‘Bingo Operator of the Year’ in 2018 and 2019. \n\nDaily Free Game**\nTry the Daily Free Game Doubly Bubbly where you could win Cash or Free Spins on the hugely popular Double Bubble Slot game. With a £750 top prize available, it’s time to get playing! \n\n**You just need to have wagered £2 in the last 7 days and deposited a total of £10 or more in your lifetime. \n\nBingo\nIn our 90 ball Bingo games you can play for super Jackpots and Full House prizes! In our Sapphire Bingo room enjoy exciting Bingo offers, like 1p games, BOGOF Bingo, Evens Stevens and Free Bingo!\n\nSlots\nIf you fancy a spin instead, Slots are where it’s at. Enjoy stunning titles such as Paper Wins, Winfall Wishes, Sapphire Sorceress and more.\n\nBest Chat and more\nYou’ll always be sure of a warm welcome whenever you join the conversation in Chat with our Hosts. You can have a natter about the latest soap drama, your new pet, even who makes the tea at home! And if it gets lively, they’re ready to party just as hardy as you can! There’s loads of games and quizzes to play, and you could even win cash or physical prizes just for taking part!\n\nThat’s on top of all our exciting onsite promotions as well, which could give you the chance to win anything from a household kettle to a holiday to America and beyond!\n\nCasino\nPull up a chair at our fantastic range of Casino games, including Roulette!\n\n\nPlease play responsibly. BeGambleAware.org. 18+\n\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.",
  "genres": [
   "Games",
   "Casino",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2013-08-21T18:06:47Z",
  "updated": "2020-03-11T11:39:47Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.6203,
  "reviews": 9713,
  "currentVersionScore": 4.6203,
  "currentVersionReviews": 9713,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.bet365.bet365GamesApp",
  "title": "bet365 Games: Slots & Casino",
  "description": "Exciting slot games, brilliant table games and enjoyable virtual sports – all ready to play in the bet365 Games app. With all the top providers, exciting casino games like Blackjack & Roulette and jackpot slots to play, there really is something for everyone!\n\nJoin bet365 Games today and play straight away.\n\nPlay all the latest games on your device instantly with a huge selection of casino games such as Roulette, Blackjack and Baccarat. We have lots of traditional casino games, with multiple versions of Blackjack, Roulette and Baccarat for you to play and enjoy.\n\nSpin to win across a wide range of slots - classic slots, video slots, premium slots, video slots and of course jackpot slots, there are so many to choose from! Win with fantastic slot games with bonus games, free spins and massive progressive jackpots.\n\n•\tPlay the world’s best casino games, such as Blackjack, Roulette and Baccarat\n•\tAll the best slots available, with huge real money jackpots\n\nUse your existing bet365 account to log in, or sign up now.\n\nbet365 Games gives you:\n\n•\tAll your favourite games in one place\n•\tInnovative slots and regular new releases\n•\tHuge jackpots across a selection of games\n•\tCasino classics such as Blackjack and Roulette\n\nWhether you’re an aspiring spinner or a casino veteran, the bet365 Games app is the perfect games app for you.\n\nWe have a massive selection of slots, lots of different Blackjack versions, variations of Roulette and all the best online Casino games.\n\n•\tHuge selection of fun, fast-loading games\n•\tLots of offers\n•\tTable games such as Blackjack & Roulette\n•\tClassic slots\n•\tJackpot slots\n•\tNew games every week\n\nDownload the bet365 Games app and start playing today! \n\nOur customer support team is on hand 24/7 to help with any queries.\n\nYou must be 18 or over to have a bet365 account.\nThis is a real money gambling app. Please gamble responsibly.\n\nFor the full terms and conditions please follow the link to the Developer Website below.\nPlease read the bet365 Privacy Policy (see link below) before installing this application. By installing and opening the application you are accepting this policy.\n\nFor gambling help and support in the UK, users can contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org.\nFor gambling help and support in IE, users can contact Gamble Aware at 1800 753 753 or visit http://www.problemgambling.ie.",
  "genres": [
   "Games",
   "Sports",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2017-05-31T16:18:43Z",
  "updated": "2019-09-23T10:57:00Z",
  "releaseNotes": "We've fixed some minor bugs, please keep feeding back as we're always looking to make our app better.",
  "version": "1.8.2",
  "price": 0,
  "developer": "bet365",
  "score": 4.47726,
  "reviews": 4111,
  "currentVersionScore": 4.47726,
  "currentVersionReviews": 4111,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.tombola.arcade",
  "title": "tombola arcade - Casino Games",
  "description": "We thought, what would traditional slots look like if we did them the tombola way?\n\nThey’d look like tombola arcade, a magical world of unique games starting at 5p... actually it’s not magical it’s REAL! We have it all here at your fingertips.\n\nYou heard us right games start at just 5p up to a maximum of £1, what’s more if you’re already a member of tombola bingo you can simply download and log in to tombola arcade with your current details!\n\nBrand new to tombola? Register and deposit £25 real money and we’ll give you £50 extra absolutely FREE to play with, or deposit £10 and we’ll give you £20 FREE* Unlike other sites there are no play-through or wagering requirements so any winnings are all yours.\n\nSo, what slot games do you have, we hear you cry? Well for a start we’re not like any other online casino, not only are our stakes low but we also have exclusive games that you won’t find anywhere else, including a FREE game which could see you win up to £30,000!\n\nStars\n\nOur completely FREE game; pop on daily and match 25 Stars Mon-Sun and you’ll win a share of a £30,000 jackpot! Did we mention it’s completely FREE? And you can win £30,000? Oh, we did…\n\nGo\n\nVenture to the orient in go, our tantalising tiled game. You can win spot prizes, be transported to the bonus round and win Top Prizes up to £500, what are you waiting for 3-2-1 GO!\n\nBubble\n\nThere’s nothing more satisfying than popping bubble wrap and we’ve brought that poppin’ feeling to the virtual world, to make things even better you could get your hands on a Top Prize of £500.\n\nPick\n\nOnly good things come from picking your own - including winning up to £200. Head on over to our Aztec and Spellbound themes to work your magic.\n\nSpin\n\nWe’ve taken traditional slots and sent them through a process of tombolaification – now you can play slots the tombola way - take it for a spin to win. Watch out for those bonus rounds.\n\nFlip\n\nFlip the counters and connect the rows, with a chance to multiply your winnings in the bonus round and win Top Prizes of up to £500.\n\nScratch\n\nItching to have some fun? Then scratch away the 9 panels to reveal the hidden symbols - match 3 to win! Choose from Jungle, Space and Treasure themes, we have a few cheeky bonus rounds for you too.\n\nGlow\n\nYou can “glow your own way” or you can head to glow to try your hand at winning Top Prizes in the enchanted forest or jellyfish themes. You can’t glow wrong. See what we did there?\n\nWe’re a gambling app and we want you to enjoy playing our games but we want to make sure you’re not only having fun but gambling responsibly. We’ve got a number of responsible gambling features to help you do so – from setting a deposit limit (you get £1 bonus for doing this), freezing a game, cooling off and much more. Be sure to check out the “play responsibly” section in your account.\n\nGet in touch:\n\nIf you need any help our Customer Service team are available 24/7 live chat, \ntelephone: 0800 29 888 73\nemail support@tombola.com\n\nWe’d love to hear how you think we could improve our app, send your comments or suggestions to feedback@tombola.com or leave a review.\n\nOver 18s only\n\nThis is a real money gambling app.\n\nPlease gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org/\n\n* Deposit £10-£25 and get 200% bonus money. First deposit only. Terms apply.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2016-07-28T21:38:55Z",
  "updated": "2020-02-26T13:02:32Z",
  "releaseNotes": "Fixes to pick when moving between skins, chat lobby updates and error message timing improvements",
  "version": "1.5.25",
  "price": 0,
  "developer": "tombola",
  "score": 4.46767,
  "reviews": 3558,
  "currentVersionScore": 4.46767,
  "currentVersionReviews": 3558,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.betfair.casino.native",
  "title": "Betfair Live Casino & Roulette",
  "description": "The Betfair Live Casino app brings a touch of class to your Live Casino experience. You'll find all your favourite games in a slick, immersive experience. New players can sign up today and claim their 30 Free Chips on Roulette. T&C's Apply.\n \nWe've got Live Roulette, Live Blackjack, Live Baccarat and Hi-Lo available for you to enjoy in the palm of your hand. Why not play at our exclusive branded tables for a more authentic Live Casino experience?\n \nOur Welcome Offer has been updated, so new players to the site can get 30 Free Golden Chips on Live Roulette!\n\nThe Betfair Live Casino app is available to all our new and existing customers. Log in to play your favourite games and manage your account details.\n \nBetfair is a licensed gambling operator in the UK, Ireland, Australia, Malta, Italy, Austria and Germany.\n \nYou must be 18 or older and have a valid Betfair account in order to use this app.\n\nT&C’s: 30 Free Chips Offer for New Casino Customers\n•\tNew players from UK & Ireland only who have never played Betfair Casino or Live Casino. One account per user.\n•\tVerify your account using our SMS verification tool or by sending us a copy of your documents. Your bonus will be available on your promotions page. This can take up to 72h.\n•\tYou will be able to accept your free chips and start playing any of the eligible games. The chips are worth £0.25 each and only 1 chip can be played at a time on Roulette.  Your Free Spins will be released over 3 days, 10 per day & will expire each day at 23:59 (GMT).  Winnings from your chips have x1 wagering requirements before you can withdraw.\n•\tYour (x3)10 free chips will be available until 23:59 (GMT) over 3 consecutive days from sign up. If you do not claim them each day they will expire and not be reapplied.\n•\tFree Spins can only be redeemed on Premium Roulette and Live Roulette.\n•\tThere is x1 wagering on winnings from your free chips. Any winnings will show on pending winnings. You must play all of your chips before your winnings are moved to your main casino balance.\n•\tIf you trigger any other promotional bonus while another is still active, the bonuses will queue in your bonus balance. \n•\tWe reserve the right to govern how bonuses are used before a player is allowed to cash them in. \n1.\tBonuses are valid for 3 days from the date of issue. Any remaining/unused bonus at the end of the stated period will be removed.\n2.\tAll bonuses credited must be ‘bought-in’ to, accepted or declined. Once accepted, a bonus is credited to your playable balance. Declined bonuses will not be reapplied.\n3.\tWagering requirements for bonuses will apply to an account from the time a bonus is accepted.\n4.\tWhen receiving a bonus, the player will first play with the money ‘bought-in’ to and only then will the player play with the bonus offered by the casino.\n5.\tWe reserve the right to withhold any withdrawals and/or confiscate all winnings for irregular play. Irregular play includes, but is not limited to:\n•\tPlacing single bets equal to or in excess of 30% of the value of the bonus before the wagering requirements for that bonus have been met.\n•\tMoving from a low weighted game (25% or less) to a high weighted game (100%) after large wins for the purpose of clearing wagering requirements.\n•\twin 100% more than your stake and move your original stake and winnings to a game in the above list weighted at 100% in order to meet wagering requirements.\n•\tLow risk Roulette bets. ANY bet spread combination on European/French Roulette games covering 25 or more (68%) of the 37 unique number spots on the table or on American Roulette games covering 25 or more (66%) of the 38 unique number spots on the table.\n\nStandard Terms and Conditions Apply: https://www.betfair.com/en/aboutUs/Terms.and.Conditions/",
  "genres": [
   "Games",
   "Sports",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-10-23T09:57:20Z",
  "updated": "2018-04-02T08:34:38Z",
  "releaseNotes": "•Enjoy playing Betfair Live Casino games with the new sign up offer: 30 Free Roulette Chips. T&C's Apply.\n•A number of bug fixes and small improvement from previous versions were addressed following customer feedback. We are always keen to hear your view on the app, so please send your feedback through at any time.",
  "version": "18.1.1.8",
  "price": 0,
  "developer": "Betfair",
  "score": 4,
  "reviews": 5,
  "currentVersionScore": 4,
  "currentVersionReviews": 5,
  "searchTerms": "roulette"
 },
 {
  "appId": "ru.epicapp.wheel",
  "title": "Daily Decision Wheel",
  "description": "Daily Decision Wheel is like your best friend in a pocket! You can ask it whatever you want and get the unbiased answer.\n\nCan't decide? Or afraid of making the wrong choice? That is not a problem anymore! Create your question, add answers, spin the wheel and see what comes up!\n\nWhere to travel? What movie to watch? What to do on the weekend? - answers to these questions and many others you can find in the app\nDecide in a fun way!\n\nFEATURES:\n- Create custom wheels\n- Set option weight 1...100\n- Tap segment to disable it\n- Playoff mode\n- Share your decisions with your friends\n- 28 predefined wheel templates\n- Simple and intuitive design\n- Colorful antistress therapy\n\nWith the new \"Playoff mode\" you can make a list with names and choose one after another randomly without repetitions (until list ends). \n\nMake your first tiny decision now!",
  "genres": [
   "Entertainment",
   "Casino",
   "Simulation",
   "Games"
  ],
  "contentRating": "4+",
  "released": "2018-09-27T11:28:41Z",
  "updated": "2020-03-17T22:36:47Z",
  "releaseNotes": "- Added \"Quick Switch\" feature, now you can tap on wheel name (arrow down icon) on top of the screen to choose different wheel in a fast way (Feedback are welcome)\n- Fixed issue when disabled segments becomes active after wheel edit\n- Now on history screen you can open thumbnail to the fullscreen (only for photo wheel segments)\n- Photo results will now show thumbnail even in blindfold mode, but it will be dimmed. This allows you to click dimmed thumbnail to see original image if you wanted to\n- Other minor fixed & optimizations",
  "version": "1.9.5",
  "price": 0,
  "developer": "Vladimir Roganov",
  "score": 4.53641,
  "reviews": 302,
  "currentVersionScore": 4.53641,
  "currentVersionReviews": 302,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.betfred.container.casino",
  "title": "Betfred Casino - Play Roulette",
  "description": "Stack your chips and play at Betfred Casino! Try your luck on our Roulette Wheel or take your seat for a Blackjack deal.\n\nWith over 200 of the latest games to choose from; such as slots, jackpots and your favourite table games, make Betfred Casino the home for your casino-gaming needs. Why not try our new customer offer, where you can get 50 FREE spins when you stake £10? Or, if Blackjack is your game, have a go of our exclusive £10,000,000 Blackjack table and you could win up to 1,000,000 times your stake! \n\nWhether Blackjack is your speciality or Roulette is your go-to-game, enjoy it all with Betfred Casino! \n\n\nBet £10 Get 50 Free Spins Terms\n\nNew Casino customers only. £10 Minimum transfer and stake. £10 Minimum stakes within 7 days. Minimum 5 game rounds. Game restrictions apply. Maximum 50 Free Spins on selected games, credited within 48 hours of qualifying. Free Spins expire after 7 days. E-Wallet & Prepaid Card restrictions apply. SMS validation may be required. Full T&Cs apply.\n\n£10 million Blackjack Terms\n\n18+ T&C’s apply. Betfred Rules apply. Bonus available on £10M Blackjack table only. The table will be available for two years from launch or until the prizes paid exceeds £10M. Bonus prizes paid as cash on a tiered structure.\n\nFull Terms and conditions available at Betfred.com",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-07-28T21:48:40Z",
  "updated": "2020-01-08T09:23:38Z",
  "releaseNotes": "We’ve made a few tweaks to help improve your overall Betfred Casino experience. Check out the updates for yourself and try your hand on the Betfred Casino app.",
  "version": "1.3.6",
  "price": 0,
  "developer": "Betfred",
  "score": 3.66,
  "reviews": 50,
  "currentVersionScore": 3.66,
  "currentVersionReviews": 50,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.purplekiwii.vegaslive",
  "title": "Vegas Live Slots Casino",
  "description": "Looking for the best all-in-one casino in the world?\nCheck out this exhilarating casino app - Vegas Live Slots!\n\n# A growing library of modern and classic slots. More than 60 free-to-play slots are available right now.\n# Features 15 keno games, 8 video poker machines, Roulette, Huge wheel and blackjack tables to play.\n# Enormous welcome gifts, free coins every day, and amazing seasonal events and bonuses that never end.\n# Jackpot winners can earn special reward Cadillacs to ride down the dazzling Vegas strip lined with real casinos.\n# Complete your missions and get cute and adorable pets!\n# Join a new Club with other enthusiastic players or create your own and become a legend with new friends.\n# Enjoy the daily live lottery, Vegas Billions in the casino lounge with other users all over the world. You might become a billionaire winner in the next drawing! \n# Unique and thrilling new features, the 100 Spins Challenge is ready every day with different slot games for you.\n\nSpin and win the way you want to with all your favorite slots and get massive jackpots!\nPlay new blackjack, video poker, keno, big wheel and roulette games at the touch of a button.\nExperience the excitement and thrill of the authentic Vegas-style casinos anywhere, on any device.\nJoin today and be a part of a growing experience with unique new features, events, and never-ending updates!\n\n*Vegas Live Slots is intended for use by those 21 or older for amusement purposes only.\n*Vegas Live Slots does not offer real money gambling or an opportunity to win real money or prizes.\n*Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-11-16T02:06:03Z",
  "updated": "2020-05-12T13:29:47Z",
  "releaseNotes": "- Resolved app crash issues that some users were reporting\n- Minor bug fixes and performance improvements\n- Happy Spinning! Win Big at Vegas!",
  "version": "1.2.25",
  "price": 0,
  "developer": "purplekiwii",
  "score": 4.66974,
  "reviews": 648,
  "currentVersionScore": 4.66974,
  "currentVersionReviews": 648,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.laan.labs.TapRoulette",
  "title": "Tap Roulette - Make Decisions with Friends!",
  "description": "Tap Roulette is like drawing straws 2.0\n\nEach friend puts a finger down on the screen and one will be selected.\n\nUse it to make decisions like who has to take out the garbage, or where to eat lunch.\n\nUp to 11 fingers supported on the iPad.\nUp to 5 fingers are supported on the iPhone.",
  "genres": [
   "Utilities",
   "Entertainment"
  ],
  "contentRating": "4+",
  "released": "2011-04-12T01:47:45Z",
  "updated": "2017-05-02T15:22:21Z",
  "releaseNotes": "Updated to 64-bit support\nBetter iPad support\nMinor graphics fixes\nNew info screen",
  "version": "1.02",
  "price": 0.99,
  "developer": "Laan Labs",
  "score": 2.05882,
  "reviews": 34,
  "currentVersionScore": 2.05882,
  "currentVersionReviews": 34,
  "searchTerms": "roulette"
 },
 {
  "appId": "Com.777Casino",
  "title": "777 Casino: Real Money Games",
  "description": "PLAY WITH 77 FREE SPINS\n\nTERMS & CONDITIONS\nNew players only • Free Spins (FS) must be claimed within 48 hrs & expires within 14 days • Free spins are set at a predefined bet amount of $/£/€ 0.25 per spin • FS wins are credited as bonus and capped at $/£/€ 20, exc. JP win • Bonus wins are capped at $/£/€ 500 • To withdraw bonus & related wins, wager bonus x 30 within 90 days • Wagering req. vary by game • Withdrawal restrictions & full T&Cs apply - https://play-www.777.com/promotions/registration-offer/ • UK only –your deposit balance is available for withdrawal at any time”\n\nIf you are looking for fun, you’ve come to the right place! 777 is a retro, glamorous, exciting online casino with surprises around every corner. Enjoy the ride with real-money casino games that have been created for the optimal mobile “Vegas Vintage” casino experience. Swipe, tilt and play “on-the-way” with 777!\n\n777 features:\n• The latest in amazing Slots\n• Big Jackpots \n• Exclusive in-house games\n• 24/7 Live Casino (incl. Blackjack, Roulette, Casino Holdem and Baccarat)\n\n777 is safe, with a 100% anonymous depositing system. Special bonus rounds and promotions give your balance regular top-ups so you can play away!\n\nDon’t delay, download today!\n\n18+\nhttps://www.888casino.com/security-and-privacy/responsible-gaming-nonuk/\n888responsible\nhttp://www.888responsible.com/\nBeGambleAware:\nhttps://www.begambleaware.org/\n\nGAMSTOP\nhttps://www.gamstop.co.uk/\nSafer,Better.Together",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2015-10-11T17:37:04Z",
  "updated": "2020-02-05T08:36:34Z",
  "releaseNotes": "Bug fixes and performance improvements",
  "version": "2.6.79",
  "price": 0,
  "developer": "Virtual IP Assets Limited",
  "score": 4.53932,
  "reviews": 890,
  "currentVersionScore": 4.53932,
  "currentVersionReviews": 890,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.vegas.slotmachine",
  "title": "Cash Tap Casino™ Slot Machines",
  "description": "Play FUN SLOTS with 12 MILLION Coin Welcome Bonus!\n\n\nTop Features:\n- Exciting Vegas slot machines - designed by REAL Casino experts!\n- Bonus rewards when you level up!\n- Huge jackpots in select slots!\n- New slot machine games added monthly!\n- Exclusive and exciting bonus-games!\n- Play with no wifi & win even when you are offline.\n\n\nYour Welcome Bonus is waiting! Get 12,000,000 bonus coins instantly NOW!\n\n\nAttention:\n- This game is intended for an adult audience only. \n- This game does not offer real money gambling or an opportunity to win real money. \n- Wins made while playing in social casino games can't be exchanged for real money.\n - Past success or practice at social casino gambling does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Board"
  ],
  "contentRating": "17+",
  "released": "2020-01-05T08:00:00Z",
  "updated": "2020-01-13T06:19:05Z",
  "releaseNotes": "Stability improvements and bug fixes \n\nMake sure you download the latest version to receive the latest features!",
  "version": "1.43.8",
  "price": 0,
  "developer": "Lush Bunny Games Ltd",
  "score": 4.74432,
  "reviews": 176,
  "currentVersionScore": 4.74432,
  "currentVersionReviews": 176,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.virginbet.virginbetuk",
  "title": "Virgin Bet: Sports Betting App",
  "description": "Virgin Bet is the sports betting app made for you. Whether you’re building accumulators or placing a quick single bet before kick-off, Virgin Bet has the markets and the in-play odds for the bets you want.\n\nVIRGIN BET PRICE BOOSTS\nWhether it’s the next hotly anticipated horse race, the latest Premier League or Champions League clash, we’ll have a Virgin Bet price boost you won’t want to miss. From football, to horse racing, to tennis, all major events will have a tasty offer for you to check out.\n\nLIVE STREAMING \nWatch live football, tennis, basketball and more to see all the action during your in-play bets. \nPlus, you can also watch live UK, Irish and international horse racing. You’ll just need to place a bet of a minimum £1 single unit stake or 50p E/W bet on the race you want to stream.\n\nFAST IN-PLAY BETTING\nBet in-play across a range of including football, tennis, basketball and follow the action on detailed Virgin Bet scoreboards. With loads of markets including next goalscorer and half-time result even on international leagues such as Serie A and Bundesliga, in-play football betting has just got better.\n\nBEST ODDS GUARANTEED ON HORSE RACING BETS\nIf the starting price is bigger than your original price, we’ll give you the bigger odds. That’s on all win/each-way bets from 7am on UK/Irish horse race days. Including the big races at Ascot. Rules/exclusions: virginbet.com/promo/terms/best-odds Max enhancement £50k/day.\n\nFULL RACECARDS\nFancy betting on the horses? With Racing Post Spotlights and form, you can check the latest on all horse races from Ascot to York with Virgin Bet’s card view. Or, tap the “Next off” button from the home page to go straight to upcoming horse races. You’ll also be able to view the full race results afterwards.\n\nMATCH STATS\nFor all the big football leagues, check out the results for each team’s last five matches, as well as the head-to-head history before placing your bets. Perfect for brushing up your knowledge on international leagues such as Serie A and Bundesliga.\n\nLIVE ROULETTE, CASINO & SLOTS\nStep into our live casino and try your luck at the roulette and blackjack tables with live casino dealers. Spin the reels of your favourite casino slot games and bet on popular games including Rainbow Riches and Deal or No Deal: What’s in Your Box slot.\n\nSlide out our in-play blackjack game from the tab on your screen and play blackjack between your sport bets.\n\nVIRTUAL SPORT\nCasino games not your thing? Try your luck and bet on virtual football and horse racing.\n\nTOP SPORTS AND BETTING MARKETS\nFrom global football leagues to ATP tennis tours, or football corners & cards to tennis sets & double faults, there’s betting markets for everyone at Virgin Bet. We even offer markets on esports such as eSoccer Liga Pro. See the latest betting odds for everything from horse racing to basketball.\n\nFAST LOGIN\nGet to your sports betting sooner, by using Face or Touch ID for a speedy log in.\n\nHOT PROMOTIONS\nFrom exclusive racing offers to Premier League betting promos, to basketball price boosts, take a look at our promotions pages to see what offers you could take advantage of.\n\n\n18+. Virgin Bet is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.\n\nVirgin Bet T&Cs: web.virginbet.com/en/vb-terms-and-conditions/\n\nPlease Bet Responsibly. BeGambleAware.org. 0808 8020 133",
  "genres": [
   "Sports",
   "Casino",
   "Games"
  ],
  "contentRating": "17+",
  "released": "2019-06-12T13:38:37Z",
  "updated": "2020-05-04T10:09:04Z",
  "releaseNotes": "We’ve smoothed out some niggles to make your betting experience with us even better than before.",
  "version": "1.7",
  "price": 0,
  "developer": "Virgin Bet Ltd",
  "score": 4.74061,
  "reviews": 852,
  "currentVersionScore": 4.74061,
  "currentVersionReviews": 852,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.betway.vegas",
  "title": "Betway Vegas: Real Money Slots",
  "description": "One lucky Betway customer won £13,213,838.68 on Mega Moolah, could you be next?\n\nViva Las Betway Vegas App!\n\nGood news, Slot-lovers: you can now experience the gambling thrills, the spills, the lights and the sights of Vegas from the palm of your hand. That’s right, Betway has just launched brand-spanking new App Betway Vegas and it’s ready to download right now!\n\nWelcome:\n\nTo help your fingers start as they mean to go on at Betway Vegas – and that’s with a whopping great win – we’ll give you a 100% Match Bonus worth up to £250 when you download the App and register a new account. Ready to spin some Slots? You can bag this Bonus from the mobile lobby so you soon will be! Use your extra real money gambling funds to get gaming – you never know where a few spins at Betway Vegas could take you. \n\nSlots:\n\nAt Betway Vegas, bigger is most definitely better. That’s why we pride ourselves on the massive collection of thrilling HD Video Slots that we offer– kerching!\n\nChoose from:\n\n5 Reel Slots: Spin to win on all your favourite 5 Reel games such as Gold Factory, Thunderstruck, Cashapillar and Immortal Romance and many, many more – there are an incredible 35 games to choose from altogether.\n\nBranded Slots: Film fanatic? Join Lara Croft on Tomb Raider™ Slot and many more of your favourite film characters to quest for blockbuster bucks. Or the gripping and highly popular Hitman Slot, brand new to mobile platforms. Join Agent 47 on a nail-biting mission to unleash a 270,000 coin jackpot. \n\n\nProgressive Jackpot Slots:\n\nDon’t miss your chance to become a MILLIONAIRE on the move by giving our 4 Progressive Jackpot Slots a whirl on your mobile – the only difficult part is deciding which one to play first!\n\nMega Moolah: With a guaranteed £1 MILLION jackpot, play big on safari-themed Slot Mega Moolah, and you could win very, very big indeed!\n\nTable Games:\n\nRoulette: Nothing says Vegas like the whir of the Roulette wheel and with the Betway Vegas App you can take the sound, the sight and, most importantly, the thrill of Roulette with you wherever you go. Betway Vegas boasts a range of popular gambling varieties of this casino classic, all of which are in stunning HD! All you have to do is sit back, relax, and use your fingers to place your bets!\n\nBlackjack: Some call it 21, some call it Pontoon, but at Betway Vegas we don’t care what you call it as long as you enjoy it. The Betway Vegas App boasts several varieties of this classic Table Game all fully optimised in stunning HD for mobile – who needs Vegas when you’ve got Betway Vegas, right?\n\nAbout Us:\n\nBetway was launched in 2006 and has become one of the world’s leading online and mobile gambling and gaming sites. We offer Betway Casino and Sports Betting alongside Betway Vegas and boast a wide variety of games and markets to bet on. \n\nApple is in no way associated with this Betway Welcome Bonus promotion. \n\n* New customers only. Opt-in required. 100% Match Bonus up to £250 on 1st deposit of £20+. 50x bonus wagering applies as do weighting requirements. Debit Card & PayPal deposits only. Advantage Play may invalidate your bonus. Other conditions apply - see Full Terms: https://casino.betway.com/policies/bonus/\n  \nSee http://casino.betway.com/terms-welcome-bonus/ for Welcome Bonus T&Cs and http://www.betway.com/terms-and-conditions/ for full T&Cs.\n\n**Please be aware the continued use of GPS running in the background can dramatically decrease battery life.\n\n***Please note, in light of new regulations, if you are using the app in the UK, to make use of the Session Reminder feature, please update to the latest version of the app.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-04-02T07:00:00Z",
  "updated": "2020-03-19T09:10:24Z",
  "releaseNotes": "We’re constantly updating and improving our app. We’ve fixed bugs and added brand new features designed to make our app easier to use!\n\n• Bundling of casino game packages into the app binary\n\nTake a seat at your favorite casino game, we’ll take care of the rest. From slots to blackjack and roulette, we’ve got all the top games for you to choose from, including:\n• Slots: Starburst, Mega Moolah \n• Roulette: European Roulette Gold, Evolution Roulette & Live Roulette HD\n• Blackjack: European Blackjack Gold, Evolution Blackjack & HD Live Blackjack\n• Wheel of Fortune: Evolution Dream Catcher\n\nAre we your favorite casino app or could we do better? Let us know & leave a review.",
  "version": "7.5.1",
  "price": 0,
  "developer": "Betway",
  "score": 4.73451,
  "reviews": 113,
  "currentVersionScore": 4.73451,
  "currentVersionReviews": 113,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.williamhill.games",
  "title": "William Hill Games",
  "description": "Are you a fan of the classics, the latest games or big jackpots? Whatever you’re in to, with over 400 slots, table and instant win games to choose from, there’s sure to be something for you at William Hill Games.\n•\tWant to get to your favourite games quickly? We’ve made it simple to bookmark them, so you can start playing at the touch/tap of a button\n\n•\tAfter a quick bit of fun? Try our impressive range of instant win games. With new releases added weekly, we’re bound to have something you’ll enjoy\n\n•\tGet even more from Games with our regular offers and promotions. Go to the promotions section and you’ll find them all in one place\n\n•\tFrom Deal or No Deal and Rainbow Riches, to 20p Roulette and Chain Reactor Super Trails, we’ve got all the popular games to keep you entertained. With exciting new games and instant wins added every week, the fun never stops at William Hill Games.\nGet the app today and start your adventure.\n\nThe app requires you be over 18 to participate in any gambling activity. Full details can be found on www.williamhill.com\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-03-05T07:19:42Z",
  "updated": "2018-02-27T09:23:12Z",
  "releaseNotes": "You will find our smart new look and feel when accessing the account menu!",
  "version": "1.4",
  "price": 0,
  "developer": "WHG (International) Limited",
  "score": 4.50387,
  "reviews": 516,
  "currentVersionScore": 4.50387,
  "currentVersionReviews": 516,
  "searchTerms": "roulette"
 },
 {
  "appId": "eric.MessengerApp.com",
  "title": "Omegle",
  "description": "Omegle connects you with others through authentic conversations in real time. With one tap, you’ll be connected with millions of users from over 100 different countries matched by our unique match algorithm, trained by years of matchmaking user data. The video chat matches are never random, but carefully customized based on your user profile and interactions with other users. All chats are carefully safeguarded by our automated AI protection software, and all violators will be removed permanently. Combined with our state-of-the-art moderation system and proprietary live chat matching algorithm, the possibilities are endless as you get to meet new friends from all over the world in a safe and fun environment. \n \nMain Features:\nVideo Chat – instant live matches\nDMs – chat with your new friends\nReactions – animated fun chats\nGifts – express your appreciation for a genuine convo\n\nThe Omegle Experience:\nLive video chat and meet new people instantly around the world. All chats are carefully protected by our automated AI monitoring system in order to create the best and safest user experience for all our users. We want to create a fun and safe online community for all. There are so many unique and talented individuals from all over the world, each with their own amazing stories and experiences to share. Each non-random video chat match is a unique social experience, and a potential new life-long friendship to be formed. Stay in touch through DM text messages and discover new connections through live chats to learn about different cultures and deep personal experiences.",
  "genres": [
   "Social Networking",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2015-11-07T19:10:13Z",
  "updated": "2020-05-07T22:04:24Z",
  "releaseNotes": "Bug fixes and performance improvements.",
  "version": "2.0.9",
  "price": 0,
  "developer": "Hans Stuffer",
  "score": 4.29213,
  "reviews": 178,
  "currentVersionScore": 4.29213,
  "currentVersionReviews": 178,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.appwings.roulette",
  "title": "Photo & Video Roulette",
  "description": "Photo & Video roulette is a social and fun board game to play with your friends! The rules are simple: \n\n⋆ Random photos or videos will be picked from your devices\n⋆ Photos or videos are shuffled and displayed one by one\n⋆ You have to guess whose photo or video is shown\n⋆ Fastest player wins\n⋆ Share your results on social media, Facebook, Snapchat, Instagram\n\nPlay with as many people as you want, choose if you would like to play with random photos, videos, both, or simply select the files yourself. \n\nHave fun with Photo & Video roulette!\n\n***\n\nSUBSCRIPTION\n\n- You can subscribe for this app to get full premium access and the ability to play an unlimited number of times \n- Subscription option: weekly \n\n- Privacy : http://photo-roulette-app.com/privacy-policy/\n- Terms of Use : http://retropixel.co/terms-of-use",
  "genres": [
   "Games",
   "Board"
  ],
  "contentRating": "12+",
  "released": "2020-01-29T08:00:00Z",
  "updated": "2020-03-09T17:09:30Z",
  "releaseNotes": "A lot of new cool fun features! Most fun multiplayer trivia game, try it for free. Enjoy photo & video roulette!",
  "version": "1.0.5",
  "price": 0,
  "developer": "APPWINGS Ltd",
  "score": 4.2381,
  "reviews": 63,
  "currentVersionScore": 4.2381,
  "currentVersionReviews": 63,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.leovegas.leocasino",
  "title": "LeoVegas: Real Money Casino",
  "description": "Join millions of players on the virtual mobile casino floor when you download the multi-award winning LeoVegas Real Money Casino mobile gaming app. \nDiscover all your favourite casino games including blackjack, roulette, baccarat and all the greatest slots like Starburst, Book of Dead, Rainbow Riches and many more. Spin for the jackpot on our slot machines, take a seat at any live dealer table or place a bet with the best odds instantly on your favourite sports. Play your way then use the instant cash out feature to claim your winnings fast.\nStep inside a world of quality casino excitement with everything you want from the latest game releases to all-time favourites in the palm of your hand with LeoVegas, the King of Mobile Casino. The LeoVegas Real Money Casino app is one of the greatest real money gaming experiences and it’s all yours to play anytime, anywhere, on your iPhone and iPad.\n\nLeoVegas – King of Mobile Casino\nLightning-fast loading, deposits and withdrawals\nApple Pay: no credit card needed, secure and easy payment\n24/7 Customer service with agents from the UK \nLive dealers and a VIP experience fit for a king\nLeoVegas supports your responsible gameplay with LeoSafePlay\n\nMulti-Award Winning LeoVegas\n'Best Native App' EGR Marketing & Innovation Awards 2017\n'Online Casino of the Year' Global Gaming Awards 2018\n\nLeoVegas Casino\nPlay for real money with over 1000 slot machines, RNG and jackpot games\nFavourite UK casino games including Starburst, Book of Dead, Rainbow Riches, who wants to be a millionaire megaways, Extra Chilli, etc.\nBlackjack, roulette, baccarat and all the greatest table games\nFast game loading speeds and cash out payments \n\nLeoVegas Live Casino\nReal casino play with first-rate dealers \nThe latest exclusive tables with instant access to roulette, baccarat and blackjack\nHD quality streaming from dedicated studios and luxurious locations around the world\nBe the king of the casino with Bespoke LeoVegas tables in our Chambre Séparée\nA fast, immersive experience with live dealers and full-screen functionality \nAccess to seat availability, latest roulette numbers and gaming limits with dynamic data\n\nLeoVegas Sport\nBet in-play on all the popular sporting events \nInstant betting markets \nBoosted live and pre-match odds\nBet and watch live\nCash out feature to claim your winnings fast before the match ends\nOver 120, 000 live events with the widest range of betting markets on the top leagues\n\nWhen you sign up at LeoVegas choose from 3 different welcome bonuses - Casino, Sport or Live Casino. The promotions page within the app is filled with the latest offers for existing customers. \nIf you have an account with LeoVegas, simply use this app to login and then play for real cash instantly from the same account as if you were on LeoVegas.com. \nLeoVegas, the King of Casino: www.leovegas.com\n\n20 Free Spins No Deposit needed T&Cs\n\nAll new casino players from the UK who are 18 years and over will be eligible for 20 Free Spins on selected slot games when they create an account at LeoVegas.com, subject to the terms and conditions below. 20 Free Spins Registration Bonus \n1. This offer is available to all new UK players registering at LeoVegas.com from the 8th April 2019. \n2. Any winnings from the Free Spins must be wagered 35 times before they can be withdrawn. 3. Free Spins are worth £0.10 each and are valid for 7 days upon activation unless otherwise stated. \n4. The game on which Free Spins are awarded is subject to change from time to time. \n5. Currently, Free Spins can be used on the following slot games: Book of Dead\n6. Free spins must be claimed on ‘’My Offers’’ page within 14 days of sign-up.\n7. General Terms and Conditions of the LeoVegas website apply https://www.leovegas.com/en-gb/promotions/bonuses/c\n\nLicences\nLeoVegas Gaming Ltd is licensed and regulated. LeoVegas Gaming Ltd holds a UK licence issued by the Gambling Commission - UK Licence Number: 000-039198-R-319450-017.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2014-04-27T13:27:22Z",
  "updated": "2020-02-27T08:37:33Z",
  "releaseNotes": "We’ve made some great updates and released fantastic features to improve your experience. Our latest update brings with it a new sleeker look, making it easier to read and navigate getting you in the action quicker\n\nWelcome to LeoVegas - The King of Mobile!",
  "version": "1.8.19",
  "price": 0,
  "developer": "LeoVegas Gaming Ltd",
  "score": 4.51206,
  "reviews": 580,
  "currentVersionScore": 4.51206,
  "currentVersionReviews": 580,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.cervomedia.spf",
  "title": "Slots - Pharaoh's Fire",
  "description": "Fun, excitement, entertainment! The legend continues... ••• Slots - Pharaoh's Fire ••• is here!\n\n• These slots play just like a dream - easy to understand, big wins, amazing bonuses. Join the Pharaoh on his breathtaking journey. Play like a true winner, win like a true emperor!\n\n• Experience features never seen before: The \"Return Bonus\" reflects the moon phases at your place of residence and grants bonuses according to the moon phase! Incredible! Collect relics and view them in the new and amazing \"Relic room\". You will have a blast!\n\nDOWNLOAD NOW! YOU WILL LOVE SLOTS - PHARAOH'S FIRE!\n\nFeatures:\n- Discover incredible games: 25 lines, 50 lines, 100 lines. WOW! And we constantly add more games!\n- Amazing bonuses and game design by casino professionals\n- Beautiful graphics, premium presentation and authentic sounds\n- Easy to play with multiple convenient features:\n> Fast reel stop\n> Individual reel stop\n> Auto play\n> Double up/Gamble (50:50 and 75:25)!\n\n••• Slots - Pharaoh's Fire ••• is THE new premium slot experience for the iPhone and iPad.\n\n--> Please note:\n• This app is for entertainment purposes only!\n• No real money or any other real world goods and/or services can be won in this game!\nThis game uses virtual units called \"Credits\" to play the game. You can purchase additional credit-packs for real money via the \"Buy\" popup. These credits bought or won cannot be changed back to real money and cashed out, transferred, redeemed or collected in any other way or changed back to any other real world goods and/or services. Once purchased or won, the credits can only be used to play this game.\n• This app does not reflect the actual game play of any casino-, online- or other electronic gaming machine. The payout percentages, odds, payout methods and other features on our for-fun, entertainment only slots are higher/better/different than slot machines in regular/online casinos. You should not expect similar results!\n• The developer of this app takes no responsibility or liability with regards to the legal requirements to use this app in the relevant jurisdiction the player is resident and plays the game, and therefore the use of this app is the sole responsibility of the player.\n• The player agrees that he/she will comply fully with all applicable laws, regulations, statutes and ordinances which are applicable to use this app.\n• Only play this game if you have reached the respective legal age required in your country of residence. If so, play responsibly!",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2015-01-20T13:33:39Z",
  "updated": "2018-07-26T08:29:26Z",
  "releaseNotes": "• A new amazing slot: Temple of Osiris!\n• Osiris grants powerful high wins and free spins in a slot full of stacked symbols!\n• Thanks for downloading. The next update is coming very soon!\n• If you encounter any problems, please contact our friendly support staff: spf-ios-support@cervomedia.com",
  "version": "3.12.1",
  "price": 0,
  "developer": "Funstage Spielewebseiten Betriebsges.m.b.H.",
  "score": 4.59999,
  "reviews": 50,
  "currentVersionScore": 4.59999,
  "currentVersionReviews": 50,
  "searchTerms": "roulette"
 },
 {
  "appId": "Com.FunSpring.StackMaster",
  "title": "Stack Master -Tap To High",
  "description": "Build the tower as high as you can!\n◉ Inspired by famous architectures all over the world\n◉ Beautiful graphics elaborately designed\n◉ Compete for the Highest score in the world",
  "genres": [
   "Games",
   "Action"
  ],
  "contentRating": "4+",
  "released": "2019-08-29T07:00:00Z",
  "updated": "2020-02-17T02:14:15Z",
  "releaseNotes": "-New skins & Improvements",
  "version": "1.5.2",
  "price": 0,
  "developer": "peng zhang",
  "score": 4.23602,
  "reviews": 322,
  "currentVersionScore": 4.23602,
  "currentVersionReviews": 322,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.royalslots.app",
  "title": "Royal Slots Casino",
  "description": "Welcome to Royal Slots, the online casino with a huge selection of fantastic games.\n\nRoyal Slots is fully licensed and regulated by the UK Gambling commission.\n\nRoyal Slots offers a massive selection of online casino slots and all your favourite live casino games – Blackjack, Roulette, Dream Catcher & More! We’re constantly adding the latest games & offer all your favourites including Fishin Frenzy, Eye of Horus and Rainbow Riches.\n\nPlayers can opt in to our exciting welcome bonus, where we will double your first deposit up to £200 followed by 3 further deposit bonuses*\n\n-Deposit bonus 1 100% up to £200*\n-Deposit bonus 2 50% up to £200*\n-Deposit bonus 3 25% up to £300*\n-Deposit bonus 4 25% up to £300*\n\n*New customers only. Opt-in required. 1st deposit bonus 100% up to £200. 2nd deposit bonus 50% up to £200, 3rd deposit bonus 25% up to £300, 4th deposit bonus 25% up to £300. Min deposit £10. 40x wagering, 30 days to complete wagering, game weighting and game restrictions apply. Max Bet with bonus funds £5. Max withdrawal from bonus funds is £2000. Eligibility restrictions apply, cash balance can be withdrawn at any time. See app for full terms and conditions.\n\nTo download and use this online casino app, you must be a UK resident and over 18.\n\nRoyal Slots is not a free to play app, you are playing with real money. You should only gamble what you can afford to lose and please gamble responsibly. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit www.begambleaware.org.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-10-25T07:00:00Z",
  "updated": "2020-04-22T15:39:05Z",
  "releaseNotes": "Updates for the latest iOS",
  "version": "1.0.33",
  "price": 0,
  "developer": "One Click Limited",
  "score": 4.58882,
  "reviews": 304,
  "currentVersionScore": 4.58882,
  "currentVersionReviews": 304,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.phonato.casino.vegas.slots.machines.double.down.videopoker.craps.game",
  "title": "Vegas Slots - 7Heart Casino",
  "description": "Download now! New players get 1,000,000 FREE BONUS Coins in the #1 FREE to play Casino app in the world!\n\n7Heart Casino gives you a chance to WIN GRAND Jackpot on our Slot machines! Feel Las Vegas right at your home with 7Heart Casino! This app has been created by casino experts to match the real slots and casino experience.\n\nWin a massive fortune with HUGE Jackpots, Free Daily Games, Bonus Games, and many more! Play and win on our 777 slots.\n\nVegas Slots - 7Heart Casino lets you play some of the top Slot Machines, Roulette,  Video Poker, Blackjack, Baccarat, Craps, Keno, Lottery and many other games. Vegas Slots Casino offers you a chance to win MASSIVE wins with great fun. Play your favourite Casino Slot machines and enjoy the excitement of winning the jackpot.\n\nPlay your favourite slot machines - Mega 10X, Three Diamonds, Buffalo Dash, Irish Cash, Yummy Candy, Wolf Riches, Jewel Spin, Caesar, Zeus, Huge Bucks and many others.\n\n7Heart Casino gives you a chance to win MASSIVE prizes with AMAZING FREE slots machines!  Play your favourite casino slot machines games with 1,000,000 Free coins.\n\nEnjoy the experience of Vegas like never before with our unique Slot Machines! Have fun playing our table games! They will make you feel as if you are in the real casino playing your favourite game!\n\nAdditionally, spend time in the Casino city - 7Heart Capitalist! This exclusive city connects you to the virtual world. Buy, sell and invest virtual goods and make yourself a billionaire!\n\nThe game has engaging graphics, sound and smooth gameplay! This game takes you closest to being in Vegas!\n\nTop Features of 7Heart Casino :\n\n► Daily Bonus Wheel and Hourly Bonuses.\n► Hand Picked Slot games added frequently.\n► Larger-than-life Jackpot Wins.\n► Exciting & Interactive Bonus rounds.\n► Play Craps, Blackjack, Baccarat, Roulette, Video Poker, Keno and other table games.\n► Double Down on the BlackJack table and win Big!\n► Join VIP membership for exclusive rewards and many more benefits.\n► Play challenging Quests and win more!\n► Play Lottery and get a chance to win big!\n► Social Connect - Send your companions INVITE on Facebook and join them in the Casino.\n► Deals on Gifts - Send or receive gifts from your friends and get instant COINS.\n► Exclusive Casino City which can be owned by you. Enjoy amazing perks of a City Owner!\n► Become Rich! Feel Rich!\n► 24/7 Email/Phone Support!\n\nContinue the thrill of playing 7heart Casino and be a billionaire! Win Big!\n\nEnjoy the game!\n\nDisclaimer : The games are intended for an adult audience. Our games are meant for amusement and entertainment purposes only. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling\".",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2018-04-23T00:38:52Z",
  "updated": "2020-05-11T13:55:53Z",
  "releaseNotes": "********GRAND UPDATE ********\n- {NEW} 8 New Slot Games - The Jungle Queen, Blaze of Tiger, Wild Egypt, Rhino Gold, Beerfest Mania, Goldish Dynamite, The Pearl of Mermaid, Yin & Yang.\n- {NEW} 7Heart Rewards Section - Here you will be able to play cool games of chance for more ways to have fun! Explore and Enjoy!\n- {NEW} Leaderboard Introduced - Check where you stand vis-a-vis your friends and other players from the globe.\n- {NEW} Trophies - Measure your success in the casino. More the gaming activity, more the trophies! \n- Game Optimisations and Performance enhancements.\n- Fine tuning of the game play.\n- Bug Fixes\n\nEnjoy the Las Vegas experience! We hope that all of you #staysafe. If there is anything we can do to enhance your gaming experience, please feel free to ask for it. Share your feedback!",
  "version": "2.31",
  "price": 0,
  "developer": "Phonato Studios Casino Slots Gaming",
  "score": 4.81203,
  "reviews": 133,
  "currentVersionScore": 4.81203,
  "currentVersionReviews": 133,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.appstreetsoft.Blackjack",
  "title": "Blackjack 42",
  "description": "Blackjack, or 21, the favorite card game found in casinos around the world, can now be experienced right on your iPhone, iPod and iPad. Impeccably designed and intuitive, this one is sure to make you go \"wow\". \n\nPlay with your friends in private tables or let us match you with anyone around the world automatically. Compete with your friends for interesting titles and achievements. \n\nPlay, compete, show off and make friends!\n\nThe complete game\n************************************\nPlay with all type of possible calls – hit, stand, double, split and surrender. Choose to play it American or European style with 2, 4, 6, 8 or 10 decks. We’ve got everything covered! \n\nFun for free \n************************************\nGet thousands of free chips daily. Refer your friends and get referral bonus every time your friend joins the game. There are other ways to get free chips as well. Play and feel like a high roller without dropping a penny!\n\nOnline Friends and Invite to Match\n************************************\nSee who is online and join in your friends' table automatically. You can also invite your friends or share invite links. If you prefer, you can always play on a public table or play offline in single player mode. There is always a table waiting for you!\n\nFive different lounges \n************************************\nChoose the lounge you want to play in and compete with like-minded people. Start with the Silver lounge and move up to the Diamond lounge.\n\nJoin the league \n************************************\nPlay and make your way to the leader boards and pick up hilarious achievements. \n\nCrowning glory \n******************************\nAs you play and gain expertise in the game, conquer various crowns and show them off to the world.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-12-21T04:04:29Z",
  "updated": "2018-01-31T18:50:36Z",
  "releaseNotes": "* New in 5.0.1\n\n- Fixed a bug which caused the interface to be over bright\n\n* New in 5.0\n\n- Invite friends using in app notifications and game links\n- View currently online friends to play with them\n- Complete revamp of user interface\n- Refer friends and get free chips when they join\n- New leaderboards\n- Multiple bug fixes",
  "version": "5.0.1",
  "price": 0,
  "developer": "App Street Software Private Limited",
  "score": 4.20253,
  "reviews": 79,
  "currentVersionScore": 4.20253,
  "currentVersionReviews": 79,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.apostek.SlotMachineFinal",
  "title": "Slot Machine: Slots & Casino",
  "description": "THE ORIGINAL #1 VEGAS CASINO SLOTS with over 15 million players worldwide is now even more awesome. Enjoy multi pay lines, various themes, surprising mini games, super jackpot, virtual shop & more! Absolutely FREE! \n\nSlot Machine got BIGGER & BETTER with v5.0! Brand New Look & Loads of Exciting Feature\n\nTOP FEATURES:\n\n–  MULTI BETLINES - Play up with Max Bets of 200 Chips with 5 Paylines\n\n- 6 EXCITING CASINO GAMES – Super Spinner, Lucky's Pot of Gold, Video Poker, Scratch Card, Turkey Smash and Super Derby. ‘Play for Fun’ OR ‘Play with Coins’!\n\n- PROGRESSIVE SUPER JACKPOT – Get Rich Quick! Free chips every 60 seconds! 100 gems Base value. Increments after 3 minutes. Ability to double Jackpot winnings\n\n- ONLINE LEADERBOARDS & ACHIEVEMENTS – Compete with other players for top honors on 3 online leaderboards & earn 25+ badges\n\n- 2x MULTIPLIERS to double your winnings. Packs of 1/2/12 hours and 7 days \n\n- Online TOURNAMENTS & MULTIPLAYER MODE to compete with thousands of players online\n\n- Slots Loyalty Program With Pocket Change – Earn free real rewards just for playing each day! Amazing gifts available from brands like Nike, Beats By Dre, Amazon, and Sony! Check out the 'Rewards' section under 'Get Xtras'.\n\n- Virtual Shop with lots of exciting lifestyle goods to be earned\n\n- 'GET XTRAS' BONUS (Super Sunday, 3 In A Row, 500 Spins). Upgrade to Slot Machine+ for upto 25,000 gems every week! \n\n- AUTO SCORES RECOVERY \n\n++++++++++++++++++++++++++++++++++++\n> Slot Machine ACHIEVEMENTS\n++++++++++++++++++++++++++++++++++++\n#1 Loved the world over - the undisputed Top Slots game in the world for more than 3 years!\n#2 #13 Ranked Game (All Games) in US. #2 in Casino games category\n#3 Top 10 Casino games in more than 50 countries\n#4 Featured in New & Noteworthy in more than 90 stores!\n\n\nALL FEATURES \n\n- Upgrade to Slot Machine+ to play with higher payouts & more time!\n- NUDGE AND HOLD to enhance your winnings. Get 25 Free every day!\n- 'GET XTRAS' Bonus for returning users: Play smart to get '3 in a Row', 'Super Sunday' and '500 Spins' bonus credits\n- High Stakes with 'JACKPOT' of 3600 chips (CENTER line only)\n- Multiple exciting skins - American, Vegas, Halloween, Xmas and Aqua \n- Free Spins for Bells (CENTER line only)\nPlay for top honors against cross-platform competitors!\nUpdated 'Statistics' to keep track of all your achievements, bonuses and scores\n- New & improved Tutorial & Help\n- Advanced 'Settings' screen with choice of 3 sounds - Classic, Casino or Musical and multiple themes\n Scores Recovery - Now get your scores back even if you reinstall the game!\n- NEW & EXCITING  War of the Platforms! Compete with other iPhone users for top honors!\n- Slot Machine+  with HIGH PAYOUTS, UNLIMITED MINI GAMES & ZERO ADS is ALSO available - Download and play NOW!\n\nHope you continue to play and enjoy the game and keep sharing your feedback. We're listening to you!\n\nLove our Apps? Want new features? Got suggestions? Email your feedback to supportios@apostek.com\n\nSay hello, talk to us and keep up with our newest games:\n\nTwitter: twitter.com/apostekapps\nFacebook: http://www.facebook.com/ApostekApps\nYoutube: http://youtu.be/PUriwGjfglk",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2009-06-06T21:50:56Z",
  "updated": "2019-11-29T09:01:26Z",
  "releaseNotes": "Bug fixes",
  "version": "7.5",
  "price": 0,
  "developer": "Apostek Software",
  "score": 3.16667,
  "reviews": 6,
  "currentVersionScore": 3.16667,
  "currentVersionReviews": 6,
  "searchTerms": "roulette"
 },
 {
  "appId": "ylee.studio.show.me.stream",
  "title": "Showme - Random video chat",
  "description": "Find friends or soul mate among people who appreciate your inner qualities!\n\nShow Me is a video chat for those who believe that the inner world is more important than appearance. You can communicate with people from all over the world with the help of blurry silhouettes. \n\nSelect location:\n- Communicate with those who are near or choose a person from anywhere in the world.\n\nFrame blur control:\n- Decide yourself when you are ready to move to a new level of communication.\n\nChoosing a way to communicate:\n- Video chat or extra text chat? The choice is yours!\n\nProtection of personal information\n- We guarantee the confidentiality of personal data.\n\nStart discovering new experiences!\n\nSUBSCRIPTION:\nShowme King offers auto-renewing subscription option monthly. Payment will be charged to iTunes Account at confirmation of purchase.\nYour Showme King subscription will automatically renew at at least 24-hours before the end of each term and your credit card will be charged through your iTunes account. Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. You may cancel automatic renewal and manage your subscription by selecting Manage App Subscriptions in your iTunes Account settings and selecting the subscription you want to modify. The cancellation will take effect the day after the last day of the current subscription period, and you will be downgraded to the free service.\n\nGET IN TOUCH:\nour terms and conditions: https://showme-chat.com/legal/terms\nour privacy policy: https://showme-chat.com/legal/privacy\n\nDo you have questions, or feedback? Feel free to contact us - showme@ylee.io\nNote: Showme App s intended for people 17 years or older.",
  "genres": [
   "Social Networking",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-07-28T23:25:16Z",
  "updated": "2020-04-17T14:38:53Z",
  "releaseNotes": "Meet new friends online - stay safe!\n\nIn this update:\n- Minor bugs has been fixed\n\nStay tuned!",
  "version": "2.6.4",
  "price": 0,
  "developer": "Ylee Studio",
  "score": 4.73654,
  "reviews": 353,
  "currentVersionScore": 4.73654,
  "currentVersionReviews": 353,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.blowfire.wildclassic",
  "title": "Wild Classic Slots™ Casino",
  "description": "Welcome to Wild Classic Slots™ - the most popular free classic slots game in 2019! Huge bonus, free spins & wheel of fortune are waiting for you! Get your gifts, choose your favourite vegas slots and spin for your huge Jackpot and the thrill of winning on the most realistic slot machines and challenging the players from all over the world!\n\n20,000 Welcome Bonus & Get FREE coins & spins every day!!\n\n- More than 100 free slot machines like real vegas casino!\nFrom the rainbow in the sky to the oil deep underground, there are endless elements in the game. You can always choose what you like! Want to more excited experience? Check our VIP high roller machines!\n\n- Endless Free Coins, Free Spins, Daily Bonus!!\nWelcome bonus, hourly free coins, daily free coins, Wheel of Fortune… More gifts are waiting for you! Grand prize for the tournament will surprise you! Will the Lucky Goddess be on your side？\n\n- Make Friends on Wild Classic Slots™\nPlay with millions of players from all over the world! Login Facebook to invite them to this world best online slots game and let even more fun with them! You can also make new friends while discovering hundreds of incredible slot machines.\n\nReady to get a free try? Collect your free coins and start your amazing slot journey!\n\nWe value all your suggestions, you can contact us by\nEmail: ClassicSlots@blowfires.com \n\n*Wild Classic Slots Casino is intended for use by an adult audience for amusement purposes only. Wild Classic Slots Casino does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2016-07-26T13:48:06Z",
  "updated": "2020-05-07T11:27:29Z",
  "releaseNotes": "Hello, my lovely wild classic slots fans! Glad to see you again!\nA more perfect new version is here waiting for you! Some slots machines have been further optimized and the new machine Chili Respin will be added with new features!\nWhat’s more, brand new thrilling bonus games will be released on the new version soon!\nAre you ready? Update now to get better experience!\nHave a good time!",
  "version": "3.9.1",
  "price": 0,
  "developer": "Lucky Money Vegas Slot Casino Games",
  "score": 4.80837,
  "reviews": 167,
  "currentVersionScore": 4.80837,
  "currentVersionReviews": 167,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.bingo.tour.party.crazy.free.ios.avidly",
  "title": "Bingo Party - Bingo Games",
  "description": "Bingo Party is the Classic & Special Bingo Game with 8 CARD VERSION!  Wanna get more bingos? Wanna be more fun? Just play Bingo Party!\n\nGame Features:\n# Realtime multiplayer! Play with more than 10,000 players at a time!\n# Join elite to play up to 8 cards!\n# Over 30 bingo rooms! We will be rolling out more rooms!\n# 500 Tickets & 30 powerups to start off. Each day you have another 150+ tickets to continue the bingo trip. Don't miss it!\n# Your daily bonus will increase by your level up!\n# Complete kinds of puzzles to get BIG BONUS!\n# 7 types of power-ups - Help you get more bingos!\n# Daily Tournament - Complete other players to win big!\n# Achievement - Over 200 achievements to challenge. Complete to win!\nIf you love bingo and want to try a new one, Bingo Party is a good choice. Just have a rest out from other bingo games, we will not let you down!\nIf you love bingo and want to try a new one, Bingo Party is the good choice. Come experience the fantastic NEW BINGO game, we will not let you down!\nDon't Wait and download now, a new Bingo Party is waiting for you!\n\nPractice or success at social casino gaming does not imply future success at real money gambling. \n• The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n•The games are intended for an adult audience.\n***********************************************************************\n\nHave questions or suggestions about Bingo Party - Bingo Casino & Slots Games?\nEmail your questions to bingo@avid.ly.\n\nThank you for playing and have a wonderful bingo trip!",
  "genres": [
   "Games",
   "Board",
   "Casino"
  ],
  "contentRating": "12+",
  "released": "2017-08-10T01:53:14Z",
  "updated": "2020-04-30T16:03:50Z",
  "releaseNotes": "1. Bug fixed and game optimized.\n2. Newly added Advancement Pack for new players.",
  "version": "2.5.0",
  "price": 0,
  "developer": "Avid.ly",
  "score": 4.65123,
  "reviews": 10305,
  "currentVersionScore": 4.65123,
  "currentVersionReviews": 10305,
  "searchTerms": "roulette"
 },
 {
  "appId": "be.nieldeckx.randomphoto",
  "title": "Photo Roulette - Random Photo",
  "description": "Photo Roulette is the perfect app to share photos in a fun and exciting way. The app selects a random photo from your library which you can share in iMessage, WhatsApp or other apps. If you are brave, you can send a random selfie as well.\n\nIt's fun to bring up embarrassing moments or exciting old memories when bored. You will definitely get to know each other better by sharing random photos and talk about it.. ;)\n\nTry out Photo Roulette for free!",
  "genres": [
   "Entertainment",
   "Photo & Video"
  ],
  "contentRating": "4+",
  "released": "2018-07-09T01:44:42Z",
  "updated": "2019-10-29T02:41:49Z",
  "releaseNotes": "Dark mode support! \nThank you for using Photo Roulette.",
  "version": "1.2",
  "price": 0,
  "developer": "Fanatic Development",
  "score": 2.5,
  "reviews": 4,
  "currentVersionScore": 2.5,
  "currentVersionReviews": 4,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.betway.casino",
  "title": "Betway - Casino Slots & Games",
  "description": "Step into the Betway Casino! Discover a huge range of real money games; from slots and poker to roulette, blackjack & more.\n\nPlay for your chance to win! And if you’re new to Betway Casino, you get 100% Welcome Bonus, up to £250*! You can even claim your winnings early - simply tap whenever you see the Cash Out button.\n\nDiscover our top games:\n\n• Evolution - Dream Catcher\n• Mega Moolah\n• Tarzan\n• Evolution - Roulette\n• Evolution - Blackjack\n• Goliath\n• European Blackjack Gold\n\n...and many more!\n\nJackpots & huge cash prizes are waiting to be won! Take a spin on Mega Moolah or Starburst, join a multiplayer Poker table or take on the dealer with Live Blackjack. What would you do with your winnings?\n\nREAL MONEY SLOTS\n\n• Play for your chance to WIN BIG with Progressive Jackpot Slots\n• Choose from top Slot machines including Mega Moolah, Starburst & many more!\n• Ready, steady, spin! There’s Slot games to suit any player & any bankroll\n\n\nLIVE ROULETTE\n\n• Simple rules, big payouts - find your Roulette game in Betway’s luxury casino\n• Play favourites like European Gold & Evolution Roulette\n• Put the wheel in motion for your chance to win\n\n\nBLACKJACK\n\n• Step right into Vegas with this casino classic - it’s all about beating the dealer’s hand\n• Play Live Casino for the ultimate Table Game faceoff\n• Take your place at the premium online Blackjack tables\n\nLIVE HD CASINO\n\n• Get the Vegas vibe streamed straight to your mobile from our studios, live in HD\n• Multiplayer casino games including Video Poker, Live Baccarat and other card games\n• Double Betway Plus points on newly released games. Redeem your points straight from your mobile to keep the good times rolling!\n\nPlay your cards right & place your bets! Whether you’re a seasoned slot machine pro or new to the game, there’s something for everyone at Betway. Download now!\n-------------------------------------------\n\n*New customers only. Opt-in required. 100% Match Bonus up to £250 on 1st deposit of £20+.50x bonus wagering applies as do weighting requirements. Debit Card & PayPal deposits only. Advantage Play may invalidate your bonus. Full Terms apply.\n\nhttp://casino.betway.com/terms-welcome-bonus/ for Welcome Bonus T&Cs and http://casino.betway.com/terms-and-conditions/ for full T&Cs.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-09-18T13:31:37Z",
  "updated": "2020-05-05T10:12:58Z",
  "releaseNotes": "We’re constantly updating and improving our app. We’ve fixed bugs and added brand new features designed to make our app easier to use!\n\n• Players experience improvements\n• Updated branding and theme\n• Performance and stability improvements\n• Bug fixes\n\nTake a seat at your favorite casino game, we’ll take care of the rest. From slots to blackjack and roulette, we’ve got all the top games for you to choose from, including:\n\n• Slots: Starburst, Mega Moolah \n• Roulette: European Roulette Gold, Evolution Roulette & Live Roulette HD\n• Blackjack: European Blackjack Gold, Evolution Blackjack & HD Live Blackjack\n• Wheel of Fortune: Evolution Dream Catcher\n\nAre we your favorite casino app or could we do better? Let us know & leave a review.",
  "version": "7.5.4",
  "price": 0,
  "developer": "Betway",
  "score": 4.71917,
  "reviews": 876,
  "currentVersionScore": 4.71917,
  "currentVersionReviews": 876,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.coldfiregames.idle.casino.tycoon",
  "title": "Idle Casino Manager",
  "description": "Rule your casino and become the richest manager!\n\nAre you ready to run a huge gambling establishment?\n\nStart with a small casino and work hard to make your business grow. Add new games to create an exciting experience where visitors can play poker, roulette, blackjack or try their luck at the slot machine.\n\nManage your cocktail bar and exchange booth wisely to earn money. Expand the Casino with new floors and unlock the most amazing games and machines.\n\nImprove the attractions of your casino with an all-new poker table, a golden roulette ball or new games for the arcade machines. Scale up your parking lot and launch marketing campaigns to get even more visitors to your gambling establishment.\n\nAs you slowly become a huge casino tycoon you'll need to hire new employees or raise their salaries as your business grows. The decision where to invest your hard-earned money is all yours. Will you unlock new games first? Or would you like to further improve the ones you already got? There are different ways to achieve glory but which one is the best for your establishment?\n\nIf you like management and idle games, you’ll enjoy Idle Casino Manager. Although it's an easy-to-play game it takes all your strategic decisions into account. Invest your money wisely and transform your small business into a huge Las Vegas-like casino!\n\nFeatures:\n► Easy-to-play game for every player\n► Take important business decisions.\n► Many different games available.\n► No internet connection needed. Play offline anywhere, anytime.\n► Make important managing decisions to expand your establishment\n\nBecome the biggest casino tycoon the world has ever seen!\n\nWhat are you waiting for? Play now!\n\nDo you have any Ideas, praises or problems?\nJust drop us a message: support@coldfiregames.com\nOr via Facebook: https://www.facebook.com/IdleCasino\nWebsite: https://coldfiregames.com\n\nYour Idle Casino Manager team",
  "genres": [
   "Games",
   "Simulation",
   "Strategy",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2019-12-12T08:00:00Z",
  "updated": "2020-05-01T01:29:11Z",
  "releaseNotes": "- Minor Bugfixes\n\nWe'd love to hear your feedback\nFacebook: http://www.fb.me/IdleCasino\nDiscord: https://discord.gg/KyR4Mzn\nSupport: support@coldfiregames.com",
  "version": "1.9.1",
  "price": 0,
  "developer": "ColdFire Games",
  "score": 4.74437,
  "reviews": 489,
  "currentVersionScore": 4.74437,
  "currentVersionReviews": 489,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.app.TinyDecision",
  "title": "Spin.the.Wheel",
  "description": "Ever have trouble making decisions? Well, you need Spin the Wheel!\nWhether you’re 12 years old or the President of the United Sates, Spin the Wheel can make all decisions for you!\nNot sure what ingredients to use for your next batch of slime?\nNot sure what to eat for lunch or what to wear?\nNot sure who to appoint as a Supreme Court Justice Nominee?\n\nSpin the Wheel is is the app for you!\n\nWhether it’s a tiny decision, or a major decision, feel free to use the app for all of your\nNot sure whether or not to download Spin the Wheel? Spin the Wheel can make this decision for you too! Although that’s technically a paradox.\n\nIt’s the easy and fun way to make all your decisions. Choose from random decisions, or create your own, spin the wheel and get the answer! We add new fun decisions weekly, on the fly, so you’ll always have something new to try.\nIndecisive of where to travel this summer? Or disagree with your significant other on where to go for date? Not sure who to vote for?\nSpin the Wheel app will make your choices for you. Simply spin the wheel, roll the dice, or flip a coin. Use coin flip a coin for tiebreaker decisions and dice rolls when playing your favorite board game.\nFeatures:\n- Create your own decisions\n- Built-in decision collection\n- Set weight for options\n- Add Siri shortcuts for your decisions\n- Select non-repeating options\n- Flip a coin\n- Roll a dice\n- Share decision with friends\n- Import options from clipboard\n- Make quick decisions\n- Feel wheel spin with touch sensitive feedback\n\nPayment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at current price per month for the upgraded plan. You can manage your subscription and auto-renewal by going to your device Account Settings after purchase. If subscription is canceled, cancellation will be effective at end of then-current subscription period. No refunds. Any unused portion of a free trial period, if offered, will be forfeited when you purchase a subscription to Spin the Wheel All Access Commercial Free.\n\nView our privacy policy at: https://tinydecision.com/privacy\nView our terms of service at: https://tinydecision.com/tos",
  "genres": [
   "Entertainment",
   "Lifestyle"
  ],
  "contentRating": "4+",
  "released": "2019-08-31T07:00:00Z",
  "updated": "2020-01-31T00:07:02Z",
  "releaseNotes": "Performance improvements.",
  "version": "1.7",
  "price": 0,
  "developer": "Tiny Decision Inc",
  "score": 4.96809,
  "reviews": 376,
  "currentVersionScore": 4.96809,
  "currentVersionReviews": 376,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.hortemo.photoguessr",
  "title": "Photo Roulette",
  "description": "In Photo Roulette you compete with your friends to quickly guess whose photo is shown! Play with random photos from you and your friends' phones in this social and exciting Photo Roulette game! Feel the thrill before each picture and share the hilarious moments that occur with the pictures of your friends and family!\n\nIn Photo Roulette, you and your friends team up and engage in a highly social game on your phones. In each round of Photo Roulette a random photo is chosen from one players’ photo library and briefly showed to all of the players. The players compete in quickly guessing whose photo it is, receiving a score based on time and accuracy of their answer. After 15 pictures, the Photo Roulette champion is crowned!\n\nPhoto Roulette features:\n- 3-10 players in a super fun and social PARTY GAME\n- Try an awesome round of VIDEO Roulette!\n- Plant a funny photo or show your photos again\n- Get to know your friends and family through their photos\n- Relive amazing moments with photos you had forgotten\n- Highscore list after each round and game end\n\nThe photos are only displayed for 5 seconds, so your friends and family will only see them briefly. Feel the thrill before each picture and share the hilarious moments that occur with the pictures of your friends and family!",
  "genres": [
   "Games",
   "Board",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2016-04-01T21:47:20Z",
  "updated": "2020-05-10T08:40:57Z",
  "releaseNotes": "This update includes bug fixes and performance improvements.",
  "version": "40.0.0",
  "price": 0,
  "developer": "Photo Roulette AS",
  "score": 4.59314,
  "reviews": 3065,
  "currentVersionScore": 4.59314,
  "currentVersionReviews": 3065,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.jellybtn.cashkingmobile",
  "title": "Pirate Kings™",
  "description": "Attack, Steal, and Defend! - It’s a Pirate Kings Adventure with Friends!\n\n• Ahoy Me Hearties! Set sail in action-packed pirate games with friends!\n• Collect coins and prizes to build your island. Stash more treasure than any other pirate!\n• Raid your friends’ loot in this island adventure! \n• Become the greatest captain of all while stealing bonuses and prizes from other pirates!\n• Yo-ho! Will become the richest Pirate King master of all?\n\nBattle Friends for Gold and Glory to Become the Pirate King! \n\n• Yo-ho! Invite Facebook friends to join in the fun! \n• Spin the wheel and steal their pirate stuff! \n• Attack your Mateys’ islands! Take their good stuff (and coins)! - it's a pirate’s life, after all! \n• Defend your islands from return attacks! Become the Pirate King!\n• Gift coins and treasures to your mateys - who said pirates were bad? \n• Anything goes in the most pirate-tastic of multiplayer games and building games! \n\n Bonuses and Loot A-Plenty In This Epic Island Adventure Game! \n\n• Spin the wheel every hour for daily bonuses! Win coins and upgrade your island.\n• Win chances to attack and more in this swashbuckling pirate game!\n• Rob your friends’ islands: In spin wheel games, you win up to 100k coins on every spin! Use your coins to build your island’s defenses, upgrade pirate ships, and add pirate parrots! Argh!\n• Upgrade your entire island for bigger, better islands - and then defend them (from your friends’ revenge attacks)! \n• Complete Pirate Quests! Damage your friends’ islands, steal their stuff, then upgrade your items for even more glorious goodies! \n• Win big with the Island Tales Pirate Album! Each new album tells the tale of a pirate island adventure game - collect cards as you complete quests for HUGE extra building games rewards! \n\nLove pirate games? Love pirate games with friends? Play Pirate Kings! \n\n• Become the Greatest Pirate Captain of All Your Friends!\n• It's even MORE fun when you play with friends, and STEAL THEIR STUFF! \n• This is Pirate Kings - the multiplayer game where you can attack your friends’ islands!\n• Spin the wheel to play games with friends and...\n• Attack your enemies (or your Pirate Kings friends!) - fire your cannon and loot away! \n• Steal coins from the Cash King! Find where the Cash King is hiding, and steal his bounty! \n• Steal coins from other players too! Take what your heart desires! Enjoy building games as you've never played before in Pirate Kings, the coolest coin game on the high seas!\n• Get in the adventure game spirit - Loot, steal and attack too! What else are island adventure multiplayer games and coin games for?",
  "genres": [
   "Games",
   "Entertainment",
   "Adventure",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2013-11-14T05:30:36Z",
  "updated": "2020-05-07T13:36:15Z",
  "releaseNotes": "Our cleaning crew used the last few days to clean up the decks, squashing some bugs along the way. Thanks to them, the game should now run smoother than ever. Hurrah!\n\nPirate log, version 7.6.8\n\nStay connected with Pirate Kings by joining our community on Facebook, Twitter, and Instagram!\n\nPlease use the in-game support feature to report any issues and give us feedback.\n\n*Game is now compatible for iOS 7 and up",
  "version": "7.6.8",
  "price": 0,
  "developer": "Jelly Button Games LTD",
  "score": 4.17602,
  "reviews": 3011,
  "currentVersionScore": 4.17602,
  "currentVersionReviews": 3011,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.bingo.scape.ios.free",
  "title": "Bingo Journey！Bingo Party Game",
  "description": "Bingo Journey is a free classic bingo game with lots of free Cash and Power-ups to claim every day! Take a tour in Bingo Journey with your friends and family to join a free bingo world and enjoy an odyssey to places of interest around the world. \n\n# You will get 500 cashes & 50 Power-ups to start the bingo journey. \n# Daily bonus of 180+ Cash for you to collect every day. The higher level you reach; the more daily bonus you can get. \n# In the club, you can complete quests in groups and send gifts to each other.\n# Free Power-ups and treasure boxes for you to collect every day!\n# Play against thousands of real players in real time. \n# Join Elite to challenge Elite Exclusive Quest.\n# Boost your cards for better rewards.\n# The more puzzles you complete, the more Cash you can claim as daily bonus. \n# Up to 7 various Power-ups to help you get more rewards.\n# The featured games are elaborately prepared with quality products and rewarding payout.  \n# Graphics are best quality among casino games and there are lots of featured bingo rooms for you to choose from.\n\nBingo Journey frequently updates and adds seasonal and featured bingo games. Our game is a good way to relax and de-stress you from the pressure of daily life. You can play with your family, friends and thousands of players around the world; You can play alone or group together in the club to complete quests! It is also a good way of Socializing to play our game!\n\nThe game is designed for people 21 years of age or older and is for entertainment purposes only. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n\nOur official website: https://bingo-journey.com/\n\nFacebook: https://www.facebook.com/BingoJourney\nInstagram: https://www.instagram.com/bingo_journey/\nYouTube: https://www.youtube.com/channel/UC3dh2DEocAWJcXf87U49FRw?view_as=subscriber\nTwitter: https://twitter.com/bingojourney20",
  "genres": [
   "Games",
   "Casino",
   "Board"
  ],
  "contentRating": "12+",
  "released": "2018-12-13T00:23:28Z",
  "updated": "2020-05-02T11:50:07Z",
  "releaseNotes": "1. Newly added Card Castle system. Enjoy the thrill of collecting precious cards!\n2. Bug fixed and game optimized.",
  "version": "1.6.5",
  "price": 0,
  "developer": "Elestorm Game Co., Ltd.",
  "score": 4.69468,
  "reviews": 5198,
  "currentVersionScore": 4.69468,
  "currentVersionReviews": 5198,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.etermax.preguntados",
  "title": "Trivia Crack",
  "description": "Have fun challenging your friends and enemies in the hottest trivia game!\nLet our friendly spinner wheel, Willy, select which questions you’ll answer from six different categories. Be the first to get the six crowns to win, but watch out for the rematch!\n\nReasons you should be playing Trivia Crack right this second: \n-Hundreds of thousands of exciting questions\n-You can create your own questions in the Factory\n-Over 20 game languages\n-Chat with your opponents\n-Collectable card collection\n\nNeed more? No problem: \n-Prove how smart you are\n-Learn something new while having fun\n-Make your mother proud\n\nSo what are you waiting for? Let’s go! Download the game!\n\nWarning: this game may cause an excess of fun. Please consult a professional if you notice your knowledge growing at an unusual rate.\n\nVisit www.triviacrack.com for more information.\n\nQuestions? Concerns? Find the solution to all your problems here: support.etermax.com.\n\nBe a social being, follow us!: \nFacebook: https://www.facebook.com/triviacrack\nTwitter: @triviacrack\nInstagram: https://instagram.com/triviacrack\nYouTube: https://www.youtube.com/c/TriviaCrackOfficial",
  "genres": [
   "Games",
   "Family",
   "Entertainment",
   "Trivia"
  ],
  "contentRating": "4+",
  "released": "2013-10-26T22:12:29Z",
  "updated": "2020-05-05T13:30:29Z",
  "releaseNotes": "-Bug fixes\n-User interface improvements",
  "version": "3.68.0",
  "price": 0,
  "developer": "Etermax",
  "score": 4.38719,
  "reviews": 3590,
  "currentVersionScore": 4.38719,
  "currentVersionReviews": 3590,
  "searchTerms": "roulette"
 },
 {
  "appId": "com.pianoballs.dancing",
  "title": "Piano Ball: Run On Music Tiles",
  "description": "Exciting Piano Ball dance. Join the challenge!\nDo not hit the white and trap tiles. Along with the piano music, let your ball jump out of a beautiful dance.\nThis game is easy to play and extremely addictive.\n\nGame features:\n- Simple and smooth control.\n- Beautiful 3D music scene, everyone can become a pianist.\n- Breath rhythm will challenge your handspeed limit.\n- Speed Challenge brings you thrill and adventure.\n- Share your high scores with your friends and compete against players. around the world on the leaderboard.\n- High quality piano music soundtracks.\n\nBegin the endless jumping fun now!",
  "genres": [
   "Games",
   "Sports"
  ],
  "contentRating": "4+",
  "released": "2018-06-23T17:05:28Z",
  "updated": "2020-02-15T22:54:50Z",
  "releaseNotes": "-Minor bug fixes and improvements",
  "version": "1.3",
  "price": 0,
  "developer": "Jeremy Kelly",
  "score": 4.56892,
  "reviews": 798,
  "currentVersionScore": 4.56892,
  "currentVersionReviews": 798,
  "searchTerms": "roulette"
 }
]