[
 {
  "appId": "com.FortyOneGames.Scratchers",
  "title": "Lucky Lottery Scratchers",
  "description": "Lucky Lottery Scratchers is the most realistic and authentic scratch-off lottery ticket game in the App Store!\n\nIf you like scratch-off tickets, you will love Lucky Lottery Scratchers!\n\n* Many types of scratch-off games and scratcher cards: Double Dollar, Fortune Galore, Money Rain, Big Time Bucks, Lucky 777, Gold Strike, Diamond Millions, and more!\n* Match numbers\n* Reveal Multipliers\n* Play Bingo\n* Bonus Games\n* Instant Win\n* Massive Top Prizes\n* VIP program rewards the best players\n* Play offline - no Internet connection required\n* FREE daily and hourly bonus credits that reward frequent play\n* Hundreds of game levels to play\n* Designed to work with iPhones and iPads\n\n\nDownload Lucky Lottery Scratchers today and let us know what you think by leaving a review in the App Store!\n\n\nPlease Note:\nLucky Lottery Scratchers is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes.  Practice or success at social casino gaming does not imply future success at real money gambling.  Lucky Lottery Scratchers is for entertainment purposes only and offers only a simulated gambling experience.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-09-04T07:00:00Z",
  "updated": "2020-01-06T20:30:14Z",
  "releaseNotes": "Improved odds of winning on new scratcher cards!",
  "version": "1.0.3",
  "price": 0,
  "developer": "41 Games",
  "score": 4.60344,
  "reviews": 174,
  "currentVersionScore": 4.60344,
  "currentVersionReviews": 174,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.lottomart.lottery.bet",
  "title": "Lottomart: Games & Lottery App",
  "description": "Lottomart is the UK’s favourite games and lottery destination. It’s no wonder we are creating such a buzz - Lottomart creates winners! Here are a few of our recent winners:\n\n \n‣ Daniel B. of Stoke-on-Trent won £137k with a Boosted lotto bet on Irish Lotto\n‣ Desiree D. of London won £31k with a Boosted lotto bet on Great British Jackpot\n‣ Danny O. of New Town won £16k with a Boosted lotto bet on Mini Lotto\n‣ Rachael T. of Bradford won £30k on a Cleoscratcha scratchcard\n‣ John D of Glasgow won £100k on Europe Millions Scratch \n\n \nLottomart is the home of Boost - the most exciting new way to bet the lottery where you “slide to decide” between bigger jackpots or more chances of winning. Our biggest lottery winners won because they Boosted their bets! Will you be next?\n \n6 Reasons you should join the thousands who play at Lottomart:\n \n‣ MASSIVE SELECTION OF CASINO GAMES - With over 100 video slots and the most popular table games you won’t be disappointed.\n‣ LOTTO JACKPOTS - Bet on the biggest jackpots worldwide for chances to win hundreds of millions in lotto jackpots every week!\n‣ EXCLUSIVE SCRATCH GAMES - Win up to £150,000 on our unique selection of BIG prize scratch cards.\n‣ SIMPLE, FUN, and EASY - The quickest and easiest app to use on the market. If you like lotto, scratch cards or casino games you’ll love Lottomart.\n‣ BOOST for more chances to win - This unique feature allows you to choose between bigger jackpots or more winning chances on any lotto draw.\n‣ INSTANT REWARDS - Earn diamonds with every purchase and use them to pay for lotto bets or play scratchcards.\n \nTry our casino games tab which includes:\n \n‣ LIVE Deal or No Deal\n‣ LIVE Monopoly\n‣ LIVE Blackjack & Roulette\n \n‣ European Blackjack\n‣ Roulette\n‣ American Roulette\n‣ Queen of the Crystal Rays\n‣ Lara Croft - Temples and Tombs\n‣ Thunderstruck II\n‣ Mega Moolah\n‣ Lucky Leprechaun\n‣ Immortal Romance\n‣ Medusa\n‣ Wild Cats\n‣ Royal Gems\n‣ Gold'orado\n‣ Jackpot Quest\n‣ Hot & Heavy\n‣ Wild Thirst\n‣ Agent Jane Blonde Returns\n‣ Gallantry\n‣ Flower Fortunes\n \nCheck out all our US, UK and Euro lotto jackpots:\n \n‣ Irish Lotto\n‣ Mega Millions\n‣ US Powerball\n‣ Europe Millions*\n‣ EuroJackpot\n‣ Cash4Life\n‣ Superenalotto & More...\n\nTry our instant win lottery scratch cards and win up to £150k. Scratchcard tickets price range from 10p to £3 per ticket.\n \n*Only The National Lottery app can sell tickets on the Euromillions. If you like the Euro Millions you will love this similar draw.\n \nDefault Welcome Offers (See promotions section in app for full promo eligibility)\n \n‣ Welcome offers are available only on your first purchase:\n---Casino match bonus up to £100 - 100% Deposit bonus\n---Lotto buy 1 get 1 free Offer + 10 additional games spins on purchase of either a lotto bet\n---10 free 5k scratchcards Offer + 10 additional games spins on purchase of any scratchcards.\n‣ Minimum purchase required to qualify for welcome offers. \n‣ Stake limits and game contribution limits apply \n‣ Consult terms within the app for full promotion terms and general terms.\n \nPromotional Terms and Conditions apply and we reserve the right to modify, extend, or suspend a promotion at any time. Please see the Promotions area within the app for current offers and details.\n \nYou must be 18 years of age or older to play at Lottomart.\n \nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact BeGambleAware.org at 0808 8020 133 or visit www.begambleaware.org.\n \nWe are licensed by the UK Gambling Commission (UKGC), license 000-051833-R-329042-001, issued 20 July 2018. Our jackpot prize payouts are covered by leading insurers to guarantee the payment of your jackpot winnings.",
  "genres": [
   "Entertainment",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2018-11-28T08:21:28Z",
  "updated": "2020-04-28T14:04:35Z",
  "releaseNotes": "- 14 New Red Tiger Daily Jackpot Games!\n- Bug Fixes",
  "version": "2.52",
  "price": 0,
  "developer": "Lottomart",
  "score": 4.38204,
  "reviews": 780,
  "currentVersionScore": 4.38204,
  "currentVersionReviews": 780,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.apphappygames.lotteryscratchers",
  "title": "Lottery Scratchers",
  "description": "Do you ever wish you could win the lottery? Well today could be your lucky day! With the new game Lottery Scratchers, you get to experience the same fun and excitement as playing real scratchers, without actually having to lose money. Test your luck by playing 26 different scratch off tickets ranging from Bingo to Red Hot 7’s… and if luck is on your side, you may win BIG!!\n\nFeatures:\n\n• 26 Different Lottery Scratcher Tickets\n• Real feel scratching effect\n• Huge Payouts\n• Win multiple times per ticket\n• Win up to 20x the prize.\n\nReady to test your luck and win big?\n \nDisclaimer: This game is intended for an adult audience and does Not offer real money gambling or an opportunity to win real money or prizes.  Our game is meant for amusement and entertainment purpose only.  Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-05-27T08:18:04Z",
  "updated": "2020-03-16T22:32:37Z",
  "releaseNotes": "New Pot O' Gold Scratcher",
  "version": "1.97",
  "price": 0,
  "developer": "App Happy Games LLC",
  "score": 4.30356,
  "reviews": 616,
  "currentVersionScore": 4.30356,
  "currentVersionReviews": 616,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.peepsinabox.scratch",
  "title": "Scratch Bling",
  "description": "DOWNLOAD THE MOST AUTHENTIC SCRATCH CARD GAME ON THE IPHONE & IPAD.\n\nScratch Bling is an exciting ‘Authentic’ scratch card game. Scratch Bling offers a HUGE selection of unique scratch cards. With multiple games per card this will increase your chances of winning BIG*. To top the excitement, Scratch Bling also offers ‘The Reels of Fortune’ which will multiply your winnings into the millions. Get scratching NOW!!!!\n\n*Bling Casino dollars are non-refundable",
  "genres": [
   "Games",
   "Simulation",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-12-04T20:46:29Z",
  "updated": "2015-10-20T11:08:22Z",
  "releaseNotes": "Four great new cards added\nMembership levels for loyal players - increase levels through in app purchases - earn up to $100,000 every four hours\nOne touch scratch feature for players that don't want to hang about\nResolved audio issue for increased stability and performance\nVisit peepsinabox.com for more information",
  "version": "1.4.6",
  "price": 0,
  "developer": "Peeps in a Box",
  "score": 4.4074,
  "reviews": 54,
  "currentVersionScore": 4.4074,
  "currentVersionReviews": 54,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.bunny-scratch.mahjong",
  "title": "Lottery Scratch Card Mahjong",
  "description": "Lottery Scratch Card - Mahjong is a free scratch card game. \nTest your luck by playing 40 scratch tickets without having to lose real money.\n\nFeatures:\n• 40 scratch tickets\n• Real scratching effect\n• You will never lose pocket money by playing these free scratch tickets \n• Play fun clicker game, defeat Nian beasts and become super clickers\n• Best time passer & pressure reducer\n\nList of scratch off tickets:\n• Big Winner\n• Phoenix Rooster\n• 2019 Zodiac Fortune\n• Super Mahjong\n• Roll the Dice\n• Lucky Wheel\n• Lunar New Year\n• Dragon & Lion\n• Red Envelope\n• Sky Lantern Festival\n...and more.\n\n\n• The game does not offer real money gambling or an opportunity to win real money or real prizes.\n• This product is intended for amusement purposes only.\n• Practice or success at social casino gaming does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Lifestyle",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-01-20T08:52:15Z",
  "updated": "2019-01-17T00:55:41Z",
  "releaseNotes": "Enhance performance.",
  "version": "25.0",
  "price": 0,
  "developer": "Happy Entertainment LLC.",
  "score": 4.88235,
  "reviews": 34,
  "currentVersionScore": 4.88235,
  "currentVersionReviews": 34,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.aspireltd.s2c",
  "title": "Scratch2Cash - Scratch Cards",
  "description": "Play our exciting range of instant games including VIP Black, Bejeweled, The 7th Heaven, Lucky Charms, Bingo Bonanza, Horoscope and much more!  \n\nPlay the best scratch cards available online and win real money from your mobile phone or tablet, over 3G or Wi-Fi. \n\nEnjoy exclusive special offers and promotions at Scratch2Cash and boost your winnings to the max! \n\nTOP FEATURES INCLUDE: \n• The top online scratch cards and jackpot slots from industry leading providers Netent, NeoGames, Microgaming and Play’nGo, all optimised for mobile and tablet play. \n• Quick to load and easy to register, deposit and find your favourite casino slots and scratchcard games. \n• Dedicated support team ready to assist you with any issue – 7 days a week! \n• Play for real money, or get some practice in with the no pressure demo feature. \n• Fast, secure cash-outs and a wide selection of payment options. \n•Great winning chances – 1 in every 3 scratch cards is a winner* - now that’s what you call a lottery with exciting odds! \n\nSince 2005 Scratch2Cash has proven to be the number one choice for scratch card players on the web. Our years of experience combined with our passion to bring you the fairest, secure and most entertaining tombola style instant games make Scratch2Cash the ideal place to play. \nAt Scratch2Cash you’re sure to find hours of pure fun with the highest level of entertaining games on the web in a safe and secure environment.\n\n*On average\n  \n\nCONNECT WITH US:\nWebsite: https://www.scratch2cash.com/\n\nGeneral T&Cs apply:  \nhttps://www.scratch2cash.com/bonus-policy/\n\nNote that:\nBets on different games contribute differently to the wagering requirements and that other terms apply: \nNot sure what link to put here\n\nT&Cs Welcome bonus:\nhttps://www.scratch2cash.com/promotions/welcome-package/",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-05-31T16:47:40Z",
  "updated": "2020-04-14T13:46:52Z",
  "releaseNotes": "We have done major updates to our app including: \nUp to 2M Jackpot .\nBest Casino tournaments . \nVariety of scratch games !",
  "version": "1.33",
  "price": 0,
  "developer": "ASPIRE GLOBAL LIMITED",
  "score": 4.45859,
  "reviews": 157,
  "currentVersionScore": 4.45859,
  "currentVersionReviews": 157,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.cuzw.foes.scratchcard.billionaire",
  "title": "Scratch Card Billionaire",
  "description": "Win massive jackpots in a range of scratch off designs.\n\nLevel up and unlock new scratch cards progressively as you play. Scratch off bonus panels to win bonus money. \nWe update the app regularly with new scratch card designs tht you will love.\n\nThis is a simulated gambling app. You are not betting real money and cannot win real money while playing this game.",
  "genres": [
   "Games",
   "Social Networking",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2019-06-29T04:08:37Z",
  "updated": "2019-06-29T04:08:37Z",
  "releaseNotes": "- Minor Bug Fixes",
  "version": "1.0.1",
  "price": 0,
  "developer": "Foes",
  "score": 3.75,
  "reviews": 4,
  "currentVersionScore": 3.75,
  "currentVersionReviews": 4,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.gamesys.jackpotjoy",
  "title": "Jackpotjoy: Bingo & Slot Games",
  "description": "Enter a world of fun at the award-winning Jackpotjoy and play our fantastic Bingo, Slots and Casino games. \n\nThere's Bingo and Slot game jackpots worth thousands, which can be won from as little as 1p. As well as super promotions to play in our entertaining Chat rooms, Jackpotjoy is the place to be!\n\nSo join Jackpotjoy today, the proud winners of Global Gaming’s ‘Bingo Operator of the Year’ in 2018 and 2019. \n\nDaily Free Game**\nTry the Daily Free Game Doubly Bubbly where you could win Cash or Free Spins on the hugely popular Double Bubble Slot game. With a £750 top prize available, it’s time to get playing! \n\n**You just need to have wagered £2 in the last 7 days and deposited a total of £10 or more in your lifetime. \n\nBingo\nIn our 90 ball Bingo games you can play for super Jackpots and Full House prizes! In our Sapphire Bingo room enjoy exciting Bingo offers, like 1p games, BOGOF Bingo, Evens Stevens and Free Bingo!\n\nSlots\nIf you fancy a spin instead, Slots are where it’s at. Enjoy stunning titles such as Paper Wins, Winfall Wishes, Sapphire Sorceress and more.\n\nBest Chat and more\nYou’ll always be sure of a warm welcome whenever you join the conversation in Chat with our Hosts. You can have a natter about the latest soap drama, your new pet, even who makes the tea at home! And if it gets lively, they’re ready to party just as hardy as you can! There’s loads of games and quizzes to play, and you could even win cash or physical prizes just for taking part!\n\nThat’s on top of all our exciting onsite promotions as well, which could give you the chance to win anything from a household kettle to a holiday to America and beyond!\n\nCasino\nPull up a chair at our fantastic range of Casino games, including Roulette!\n\n\nPlease play responsibly. BeGambleAware.org. 18+\n\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.",
  "genres": [
   "Games",
   "Casino",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2013-08-21T18:06:47Z",
  "updated": "2020-03-11T11:39:47Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.6203,
  "reviews": 9713,
  "currentVersionScore": 4.6203,
  "currentVersionReviews": 9713,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.peepsinabox.scratchblingpro",
  "title": "Scratch Bling Pro",
  "description": "Download Scratch Bling Pro today and play the best and most authentic Scratch Card game for mobile and tablet. It’s free to play and guaranteed to keep you entertained for hours. Get scratching now.\n\n*FEATURES*\n\n- Authentic Scratch Card Experience\n- Lots of different games and cards to choose from\n- 100’s of ways to win\n- Gamble mode: Slots, HI/LO, Coin Toss and more\n- Free hourly bonuses\n\nPlay the Best and most Authentic Scratch Card game on the market\n\nSupport: info@peepsinabox.com\nVisit peepsinabox.com for promotions and bonus cash.\n\n*Bling Dollars are virtual and therefore non-refundable",
  "genres": [
   "Games",
   "Simulation",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2017-03-27T18:03:19Z",
  "updated": "2017-04-26T16:29:45Z",
  "releaseNotes": "* facebook sharing enabled\n* improved UI sensitivity\n* greater payout ratio",
  "version": "1.0.8",
  "price": 0,
  "developer": "Peeps in a Box",
  "score": 3.66667,
  "reviews": 3,
  "currentVersionScore": 3.66667,
  "currentVersionReviews": 3,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.lazyland.scratch",
  "title": "Scratch On! Card Scratch Mania",
  "description": "A whole new world of scratch games is just here: fans around the globe ScratchOn! \n\nA classic and beloved game becomes even more interesting. Explore different modes in this amazing version: Fruit salad, Summer Fun, Space Travel, 7Lucky, Animal Kingdom, Merlin's Magic, Olympus Gods, Jurassic Scratch, The night of the winning Dead, all-in-one deluxe Scratch game! \nDifferent and themed graphics in each mode will take your experience in another level. Huge winnings may come across your road to the top so keep your eyes and your pocket open! Exciting mini games can trigger your mind and keep you busy. The Grabber, 5Chances, Bonus Wheel, BombTrap, Twiins, Pinball Parlour and mini Scratch Card are really going to be sought after. \nSo get your hands on and keep on Scratching!",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "12+",
  "released": "2016-04-29T01:20:15Z",
  "updated": "2019-07-27T20:30:48Z",
  "releaseNotes": "Various bug fixes and improvements",
  "version": "1.12.7",
  "price": 0,
  "developer": "LazyLand LTD",
  "score": 3.66667,
  "reviews": 6,
  "currentVersionScore": 3.66667,
  "currentVersionReviews": 6,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.lootwinner.casino",
  "title": "Instant Win Arcade - Real Money Scratch Cards",
  "description": "The new Instant Win Arcade app brings classic Bingo Lounge games and the latest exclusive games by our LootWinner Team. We have fun, quick-play games and are always growing our arcade with new titles soon to come.\n\nOur new players receive a whopping 250% deposit bonus up to £125! That means depositing only £10 today will give you £35 to play with, or deposit the maximum of £50 and get £125 on your account!*\nWe offer secure and fast payment & withdrawal process by using a wallet powered by Betable. All our games are Real Money Gambling enabled and you can play anywhere, anytime in the UK on your iPhone or iPad.\n\nAt LootWinner, we create games that are entertaining and interesting by having creative and original content - games that are not just simple copies of casino games you find everywhere else. Whether you love bingo, slots, scratchers, or new game types we have you covered!\nWe believe in above average odds, skill factor, and big juicy payouts! We want you to win and to enjoy playing games that you like!\n\nPlease note some portions of this app have REAL MONEY GAMBLING FUNCTIONALITY POWERED BY BETABLE. The real-money gambling functionality of this application is only available to customers over the age of 18. A valid Betable account is required in order to use the real-money functionality of this application. Betable is licensed by the United Kingdom Gambling Commission to offer remote gambling services, license number 000-023328-R-307313-003.\n\n18+ Gambleaware.co.uk Play Safe. Always gamble responsibly.\n\n*Terms & Conditions apply to bonuses. See http://betable.com/legal/bonus-promo/ for further details.",
  "genres": [
   "Games",
   "Casino",
   "Casual"
  ],
  "contentRating": "17+",
  "released": "2016-12-12T19:13:02Z",
  "updated": "2016-12-12T19:13:02Z",
  "version": "1.0.0",
  "price": 0,
  "developer": "Loot Winner Ltd",
  "score": 1,
  "reviews": 1,
  "currentVersionScore": 1,
  "currentVersionReviews": 1,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.ellis.lottoticketvip",
  "title": "Lotto Cards Scratch Offs VIP",
  "description": "Lotto Cards Scratch Offs VIP brings the fun and excitement of scratching lotto tickets to your iPhone!\n\nYou get Blackjack, Poker, Match 3, Lucky Numbers and more!\n\nGet the same rush that you feel when you win a real lotto scratch ticket, but enjoy the savings of just playing for fun!\n\nNOTE: \n- This app is for entertainment purposes only!\n- No real money or any other real world goods and/or services can be won in this game!\n\n√ NUMBER ONE Lotto Scratch game in the store! \n√ Realistic retina graphics! \n√ Realistic sounds, ambiance, and voice! \n√ Feels like you are ACTUALLY playing and winning at lotto tickets.\n√ Check out the screen shots & see for yourself \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-08-06T15:53:25Z",
  "updated": "2014-09-09T13:59:10Z",
  "releaseNotes": "- Bug Fixes",
  "version": "1.7",
  "price": 0,
  "developer": "Ellisapps Inc.",
  "score": 3,
  "reviews": 4,
  "currentVersionScore": 3,
  "currentVersionReviews": 4,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.jidoosworldofgames.scratchcardmania",
  "title": "Scratchcard Mania Lottery",
  "description": "Scratchcard Mania gives you all the fun of experiencing the thrill of Scratchcards using your own Device!\n\nFeaturing 5 Amazing Themes To Unlock!\n\n~ Magic Temple\n\n~ Luck Of The Irish\n\n~ Wild Wild West\n\n~ Casino Royale\n\n~ Unleash The Genie\n\nYou can buy bucks to use to unlock levels, or simply play to win and try to earn enough bucks to unlock more levels!\n\nCross your fingers and get scratching with Scratchcard Mania!",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-08-10T07:00:00Z",
  "updated": "2020-02-19T22:50:43Z",
  "releaseNotes": "Added compatibility for the latest iOS Versions & iOS Devices\nBug Fixes",
  "version": "2.2.0",
  "price": 0,
  "developer": "Fragranze Games Ltd",
  "score": 4.33333,
  "reviews": 3,
  "currentVersionScore": 4.33333,
  "currentVersionReviews": 3,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.annexio.wlcapp",
  "title": "LottoGo.com: Bet & Win",
  "description": "Place your bets on the biggest lotteries from around the globe with LottoGo.com.\n\nOur lotto betting app puts the best jackpots – including the mighty Powerball and Mega Millions - at your fingertips. So, whether you’re at home or on the move, we give you the chance to pick your numbers and win in an instant!\n\nIn addition to lottery betting, there’s a range of fun Scratchcards and Instant Win games to choose from.\n\nAs a member of LottoGo.com, you’ll have access to a variety of great discounts and exclusive deals – all sent direct to your inbox!\n\nLottoGo.com is a brand of Annexio Limited, a leading provider of secondary lottery and lottery betting services. \nWe’re proud to be licensed and regulated by multiple jurisdictions worldwide, including the UK Gambling Commission, the Isle of Man Gambling Supervision Commission, and the Irish National Excise Licence. As such, a commitment to providing our players with an enjoyable and secure gaming experience is at the heart of everything we do.\n\nAvailable only to players 18 years and over. LottoGo.com believes in responsible gambling. For more information visit www.gamcare.org.uk, or by reading our Responsible Gambling Policy here: https://www.lottogo.com/en/responsible-gambling-policy",
  "genres": [
   "Lifestyle",
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-06-20T02:06:52Z",
  "updated": "2020-04-01T20:35:42Z",
  "releaseNotes": "Changes to Apple Pay feature to fit in with new regulations regarding credit card use.\nFix of errors when user navigates to various screens.",
  "version": "1.26.3",
  "price": 0,
  "developer": "Annexio Limited",
  "score": 3.75135,
  "reviews": 929,
  "currentVersionScore": 3.75135,
  "currentVersionReviews": 929,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.Firecannon.VIPScratchCards",
  "title": "VIP Scratch Cards",
  "description": "Enjoy the excitement of realistic scratch cards — for free. VIP Scratch Cards welcomes you to scratch thrilling new cards based on some of the world's most popular scratchies. VIP Scratch Cards is one of the hottest new casino games.\n\nLevel up and unlock new scratch cards progressively as you play. Scratch off bonus panels to win bonus money. \n\nWin massive jackpots in a range of scratch off designs including: \n\n - Booty Cove: Bask in the calming waters of Booty Cove. A good chance to win big! Win up to 10,000 coins\n - Luxury Club: 13 chances to win up to 100,000 coins\n - Hearts: two different fun game modes with your chance to win 100,000\n - Candy Cash: multiply your winnings up to 10 times\n - Over the Moon: win up to 250,000 coins\n - Fortune Cat: will Fortune Cat bring you good fortune? Win up to 888,888 coins\n\nPlus fun seasonal games such as Merry Money and Spooky Cash. More designs every new season!\n\nEnjoy a similar experience to scratchies from Game Store, Instant Scratch-its, The National Lottery and more.\n\nVIP Scratch Cards is a simulated gambling app. You are not betting real money and cannot win real money while playing this game.",
  "genres": [
   "Games",
   "Lifestyle",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-05-30T04:17:30Z",
  "updated": "2018-11-12T17:25:20Z",
  "releaseNotes": "New scratch card design for Level 12: Fortune Cat.",
  "version": "1.3",
  "price": 0,
  "developer": "Firecannon Pty Ltd",
  "score": 4.33333,
  "reviews": 3,
  "currentVersionScore": 4.33333,
  "currentVersionReviews": 3,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.smallscreencasinos.thephonecasino",
  "title": "Play Slots at The Phone Casino",
  "description": "At The Phone Casino, we don't believe in phoney cash bonuses, we believe in giving all players FREE SPINS that can be spun into CASH PRIZES and withdrawn with NO WAGERING REQUIREMENTS.\n\nThe Phone Casino brings you all of your favourite REAL MONEY CASINO games straight to your iPhone or iPad.\n\nPlay favourite Slots like;\n- Monopoly\n- Rainbow Riches\n- Foxin' Wins\n- Reels of Luck\n- Kings of Cash\n- Irish Eyes\n- Bingo Billions\n\nPlay classic casino table games like;  \n- Blackjack\n- Roulette\n- Bacarrat \n- Video Poker\n\nOr enter our LIVE CASINO to play; \n- Blackjack\n- Roulette\n- Bacarrat\n- Casino Hold'em\n\nLooking for an alternative to casino games?  How about our enormous range of INSTANT WIN Games like KENO, SCRATCH CARDS or SKILL GAMES?  \n\nDaily Slots Freeroll Tournament: \nEvery day, we give players one entry into our daily freeroll tournament.  Place in the top 20 to win cash you can either use on other games or withdraw with NO WAGERING REQUIREMENTS.  The choice is yours.  Players can also win prizes like iPhones, computers, TV’s, VIP holidays or the chance to win £1 million….that’s right £1 million.  Its that simple!\n\nWith 100's of games and new games added weekly, there's plenty to do at The Phone Casino.\n\nWe offer fast, secure, encrypted deposits and withdrawals and you can even top up using your mobile, debit card. credit card, Paysafe or Skrill.\n\nWhat are you waiting for? Download today!\n\nWe’d love to hear from you, so please rate us here in the App Store.  Or, if you’re not 100% satisfied feel free to email \nsupport@smallscreencasinos.com and we’ll happily help you. Or follow us on Social here\n\nwww.facebook.com/PhoneCasino/\nTwitter - @thephonecasino\nwww.instagram.com/thephonecasino\n\nThe Phone Casino is licensed by the UK Gambling Commission and the Alderney Gambling Control Commission. All communications are encrypted making The Phone Casino a safe, secure and trusted. UK Gambling Commission, licence number: 000-039397-R-319363-002.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-04-24T15:58:29Z",
  "updated": "2018-12-11T13:46:06Z",
  "releaseNotes": "We’ve updated our bonus system to enable users to cash out all bonuses with no wagering requirements. Plus, we’ve also added enhanced ID document security to keep players even more safe and secure.",
  "version": "3.0",
  "price": 0,
  "developer": "SmallScreenCasinos Ltd",
  "score": 2.35417,
  "reviews": 48,
  "currentVersionScore": 2.35417,
  "currentVersionReviews": 48,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.jalsaa.scratch.cards",
  "title": "Scratch Cards Lottery Pro",
  "description": "A classic and beloved game becomes even more interesting. Explore different modes in this amazing version: all-in-one deluxe Scratch game! \n\nWin massive jackpots in a range of scratch off designs including:\n\n- Pirate Bunch: Bask in the calming waters of Pirate Bunch. A good chance to win big! Win up to 10,000 coins\n- Dragon Hearts: two different fun game modes with your chance to win 100,000\n- Sushi Kawaii: multiply your winnings up to 10 times\n- Owly Count: win up to 250,000 coins\n- Fortune CatFish: will Fortune CatFish bring you good fortune? Win up to 888,888 coins\n\nPlus fun seasonal games such as Moon Bunnies and Spooky Moths. More designs every new season!",
  "genres": [
   "Games",
   "Shopping",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2019-06-21T03:12:19Z",
  "updated": "2019-06-21T03:12:19Z",
  "version": "1.0.0",
  "price": 0,
  "developer": "Jalsaa",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.williamhill.games",
  "title": "William Hill Games",
  "description": "Are you a fan of the classics, the latest games or big jackpots? Whatever you’re in to, with over 400 slots, table and instant win games to choose from, there’s sure to be something for you at William Hill Games.\n•\tWant to get to your favourite games quickly? We’ve made it simple to bookmark them, so you can start playing at the touch/tap of a button\n\n•\tAfter a quick bit of fun? Try our impressive range of instant win games. With new releases added weekly, we’re bound to have something you’ll enjoy\n\n•\tGet even more from Games with our regular offers and promotions. Go to the promotions section and you’ll find them all in one place\n\n•\tFrom Deal or No Deal and Rainbow Riches, to 20p Roulette and Chain Reactor Super Trails, we’ve got all the popular games to keep you entertained. With exciting new games and instant wins added every week, the fun never stops at William Hill Games.\nGet the app today and start your adventure.\n\nThe app requires you be over 18 to participate in any gambling activity. Full details can be found on www.williamhill.com\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-03-05T07:19:42Z",
  "updated": "2018-02-27T09:23:12Z",
  "releaseNotes": "You will find our smart new look and feel when accessing the account menu!",
  "version": "1.4",
  "price": 0,
  "developer": "WHG (International) Limited",
  "score": 4.50387,
  "reviews": 516,
  "currentVersionScore": 4.50387,
  "currentVersionReviews": 516,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.paddypower.hybridgames",
  "title": "Paddy Power Games",
  "description": "New Customer Offer – 60 Free Spins to Play Daily Jackpots! T&C’s Apply\nUK and Ireland's hottest new real money games app from Paddy Power is here! Our app offers the biggest and best selection of real money casino games in the Google Play Store. All of your Casino favourites including Online Roulette, Blackjack, Slots and Scratchcards! \n\nPlay classic slots including Cleopatra, Rainbow Riches, and Genie Jackpots. Other popular games: King Kong Cash, Top Cat, Starburst. \n-Over 200 games to choose from that can be played with real or fun money\n-Jackpot slot games including Rainbow Jackpots, Bomb the Jackpot and Dragon’s Luck\n-Share games with your friends through Twitter, Facebook, Email and SMS\n-Award winning customer service available 24 hours a day\n-Play over 3G, 4G or Wifi\n\nLogin with your existing Paddy Power account to play the games. Our games are fully certified and offer you the chance to win real cash. Questions? Email us at support@paddypowergames.com\nPlease note this app is available to play for customers in the UK and Ireland only and you must be over 18 years of age.\n\n60 FREE SPINS T&C’s\n1) To take part, you must register via the registration code PGCTV1 and opt in to this promotion. 2) Get SMS-verified by supplying a valid telephone number. 3) Enter the validation code received by SMS to redeem the free spins. 4) Free Spins are valid on any of our Daily Jackpot games. 5) Free Spins will expire in 10 days from receipt of the offer.\n\nAll Paddy Power Games NEW CUSTOMERS can receive 60 Free Spins on our Daily Jackpots Slots Collection once they Opt In and complete the steps outlined below.\nALSO, all NEW CUSTOMERS can also receive a €30 Bonus on our Daily Jackpots Slots Collection when they Opt In, deposit and stake €10 or more on Daily Jackpot games. \nYou will receive 60 Free Spins for use on all valid Daily Jackpot games. The free spins each have a value of €0.10.\nTo take part, you must register via the registration code PGCTV1, opt in on-site and supply a valid telephone number that is capable of receiving an SMS. You will then be sent a validation code to that phone, which you must enter on site to redeem the free spins.\nIf you have previously taken part in our 10 Free Spins on Daily Jackpot games promotion, as seen on TV, or our 30 Free Spin on Daily Jackpot games promotion, you are not eligible for this promotion.\nOnce verified, launch any of the eligible Daily Jackpot games to claim your spins.\nThe offer is available to new Paddy Power customers in the UK & Ireland who have a valid mobile number.\nOnce you have completed using the bonus, you will begin staking real cash.\nFree Spins expire 10 days from receipt of the offer.\n•\tBy participating in this offer, you agree with these standard Terms and Conditions:\n•\tPaddy Power reserves the right to withhold any withdrawals and / or confiscate all winnings for irregular play.\n•\tOnly one bonus is available per customer\n•\tIf a Player is ineligible, PP reserves the right to withhold payment of the prize.\n•\tEntry will be forfeited if players are found to have multiple accounts.\n•\tPP games reserves the right to modify, alter, discontinue or terminate this promotion at any time for any reason what so ever without notice to players.\n•\tIn the event of any dispute, the decision of paddypower.com will be considered final.\n•\tThis offer is only available to customers in the UK & Ireland.\n•\tIf any of term of the promotion is breached, or if there is evidence that a customer is using the promotion to guarantee profits regardless of the outcome (whether individually or as part of a group), we reserve the right to reclaim the bonus element, and any pending winnings from play generated using the bonus funds.\n•\tFull T&Cs apply https://promos.paddypower.com/promotion?promoCode=GASUO60FS10PSUO \n•\tPaddy Power Games terms and conditions apply https://www.paddypower.com/en/aboutUs/Terms.and.Conditions/#PartF",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-02-06T10:52:49Z",
  "updated": "2019-05-09T12:57:14Z",
  "releaseNotes": "We have listened your feedback and want to make sure that customers get the best experience with Paddy Power Games. This version has improvements along with bug fixes.",
  "version": "6.0.0",
  "price": 0,
  "developer": "Paddy Power PLC",
  "score": 2.4,
  "reviews": 20,
  "currentVersionScore": 2.4,
  "currentVersionReviews": 20,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "uk.co.eulotto.Eulotto",
  "title": "Lottoland UK: Lottery Betting",
  "description": "Bet and win real money with Lottoland, the lotto betting app featuring top lotteries such as PowerBall, MegaMillions and the Irish Lotto! Bet on the outcome of these draws, get the latest results and, if yours are winning bets, win real money with the chance of becoming a jackpot millionaire.\n\nLottoland – Top 3 Reasons to Download\n1. Win big jackpots every day: Become an instant millionaire with top bets on the outcome of lotto draws!\n2. Bet on international lotteries and the world’s biggest jackpots: Keno 24/7, Irish Lotto, US PowerBall, US MegaMillions and many more.\n3. Betting made easy: Simply choose the draw, select your numbers and place your bet.\n\nDownload the Lottoland UK lotto app today – you could win big and become a millionaire anytime, anywhere!\n\n\nPromo Terms and Conditions:\n\n1. The Player’s use of the Website and your participation in any gaming or wagering (including any promotions) is governed by these terms and conditions. Players should ensure that they have read and understood these Promotional Offers Terms before taking part in any promotion.\n2. Player’s must register at Lottoland.co.uk, confirming that they are 18+, prior to placing any bets or playing any games.\n3. This promotion is available to all registered players using the Lottoland App for the first time. This promotion is redeemable once per user and can only be attained via the Lottoland App.\n4. For free bets or free game plays, no deposit is required to redeem the free bet or free game play.\n5. For discount promotions, the player must place at least one bet or one play on the specified products.\n6. Bonus amount cannot be withdrawn prior to any specified wagering requirement being met.\n7. Bonuses only applies to the first bet or first game play.\n8. Bonuses will be automatically applied in the checkout section and it is the player's responsibility to check their cart before confirming the transaction.\n9. Any person found to be operating multiple accounts in promotions will be in breach of these Promotional Offers Terms. Lottoland will determine at its sole discretion by whatever means it deems necessary to establish if different entries or accounts are connected to the same person.\n10. Participants, whether individually or acting in a group, will be found to be in breach of these Promotional Offers Terms if Lottoland, in its sole discretion, has reason to believe that a promotion has been abused, manipulated, or that irregular, fraudulent, collusive or illegal activity has occurred.\n11. The decision of Lottoland in all promotional matters is final and no correspondence will be entered into. Lottoland reserves the right to withhold promotional benefits until resolution of any dispute.\n12. The decision of Lottoland in respect of any matter concerning or related to competitions and promotions is final.\n13. A breach by a participant of these Promotional Offer Terms and/or Lottoland Limited’s General Terms or where there is evidence of a series of bets placed by a participant, whether individually or acting as a group, which due to promotional offers result in guaranteed customer profits irrespective of the outcome, may result in Lottoland withdrawing the availability of any promotion or all promotions to that participant or group of participants and/or voiding any wager funded by the promotion and remove any winnings from such wager.\n14. Lottoland reserves the right to amend or withdraw any promotion at any point at its sole discretion.\n15. Promoter: Lottoland Limited, Suite A, Ocean Village Promenade, Ocean Village, Gibraltar, GX11 1AA (“Lottoland”).",
  "genres": [
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-03-14T10:11:37Z",
  "updated": "2020-04-20T08:02:30Z",
  "releaseNotes": "We regularly update our app to give you the best Lottoland experience possible. If you have any comments about our latest update or ideas about what you’d like to see next, please get in touch via email at support@lottoland.co.uk.",
  "version": "1.7.3 UK",
  "price": 0,
  "developer": "EU Lotto Limited",
  "score": 4.58815,
  "reviews": 4912,
  "currentVersionScore": 4.58815,
  "currentVersionReviews": 4912,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.igogames.fortunescratchoffs",
  "title": "Fortune Scratch Offs",
  "description": "Fortune Scratch Offs offers several games which feature exciting game play and the thrill of winning big!\n\nDownload now and start Winning!\n\nChallenge friends in the Game Center, get listed on the leader board.\n\nNo need to go to the store and buy scratch offs, their right in the palm of your hand.",
  "genres": [
   "Entertainment",
   "Card",
   "Casino",
   "Games"
  ],
  "contentRating": "17+",
  "released": "2015-09-04T15:05:47Z",
  "updated": "2015-09-04T15:05:47Z",
  "version": "1.0.2",
  "price": 0,
  "developer": "iGo Games",
  "score": 1,
  "reviews": 2,
  "currentVersionScore": 1,
  "currentVersionReviews": 2,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.gamesys.heartbingo",
  "title": "Heart Bingo: Real Money Games",
  "description": "Join the fun at the award-winning Heart Bingo and play Bingo, Slots and Casino games. We even have Box Bonanza prizes and a Daily Free Game for all our players, you just need to deposit £10. \n\nWith Bingo and Slot game jackpots worth thousands to be won, you can play from as little as 10p. As well as super promotions to play onsite and in our welcoming Chat rooms, Heart Bingo has got everything you need!\n\nSo join Heart Bingo today, the 2018 WhichBingo winners of ‘Best Mobile Bingo Experience’, ‘Best Online Bingo Chat Team’ and for the second year in a row, ‘Best Online Bingo Site’. \n\nDownload the App today!\n\nDaily Free Game\nTry Daily Paper, the Daily Free Game where you could win Cash or Free Spins on the hugely popular Paper Wins Slot game. With a £750 top prize available, what are you waiting for? \nYou just need your first deposit to be £10 or more.\n\nBingo\nLove Bingo? There are cash prizes up for grabs 24 hours a day, 7 days a week with sensational jackpots and Full House prizes up to £500. Take a peek in our Candy Club room and enjoy exciting Bingo offers, like 10p games, BOGOF Bingo, Evens Stevens and Free Bingo!\n\nEach game of 90-ball Bingo features a Progressive Jackpot which can be won by completing a Full House in 40 calls or less. There’s also a Community Super Jackpot to be won when calling ‘house’ on selected games within 38 calls. Each Super Jackpot offers a cash prize ranging between £5,000 and £25,000!\n\nSlots\nIf Slot games are more your thing, then Heart Bingo’s got you covered with stunning titles such as Paper Wins Jackpot, Secrets of the Phoenix and Double Bubble and more.\n\nCasino\nOr if you fancy seeing the bright lights of Vegas, take your seat at the Casino table and enjoy Roulette like never before. \n\nBest Chat and more\nYou’ll get a warm welcome from our friendly Hosts in Chat, who will entertain you with fun quizzes, games and extra prizes. Plus take part in exciting promotions to win cash and prizes.\n\n\nPlease play responsibly. BeGambleAware.org. 18+\n\nThis is a real money gambling app. Only bet what you can afford and always set yourself sensible limits.",
  "genres": [
   "Games",
   "Simulation",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-07-21T14:29:44Z",
  "updated": "2020-03-11T11:40:56Z",
  "releaseNotes": "We've made a couple of bug fixes to give you an even better app experience. Enjoy!",
  "version": "11.13.0",
  "price": 0,
  "developer": "Gamesys",
  "score": 4.59929,
  "reviews": 4769,
  "currentVersionScore": 4.59929,
  "currentVersionReviews": 4769,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.tinyMobile.scratchers",
  "title": "American Scratchers Lottery",
  "description": "American Scratchers Lottery recreates every aspect of the \"scratch off experience\" and brings it home to you in this new and exciting game. If you've ever played scratch off lottery tickets before, you already know exactly how to play! Enjoy 34 different scratcher tickets and 5 different game types (match 3 style, lucky number style, blackjack, coin adding, Poker, horse racing, slots, RPG style and our latest \"auction style\"!!!). \n\nLevel up by buying tickets and winning to get additional bonus amounts every time you win! Collect all the achievements and best your friends on the Game Center leaderboards for maximum enjoyment! Bottom line, if you like scratcher lottery tickets, you are going to love American Scratchers Lottery.\n\nGet the same rush of excitement when you win and enjoy the savings versus traditional lottery games and scratch off tickets.\n\nSpecial thanks to Kevin Suffecool for his poker hand evaluation code!\n\n*** Information about Player’s Club VIP Card:\n• Subscription service billed monthly. Included features:\n  *20% extra currency on TinyBuck purchases\n  *VIP daily chest (opt-in required)\n  *0.50 TinyBuck per minute in-app reward\n  *Ads removed \n\n• Payment will be charged to iTunes Account at confirmation of purchase\n• Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period\n• Account will be charged for renewal within 24-hours prior to the end of the current period, at a cost listed in the app (currently $2.99 /mo. USD or equivalent in other locales)\n• Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase\n• Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable\n\nFor more information, visit the following link below to read our privacy policy and terms of service http://tinymobile.com/privacy-policy-terms-of-service/  You can also tap the privacy policy link our app’s App Store listing.\n\n\nThis app is intended for entertainment purposes only, no real money is rewarded.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2011-11-05T02:24:30Z",
  "updated": "2019-09-30T14:50:07Z",
  "releaseNotes": "• Metadata update only. Non-critical update for users.",
  "version": "3.8.2",
  "price": 0,
  "developer": "Tiny Mobile Inc.",
  "score": 4.26984,
  "reviews": 63,
  "currentVersionScore": 4.26984,
  "currentVersionReviews": 63,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.babaroga.JSSOG",
  "title": "JetSet Scratch Lotto",
  "description": "Scratch off instant lottery tickets as you visit exotic places around the world like a true jet-setter!  It's your Lucky Day!\n\nCollect interesting souvenirs from locations around the globe through scratching a wide variety of beautiful and compelling scratch lotto cards themed in styles which make you anticipate the next one with great eagerness and joy.  With frequent jet-setting, you will gain VIP status, allowing you to live the true high-life! \n\nPlace your tray tables up and seat back to the upright position, you are about to take off on a Jet-Set adventure! They are not just lottery tickets, but a lottery ticket life-style. With luck on your side, and you know this is your lucky day, you will put luck in lucky. \n\nFive Coveted Destinations worthy of the most discerning traveler that will scratch that money itch. You have the necessary luck to get there.\n\n• Lay on the Beach in Sunny and Gorgeous Jamaica \n• Experience the Seriously Charming and Delightful Spain\n• Visit Ruins in Warm and Ancient Greece\n• Fascinate Your Senses in Truly Exotic India\n• Sip tea and take in the Wonders of Japan\n\nTo help your luck and your lucky streak, a Wide Variety of Mini-Games that add Loads Fun and Suspense are scratch-able\n\n• Scratch 'n' Win: Gift-Pile gives you free money\n• Frequent Fun Flyer: collect money until a whammy\n• Choose and Scratch: Sort the correct order and collect the most lucky money\n• Lotto Tipping Point: Get as close as possible to the high money values without going over and get your lucky wins\n\nFifteen Unique and Interestingly Varied and Gorgeous Location-themed Scratch Lotto Tickets !\n\nCompetitive Leaderboards, Worthwhile Achievements, Fun Scratch Ticket Goals!\n\nLike us on: Facebook.com/babarogagames\nFollow us on: Twitter.com/babarogatweet\n\nDo you have comments or questions about our fun scratch lottery ticket game? Was it your lucky day?  We would be happy to hear your thoughts!  You can reach us at contact@babaroga.com.  Don’t be a stranger!\n\nWe cannot respond to questions or comments posted in reviews, so please be sure to use our contact info.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Lifestyle"
  ],
  "contentRating": "17+",
  "released": "2013-08-01T03:35:01Z",
  "updated": "2017-09-07T20:00:36Z",
  "releaseNotes": "- crashes fixed\n- polished\n- compiled with current iOS in mind\n- bonus content streamlined and easier to unlock\n- higher rewards for videos / downloads",
  "version": "2.2.1954",
  "price": 0,
  "developer": "babaroga, llc.",
  "score": 4.66667,
  "reviews": 3,
  "currentVersionScore": 4.66667,
  "currentVersionReviews": 3,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.kau.winzzy",
  "title": "Winzzy",
  "description": "Say goodbye to visiting the shop to buy scratch and lottery cards. \n\nWith 50+ unique games, Winzzy is the number one app for all your instant games needs. \nGet unlimited cards and start winning games and prizes straight away. As you progress you will earn more Coins which will unlock even more games!\n\nWhat is Winzzy? \n\nWinzzy is the ultimate destination for scratch cards and other instant games which can be played in just a few seconds.\n\nWhich games can I play?\n\nAurora - Scratch the cards and reveal what’s beneath. Match three symbols to win!\nBananas - Spin the wheel to line up the fruits in either direction and win Coins. \nSnowflakes - Tap and reveal the snowflakes to find out what’s hidden behind. Match three or more to hit a big jackpot. \nLanterns - Tap and reveal each Chinese Lantern to reveal a symbol. Match three or more signs to land the jackpot.\nLotto 5 - Select your favourite 5 numbers from 1 to 30 and match it up with the 5 balls that are instantly drawn randomly to win great prizes!\nAnd many more! \n\nWinzzy features\n\nPlay all your favourite instant games right on your phone! Say goodbye to visiting the shop to buy scratch and lottery cards.\nStart with scratch cards and as you progress you will unlock new exciting game types.\nProgress through the games and win prizes to unlock extra levels.\nBuy Coins to unlock new and exciting games faster.\nEasily set variable bets to increase the stakes using a slider. The more you bet the bigger the potential jackpot!\nKeep track of all your winnings in your very own account section. \nTransfer your account to your web app and use your Coins to claim great prizes!\n\nCheck back regularly as we are continually adding more games for you to enjoy!\n\nSo install today and start having fun with Winzzy. The best instant games app you can take anywhere!",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-08-04T08:32:55Z",
  "updated": "2019-08-06T09:33:47Z",
  "releaseNotes": "Thanks for playing Winzzy! We hope you enjoy it as much as we do! This release brings bug fixes that improve our product to help you enjoy the best scratch card experience available.",
  "version": "1.0.14",
  "price": 0,
  "developer": "KAU, Inc",
  "score": 3,
  "reviews": 2,
  "currentVersionScore": 3,
  "currentVersionReviews": 2,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "gold.vegas.slots.cashman.fever",
  "title": "Slots Casino Fever  - Win Big",
  "description": "Enjoy the most authentic ALL-IN-ONE Vegas casino games free with Casino Fever, a NEW Vegas style FREE casino slot machines where you can find wild and free slot games with awesome scatters, bonuses and cool payouts! Enjoy amazing graphics, FREE chips and incredible wins!\n\nLooking for Huge Wins, Real Vegas slot machines and unlimited Bonuses? Casino Fever Free Slots has all of this and even more! Casino Fever Free Slots hosts a Best Variety of online casino games, 50+ incredible free slot machines, premium Texas Hold'em Poker games, Blackjack, Roulette, Baccarat, Sicbo, Craps and tons of free casino Bonuses. \n\nThere’s no better casino action than seeing that big 777, collecting your rewards & cheering for joy! Enjoy the biggest WIN in your life with the NEW casino game, Casino Fever Vegas Slots Free! \n\nStarting your day with FREE Quick SPINS at the free slot machines. \n\n**Key Features**\n- Top-tier authentic graphics and sound effects for all slot machines\n- Massive daily & hourly my Vegas free chips and bonuses at quick spin bet & win slot machines!\n- More new slot machines casino games added regularly\n- Best slot machines games scenes like Zeus, Wicked, Wizard, Tiger, Pirate and Pharaohs Egypt...\n- 4 more types of free slot machines tournaments everyday with progressive Jackpots slot games\n- Spin with friends to get free gifts, and earn more extra bonuses\n- Login with Facebook account for more extra bonuses\n- Instant authentic accessibility anywhere, anytime, and more from ANY DEVICE!\n- Beat the house and show your best bet skill in FULL variety of Vegas style casino games: free slot machines, blackjack 21, roulette free, baccarat, Texas holdem poker, sicbo, craps\n\nPlay Casino Fever social Las Vegas slots free NOW. Claim your massive Welcome Bonus! It's Time to start your Path to Wealth!\n\nCasino Fever Free Slots games is the most exciting online social casino games providing unlimited free entertainment and countless MEGA WINS. Play through all kinds of free slot machines: Slot machines with bonus games, slot machines with free spins and slot machines with Progressive Jackpot. Unlimited chances to win in the FREE Casino Slots!\n\n**Support**\nWe'd love your feedback on our casino slots games! Please feel free to contact us at: casino@ae-mobile.com!\n\nCasino Fever is intended for an adult audience and does not offer real money gambling or an opportunity to win real money bonuses or prizes. Practice or success at social gaming does not imply further success at real money gambling.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2016-05-19T19:15:32Z",
  "updated": "2017-10-30T22:54:05Z",
  "releaseNotes": "Hello fans,\n\nWe have some exciting treats for you!\n•5TH ALBUM! Card collection fun never ends!\n•Minor fixes and enhanced gameplay\n\nHave fun and good luck!",
  "version": "6.1.0",
  "price": 0,
  "developer": "AE Mobile",
  "score": 5,
  "reviews": 14,
  "currentVersionScore": 5,
  "currentVersionReviews": 14,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.jalsaa.bingovip",
  "title": "Bingo Billionaire Multi Bingo",
  "description": "Bingo Billionaire is the Classic & Special Bingo Game with 8 CARD VERSION! Wanna get more bingos? Wanna be more fun? Just play Bingo Billionaire!\n\nIt's really simple to play. Just tap on the number called on each bingo card.\nYou can even select multiple cards to play on a round. Multiple cards increase the chance to get more BINGOs! Even better is the BOOSTER ITEMS that will help you to win MULTI BINGOs. You can get even bigger payouts with DOUBLE, TRIPLE, or MEGA BINGO!!\n\nAre you ready to shout \"Bingo!\"? Play now and win bingos - NEW BINGO - the very bingo game for mobile!",
  "genres": [
   "Games",
   "Finance",
   "Board",
   "Casino"
  ],
  "contentRating": "12+",
  "released": "2019-05-15T06:56:46Z",
  "updated": "2019-05-15T06:56:46Z",
  "version": "1.0.0",
  "price": 0,
  "developer": "Jalsaa",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.appsentertain.scratchnwin",
  "title": "Scratch n Win",
  "description": "Scratch n Win is the fun gaming app to play and win by scratching lottery.\n\nThere are different stages its for complete iOS\n\nEnjoy different theme\n\nJust play and enjoy",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-04-11T01:57:03Z",
  "updated": "2015-04-11T01:57:03Z",
  "version": "1.0",
  "price": 0,
  "developer": "eHeuristic Solutions",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.paddypower.casino",
  "title": "Paddy Power Casino & Roulette",
  "description": "Deposit £/€10, Play with £/€50 + 20 FREE SPINS FOR BERRY BERRY BONANZA FOR NEW CASINO CUSTOMERS | T&Cs Apply\n\nOur new Paddy Power Casino app comes complete with Blackjack, Roulette, Slots and more, so you can now enjoy the Paddy Power Casino experience in the palm of your hand, on either iPhone or iPad.\n\nFEATURES\n- Play 150+ of your favourite Paddy Power Casino games for real money. This includes Roulette, Blackjack, Slots, Frankie Dettori’s Magic Seven, Jackpot Slots, and a hell of a lot more.\n- Our Casino app features games designed especially for iPhone, iPad.\n- Quick to load and easy to navigate.\n- Free play and real money, cash play.\n- Players can use the same login credentials as on online Casino, or Paddy Power Sports betting.\n- Deposit directly through the Casino app. \n- Register and deposit securely in 5 minutes. \n- Works just as well on 3G/4G as it does on WiFi.\n\nPaddy Power Casino is a product of the Paddy Power PLC, one of Europe’s largest gaming groups listed on the UK and Irish stock exchanges. We’re fully licensed and regulated by the Alderney Gaming Control Commission. Paddy Power Casino is only available to customers over the age of 18.\n\nT&C’s Deposit £/€10, Play with £/€50 offer:\n\n•Only new players from UK and Ireland who have never before played Paddy Power Casino\n•Deposits made with e-wallets (Paypal, Neteller, Moneybookers etc.) are not valid \n•Claim with a minimum of £/€10. The maximum bonus you can receive is £/€40 (400% of your deposited amount) \n•Once your bonus has been redeemed or lost, 10 free spins will become available to you.\n•All winnings from the initial bonus are capped at £/€500.\n•If you choose to ‘claim’ this bonus, you’ll need to wager the amount of the bonus 35 times.\n•Stakes on some of our games don't count in full towards the wagering requirement. Instead they have a percentage contribution:\n-Slots (Excluding double options)\t100%\n-Arcade, Scratchcards, Fixed Odds Games (Excluding Spin A Win/Lucky Wheel) 100%\n-Roulette (Excluding Zero Roulette and 3D) 50%\n-Card Games (Excluding Red Dog, Casino Hold'em, Casino War & Wild Vikings) 25%\n-Blackjack (Excluding Pontoon, Blackjack Surrender, Blackjack Switch, Zero Blackjack and Stravaganza) 25%\n-Sic Bo, Craps, Video Poker (All varieties), Pontoon, Blackjack Switch, Red Dog, Spin A Win/Lucky Wheel, Casino War, Casino Hold'em, Wild Vikings and Stravaganza, Zero Games, Blackjack Surrender and all double options on slots and on Video Poker (All varieties), 3D Roulette and any other games not in the eligible games list 0%\n•Once you complete the wagering requirements or lose your bonus, the free spins will appear on the casino promotion page. Accept your free spins and play them on Berry Berry Bonanza. Unused free spins expire in 24 h. Free spins have no wagering requirements. \n•If you cancel your bonus you also forfeit any pending winnings you have accrued. Cancelled bonuses and winnings cannot be refunded.\n•When a player chooses to participate in buy-in/match deposits, the combined value of their real cash buy-in amount is combined with a specified bonus. This is referred to as the Casino Promotional Balance. \n•You will only be able to qualify for one casino sign-up bonus. If you trigger any other promotional bonus while another is still active, the bonuses will queue in your bonus balance. \n•We reserve the right to govern how bonuses are used before a player is allowed to cash them in. As such we deem it necessary to restrict certain types of wagering from contributing to the wagering/turnover requirements.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-11-21T11:58:40Z",
  "updated": "2018-11-28T12:49:19Z",
  "releaseNotes": "We have been busy making sure our customers get the best possible casino experience. This version has improvements to load times along with bug fixes and we have updated our sign up offer for all you new customers - sign up now, deposit £/€10 and play with £/€50, T&C's Apply.",
  "version": "5.0.5",
  "price": 0,
  "developer": "Paddy Power PLC",
  "score": 3.19048,
  "reviews": 42,
  "currentVersionScore": 3.19048,
  "currentVersionReviews": 42,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "vc.plus.scratch",
  "title": "The Scratch Card",
  "description": "Simulation game of scratch lottery appeared!\nEyeing a big hit , rice 's luck !\n\nOperation is simple .\nIf the six silver align the three mark by cutting a finger hit a jackpot!\nGamecenter support ! Trying to match people and luck in the world !",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2012-08-28T23:39:59Z",
  "updated": "2018-01-23T22:36:08Z",
  "releaseNotes": "changed the icon",
  "version": "2.1",
  "price": 0,
  "developer": "IRITEC CO., LTD.",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.onlinemobilegames.scratchnsniff",
  "title": "Scratch n’ Sniff Party Game",
  "description": "Try your luck with realistic scratch card lottery tickets without having to pay for them, AND enjoy the hilarious game of Scratch and Sniff.  \n\nIt’s easy to play with or without the adult party game rules – just be prepared for a lot of sniffing!\n\nNote: This game is only for entertainment.  Sorry, but you cannot win real money with this game.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Simulation"
  ],
  "contentRating": "17+",
  "released": "2017-10-13T02:13:05Z",
  "updated": "2017-10-13T02:13:05Z",
  "version": "1.0",
  "price": 0,
  "developer": "Alexander Donaldson",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.DesignWorks.SpinVegas",
  "title": "Spin Vegas Slots: VIP Casino",
  "description": "Take our lucky slots for a spin! If you’re looking for the most realistic classic sloto games on mobile, look no further than Spin Vegas Slots! Our exciting sloto games and scratch off games for iPhone and iPad give you a real Vegas experience with the graphics and sounds you love from classic Vegas casinos! Our classic slot games and scratchers are filled with progressives, wilds, free spins and lots of bonuses! \n\nFEATURES:\n• New sloto games added bi-weekly\n• 125+ lucky slots and scratch cards!\n• Up to 10,000,000 coins daily and even more for VIP Players\n• More ways to win: Scratch Off Games, Progressives, Daily Wheel Spins, Daily Bonuses, Friend Bonus, 3-Hour Bonus and more!\n• VIP Room with better bonuses, bigger wins, huge progressives and exclusive games!\n\nCLASSIC SLOTO GAMES:\n• Diamond Arrow (Progressive jackpot is over 5 Billion!)\n• Stars and Stacks\n• Wild Hide\n\nFAN FAVORITES - OUR MOST POPULAR SLOTO GAMES:\n• 10X Fortune\n• Super Diamond Multi Wheel (Progressive jackpot is over 1 Billion!)\n• Flash Pays (Progressive jackpot is over 1 Billion!)\n• And even more lucky slot games that you're sure to love!\n\nSCRATCH AND WIN GAMES!\n• Clover Fields\n• Molten Hot 7s\n• Winning Pick\n• Cash Offer\n• And even more scratchers that you're sure to love!\n\nDownload today and take our lucky slots for a spin! Get the thrill of real Vegas casinos and real scratch off games!\n\nThis game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money prizes. Practice or success at social gambling does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2018-03-21T16:36:39Z",
  "updated": "2020-01-17T16:10:39Z",
  "releaseNotes": "Get freshly squeezed coin bonuses when you play our latest game, Juicy Wins (available 1/21)!  Download the latest version for access to the latest games, features and deals! \nJOIN OUR COMMUNITY FOR SPECIAL OFFERS AND THE LATEST INFO! \nLike us on Facebook www.facebook.com/spinvegasslots",
  "version": "1.4.2",
  "price": 0,
  "developer": "Design Works Gaming",
  "score": 4.7439,
  "reviews": 82,
  "currentVersionScore": 4.7439,
  "currentVersionReviews": 82,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "slots.machine.winning.ios",
  "title": "Winning Slots™ - Casino Slots",
  "description": "THE BEST SLOTS & CASINO GAMES\n\nPlay the most popular free Vegas Casino Slots game in 2020 and claim 10,000,000 FREE COINS as a welcome bonus! Claim awesome bonuses, spin your favorite casino slot machines, and get ready to experience the best free Vegas slots casino online! Prepare to enter the world of the best casinos in Vegas! Spin for Super Bonus and win Jackpots! \n\nOfficially Licensed Dark Horse Comics The Mask Slot Machine Game! The Mask slot is based on the Dark Horse Comics comic. Fans of the Mask will definitely love this slot machine. It highlights great gameplay and a high payout.\n\nGAME FEATURES:\n- Enjoy a variety of exciting slot machines – with new machines added weekly!\n- Huge Jackpots to win on every free Vegas casino slot machine game! \n- Big wins and triple wins which give you this special Las Vegas casino feeling! \n- Participate in slots tournaments for HUGE prizes!\n- Break Piggy Bank to collect coins saved in each spin!\n- Lucky scratch lottery tickets with bonuses every day!\n- Join the Vegas VIP program to get bonuses and lucky chances!\n\n\nAwesome Bonuses:\n-  Free coins every three hours in the game.\n- Daily free coins when you log in to the game.\n- Free bonus coins when you level up.\n- Free credit sweepstakes and online casino slots free promotions.\n- Participate in Daily Bonuses on our Facebook page.\n- Subscribe our notifications and mails to receive free coins.\n- Invite your friends to play Winning Slots™ and send coins to each other.\n- Connect your Facebook or email account to receive free coins.\n\nFollow us for exclusive coins offers and bonuses:\nFacebook: https://www.facebook.com/playWinningSlots\nInstagram: https://www.instagram.com/playwinningslots/\nTwitter: https://twitter.com/winning_slots\n\nVisit the website to learn more about Winning Slots™:\nhttp://playwinningslots.com/\n\nSUBSCRIPTION:\n\n*Weekly VIP Privilege offers $9.99 weekly subscription for the following benefits:\n- Free coins worth $1.99 everyday!                   \n- Unlock all slots!                                               \n- Early Access VIP Slots!                                                        \n- A random card package!\n- Remove ADS!\n\n*Monthly VIP Privilege offers $29.99 monthly subscription for the following benefits:\n- Free coins worth $1.99 everyday!                   \n- Unlock all slots!                                               \n- Early Access VIP Slots!                                                       \n- A random card package!\n- Remove ADS!\n\nThis price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.\n\n- Payment will be charged to iTunes Account at confirmation of purchase\n- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period\n- The account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal\n- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase\n- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable\n\nYou can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. \n\nPrivacy Policy: https://sites.google.com/view/t7privacy/\nTerms of Use: https://sites.google.com/view/t7gametermofuse/\n\n*ATTENTIONS:\n- This game is intended for an adult audience.\n- This game does not offer real money gambling or an opportunity to win real money.\n- Wins made while gambling in social casino games can't be exchanged into real money.\n- Past success or practice at social casino gambling does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2018-01-23T04:09:20Z",
  "updated": "2020-04-17T16:02:55Z",
  "releaseNotes": "*** NEW Slot Machines NOW released! Update for Free Coins!***\nWe've just added more FUN to Winning Slots, including new games, feature improvement, and updates to take your experience to the next level!\n- New slot machine: Elemental Queen\nA brand new slot game! Update to win JACKPOTS & BIG WINS!\nDo you love us? Please rate us! Your comments are important!\nFollow our fan page to collect free coins:\nhttps://www.facebook.com/playWinningSlots",
  "version": "1.90",
  "price": 0,
  "developer": "Triple Sevens Co., Ltd",
  "score": 4.6609,
  "reviews": 289,
  "currentVersionScore": 4.6609,
  "currentVersionReviews": 289,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "Real.slots.casino.saga.classic",
  "title": "Casino Slots - Slots of Vegas",
  "description": "Best Casino slot machines games?  Real Vegas slot machines? Old slot machine?  Enjoy the most realistic all in one Vegas casino games free. \nCasino saga includes Vegas Slot Machines with bonus games, Macau slot games, old Vegas classic, Blackjack 21 online, Roulette free, Crapss free, Sic Bo free, Baccarat, Texas Holdem Poker free game all in one place! \n\ncasino slot machines valley:\nStarting your day with free quick hits at the free slot machines with bonus games.  Casino Saga hosts a variety of free slot games with bonus rounds and bonus features.\nBest casino Slot Machines free boasts gorgeous graphics, exciting gameplay, interactive Bonus games that provides hours of fun for slotomania! Hit the jackpot and join jackpot party! \nGet your Lucky 777, play with friends, tournament challenge at slotsfree with bonus casino!  Enjoy slotss free with bonus and have house of fun.\n\n\nCasino table games:\nMeet people at the blackjack 21 online table.   Bankruptcy insurance is perfect for blackjack trainer.  \nCompetitive leaderboard for texas holdem poker free game.  Go Poker tournament casino games free to win Real Saga Cash.  Roulettes casino is shining, double down your bet to get huge win.   Play alone with high speed, or play with buddies.\n\nAsian games:\nBaccarat, sic bo are the popular Asian games.  Experience the new games and meet new people.\n\nDice games:\nCrapss are the dice games king on casino floor.  Be the lucky dice roller.\n\n\nWe are working on more games and strive to make Casino Saga the one stop casino games free for your casino game needs.\n\nKey Features:\n- Beat the house and show your skill in FULL variety of Vegas style casino games: free slot machines, blackjack 21, roulette free, baccarat, Texas holdem poker, sicbo, crapss\n- Top-tier graphics and high-quality sound effects for all slot machines\n- 3 ways to play casino games free, Texas Hold'em Poker: cash game, Sit n Go, MTT Tournaments\n- Massive daily & hourly my vegas free chips at quick hits slot machines, plus decent payouts!\n- new slot machines games added regularly 2017\n- Popular slot machines scenes like PCH, Wizard, China Town, Pirate and Pharaohs Egypt...\n- 4 types of free slot machines tournaments everyday with progressive Jackpots slot games\n- Play with friends to get free gifts, and earn extra bonuses\n- Watch your ranking on daily, weekly and monthly leaderboard\n- Instant accessibility anywhere, anytime, and from ANY DEVICE!\n\n\nDisclaimer:\n*Casino Saga: slot machines casino games free is intended for use by those 21 or older for amusement purposes only. THERE IS NO REAL CASH PAYOUT YOU CAN EARN.\n*Practice or success at social casino game does not imply future success at real money gambling casino.\n*Casino Saga: slotsfree with bonus does not offer real money gambling or an opportunity to win real money.\nInternet or wifi required. Not a free slot machines offline.",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-03-21T16:24:44Z",
  "updated": "2020-03-10T10:43:55Z",
  "releaseNotes": "Improvements and optimizations have been made for best experience.\nGet the latest version for all of the available new and advanced features.",
  "version": "6.4.6",
  "price": 0,
  "developer": "Theotino",
  "score": 4.47058,
  "reviews": 17,
  "currentVersionScore": 4.47058,
  "currentVersionReviews": 17,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.giinger.onedollar",
  "title": "One Dollar - Tap to win",
  "description": "See how far a dollar can get you...\n\nIt's simple, use your dollar coins on products you like, check the progress and wait for the draw. If this is your number you win the product and it gets delivered to you for Free.\n\nWith One Dollar you can get smartphones, designer bags, shoes, electronics- the list goes on and on- and it's all yours in just a tap. Every week merchants add new best selling products to our inventory.  There is only 1 piece at a time, so quantity is limited. \n\nTo get you started, merchants give you sponsored dollars. \n\nAll it takes is a dollar coin and your smart bet to turn your day around.\n\nGood luck !\n\n*Winners are announced in the Live feed screen (Notification). They all drawn randomly by a complex algorithm and you can verify identities on Facebook or Google+ unless users set a high privacy level. We care about full transparency if any questions please check our FAQ.  \n\nOne Dollar is:\n\n•\tEasy : \nVery Easy Interface to use, you would be able to see many discounts and deals. \n\n•\tFree :\nThe app is free and it will stay Free for life, so there is No hidden fees, no special members, and no annual subscription.\n\n•\tFast : \nWe have designed our app to let you, your family and your friends win awesome products for just one dollar with the most reliable technology.\n\n•\t Secured : \nOur team developers made this shopping app secured and no one can steal your money, dollars or the products that you won.\n\n•\tFor everyone : \nOne dollar is a free app and your whole family & your friends can try it and they will enjoy winning awesome products for $1.\n\n\n******FAQ******\n\nWhat is OneDollar?\nA marketplace platforms for merchants with a different concept to sell or get rid of their product faster.\n\nHow can you get Free $?\nWhen you sign-up you get a Free $ fully sponsored by merchants. You can have an extra Free $ by taping the Facebook icon in the drawer and share OneDollar on your Facebook wall, we credit you with another sponsored dollar. You can't cumulate sponsored credit.\n \nCan I see who bet? \nYes, check the product detail and tap the icon (magnifying glass). You will see who already bet.\n\nWho can bet, real users?\nAll valid account and users from the same country. Prizes won't be shipped abroad for regulation purposes. The fake accounts will be banned.\n\nWho draws the winner?\nMerchants upload their products in the app and a complex algorithm draws winners,each time it's different and not reproducible. We guaranty a random and non-repetitive series of the draws. Each entry has, by definition, the same chance to win.\n\nWhat if I can't get my product or it's canceled?\nAll participants will get their account credited to the amount they bet on this specific product.\n\nIf I didn't win or missed my prize ?\nDon't worry you can bet again. Buy more credit and look for the smaller product with the higher chance to win.\n\n**Apple is not a sponsor or involved in the activity in any manner.**",
  "genres": [
   "Shopping",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-06-20T02:11:53Z",
  "updated": "2018-04-25T22:53:05Z",
  "releaseNotes": "Thank you for using One Dollar, here is what we have done.\n*Fixed Push Notification when a seller sends you a message.\n*Spin the wheel to get a bonus is now daily.",
  "version": "1.5.2",
  "price": 0,
  "developer": "Giinger Pte Ltd",
  "score": 3.25,
  "reviews": 4,
  "currentVersionScore": 3.25,
  "currentVersionReviews": 4,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.papaappzi.scratchphrase",
  "title": "Scratch Phrase",
  "description": "Can you guess the phrase? Scratch carefully!\n\nTest your knowledge of popular Phrases with this brand new game, Scratch Phrase!\n\nGuessing a well known phrase from a picture might be easy, right? How about if you can only see part of the picture?\n\nScratch away to reveal the picture, but be careful, you cant scratch it all! If you get stuck there is no need to worry, we have added some in game hints to help you out!\n\n8d18f4ff45",
  "genres": [
   "Games",
   "Entertainment",
   "Trivia",
   "Word"
  ],
  "contentRating": "4+",
  "released": "2014-12-30T10:03:49Z",
  "updated": "2017-09-05T20:40:16Z",
  "releaseNotes": "Integrated app into Blank Media LLC\n\n8459e920de",
  "version": "1.4",
  "price": 0,
  "developer": "Intellimax, Inc.",
  "score": 4.77142,
  "reviews": 175,
  "currentVersionScore": 4.77142,
  "currentVersionReviews": 175,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.Makopaz.IdleScratch",
  "title": "Idle Scratch-Off",
  "description": "Scratch to win! Earn points by scratching off your rewards. Purchase upgrades and move to new stores to increase your income, unlock automation, and levels of prestige.",
  "genres": [
   "Games",
   "Simulation",
   "Casino"
  ],
  "contentRating": "4+",
  "released": "2019-10-04T07:00:00Z",
  "updated": "2019-11-07T01:20:23Z",
  "releaseNotes": "Updates:\n—Added background app income\n—Changed Empire Credit System Slightly\n—Fixed Automation Reset Glitches\n—Fixed Super Hold Glitch",
  "version": "1.5.1",
  "price": 0,
  "developer": "Makopaz LLC",
  "score": 3.33333,
  "reviews": 3,
  "currentVersionScore": 3.33333,
  "currentVersionReviews": 3,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "WilliamHillCasino",
  "title": "William Hill Casino",
  "description": "Big fan of the slots, or fancy your luck at the tables? Prefer to play live or are you dreaming of that big jackpot win? Whatever you’re into, William Hill casino is bursting with entertainment.\n  \nOur app is designed around you and how you like to play. Which means you can get to the games you love, faster. Wherever you are.\n \n•\tHave you seen our impressive range of huge jackpots? Get involved and you could be our next big winner\n\n•\tWhy go anywhere else? We’ve got all the casino classics, live tables, plus a wide range of slots including blockbuster games such as Superman the Movie and American Dad\n\nThe app requires you be over 18 to participate in any gambling activity. Full details can be found on www.williamhill.com\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-03-05T17:25:58Z",
  "updated": "2018-02-26T09:50:21Z",
  "releaseNotes": "You will find our smart new look and feel when accessing the account menu!",
  "version": "3.8",
  "price": 0,
  "developer": "WHG (International) Limited",
  "score": 4.33814,
  "reviews": 763,
  "currentVersionScore": 4.33814,
  "currentVersionReviews": 763,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "net.playtowingames.casino",
  "title": "Play To Win Casino Sweepstakes",
  "description": "Play To Win offers fun, free sweepstakes – and so much more! Enter Play To Win’s sweepstakes for your chance to earn real prizes daily, no purchase required.\n\nTo celebrate the launch of Play To Win, we are offering a HUGE bonus: 100% FREE cash sweepstakes for real money prizes! All Sweepstakes are free to enter and chosen at random.\n\nLucky sweepstakes winners can win cash rewards in Daily, Weekly and Monthly drawings! Sweepstakes for money are free to enter and open to all!\n\n-----\n\nPlay To Win also has fun games you can enjoy! Free games include 30 slot machines to play for fun, with more to come. Plus: bonus mini-games!\n\nBecome a Play To Win VIP for big bonus multipliers! Get an ad-free Play To Win experience with more spins, rewards and fun than ever before!\n\nMore games are on the way, so you can come back to play video poker, bingo and more!\n\n-----\n\nDecorate your virtual dream house with Play To Win’s Dream House lobby! Customize and decorate rooms with fun themes and furniture to make them look great and earn coins.\n\nYour virtual house will look amazing when you’re done decorating. Not only that, but you can earn free coins just from having decorations!\n\n-----\n\nDownload Play To Win today and find all the great ways to win!\n\nPLAY TO WIN FEATURES\n\nCASH SWEEPSTAKES\n- Win real money in our giveaways\n- Free sweepstakes\n- Get lucky and you can earn real cash!\n\n-----\n\nDECORATION GAMES\n- Decorate virtual rooms to your heart’s content\n- Create your dream house design with virtual furniture\n- Earn coins from all the decorations you display!\n\n-----\n\nFREE CASINO GAMES\n- Free slot machine games\n- Enjoy 30+ slot machines with different themes and designs\n- Free casino games with a fun, Las Vegas feel\n- Win cool bonus prizes\n\nVIP Experience\n- Become a Play To Win VIP for a bonus boost!\n- Up to 8x bonus multipliers\n- No ads, more fun!\n\nCASINO GAMES COMING SOON\n- New games added all the time!\n- Video poker\n- Bingo\n- Roulette\n- Baccarat\n- And more!\n\nGet Play To Win and enjoy tons of great sweepstakes today!\n\n\nSuccess within this game does not imply future success with real money gambling\n\nThis game does not offer real money gambling or any opportunities to win real money or prizes from gambling activities\n\nThese sweepstakes are devised as non-gambling promotions and are intended solely for entertainment purposes.\n\nApple does not sponsor, nor is any way affiliated with Play To Win and/or the sweepstakes prizes.\n\nPlay To Win is a free mobile gaming app that allows users to win money and prizes, no purchase is necessary.\n\nThis game is intended for an adult audience",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2020-03-01T08:00:00Z",
  "updated": "2020-05-07T20:20:30Z",
  "releaseNotes": "Become a Play To Win VIP for even more opportunities to play and big bonuses!\n\nLucky sweepstakes winners can win real cash in our $50 Daily, $100 Weekly, $500 Holiday, and $10,000 GIANT GIVEAWAYS! Sweepstakes for money are free to enter and open to all! No purchase required, and winners are chosen at random.",
  "version": "v1.2.2",
  "price": 0,
  "developer": "Play To Win Games",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "amz.lottery.scratch",
  "title": "Escape by scratch *Scratch games",
  "description": "Can you escape skyscraper?\nSolve puzzle by Scratch action.\n\n- Escape Game\nNew style of escape games.\nFind clue with scratch in the touch.\n\nEscape skyscraper.\nComposite facilities formed from park,office,shops..\nWe are prepared various kind of stage.\n\n- Scratch lottery games.\nLottery ticket scratch off games.\nLike a lottery ticket card.\nThere is no prizes,But,this lottery games can challenge by free.\n\n-Card Games\nHigh and Low style card games.\n\n-  Picture jokes games\nCan make unique scratch card from a your favorite two images.\nNot only photo,also capture of the movie and animation will also be scratch card.\nYou can creating everything what you want scratch.\n\n- Fortune telling scratch cards\nYou can know \"Today's fortune telling\" by scratch.\n\nBecome habit this realistic Scratch feeling.",
  "genres": [
   "Games",
   "Casino",
   "Puzzle",
   "Photo & Video"
  ],
  "contentRating": "17+",
  "released": "2016-05-26T01:15:05Z",
  "updated": "2016-12-20T02:26:03Z",
  "releaseNotes": "Greatly updated.\nHalf of contents revamp to as solution of a riddle in escape style games.\n\nThe following contents not any change.\nBut location will be in Menu windows.\n\n-Lucky Star\n-Double Chance\n-Making scratch cards by your photos\n-fortune telling scratch",
  "version": "1.0.8",
  "price": 0,
  "developer": "Bakerstreet Co., Ltd.",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.bridgetech.lottery.balls",
  "title": "Lottery Balls -  Lotto Results",
  "description": "Increase your chances of winning the lottery with Lottery Balls. \n\nEver noticed how there's rollover after rollover without a winner and then multiple people hit the jackpot at the same time. There's a reason for that; people are all picking their numbers the same way. \n\nYou can beat this trend. Lottery Balls uses highly advanced randomising algorithms to find the numbers that other people aren't choosing. \n\nAs well as helping you win the top prize and not having to share it, Lottery Balls increases your chances of winning the smaller prizes. When using other random number generators, including the \"lucky dip\" available at retailers, each row of numbers will be produced in isolation. Using their method, if you're buying more than one ticket, you'll find you're repeating the same number on several lines. That's fine if all you're interested in is the jackpot, but for smaller prizes, you've got a better chance of winning if you cover a wider range of numbers. That's why Lottery Balls generates multiple lines holistically, without repeating any numbers across the different tickets. \n\nEver forgotten to buy your ticket? Lottery Balls can remind you on the day of the draw to go out and get it before it's too late. \n\nCheck results in the app and receive a notification to let you know when the draw has happened. Look up the results from previous draws. \n\nLike playing the same numbers every week? Lottery Balls can save your favorite numbers for quick and easy access every time. \n\nLottery Balls works with any lottery. We've even added built-in generation rules for many popular worldwide lotteries. \n\nThese include:\nEurope\nEuromillions\n\nAustralia\nPowerball\nMonday & Wednesday Lotto\nOz Lotto\nSet for Life\nTattsLotto (Saturday Lotto)\n\nCanada\nDaily Grand\nDaily Keno\nLottario\nLotto 649\nLotto Max\nPick-2\nPick-3\nPick-4\n\nChina\n七乐彩 (Lucky 7)\n七星彩 (Lucky 7)\n六合彩 (Mark Six Lottery)\n双色球 (Double Colour Ball)\n排列三 (Order of 3)\n排列五 (Order of 5)\n福彩3 D (3D Lottery)\n超级大乐透 (Super Lotto)\n\nSpain\nBonoloto\nEl Gordo\nLa Primitiva\n\nUnited Kingdom\nHealth Lottery\nLotto\nSet For Life\nThunderball\n\nIreland\nDaily Million\nLotto\n\nItaly\nSuperEnalotto\n\nJapan\nナンバーズ3 (Numbers3)\nナンバーズ4 (Numbers4)\nハロウィンジャンボ宝くじ (Jumbo Lottery)\nミニロト (Mini Loto)\nロト6 (Loto 6)\nロト7 (Loto 7)\n\nMexico\nChispazo\nMelate\nMelate Retro\n\nPhilippines\nGrand Lotto 6/55\nLotto 6/42\nMega Lotto 6/45\nSuper Lotto 6/49\nUltra Lotto 6/58\n\nSingapore\nTOTO\n\nTurkey\nSayisal Loto\nSüper Loto\n\nUSA\n2by2\nAll or Nothing\nCash 5\nCash4Life\nDaily Derby\nFantasy 5\nFlorida Lotto\nGimme 5\nJackpot Triple Play\nJersey Cash 5\nLotto America\nLucky Day Lotto\nLucky For Life\nMass Cash\nMega Millions\nMegabucks\nPick 2\nPick 3\nPick 4\nPick 5\nPowerball\nSuperLotto Plus\nTexas Two Step\n\nSouth Africa\nDAILY LOTTO\nLOTTO\nPowerBall\nUK 49\n\nWe’re adding more and more of these all the time and we’d love to hear your suggestions for what you’d like included. There’s a form here if you’d like to suggest one. http://bit.ly/324vSYW\n\nIf you win using this app then please take the time to rate it 5 stars.\n\nFollow me on Twitter for the latest promotions, news and updates. @MarkBridgesApps",
  "genres": [
   "Entertainment",
   "Games",
   "Casual",
   "Casino"
  ],
  "contentRating": "4+",
  "released": "2012-02-25T04:01:22Z",
  "updated": "2020-01-20T18:40:38Z",
  "releaseNotes": "Minor bug fixes and improvements",
  "version": "2.29",
  "price": 0,
  "developer": "BRIDGETECH SOLUTIONS LIMITED",
  "score": 4.60562,
  "reviews": 71,
  "currentVersionScore": 4.60562,
  "currentVersionReviews": 71,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.WilliamHill.WilliamHillBingo",
  "title": "William Hill Bingo",
  "description": "Just one to go. Waiting on those two little ducks. Will your number be called first? Little can match the anticipation. Enjoy the excitement, across our collection of thrilling games – we have all sorts from classic 90 ball bingo to something a bit different with our exclusive themed games. You’re bound to find what you want at William Hill Bingo.\n\n\t•\tPlay in over 20 unique Bingo rooms. We have all the favourites including Deal or No Deal, plus you can play our exclusive rooms like Day at the Races and Bingo Bowl.\n\n\t•\tYou can win big and from a ticket costing as little as 20p.\n\n\t•\tWe also have over 150 of the best slots for you to enjoy, with popular games like Rainbow Riches, Clover Rollover and Dynamite Digger, alongside our exclusive titles such as Magic Mouse.\n\nDownload the app and start playing today.\n\nWilliam Hill is operated by WHG (International) Limited a company registered in Gibraltar. William Hill is licenced by the Gambling Commission (Number: 000-039225 R-319373-001) for customers in Great Britain, and licenced by the Gibraltar Government and regulated by the Gibraltar Gambling Commissioner (RGL no. 034 & 042) for all other customers. \nThe app requires you be over 18 to participate in any gambling activity. Full details can be found on www.williamhill.com\nThis is a real money gambling app. Please gamble responsibly and only bet what you can afford. For gambling addiction help and support, please contact Gamble Aware at 0808 8020 133 or visit https://www.begambleaware.org",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-11-02T17:30:46Z",
  "updated": "2018-10-12T12:38:23Z",
  "releaseNotes": "Bug fixes and performance enhancements to allow the App to run smoother and faster.",
  "version": "3.3.3",
  "price": 0,
  "developer": "WHG (International) Limited",
  "score": 4.29697,
  "reviews": 165,
  "currentVersionScore": 4.29697,
  "currentVersionReviews": 165,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.RichiScratcher",
  "title": "RichiScratcher",
  "description": "FREE DOWNLOAD \n\n \n-SCRATCH THE CARD TO WIN\n-FIND THE  LUCKY CARD\nFOR 5 X , 10 X , 500 , 1,000, 2,000 and 5,000 COINS\n-COLLECT THE COINS TO 80,000 , 100000 , 300,000, 500,000 , 800,000\n 1,200,000 , 1,800,000 , 2,500,000   \n\n-ONLY FIRST PERSON CAN WIN\n-YOUR NAME /CITY/PHOTO  WILL BE PUT IN OUR HALL OF FAME\nAS FOREVER SHOWN ON \n\n189f15f19c\n\n\nGOOD LUCKS !",
  "genres": [
   "Games",
   "Casino",
   "Sports",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-07-18T16:53:12Z",
  "updated": "2017-12-14T19:12:33Z",
  "releaseNotes": "Fixed crash when scratching tickets",
  "version": "1.2",
  "price": 0,
  "developer": "Huge Holdings Ltd",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.lootwinner.BingoLounge2.0",
  "title": "Bingo Lounge 2 - Real Money UK Gambling Casino",
  "description": "At Bingo Lounge we’re different to all of the other Bingo apps that force you to buy tickets into tournaments, here you pick the shots and make the calls!\n\nOur new players receive a whopping 250% deposit bonus up to £125! That means depositing only £10 today will give you £35 to play with, or deposit the maximum of £50 and get £125 on your account!*\n\nWe have a variety of games to suit your favourite Bingo types. Play any of our classic Bingo Lounge games or try your hand in the new Bingo Fusion and Pixie Riches!\n\n_In our exclusive games (you won’t find them anywhere else!) you pick how much you want to bet, how many cards you want to play with, and most importantly WHEN you want to play! No waiting around for tournament rooms to start, our Bingo games are ready when you are! _\n\nPurchase tickets in our games from 5p to £500 and win up to 100x your wager back!** Play how you want - single or multiple cards at a time, auto-daubing or manual - all of these features are available within our games.\n\nWe don’t forget to show our regular players how much we appreciate them either, with regular deposit bonus days, prize draws, and competitions, there are multiple ways to win cash! With regular updates, generous promotions, and new games added, there’s always a reason to come back.\n\nDownload Bingo Lounge today and call your own shots, you won’t regret it!\n\n*First deposit only. Bonus money cannot be withdrawn. T&Cs apply.\n** Different games offer different paytable structures. Check each games paytable to see what they offer.\n\nPlease note some portions of this app have REAL MONEY GAMBLING FUNCTIONALITY POWERED BY BETABLE. The real-money gambling functionality of this application is only available to customers over the age of 18. A valid Betable account is required in order to use the real-money functionality of this application. Betable is licensed by the United Kingdom Gambling Commission to offer remote gambling services, license number 000-023328-R-307313-003.\n\n18+ Gambleaware.co.uk Play Safe. Always gamble responsibly.",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-03-23T04:14:04Z",
  "updated": "2017-07-02T22:15:05Z",
  "releaseNotes": "Bug Fixes\nImprovements",
  "version": "1.0.1",
  "price": 0,
  "developer": "Loot Winner Ltd",
  "score": 2,
  "reviews": 3,
  "currentVersionScore": 2,
  "currentVersionReviews": 3,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.boomdmg.BoomMinigames",
  "title": "BOOM MINIGAMES -Bingo and Casino Minigames!",
  "description": "Get the feel of High-Rolling in Vegas, anytime, anywhere, for free with Boom Minigames!\n\nFrom Rapid Bingo to Royal Flush Poker Slots, Boom Minigames has no limits! Watch the reels go wild and the Pull Tabs FLASH when you WIN INCREDIBLE JACKPOTS!\n\nGet your Signup BONUS and play for FREE today!\n\nBOOM SLOTS FEATURES: \n\n• TONS of FUN and EXCITING mini games!\n• Roll the dice and make your way to the top of the community LEADERBOARDS!\n• Collect your free Daily Spin to win big BOOM BUCKS every day!\n• WIN BIG and level up to receive special BADGES & ACHIEVEMENT REWARDS!\n• Make friends from around the world!\n• Connect with Facebook to play on different devices!\n\nWIDE SELECTION OF MINIGAMES\n- Boom Minigames will keep you entertained with an endless list of THEMED Slots Games, Scratch Cards, Pull Tabs, Money Wheel, Rapid Bingo and Dice games!\n\nPROGRESSIVE JACKPOTS\n- Take a chance and roll the dice to win COLOSSAL JACKPOTS worth THOUSANDS of Boom Bucks! \n\nINCREASE YOUR BET FOR BIGGER WINS\n- Choose between Bronze, Silver, Gold and Platinum bets to reap your HUGE BOOM BUCK WINNINGS!\n\nROLL YOUR WAY TO NUMBER ONE\n- Take on your friends to become the number one Mini games Champion on the DAILY LEADERBOARD to win BIG PRIZES!\n\nBOOM SLOTS COMMUNITY\n- Receive gifts and make friends from around the world to compete for Leaderboard bragging rights!  \n\nCROSS-PLATFORM PLAY\n- Connect on any platform with your account, so you can play anytime, anywhere!\n\nLIKE US: www.facebook.com/boomgamingcommunity\nFOLLOW US: www.twitter.com/boomgamingnews\nWATCH US: www.youtube.com/user/boomgamingvideos\n\nDON’T MISS OUT!\n- Don’t miss some of our other FUN and EXCITING BINGO games, from Character Bingo, Bingo Keno, Beach Bingo and more - get them NOW!\n\nThe games on this platform are intended for an adult audience and are for entertainment purposes only. The games do not offer “real money gambling” or an opportunity to win real money or prizes. Practice or success at social casino gambling does not imply future success at real money gambling.",
  "genres": [
   "Games",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2015-02-17T20:21:44Z",
  "updated": "2017-07-28T19:45:56Z",
  "releaseNotes": "Minor layout changes.\nNetworking updates\nVarious bugfixes",
  "version": "1.9.15",
  "price": 0,
  "developer": "Boom Digital Media Group",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.aemobile.casino",
  "title": "Luckyo Casino - Slots of Vegas and 777 Machines",
  "description": "Luckyo Casino Free Slots - the ONLY online casino game with FREE Slots, Texas Hold'em Poker game, Blackjack 21, Roulette, Baccarat, Sicbo and Craps just in ONE APP!\n\n**Join the most popular FREE casino slots game online with thousands of real players.\n\nLike no other casino games, Luckyo Casino provides almost 100% LAS VEGAS social casino games experience! You can Win BIG with huge Jackpots, spin it rich with numerous slot game features, or place bets with real online casino players on the table of Texas Poker, Blackjack, Roulette, Baccarat... and have great FUN!\n\n**Luckyo Casino provides massive free casino and slots bonuses. Unlimited FREE casino slots bonuses! Amazing slots bonus games and chips gift features!\n- Get HUGE WELCOME BONUS to start your path to wealth!\n- Collect casino games FREE CHIPS every hour! \n- Break the CAT BANK to fill your coin package\n- Multiply BIG WINs with 777 slot machines FORTUNE BOOSTER\n- Hit the Progressive JACKPOT to Billionaire with high payouts!\n- Spin the Lucky WHEEL everyday for more bonuses\n- Receive Chips and Card GIFTs from friends\n- Enjoy casino slots bonus features: Mega Bonus Games, Sticky Wilds, Free Spins and Re-Spins!\n\nLuckyo Casino Free Slots is the best online casino game, various free slot machines with stunning graphics and animation, authentic real casino table games including Texas Hold em Poker, free Blackjack 21 Pro game, Roulette free, Baccarat free, Sicbo and Craps.\n- New casino slot machines added all the time \n- 3 ways to play FREE Texas Holdem Poker: cash game, Sit n Go, MTT Tournaments\n- Revolutionary PVP slot machines, only in Luckyo Casino Vegas free slots\n- Slots VIP Room with a series of Asian-themed free slot machines\n- 4 types of Vegas slots tournaments with progressive Jackpots\n- Add friends in active community, chat and send gifts and chips\n- Certified card generator for blackjack free poker game\n- Login with Facebook for extra bonuses\n- Play free slot games for fun against with your friends\n- Instant accessibility anywhere, anytime, and from ANY DEVICE!\n\nPlay Luckyo Casino Vegas Slots Free and spin to WIN BIG!\n\n**People LOVE Luckyo Casino\n\"Luckyo casino has the most variety of casino games. Free slots are my favorite.\"\n\"Luckyo Casino Free Slots is impossible to get bored. It has the best themes and such a huge variety of casino games. Their support team is geared for quick responses. What else could you possibly ask for! Luckyo Casino Rocks!\"\n\"You win some, you lose some, but you always some fun! Love it!\"\n\n**Earn Free Casino Chips\nLike Us on Facebook: facebook.com/LuckyoCasino\nFollow Us on Twitter: @LuckyoCasino\n\n**Support\nWe'd love your feedback! Please feel free to contact us at: casino@ae-mobile.com!\n\nLuckyo Casino and Free Slots is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply further success at real money gambling.",
  "genres": [
   "Games",
   "Card",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-06-04T13:55:38Z",
  "updated": "2017-07-12T22:01:15Z",
  "releaseNotes": "Luckyo Casino keeps getting better! Get the latest version and check it out.",
  "version": "5.9.1",
  "price": 0,
  "developer": "AE Mobile",
  "score": 4.66667,
  "reviews": 15,
  "currentVersionScore": 4.66667,
  "currentVersionReviews": 15,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.bananaandco.blackjack",
  "title": "Blackjack 21!",
  "description": "Do you love Blackjack? Play the best FREE Blackjack game on the app store!\n\n- Jump right in and play Blackjack completely free!\n- Popular Las Vegas rules just like at the casino.\n- Beautiful table customizations with HD graphics.\n- Easy, simple to learn controls make this the sleekest Blackjack available.\n- Stat tracking shows your performance over time.\n- Double Down, Splits, Insurance and Surrender for an authentic Blackjack experience.\n- Deck shuffle animation lets you know when the deck is being reshuffled.\n- Tons of chip denominations from singles all the way to millions!\n- Customization options including decks, tables, face card style, hints, music, sfx, surrender.\n- Informative help screen for those who don't already know how to play Blackjack.\n\nThe current game has hints enabled by default. This will highlight the suggested move based on basic Blackjack strategy. If you want to turn this off, toggle the \"Move Advice\" setting in the menu.\n\nWe'll be adding some awesome new features to Blackjack soon, so stay tuned! Thanks for playing!! For fast and friendly support, email us at contact@maplemedia.io. We would love to hear from you!",
  "genres": [
   "Games",
   "Card",
   "Lifestyle",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2015-07-03T22:32:27Z",
  "updated": "2019-06-19T19:07:15Z",
  "releaseNotes": "Get ready to double down! We've made some behind the scenes changes to keep you in the action longer. \n\nKeep playing and rack up those chips! Good luck!",
  "version": "1.8",
  "price": 0,
  "developer": "Banana & Co.",
  "score": 4.58462,
  "reviews": 65,
  "currentVersionScore": 4.58462,
  "currentVersionReviews": 65,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "pi.HeartSolitaire",
  "title": "Solitaire Heart - Classic Play",
  "description": "Welcome to Heart Solitaire!\nWe have stayed true to the spirit of the classic Solitaire, also known as Klondike, and kept the wonderful classic feel that everyone loves. Furthermore, Heart Solitaire adds a little 3D element, which will give a different experience!\nIf you love classic solitaire game, you will also like Heart Solitaire. It is suitable for all ages, and it can keep your brain sharp. Hearts Solitaire is always at the ready, playing anytime to relieve boredom.\nIn Heart Solitaire, you will have feedback for every click. If you start the game, you will be immersed in it. So please start the classical game- Heart Solitaire!\nFeatures:\n-3D element\n-have feedback for every click\n-Single tap or drag to move cards -Draw 1 card (Easy)or 3 cards (Hard) as you like -Unlimited UNDOS and HINTS supported\n-Auto-collect cards on completion\n-Cool victory action\n-Game Center leaderboards\nPlease enjoy our Hearts Solitaire games free! Download now!",
  "genres": [
   "Games",
   "Card",
   "Family"
  ],
  "contentRating": "4+",
  "released": "2019-10-19T07:00:00Z",
  "updated": "2020-01-08T01:30:02Z",
  "releaseNotes": "1、Optimized the game page\n2、Fixed some bugs",
  "version": "1.3",
  "price": 0,
  "developer": "Bai Jiangtao",
  "score": 4.56923,
  "reviews": 65,
  "currentVersionScore": 4.56923,
  "currentVersionReviews": 65,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.onlinecasinoreports.vegasgames",
  "title": "Vegas Slot Games - Exclusive Bonuses",
  "description": "Find the Best Vegas Games sites suitable for players from the United Kingdom in GBP.\n***\nDownload the Vegas Games app now and you'll always have the best info about where to enjoy great Vegas and casino games. The Vegas Games app was made by gamers for gamers who are looking for a top-notch Vegas experience on their mobile, made out of the combination of trustworthy Vegas games sites, great games and feisty bonuses and offers for players.\n\nFEATURES:\n\n- TOP VEGAS GAMES SITES: Receive info about the top Vegas Games sites where you can play fun instant win games, slots, scratch cards and more.\n\n- FREE OFFERS: Get a list of free offers - free spins and free play bonuses, all rounded up together for your utmost convenience. \n\n- EXCLUSIVE BONUSES: Be informed about exclusive bonus offers for the Vegas Games app users, where you can receive extra free spins, free chips and more.\n\n- WELCOME BONUSES: Where will you find the most generous welcome bonuses? Find the welcome offer that fits you the most\n\n- EASY TO USE: The Vegas Games app is tailored for use on iOS devices - it's colorful, simple and responsive so you can find your preferred site in a jiffy!\n\nDOWNLOAD NOW\n\nTop-notch online gaming experiences await you now at the Vegas Games app, Download now!",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2016-06-20T19:34:49Z",
  "updated": "2016-07-11T18:03:16Z",
  "releaseNotes": "* Improved push notifications\n* Bug fixes & performance optimisation",
  "version": "2.0",
  "price": 0,
  "developer": "Redsquare Services Ltd.",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.hillbilly.slots",
  "title": "Hillbilly Slots - Top Free Redneck Slots Machine",
  "description": "Hillbilly Slots is an exciting slot machine game containing several different Redneck themed reels. Play up to to 25 coins for maximum chances to WIN BIG!!! Hillbilly Slots is available now for the iPhone and iPod. This app offers simulated casino style slot machine fun on the go, anytime or anywhere. It's a must have game for anyone who loves playing slot machines!. Don't worry though, the money you bet isn't real! Get Hillbilly Slots today!\n\nHOW TO PLAY: \n-Manage your bets with one credit or bet max credits up to $1,500. \n-Press spin to start the fun or use multiple Auto Spin options for continuous play.\n-Buy COINS via In-App Purchase for exciting HIGH STAKES gameplay!\n-Keep Playing in order to unlock new and interesting Redneck themed levels.\n\nFEATURES \n-Multiple Redneck Themed reels\n-Max bet option\n-Realistically rendered reels.\n-Incredible sound effects \n\nRemember that Hillbilly Slots is for entertainment purposes only. You are not playing for real money. \n\nWe hope you enjoy playing the game. Please share your feedback or leave a review. We listen to your feedback!",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Simulation"
  ],
  "contentRating": "12+",
  "released": "2015-04-01T21:22:07Z",
  "updated": "2015-04-01T21:22:07Z",
  "version": "1.0.1",
  "price": 0,
  "developer": "Revolution Games, Inc.",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.indigoapps.worldofsolitaire",
  "title": "World of Solitaire - Classic, Spider, TriPeaks and more",
  "description": "\"World of Solitaire - Free Card Game\" is the best Solitaire card game on IOS!\n  \nIf you like Windows Solitaire, you're going to love this app! \n\nWe've always strived to stay true to the classic Solitaire card game (also known as Klondike or Patience), the most popular version of Solitaire! A truly solitary experience! Try this completely custom version of Solitaire tailored for IOS devices, from the small screen all the way up to the large screen tablet. It has the best game play of any Solitaire in the market. Please take Solitaire for a spin and we think you'll see the difference. What have you got to lose, Solitare is a free download. Solitaire is also known as Patience.  \nFEATURES: \n- Solitaire Draw 1 card \n- Solitaire Draw 3 cards \n- Portrait - Landscape - Right and left hand deal layouts \n- Unlimited free solitaire games \n- Undo feature  \n- Auto win solitaire hand \n- Big and easy to see cards \n- And so much more!",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "4+",
  "released": "2016-06-14T03:35:28Z",
  "updated": "2016-06-14T03:35:28Z",
  "releaseNotes": "This update is signed with Apple’s latest signing certificate. No new features are included.",
  "version": "1.0",
  "price": 0,
  "developer": "rafiquan bibi",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.Among.AquaticQuiz",
  "title": "Quiz Games Aquatic Animals",
  "description": "Predictions for a variety of aquatic animals. Look at the pictures of aquatic animals and then guess what animal is the animal. Is the aquatic animal you know? Spell the name of the species. Give the vocabulary benefits. Learn to spell words.",
  "genres": [
   "Games",
   "Puzzle",
   "Education",
   "Card"
  ],
  "contentRating": "4+",
  "released": "2018-04-29T22:38:14Z",
  "updated": "2018-04-29T22:38:14Z",
  "version": "1.0.0",
  "price": 0,
  "developer": "Amornrat Tangjitsirirat",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.tapcart.sHpPLY62o1",
  "title": "Unicorn Smiles",
  "description": "Unicorn Smiles is a fast growing e-commerce platform that provides fun products for business owners to give to their customers.\n\nWe have scratch off cards, stickers, punch cards, thank you cards and much more!\n\nWe are constantly adding new products to our shop and we love to spoil our customers with fast shipping!\n\nWe created this app to give you guys a simple and fast way to shop our products.\n\nIf you are on Instagram, please feel free to tag @unicornsmilesofficial and #unicornsmilesofficial when showing off your new products from us!",
  "genres": [
   "Shopping",
   "Business"
  ],
  "contentRating": "4+",
  "released": "2019-12-11T08:00:00Z",
  "updated": "2019-12-11T12:14:35Z",
  "version": "1",
  "price": 0,
  "developer": "ROSINSKI RETAIL LLC",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.tiltangames.realanimalspuzzlelite",
  "title": "Amazing Wild Animals - Best Animal Picture Puzzle Games for kids",
  "description": "Animal Puzzles Games is a wonderful collection of puzzle games for kids and adults \nPlay 50 amazing picture puzzles with various wild animals: lion, elephant, zebra, monkey, dolphin, birds, leopard and many more! \nUpload your own pictures and create puzzles!\n4 Activities: Jigsaw Puzzle, Scratch Card, Shuffle Puzzle, Colour Card\nSelect between 2-30 pieces\n\nAnimals Puzzle Games Features:\n* Play through 50 Unique puzzles.  \n* Four different activities - Jigsaw Puzzle, Scratch Card, Shuffle Puzzle, Colour Card.  \n* Wide range of difficulty levels - from 2 pieces for starters to 30 pieces for kids and adults! \n* Create your very own puzzles - Draw and Paint activity\n* Record your voice and have it played\n* Easy to learn and control, even for small kids \n* Multiple side games for in between puzzle solving - pop balloons, bubbles and more. \n* Control puzzle settings, game music, and sound effects from the settings menu \n* Colourful, cute HD Graphics, suitable for new HD devices\n\nNote, this is the lite version. The first 4 puzzles are open for free. \nIf you like this game and would like to unlock the rest of the activities, you can unlock the complete game with a single in-app purchase or with ads. \n\nThanks for your support!\n\nHave Fun!\nTiltan Games (2013) LTD\nhttp://www.tiltangames.com",
  "genres": [
   "Games",
   "Puzzle",
   "Family",
   "Photo & Video"
  ],
  "contentRating": "4+",
  "released": "2015-08-03T17:55:30Z",
  "updated": "2015-08-03T17:55:30Z",
  "version": "1.0.5",
  "price": 0,
  "developer": "Tiltan Games (2013) LTD",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.ellis.lottoscratchpro",
  "title": "Lotto Scratch Offs Tickets Pro",
  "description": "Lotto Scratch Off Tickets Pro brings the fun and excitement of scratching lotto tickets to your iPhone! In this Pro version you do not have to see advertisements and you also get more credits to start out with!\n\nYou get Blackjack, Poker, Match 3, Lucky Numbers and more! \n\nGet the same rush that you feel when you win a real lotto scratch ticket, but enjoy the savings of just playing for fun! \n\nNOTE: \n- This app is for entertainment purposes only! \n- No real money or any other real world goods and/or services can be won in this game! \n\n√ NUMBER ONE Lotto Scratch game in the store! \n√ Realistic retina graphics! \n√ Realistic sounds, ambiance, and voice! \n√ Feels like you are ACTUALLY playing and winning at lotto tickets. \n√ Check out the screen shots & see for yourself \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-01-09T19:29:36Z",
  "updated": "2014-09-09T14:20:50Z",
  "releaseNotes": "- Bug fixes",
  "version": "1.1",
  "price": 0.99,
  "developer": "Ellisapps Inc.",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "it.arkimedenet.scopa3d",
  "title": "Scopa 3D",
  "description": "If our 3D version has stunned you, get ready for a gaming experience even more realistic with one of Italian most beloved pastime: scopa!\nHow many of you, at least once, have never played this fabulous game at home, in the café with friends or relatives?\nShrewdness, skillfulness and so much fun are the typical ingredients of scopa. This app will allow you to live the same emotions directly on your device through a simple touch. If you think that it is too sophisticated, don’t worry: Scopa3D puts in place the best technologies to make you live a smooth gaming experience and absolutely REALISTIC.\nMain features:\n-\tSingle-player and multiplayer\n-\t5 variations (Napola, Rebello, Asso piglia tutto, ultima scopa, a perdere)\n-\t3 difficulty levels for each variation\n-\tOnline championships with rich prizes!\n-\tAll the italian deck cards are high-definition\n-\tWeekly, monthly and general rankings both for single-player and multiplayer.",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-08-04T01:58:52Z",
  "updated": "2018-01-20T19:01:27Z",
  "releaseNotes": "- minor bug fixes",
  "version": "2.02",
  "price": 0,
  "developer": "ARKIMEDE S.R.L.",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.monkeybin.monsterminds",
  "title": "Monsterminds",
  "description": "Do you like board, puzzle match, dice or word games? Would you like to compete with friends or with people around the world? Have you tried many board games but you can not reach suitable board games yourself? Don’t worry. You are in the right place. \n\nIf you like board games and if you are competitive, you will love this game! Monsterminds Board Game: Play with Friends is easy to learn, but hard to master gameplay!\n\nWith this fun game Monsterminds Board Game: Play with Friends, you will enjoy and battle with your best buddies. A game for all ages you can play with your mother, grandfather, father, children and of course, your friends. \n\nMonsterminds Board Game: Play with Friends features:\n● Addictive and easy gameplay. Place monsters on board by the rules\n● Compete with Zalo (Artificial Intelligence opponent), friend or with a random opponent\n● You'll be matched against players at a similar level to you. Test your opponents.\n● You can play with different stakes\n● Reach new levels and unlocks boards\n● Play 1vs1 (PvP)\n● Compete in weekly tournaments & events\n● 15 different boards\n● Boards 1-5 on 9x9 slots\n● Boards 6-10 on 11x11 slots\n● Boards 11-15 on 13x13 slots\n● Top Monsters leaderboard\n● Unlock and collect avatar frames\n● Additional metagame (add outfits, change the profile frame)\n● Send emotes to your opponents\n● Mini-game (scratch cards and win coins). You are able to buy extra scratch cards for games. You can use gems to buy coins. \n● No need to be a word geek. Our addictive board game is for people off all ages\n● Boost your scores using multipliers\n● Well-known board game tactics from a famous word game\n● Eye-catching graphics and colorful gameplay \n● Hours of endless fun\n● Competitive and creative\n● Savor tasty graphics, luscious animations, and amazing audio experience. The best looking mobile board game by far!\n● Highly rated by players who enjoy dice, match, puzzle, and word games\n\nTest your skills against your friends and buddies. Get Monsterminds! \nOur addictive, fun board game will become your new addiction! You won’t be able to put it down. Players of all ages can participate in our game. \n\nAre you ready to battle with your best friends & buddies and people from all over the world? Fight online PvP battles with your friends.\n\nDownload Monsterminds Board Game: Play with Friends and start the battle.",
  "genres": [
   "Games"
  ],
  "contentRating": "4+",
  "released": "2020-04-01T07:00:00Z",
  "updated": "2020-04-01T13:33:32Z",
  "releaseNotes": "Winter Delight tournament!\nAdded VIP mode - play all boards and unlimited games!\nUpdated main screen looks\nFixed a few multiplayer bug\nFixed invite bug",
  "version": "4.0.1039",
  "price": 0,
  "developer": "Monkeybin",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.alitan.secretflashcards",
  "title": "Secret FlashCards for Kids:Funbox-LearningBox",
  "description": "Secret flashcards for your baby to learn letters, numbers, fruits, animals. Learn Letters, Numbers, Animals.\nYour babies can improve their finger actions with this application to find out images what are.\n\nLots of Categories include: Alphabets, Animals, Numbers, Fruits\n\n*** Cute and Colorful images on each Flashcard!\n*** Great for learning with their sounds\n*** FREE! \n*** Sound effects when your baby/toddler touches each image!\n*** Kids and Parents love it! \n*** Building vocabulary has never been so much fun \n*** Large words and letters \n*** Large icons and buttons \n*** More than 75 HD images\n*** Professional voiceovers recorded in production studio \n*** High quality images \nYour baby will love the bright colors, unique sound effects and exciting animations. Give it a try! You won't regret it!!",
  "genres": [
   "Entertainment",
   "Games",
   "Puzzle"
  ],
  "contentRating": "4+",
  "released": "2016-09-16T07:20:41Z",
  "updated": "2016-09-21T20:52:01Z",
  "releaseNotes": "*** Device orientation bug fixed",
  "version": "1.2",
  "price": 0,
  "developer": "Ali Tanriverdi",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.rskoong.fruitsmatchinggames.app",
  "title": "Fruits matching pictures games - puzzle art",
  "description": "Fruits matching pictures games for kids\n\nThis game is a matching games fruits for kids, cute kids or anyone who loves about fruit cartoon such as Melon grapes coconut watermelon banana melon and many others.\nThe game can helps children learning before go to preschool. Including school And primary school aged children Learn to think coaching and image recognition cute fruits alike.\nIt also allows children to recognize kind of fruits increasing. Great imagination to the fruits. The brain of children and players. Make kids better and know how to make their own memorable images cute pictures of fruits. Games like cute fruits pictures, this will fit the child. Also for all people who want to practice memory games and compete with friends or want to indulge in a game matching the portrait, it is great. Encourage the family to play and have a happy time together with this games cute fruits pictures.\n\nGames by matching cute animal images. Try to remember what pictures is what position . So that we can open up the two identical pictures. We call this game the same picture games.\n\nhow to play:\nThere are many cute fruits images hidden under the card, click on each photo card. Cute fruits pictures, it will open up the fruits that we have to remember that you have to match up to the image on each side. And practice our memory. And can compete with friends who would like to be able to match images who can finish matching pictures first. Invite a friend to our race to see who will match the photo as soon as possible as well. This must be fun and improving recognition skill.\n\nGames cute fruits pictures. The image is cute and colorful beautiful game can be played for free without paying anything. rate me 5 stars if you like it.\n\nFEATURES:\n- Fruits game for kids develops recognition skill for kids\n- Fruits memory game for kids has cute sounds for kids\n- Game for children has colorful nice graphic and designed for toddlers\n- Memory game for kids contains beautiful images of many kind of fruits\n\nFruits matching pictures games for kids hope you like it and have a good time.",
  "genres": [
   "Games",
   "Education",
   "Puzzle"
  ],
  "contentRating": "4+",
  "released": "2017-03-23T16:03:23Z",
  "updated": "2017-03-23T16:03:23Z",
  "version": "1.0.0",
  "price": 0,
  "developer": "Rotechanint Sribenjapaisarn",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "mobapp.at.Botteginos",
  "title": "Botteginos",
  "description": "In this app you can find: \nContact Us, Our Menu, Coupons, Loyalty Cards, Scratch Card, Review, Book a Table, News",
  "genres": [
   "Food & Drink"
  ],
  "contentRating": "4+",
  "released": "2016-06-03T02:09:51Z",
  "updated": "2017-11-19T00:35:20Z",
  "releaseNotes": "changed logo",
  "version": "1.84.198.343",
  "price": 0,
  "developer": "Polly Evans",
  "score": 5,
  "reviews": 3,
  "currentVersionScore": 5,
  "currentVersionReviews": 3,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.boogygamesstudios.SolitaireCatPiratePortrait",
  "title": "Solitaire - Cat Pirate Portrait",
  "description": "Solitaire - Cat Pirate Portrait - Experience the crisp, clear, and easy to read cards, simple and quick animations, and nice sounds, you can play with portrait views. \nYou can move cards with a single tap or drag them to their destination. You can either play the easy Draw 1 games where most games are winnable or if you feel up to the challenge, try your luck with Draw 3 and Vegas play modes. You can undo your last move.\n\nFEATURES:\n\n- More Card Backs and Game Backgrounds\n- Draw 1 card or 3 cards \n- Random Deal or Winning Deal\n- Portrait game mode\n- Time/Moves show your progress\n- Standard Scoring Rules\n- Unlimited Undos\n- Unlimited Hints\n- Tap or Drag cards\n- No Ads",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2017-06-21T18:29:28Z",
  "updated": "2017-06-21T18:29:28Z",
  "version": "1.0",
  "price": 0.99,
  "developer": "Boogygames Studios",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.rskoong.Kidsmatchinggames-Animals.app",
  "title": "Animals matching games - puzzle art",
  "description": "Kids Matching Games - Animals\nThis game is a matching games animals for kids, cute kids or anyone who loves animals cartoon such as  fish and raccoon chicken shrimp, crabs, ants and many others.\nThe game can helps children learning before go to preschool. Including school And primary school aged children Learn to think coaching and image recognition cute animals alike.\nIt also allows children to recognize animals increasing. Great imagination to the animals. The brain of children and players. Make kids better and know how to make their own memorable images cute animals. Games like cute animal pictures, this will fit the child. Also for all people who want to practice memory games and compete with friends or want to indulge in a game matching the portrait, it is great. Encourage the family to play and have a happy time together with games cute animal pictures.\n\nGames by matching cute animal images. Try to remember what pictures is what position . So that we can open up the two identical pictures. We call this game the same picture games.\n\nhow to play\nThere are many animal images hidden under the card, click on each photo card. Cute animal pictures, it will open up the animals that we have to remember that you have to match up to the image on each side. And practice our memory. And can compete with friends who would like to be able to match images who can finish matching pictures first. Invite a friend to our race to see who will match the photo as soon as possible as well. That must be fun\n\nGames cute animal pictures. The image is cute and colorful beautiful game can be played for free without paying anything. rate me 5 stars if you like it.",
  "genres": [
   "Games",
   "Education"
  ],
  "contentRating": "4+",
  "released": "2017-03-20T17:10:55Z",
  "updated": "2017-03-20T17:10:55Z",
  "version": "1.0.2",
  "price": 0,
  "developer": "Rotechanint Sribenjapaisarn",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.abzorbagames.pokerIos",
  "title": "Poker Live Omaha & Texas",
  "description": "Poker Live with Texas Hold ‘Em and Omaha High/Low in same app - the Poker\nPlayer Poker is here\n\nThis is a seriously smart and good-looking heads-up card classic with authentic\nmultiplayer Vegas feel. There are loads of special features such a visual 'Hand\nStrength Meter' that discreetly shows you if your cards are strong. Challenge\nfriends, make new ones, swap cocktails and dress up in amazing outfits - be as\ncool as you feel and meet millions of gamers. There are hundreds of tables, VIP\nprivilege suites, tournaments and challenges all with Guest and Facebook sign\nin options.  And when you want to kick back from the tables there are fantastic\nmini games such as Scratch ’n Match and Luck wheel to try your hand at winning\na millions of chips!\n\nEvery game is fresh, new and exciting because its the mix of folks there that\nmake this so social. So come and join the fun you never know who you’ll meet.\n\nPoker Live Omaha & Texas is a free, online, game of chance and skill for\nentertainment purposes only. It is not possible to win real money, real\nitems/services/gifts or goods in kind by playing our skill games. The virtual\ncurrencies used in this game are called Chips and Diamonds and can be purchased\nin the ‘Store’ by using real money. Chips and Diamonds cannot be exchanged for\ncash or be paid out in any form and can only be used to play our game.\nPoker Live Omaha & Texas is intended solely for an adult audience which is\neighteen years or over.\n\nPlaying Poker Live Omaha & Texas does not imply future success at real money\ngambling.\n\nTerms of Service: https://www.abzorbagames.com/terms-of-service",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2012-11-02T01:06:52Z",
  "updated": "2020-02-11T07:35:34Z",
  "releaseNotes": "New in the latest update!\n- Minor UI changes In our attempt to improve the user experience, we continue\nto deliver UI changes in each update",
  "version": "3.89",
  "price": 0,
  "developer": "AbZorba Games BetriebsgmbH",
  "score": 4.7037,
  "reviews": 27,
  "currentVersionScore": 4.7037,
  "currentVersionReviews": 27,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.sgn.scratchergame",
  "title": "Scratch Blitz - Free Lotto Scratchers",
  "description": "Download Scratch Blitz today & bring all the fun of your favorite scratcher lotto tickets to your mobile device! It’s FREE to play and delivers authentic scratch card fun to you on the go, wherever you go! Feeling lucky??\n\nScratch your way through games like “5 Card Draw: Beat the Dealer” and “Triple Aces” to level up and unlock new cards with higher stakes and payouts. Every game is a little different, but each ticket has all the features you love in a scratcher: \n\n      ● Real life scratch-off experience!\n      ● Try your luck with 100s of ways to win!\n      ● Tons of exciting scratcher themes you know and love!\n\nMore Fun Features:\n\n     ● DOUBLE or NOTHING: take a chance to double your earnings?\n     ● LEVEL UP: unlock new fun scratchers as you play! What’s next??\n     ● HOURLY BONUSES: free coins throughout the day... just for coming back and playing!\n\nLike: https://www.facebook.com/Scratch-Blitz/\nFollow: @sgngames\nSupport: https://scratchblitz.zendesk.com/home\nPrivacy: www.sgn.com/privacy\n\n• Developer Info •\nSGN is the leading developer in truly cross-platform gaming. Wherever you play, SGN has a game for you. Chart-topping games include Bingo Blingo, Panda Jam, Slots Dreamland, Jewels of the Amazon, and so many more.",
  "genres": [
   "Games",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-07-27T20:41:40Z",
  "updated": "2014-01-31T17:09:32Z",
  "releaseNotes": "Saddle up for 4 brand new Western-themed cards...within which is an added MULTIPLIER feature! Scratch it off to see if your winnings are multiplied. 2X? 5X? 10X?! Only one way to find out...",
  "version": "1.7",
  "price": 0,
  "developer": "MindJolt",
  "score": 3.375,
  "reviews": 8,
  "currentVersionScore": 3.375,
  "currentVersionReviews": 8,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.RobertWalden.LuckyLotteryJackpot",
  "title": "Lucky Lottery Jackpot - Lotto Scratch Off Tickets",
  "description": "Enjoy the Rush of Scratching off a Lotto Ticket and Winning a Huge Bonus! Scratch from your ipad, iphone or\nipod! Win tons of credits and buy scratchers with increasingly higher payouts. It gets better and better, how\nmuch can you win?\n \n***Win Instantly - Win Tons of Credits!\n***Instant Scratch Available, or scratch with your finger like traditional lotto scratchers!\n***5 Beautiful Scratcher Games - Unlock Them All!\n***Increase your Odds with Unlockables on each game!\n \nEnjoy wonderful themes such as:\n \nCandy Land Riches\nCowboy Fast Draw\nLuck of the Irish\nPharaohs Fortune\nPirates Treasure\n \nGreat fun and tons of winning awaits, what are you waiting for!?",
  "genres": [
   "Games",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-11-10T22:34:49Z",
  "updated": "2014-09-23T20:47:05Z",
  "releaseNotes": "bug fixed",
  "version": "1.1",
  "price": 0,
  "developer": "Robert Walden IV",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "it.arkimedenet.ibriscola",
  "title": "Briscola3D",
  "description": "All men are equal at cards \nNikolaj  Gogol, Gamblers, 1842\n\nIt's the niceties that make the difference fate gives us the hand, and we play the cards..\nArthur Schopenhauer, Parerga e paralipomena, 1851\n\nOne should always play fairly when one has the winning cards.\nOscar Wilde, An ideal husband, 1895\n\nComplain about cards is a vice; showing them is dangerous.\nMarcello Chitarrella, Chitarrella Code, 1750\n\n\nBriscola is one of the most famous and diffused card games. It has been passed on across many generations that have had funny with it. It was quite hard for us to get over the fascinating sound of the cards while playing; the wish of the actual “touch screen” generation to play wherever and with whoever has generated the need of an App able to not regret the loved smell of the cards.\nBriscola3D has been developed to join those just apparently far worlds, using the CLASSIC rules of the game.\nYou can challenge players all over the world or have fun with the Game Center!\nClimb the online classification and demonstrate to be a great Briscola player!\nTrain against artificial intelligence and relax playing with the minigames; “7&1/2”, slot machine and  Rip’n’Win  complete this charming App!\nCustomize your game environment by choosing among a lot of desktops, tunes or cards! \nCreate your own avatar and chat with your opponents!\n\nHelp us to make better Briscola3D with your ideas.\nmailto: briscola3d@arkimedenet.it",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2012-01-10T07:35:49Z",
  "updated": "2013-11-13T23:17:26Z",
  "releaseNotes": "- If you have an internet connection, you can play for free\n\n- Graphic: iPhone 5 and iPad Retina support. Graphic interface restyling\n\n- Tournaments: now you can check match detail for all players\n\n- bug fixes",
  "version": "1.93",
  "price": 0,
  "developer": "ARKIMEDE S.R.L.",
  "score": 4,
  "reviews": 2,
  "currentVersionScore": 4,
  "currentVersionReviews": 2,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.appmooshi.BlackJackScratch",
  "title": "Black Jack Scratch",
  "description": "Your Lucky Day!\n\nYou can't stop when you're getting winners and feeling the fun, the excitement and that special rush when you match 3 numbers and just keep on going...\n\nYou could be a million dollar winner!\n\nScratching is as easy as swiping with your finger\nOR just using the super convenient INSTANT Scratch.\n\nFive levels of play and many more themes to come.\n\nEach level has different prizes.\n\nSuper easy to use when you're busy on the go or just killing time.\n\nPlay Black Jack Scratch and get the full on experience of scratching lottery tickets right on your iPhone, iPod or iPad.\n\nPlay to Win with 5 different lottery scratch off ticket themes!\n\nHave fun and Good Luck!\n\nThanks for playing!",
  "genres": [
   "Games",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2013-12-20T08:00:00Z",
  "updated": "2013-12-20T08:00:00Z",
  "version": "1.0",
  "price": 0,
  "developer": "Gold Coin Kingdom",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.appmooshi.LottoSuperDuperScratch",
  "title": "Lotto Super Duper Scratch - Lottery Ticket Scratchers",
  "description": "See how very LUCKY You Are!\n\nYou can't stop when you're getting winners and feeling the fun, the excitement and that special rush when you match 3 numbers and just keep on going...\n\nYou could be a million dollar winner!\n\nScratching is as easy as swiping with your finger\nOR just using the super convenient INSTANT Scratch.\n\nFive levels of play and many more themes to come.\n\nEach level has different prizes.\n\nSuper easy to use when you're busy on the go or just killing time.\n\nPlay Lotto Super Duper Scratch and get the full on experience of scratching lottery tickets right on your iPhone, iPod or iPad.\n\nPlay to Win with 5 different lottery scratch off ticket themes!\n\nHave fun and Good Luck!\n\nThanks for playing!",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-12-18T00:35:37Z",
  "updated": "2013-12-18T00:35:37Z",
  "version": "1.0",
  "price": 0,
  "developer": "Gold Coin Kingdom",
  "score": 1,
  "reviews": 1,
  "currentVersionScore": 1,
  "currentVersionReviews": 1,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "it.arkimedenet.iscopone",
  "title": "iScopone Scientifico",
  "description": "\"iScopone scientifico\" is an Italian card game and one of the major national card games in Italy. It is played with a standard Italian 40-card deck (but you can use poker card deck) , between four players in two partnerships. \nThe name is an Italian verb meaning \"to sweep\", since taking a \"scopa\" means \"to sweep\" all the cards from the pool. Watching a game of scopone can be a highly entertaining activity, because traditional games involve lively, colorful and stimulates your brain activity and your craftiness. However, skill and chance are more important to the outcome of the game. Our \"how to\" will explain you the rules. \n\nIf you want to challenge your friends or players around the world by Game Center, \"iScopone Scientifico\" is the game for you! \n\n Retina Display support \n\n Chat and Avatar \n\n Multiple decks and boards \n\n Online scores \n\n Music and soundFx inspired to the famous italian film \"Lo Scopone Scientifico\" by Luigi Comencini \n\nBet your chips with our amazing MiniGames you can play in every moments, in offline mode or while you are waiting for a match: \n\n 7 & 1/2 (another simple italian card game) \n\n Scratch'N Win \n\n Slot Machine \n\nIf you have network connectivity issue please refer to the link below:\nhttp://support.apple.com/kb/HT4307?viewlocale=en_US",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2011-05-18T01:05:01Z",
  "updated": "2013-12-23T23:33:24Z",
  "releaseNotes": "Minor bug fixes",
  "version": "2.63",
  "price": 0,
  "developer": "ARKIMEDE S.R.L.",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "7UFX2QMUS5",
  "title": "Circus Bingo Games and Slots - Big Jackpot Wins With Real Money Prizes",
  "description": "The greatest show on earth… now on iPhone & iPad!\n\nLadies & Gentlenuts - you are invited to try out the funnest, most rewarding and show stopping bingo games the world has ever seen… wherever and whenever you like. What’s more fun than a pocketful of nuts? A pocketful of circus nuts! \n\nWitness our 350% welcome bonus; deposit £10 and you play at the circus with a mighty £45!* And as an extra bonus, you will unlock an exclusive special game… Pablo’s Nuts! Pop those crazy nuts for some extra no deposit bingo bucks. It’s a deal even a squirrel could love.\n\nAh, but what use is talking about jackpot games when no one wins the jackpot? Well dearest friend, we have winners… lots of ‘em! Bear witness to the tale of augustapark100 who just scooped a life changing £77303.35. Real winners, real cash... take that other stinky bingo apps!\n\nOh and we have bingo friend; free bingo, 90 ball bingo, 75 ball bingo, super jackpot bingo… there’s a bingo for everyone! And if that’s not enough for you, then how about three exclusive bingo games for our new BFFs:\n\nEveryones-A-Winner\n\nDoes what it says on the label; guaranteed prizes for everyone! 7 top winners will each scoop £700 in delicious bonus money and a £300 real cash prize is split between everyone else. Yep, we love our winners at the circus!\n\nCash Cannon\n\nWoah watch yourself, the Cash Cannon is firing! Win £50 bonus cash every hour in this free to play bingo game - what bunch of nutters would shoot their roomies with a high-powered cash cannon?! We would. Because our roomies give us the warm fuzzles.\n\n£1k Big Top\n\nAh, here it is friends, the star of our show! Get 6 free tickets when you make your first deposit and scoop £1,000 in real cash every single month. Yes, it’s true… we are nuts about the freebies!\n\nSo as you can see friends, we rock at bingo. But what self-respecting bingo show would we be without an assortment of thrilling slots? Step inside friend and discover instant games  like Fluffy Favourites, Millionaire Genie, Gonzo’s Quest and Starburst plus many, many more.\n\nSo what you waiting for friend? DOWNLOAD AND INSTALL Circus Bingo and enjoy the greatest bingo show on earth in the palm of your hand!\n\n*Yes this is that good old Ts&Cs star where we have to tell you legal stuff. The Circus Bingo welcome bonus is only valid on your first deposit. Full Ts&Cs can be read here. The Circus Bingo mobile app is not available for squirrels; if you suspect you may be a squirrel then we suggest you seek professional help from a squirrel psychiatrist.",
  "genres": [
   "Games"
  ],
  "contentRating": "17+",
  "released": "2015-12-16T23:08:08Z",
  "updated": "2015-12-16T23:08:08Z",
  "version": "1.0.0",
  "price": 0,
  "developer": "Lindar",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.ChubbyBuddhaMedia.AmericanLotto",
  "title": "' A American Lotto Scratch-Off Lottery Scratchers Game",
  "description": "Free Bucks by the minute!  The most realistic scratch-off feel.  Instant win and different card amounts to try your luck!\n________________________________",
  "genres": [
   "Games",
   "Entertainment",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2014-12-13T08:00:00Z",
  "updated": "2014-12-13T08:00:00Z",
  "version": "1.0",
  "price": 0,
  "developer": "joseph manning",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.playtinum.iLottoFree",
  "title": "Sultan's Lucky Lotto Free",
  "description": "Have instant fun of revealing the winning numbers and hitting the jackpot in this amazing FREE pull tab or scratch off card lottery game.\n\nGet the ‘Sultan’s Lucky Lotto’ game now and immerse into a simple but rewarding experience of pull tab or scratch off cards lotto.\nThe game provides a set of different thematic cards offering a variety of game play ranging from same-3, matching the winning number, revealing the lucky symbols, a slot machine 3-reel payout and more.\n\nFeatures:\n1.Instant pull tab or scratch off lotto game\n2.Unlock new cards as you level up\n3.Daily Bonus for a limitless fun experience\n4.The feel of a pull tab or scratch card play without the mess and wait\n5.No in-app purchases. Full Game for FREE.\nSultan’s Lucky Lotto is an enjoyable game to drive away boredom with simple and short instant lottery experience right on your iOS device!\nFor all those who love casino style popular games like poker, lotto, slot machines and even solitaire card games – check out our other releases. \nThe game is for amusement purpose only and the money bet is not real.\nThe payouts in game do not replicate actual payouts of any lottery, although we have tried to maintain a realistic return percentage.",
  "genres": [
   "Games",
   "Casino",
   "Card",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2013-07-10T22:10:52Z",
  "updated": "2013-07-10T22:10:52Z",
  "version": "1.0",
  "price": 0,
  "developer": "PLAYTINUM SOFTWARE AND MULTIMEDIA PRIVATE LIMITED",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.appiukko.luxurylotto",
  "title": "Luxury Lotto Scratchers Free - Reveal Lucky Winning Numbers",
  "description": "Care to try your luck? Pick a lotto scratcher and let’s see what you got!\n\nLuxury Lotto Scratchers will let you feel the rush and thrill of playing real lotto scratchers without having to shell out real money! In this game, you’ll begin by choosing among 5 different luxury themes. From there, you’ll have to scratch your card to reveal the numbers. If you get three of the same numbers, you’ll win the amount that you have revealed! Our lotto scratchers are designed like real scratchcards so you will surely feel the excitement and fun when playing!\n\nFEATURES:\n\n* Beautiful graphics!\n\n* Choose from 5 exciting themes!\n\n* Addictive and super fun to play!\n\n* Win Big!\n\n* Modeled after real scratchers!\n\nIf you find lotto scratchers addicting, THIS is the perfect game for you! Download now!",
  "genres": [
   "Games",
   "Entertainment",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-10-05T07:00:00Z",
  "updated": "2013-10-05T07:00:00Z",
  "version": "1.0",
  "price": 0,
  "developer": "Appiukko",
  "score": 5,
  "reviews": 1,
  "currentVersionScore": 5,
  "currentVersionReviews": 1,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.immanitas.luckylottery",
  "title": "Lucky Lottery Scratcher – The ultimate lottery scratch ticket app",
  "description": "Winnings, winnings, winnings: Welcome to this ultimate lottery scratch ticket app for iPhone, iPad and iPod!\n\nFeel the rush of winning and experience all the great excitement and fun of scratching your lottery tickets.\n\nLucky Lottery Scratcher brings you the full experience of scratching your lottery tickets and feeling the rush and excitement of winning. Play with our Lotto Bucks and get the jackpot!\n\nEnjoy 5 totally different ticket themes all with different prize levels just like you would experience at your local lottery agency.\n\nPharaoh Scratcher \nCasino Scratcher \nGold Rush\nAtlantis Underwater Treasures Scratcher\nDiamond Scratchers\n\nWhat are you waiting for? Go get the jackpot and become a millionaire!",
  "genres": [
   "Games",
   "Card",
   "Casino"
  ],
  "contentRating": "17+",
  "released": "2013-08-18T07:00:00Z",
  "updated": "2013-08-21T19:59:05Z",
  "releaseNotes": "------------------------------\n« Improved game play\n« Added more features\n« Updated screen transition.\n------------------------------",
  "version": "1.1",
  "price": 0,
  "developer": "Immanitas Entertainment GmbH",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.violet2000games.CashOutLotto",
  "title": "Crazy Cash Out Lotto",
  "description": "Got that Lotto Scratch itch? Feeling Crazy Lucky? You could be a million dollar winner...instantly!\n\nOur Crazy Cash Out Lotto scratch game is easy. Just swipe with your finger OR just using the super convenient INSTANT Scratch Button.\n\n-Five levels of play and many more themes to come.\n\n-Each level has different prizes.\n\n-Super easy to use when you're busy on the go or just killing time.\n\nPlay Crazy Cash Out Lotto and get the full-on experience of scratching lottery tickets right on your iPhone, iPod or iPad.\n\nPlay to Win with 5 different lottery scratch off ticket themes!\n\nHave fun and may Lady Luck be with you.",
  "genres": [
   "Games",
   "Casino",
   "Entertainment",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2014-08-24T07:00:00Z",
  "updated": "2014-08-24T07:00:00Z",
  "version": "1.0",
  "price": 0,
  "developer": "Gold Coin Kingdom",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.playtinum.iSultanBingo2",
  "title": "Sultan Of Bingo 2 - Desert Daub Duels",
  "description": "Get the amazing new 75 ball US version of this free exciting bingo game for your phones and tablets.\nSet in a unique theme, play this fantastic bingo game where focus, concentration and reflexes are your friends as you race to score a BINGO against your opponents.\nObserve the bingo balls with random numbers that pop up on the screen and scratch, mark or daub your bingo card to score. The more alert you are, more are your chances to complete the bingo card and win a jackpot bonus.\nPlay against one or four players - Snake Charmer, Vizier, Royal Guard, Queen and of course the Sultan\nUse awesome power ups like Sleeping Pill to put your opponents to sleep or use the Freeze Spell to make a random contestant helpless. You can also seek aid from Free Cell Daub to get the bonus edge.\nEarn experience points and coins as you progress in the game. These will help you to unlock new bingo tournament locations and trophies.\nGet rewards and free coins as you win vertical line bingo, horizontal line bingo, diagonal line bingo and four corners bingo patterns and also when you level up and win trophies.\nDaily and hourly bonuses of free coins are also available so that you never run out of coins to play with.\nFeatures:\n\nPlay classic bingo game anytime anywhere. No need to be online.\nA unique arabian nights theme with contestants like Snake Charmer, Vizier, Royal Guard, Queen and of course the Sultan\nFree coins rewarded hourly and daily and also for bingo wins.\nExciting powerups for the extra edge\nFull game for FREE. No in app purchase needed\n75 ball US version of the game known as Housie or Tambola.\nCheck out our other card and casino games for a variety of slot machines, video poker, solitaire and more !!!",
  "genres": [
   "Games",
   "Entertainment",
   "Casino",
   "Card"
  ],
  "contentRating": "17+",
  "released": "2014-07-20T04:42:38Z",
  "updated": "2014-07-20T04:42:38Z",
  "version": "1.0",
  "price": 0,
  "developer": "PLAYTINUM SOFTWARE AND MULTIMEDIA PRIVATE LIMITED",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 },
 {
  "appId": "com.SA.WorldLotto",
  "title": "' Ace Lotto Scratchers - World Tour Lottery Scratch-Off",
  "description": "Feel the intensity as you scratch to reveal your big winnings!  The most addicting scratch off experience is here.  Try it today!\n________________________________",
  "genres": [
   "Games",
   "Casino",
   "Entertainment"
  ],
  "contentRating": "17+",
  "released": "2014-12-14T08:00:00Z",
  "updated": "2014-12-14T08:00:00Z",
  "version": "1.0",
  "price": 0,
  "developer": "ore gilron",
  "score": 0,
  "reviews": 0,
  "currentVersionScore": 0,
  "currentVersionReviews": 0,
  "searchTerms": "scratch cards"
 }
]